{
    "@context": "http://www.daostar.org/schemas",
    "name": "Gitcoin Grants",
    "type": "DAO",
    "grantPools": [
        {
            "type": "GrantPool",
            "id": "42161:25",
            "name": "dApps & Apps ",
            "description": "To hasten the growth and widespread use of dApps & Apps, there's an initiative to support those offering innovative utilities or services within the ecosystem. The focus is on supporting two main areas:\n\n1. User-Centric dApps & Apps: Priority is given to applications that significantly enhance Web3 accessibility and usability, making it easier and more intuitive for users to navigate and benefit from the decentralized web.\n\n2. Contributions to User Experience and Interface Design, Financial Inclusion, Education, and Social Impact: dApps and Apps dedicated to advancing financial inclusion, providing educational opportunities, and creating positive social impact are strongly encouraged to apply.\n",
            "isOpen": false,
            "closeDate": "2024-04-27T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/25",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-02T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:26",
            "name": "Web3 Infrastructure",
            "description": "This round aims to strengthen the Ethereum ecosystem's foundational infrastructure by supporting projects crucial for its development, scalability, and security. \n\nWe seek to fund initiatives that focus on core client teams and development, staking infrastructure and diversity, decentralized identity and cross-layer solutions, security and scalability innovations, wallet security and privacy technologies, and standardization and future-proofing efforts. \n\nSuccessful projects will demonstrate a significant contribution to the Ethereum network's infrastructure, addressing both foundational needs and innovative solutions to current challenges, while engaging in pioneering development that promises to elevate the ecosystem, particularly in areas of privacy, interoperability, and user experience.\n",
            "isOpen": false,
            "closeDate": "2024-04-27T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/26",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-02T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:608",
            "name": "GG22 OSS - dApps and Apps",
            "description": "To accelerate the adoption and development of Open Source dApps and apps offering novel utilities or services within the ecosystem. This includes dApps and apps enhancing Web3 accessibility and usability and those contributing to financial inclusion, education, and social impact.",
            "isOpen": false,
            "closeDate": "2024-10-29T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/608",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-30T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1329:9",
            "name": "Sei Creator Fund: Round #2 - Creative Media and IP Development",
            "description": "Gitcoin and Sei are collaborating to support the growth and development of the Sei ecosystem through a quadratic funding round. This round will allocate funds to support contributions to projects focused on 1) IRL Video Content: Videos, vlogs, live streams 2) Podcast Hosting: Twitter Spaces, YouTube 3) Video + Animations: Informative content, entertainment 4) Storytelling: Lore and IP around Sei",
            "isOpen": false,
            "closeDate": "2024-08-15T15:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1329/9",
            "governanceURI": "https://t.me/+byWpLVRDllEzZTU1",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-31T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1329:12",
            "name": "Sei Creator Fund Round #4 - Supporting Web3 Gaming Creators",
            "description": "While gamers compete in Sei GG: The Gauntlet, Web3 gaming creators are invited to apply for $250,000 in grants through Creator Fund Round #4. This funding round supports creators building and growing the Sei gaming ecosystem.",
            "isOpen": false,
            "closeDate": "2024-09-26T16:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1329/12",
            "governanceURI": "https://t.me/+byWpLVRDllEzZTU1",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-31T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:44",
            "name": "Asia Round",
            "description": "Asia, with its 4.6 billion people and over 2,300 languages, is an essential region for the mass adoption of digital public goods.  The GG21 Asia Round is an exciting initiative of two leading communities in Asia - GCC & Pagoda,  designed to unlock the potential of talented Asian innovators, builders, and projects by providing them with essential funding and resources.   // We’re looking for projects in following areas but not limited to:  1. Asian Dev Communities(Ethereum ecosystem)  2. Policy Advocacy in Asia  3. Creative public goods funding protocols and tools that fits Asian ecosystem  4. Privacy and Anti-censorship      To minimize inequality due to language proficiency, we will accept project applications in Asian native languages other than English.     //   If you get your application in by the 6th, you will receive a decision by the start of the round.  Missed the application window?  No problem! You can still apply, but you will get the decision no later than August 15. This is for you and your team to decide.",
            "isOpen": false,
            "closeDate": "2024-08-14T23:59:21+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/44",
            "governanceURI": "https://t.me/+i312Hy9HG382MjI1",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:609",
            "name": "GG22 OSS - Developer Tooling and Libraries",
            "description": "This round aims to support the development of tools and libraries that empower developers to build efficiently and effectively within the OSS and Web3 ecosystems. We focus on development frameworks, interoperability tools, smart contract libraries, and data analytics tools.",
            "isOpen": false,
            "closeDate": "2024-10-29T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/609",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-30T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:27",
            "name": "Developer Tooling and Libraries",
            "description": "This round focuses on improving developer efficiency in the open-source software (OSS) and Web3 ecosystems by funding projects that provide essential tooling and libraries. We seek to support the creation and enhancement of development environments, frameworks, testing tools, and libraries that enable secure, efficient smart contract development. Successful projects will reduce development barriers, enhance efficiency, and demonstrate strong community support and usage.",
            "isOpen": false,
            "closeDate": "2024-04-27T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/27",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-02T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:610",
            "name": "GG22 OSS - Web3 Infrastructure",
            "description": "This round aims to strengthen the Ethereum ecosystem's foundational infrastructure by supporting projects crucial for its development, scalability, and security. We focus on core client development, staking infrastructure, decentralized identity, security innovations, and more.",
            "isOpen": false,
            "closeDate": "2024-10-29T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/610",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-30T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1329:11",
            "name": "Sei Creator Fund Round #3 - Developer Ecosystem",
            "description": "Gitcoin and Sei are collaborating to support the growth and development of the Sei ecosystem through a quadratic funding round. This round, part of the $10 million Sei Creator Fund initiative, will allocate $250,000 to support contributions to projects building on Sei, focusing on the Developer Ecosystem.",
            "isOpen": false,
            "closeDate": "2024-09-26T16:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1329/11",
            "governanceURI": "https://t.me/+byWpLVRDllEzZTU1",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-31T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:389",
            "name": "GG21: Thriving Arbitrum Summer",
            "description": "Thank ARB is supporting the growth and development of the Arbitrum ecosystem through a quadratic funding round. This round will allocate funds to support contributions to projects building on Arbitrum, focusing on core infrastructure, developer tooling, and innovative dApps & Apps.\n\nObjectives\n- Support projects with previous contributions to the Arbitrum Ecosystem.\n\n- Encourage wider Web3 community involvement through donations to projects, using donation volume as an indicator of engagement.\n- Drive innovation and development within the Arbitrum ecosystem, particularly on \nStylus and Arbitrum Orbit Chains.\n\nRound Philosophy\n- Collaborative Approach: We encourage projects that seek to complement and enhance existing initiatives rather than competing directly against them. The success of this round is viewed as a collective achievement, benefiting the entire Arbitrum ecosystem.\n\n- Long-term Vision: We value projects demonstrating a commitment to sustained impact and growth within the Arbitrum ecosystem. This round may be part of a series of recurring funding opportunities, and projects showing long-term potential will be well-positioned for future support.\n\n- Community-Driven Success: The collaborative nature and positive community engagement in this round will influence the planning of future funding opportunities.",
            "isOpen": false,
            "closeDate": "2024-08-10T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/389",
            "governanceURI": "http://t.me/gg21arbfrens",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:17",
            "name": "Aave & GHO Ecosystem Advancement",
            "description": "Gitcoin and Aave Grants DAO are collaborating to support the growth and development of the Aave and GHO Ecosystems through a strategic funding round. This initiative will allocate $50,000 to support impactful contributions to projects building on Aave and GHO.",
            "isOpen": false,
            "closeDate": "2024-05-21T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/17",
            "governanceURI": "https://discord.com/channels/602826299974877205/695270706497454160",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-23T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1329:4",
            "name": "SEI Creator Fund: Kickoff",
            "description": "Gitcoin and SEI are collaborating to celebrate the launch of SEI v2 and support the growth and development of the SEI ecosystem through a quadratic funding round. This round will allocate funds to support contributions to projects building on SEI. \n\nThe round will welcome past projects contributing to the ecosystem and new projects with forward-looking vision. The aim is to enhance community engagement and establish a precedent for fostering strategic partnerships while supporting diverse initiatives within the SEI ecosystem.",
            "isOpen": false,
            "closeDate": "2024-06-11T13:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1329/4",
            "governanceURI": "https://t.me/+byWpLVRDllEzZTU1",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-31T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1088:8",
            "name": "Metis Ecosystem QF",
            "description": "Gitcoin and Metis are collaborating to support the growth and development of the Metis ecosystem through a Quadratic Funding (QF) round. This round aims to allocate funds to projects building on Metis, with a focus on community involvement and ecosystem enhancement.",
            "isOpen": false,
            "closeDate": "2024-09-13T15:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1088/8",
            "governanceURI": "https://t.me/metis_grants",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-08-29T15:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:643",
            "name": "Land Regenerators",
            "description": "Ma Earth Grants Round 2 provides funding for regenerative land projects. The aim is to support place-based, environmental activities for community impact. Matching pool generously provided by Biome Trust, Gitcoin, and Naia Trust.",
            "isOpen": false,
            "closeDate": "2024-10-28T10:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/643",
            "governanceURI": "https://maearth.com/grants",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-13T20:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:24",
            "name": "ENS Identity",
            "description": "The GG20 ENS Identity Round round is meant to support projects actively building on top of ENS. Any project that is growing, enhancing, or supporting the decentralized identity system around ENS is eligible.",
            "isOpen": false,
            "closeDate": "2024-04-16T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/24",
            "governanceURI": "https://t.me/+uqvpeZVpu-lmMDRh",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-02T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:388",
            "name": "Climate Solutions Round",
            "description": "We aim to fund climate solutions projects worldwide that have a proven history of real-world impact. Specifically, these projects will showcase evidence of how they help reduce GHGs or are an important core infrastructure for Web3 climate solutions in the following nine categories: Renewable Energy - Oracles & dMRV - Carbon Accounting - Climate Activism/Education - Nature-Based Solutions - Ocean-Based Solutions - Climate Adaptation/Climate Resilience - Supply Chain solutions - Built Environment/Transportation.  Maximum of 70 grantees in the round based on their score. Reviewers will score projects based on Application, Karma GAP and other information. Applications received before 08/02/24 23:59 UTC are guaranteed a review before the round. Applications received after 08/02/24 23:59 UTC will receive a penalty to their review score. ",
            "isOpen": false,
            "closeDate": "2024-08-06T20:15:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/388",
            "governanceURI": "https://t.me/climatecoordinationnetwork",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:36",
            "name": "Regenerative Land Projects",
            "description": "This round provides funding support for regenerative land projects. Ma Earth is a community-led movement to align economic incentives with planetary health and regeneration. Matching funds are provided by Biome Trust.",
            "isOpen": false,
            "closeDate": "2024-04-20T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/36",
            "governanceURI": "https://maearth.com/grants",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-10T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42:7",
            "name": "LUKSO Community Grants Round 1",
            "description": "Gitcoin and LUKSO are teaming up to host the first LUKSO Community Grants round, aimed at fostering the growth and development of the LUKSO ecosystem through quadratic funding. This round empowers the community to decide where to allocate funds, supporting both technical and non-technical projects. We are dedicated to celebrating and supporting the projects building on LUKSO that have contributed to the ecosystem’s expansion.\n\nThe goal is to cultivate an ecosystem where every project's success ripples outward, strengthening the community. We believe in collective growth, where innovative ideas and collaborative efforts combine to elevate the entire ecosystem to new heights.",
            "isOpen": false,
            "closeDate": "2024-09-13T21:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42/7",
            "governanceURI": "https://discord.gg/lukso",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-03T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "43114:4",
            "name": "Avalanche Community Grants Quadratic Funding Round One",
            "description": "The Avalanche grant criteria emphasize the need for projects and grantees to significantly contribute to or advance the ecosystem. These areas include public goods software, analytics, education, on-chain infrastructure and protocols, gaming, NFTs/arts & culture, and consumer applications. \n\nAlthough not mandatory, the history of contributing to the Avalanche ecosystem is a plus for applicants. Additionally, projects must be at least three months old, demonstrated through social presence, public repositories, or verified contracts deployed, to be considered for grant rounds.\n\nTo Apply:\n\n1) Please review carefully the Eligibility Requirements: https://forum.avax.network/t/eligibility-criteria/1948\n2) Create a post on the Avalanche Forum detailing your application per the eligibility criteria\n3) Complete the application process here in Grants Stack once the forum post has been created (it is required to save your application)",
            "isOpen": false,
            "closeDate": "2024-04-16T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/43114/4",
            "governanceURI": "https://t.me/avalanchegrants",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-03-26T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1329:14",
            "name": "Creator Fund: Round #5 - Video Content Application Setup",
            "description": "This round will allocate funds to support contributions to individuals and initiatives building on Sei, focusing on Video Content Creation and Community Engagement.",
            "isOpen": false,
            "closeDate": "2025-01-27T17:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1329/14",
            "governanceURI": "https://t.me/+byWpLVRDllEzZTU1",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-31T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42220:11",
            "name": "Real World Builders",
            "description": "The Real World Builders program supports team working on use cases of blockchain technology that make a positive impact on physical communities and environments in areas such as financial inclusion, ecological credits, Real World Assets (RWA), Decentralized Physical Infrastructure (DePIN), and more.",
            "isOpen": false,
            "closeDate": "2024-08-12T21:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42220/11",
            "governanceURI": "stewards@celopg.eco",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T13:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:23",
            "name": "Hackathon Alumni",
            "description": "To foster the growth and impact of open-source software (OSS) within the tech ecosystem, there's a growing need to support projects that have shown promising beginnings at recent hackathons. Recognizing this potential, the focus is on identifying and funding projects that align with several key target areas:\n\n1. Innovative Solutions or Prototypes: Priority will be given to projects that originated as innovative solutions or prototypes during hackathons. These projects should demonstrate a high potential for scalability, impact, and the ability to address complex challenges within the OSS ecosystem.\n\n2. Initiatives Addressing Clear Needs: The funding will also target initiatives addressing clear and identifiable needs within the OSS or broader tech ecosystem. This includes projects that offer new tools and improve end user experience.\n",
            "isOpen": false,
            "closeDate": "2024-04-27T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/23",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-02T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:387",
            "name": "GG21 DeSci Round",
            "description": "DeSci (Decentralized Science) envisions a fair and equitable ecosystem for funding, creating, reviewing, crediting, storing, and disseminating scientific knowledge. The core idea is simple: transparency and decentralization lead to collaboration and progress in academia and beyond. The first DeSci round was held during GR15 in September 2022. GG21 is the 4th official DeSci round on Gitcoin.                                                                                                                                                                                                                                                                                                                                                                                          As DeSci continues to grow, the stewards and operators envision the DeSci round becoming more than just a round—it aims to serve as an ecosystem governance framework, empowering stakeholders to shape the future of decentralized science.                                               　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　                                                                                                                         　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        https://x.com/DeSci_Round_Ops",
            "isOpen": false,
            "closeDate": "2024-08-12T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/387",
            "governanceURI": "https://t.me/gitcoindesci/678",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-03T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:385",
            "name": "Web3 Grants Ecosystem Advancement",
            "description": "The Cartographer Syndicate is a high-context community of individuals and teams dedicated to advancing the Web3 grants ecosystem. We bring together service providers, grant managers, and thought leaders to collaborate, share insights, and drive innovation. \n\nIn collaboration with Thank ARB and Gitcoin, we are hosting a quadratic funding round to support and grow our community while furthering our mission in the Web3 grants space.  This round will allocate funds to individuals or teams who have previously contributed to the Web3 grants ecosystem or those with forward-looking ideas that align with the Syndicate's mission.\n\nRound Objectives:\n- Attract new members to the Cartographer Syndicate\n\n- Support innovation in the Web3 grants space.\n\n- Support previous and ongoing contributions to Web3 grants, including research, tooling, and thought leadership.\n\n- Encourage projects that align with or complement the Syndicate's broader goals, such as contributing to the Web3 Grants Registry, enhancing news aggregation and event coverage in the Web3 grants space, and developing tools or methodologies for the Web3 grants ecosystem\n\nRound Philosophy:\n- Open Innovation: We welcome diverse projects that can contribute to the Web3 grants ecosystem in novel and impactful ways.\n\n- Collaborative Approach: We encourage projects that align with our mission and seek to complement existing initiatives. This round's success is viewed as a collective achievement, benefiting the entire Web3 grants ecosystem.\n\n- Knowledge Sharing: We prioritize initiatives that contribute to aggregating and disseminating insights across the Web3 grants space.\n\n- Long-term Vision: We support projects committed to sustained impact and growth within the Web3 grants ecosystem.",
            "isOpen": false,
            "closeDate": "2024-08-10T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/385",
            "governanceURI": "https://t.me/+TSXkBlGDqJ9hM2E5",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:31",
            "name": "OpenCivics Consortium Round 02",
            "description": "This OpenCivics Consortium Round seeks to fund critical collaborative protocols, prototypes, and infrastructures that enable civic engagement and interoperable civic utilities for direct governance and stewardship of our communities and commons. We see these collaborative methods and prototypes as critically underfunded force multipliers for multi-agent coordination on key systemic leverage points that create deep social change. \n\nIdeal applicants will be engaged in developing technology, applied research, and social processes related to collaboration and coordination for collective action. Projects may address the diverse stack of collaborative protocols needed for successful multi-agent coordination such as: identity and attestation, on-chain delegation and roles, decentralized project management, fundraising and allocation, systems-aware strategic alignment processes, measurement and evaluation, and participatory governance and learning. These efforts may be theoretical and research-based or may be applied contexts of collaboration whose successful actualization could lead to protocolization of key activities and collaborative functions.  \n\nFor additional definitions and application details, please visit https://go.opencivics.co/wiki",
            "isOpen": false,
            "closeDate": "2024-04-27T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/31",
            "governanceURI": "team@opencivics.co",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-03T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:642",
            "name": "ENS Ecosystem",
            "description": "The GG22 ENS Ecosystem Round round supports projects actively building on top of ENS",
            "isOpen": false,
            "closeDate": "2024-10-23T12:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/642",
            "governanceURI": "https://t.me/limes_eth",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-14T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:384",
            "name": "CollabTech Round and Thresholds Experiment",
            "description": "Let’s grow CollabTech: organisations on-chain, evolution of B2B SaaS, and future of work; projects advancing identity & reputation, governance & decision making, operations (accounting, sales automation, inventory management, talent, etc), community, and contributor tooling!",
            "isOpen": false,
            "closeDate": "2024-08-20T22:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/384",
            "governanceURI": "https://t.me/+PEUVS-tMcX5iMzE0",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T08:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:39",
            "name": "DeSci (Decentralized Science)",
            "description": "The DeSci round includes projects that fall into the domain of Decentralized Science. (https://ethereum.org/en/desci/)",
            "isOpen": false,
            "closeDate": "2024-05-07T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/39",
            "governanceURI": "https://t.me/gitcoindesci/",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-16T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:96",
            "name": "Glo Dollar x Optimism Builders ",
            "description": "This round supports projects on Optimism that have integrated or hold Glo Dollar (USDGLO), a stablecoin that donates 100% of its profits to fund public goods. Its donations support initiatives like Optimism Retro Funding, Gitcoin, Giveth, the Protocol Guild, climate action, efforts to fight extreme poverty, and more.",
            "isOpen": false,
            "closeDate": "2025-01-29T05:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/96",
            "governanceURI": "https://t.me/glodollarrr",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2025-01-10T21:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:28",
            "name": "Hypercerts Ecosystem Round",
            "description": "This round aims to strengthen the Hypercerts Ecosystem to realize the vision of an interconnected impact funding network. We specifically want to support projects\n1. that integrate hypercerts into existing funding platforms—similar to the hypercerts integration with Gitcoin,\n2. that develop new applications like prize competitions leveraging the hypercerts infrastructure,\n3. that build tooling to extent the functionality for multiple integrations and applications, such as Deresy to coordinate evaluators, or\n4. that are tangible use cases piloting new functionalities, e.g. implementing retroactive funding rounds with hypercerts or using hyperboards.",
            "isOpen": false,
            "closeDate": "2024-04-27T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/28",
            "governanceURI": "https://t.me/+YEZDaZ5LldY3NDhi",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-02T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42220:16",
            "name": "Regen Citizens Genesis",
            "description": "**The GG22 Regen Citizens Genesis Round** is a joint initiative between GreenPill Network, ReFi DAO, Let’s Grow DAO, and Celo Public Goods. Focusing primarily on these organisation as a starting point, the aim of this round is to empower and recognize builders making meaningful contributions to the regenerative movement on Ethereum.",
            "isOpen": false,
            "closeDate": "2024-10-25T04:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42220/16",
            "governanceURI": "https://www.regencoordination.xyz/GG22-Regen-Citizens-Genesis-11a2e7251f2f80b0b958c8ef1f89bb7a?pvs=4",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-09T13:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42220:18",
            "name": "BioFi Pathfinders 🌱",
            "description": "The Bioregional Finance (BioFi) Pathfinders Round is a partnership between The BioFi Project, Open Civics, The Design School for Regenerating Earth, and Regen Coordination to support the most sophisticated Bioregional Organizing Teams around the world in developing, clarifying, and enhancing their BioFi vision, strategy, and capabilities. This invite-only round is aimed at advanced teams that are already practicing or actively developing their approach to Bioregional Finance (BioFi), with a focus on building Bioregional Financing Facilities (BFFs) or bioregional funding ecosystems more broadly.\n\nFor detailed suggested questions to help shape your project description, visit https://nifty-humidity-dcf.notion.site/Pathfinders-Grantee-Questions-Template-fa60a0314b174422bd1f2735e3541cdc?pvs=4",
            "isOpen": false,
            "closeDate": "2024-11-07T00:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42220/18",
            "governanceURI": "https://nifty-humidity-dcf.notion.site/GG22-BioFi-Pathfinders-Round-11866e07503c80e89439c0c4fdba6df7?pvs=4",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-15T16:10:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42220:14",
            "name": "Regen Coordi-Nation Genesis",
            "description": "​The Regen Coordi-Nation — a pioneering collaboration between GreenPill Network, ReFi DAO, and Celo Public Goods aimed at fostering a global movement of regenerative communities leveraging Web3 technology to address local needs and create real-world impact. \n\nThis GG21 Genesis Round, which offers $50K in matching funds, is open to applications from nominated ReFi DAO Local Nodes, GreenPill Local Chapters, and Celo Regional DAOs, as well as a select few additional aligned projects from each network.\n\nLearn more through the Regen Coordi-Nation Portal! \n--> https://tinyurl.com/RegenCoordinatePortal",
            "isOpen": false,
            "closeDate": "2024-08-12T22:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42220/14",
            "governanceURI": "https://t.me/+dfOMYhMROdU5YzY0",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-26T11:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:611",
            "name": "GG22 OSS - Hackathon Alumni",
            "description": "Gitcoin and our partners are collaborating to support the growth and development of projects that originated in recent hackathons and have shown potential for significant contributions to the OSS community. This round will allocate funds to nurture and support these emerging projects.",
            "isOpen": false,
            "closeDate": "2024-10-29T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/611",
            "governanceURI": "https://t.me/+W9y5_KplLX4xYjcx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-30T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:646",
            "name": "Youth In Need",
            "description": "This round welcomes projects that support youth in need through kids’ shelters and related services, such as education, safe housing, counseling, and crisis intervention programs.",
            "isOpen": false,
            "closeDate": "2024-11-07T00:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/646",
            "governanceURI": "noahchonlee@gmail.com",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-16T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:66",
            "name": "Octant Community Round 1",
            "description": "This round is dedicated to supporting projects that enhance and expand the Octant ecosystem through community building and educational initiatives. We're looking for innovative proposals that will engage, educate, and grow our community.",
            "isOpen": false,
            "closeDate": "2024-09-12T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/66",
            "governanceURI": "https://discord.gg/octant",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-04T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:57",
            "name": "Token Engineering the Superchain",
            "description": "This round aims to advance the Optimism (OP) and broader Superchain ecosystems by funding high-impact token engineering projects. We prioritize initiatives in tooling, research, education, social infrastructure, and consulting. Successful projects will show impact potential, feasibility, and alignment with OP's goals. Top grantees will be eligible for a follow-on Retroactive Funding round to reward their impact. More detail on these integrated grant rounds can be found here: https://bit.ly/3Yhf29o\n\nGrants admitted into this August round will be eligible to participate in a TEC retroactive funding round later this year, with awards based on progress against 2 milestones. \n",
            "isOpen": false,
            "closeDate": "2024-08-12T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/57",
            "governanceURI": "grants@tecommons.org",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:636",
            "name": "Allo Builders Advancement Round",
            "description": "This round aims to support and grow the ecosystem of projects building on or integrating with the Allo Protocol. We seek to fund established and emerging projects that contribute to the advancement of Allo, with the ultimate goal of driving Gross Merchandise Value (GMV) through the Allo protocol.",
            "isOpen": false,
            "closeDate": "2024-10-29T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/636",
            "governanceURI": "https://t.me/+KDqQziqz90ZlN2Y5",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-10T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:648",
            "name": "GG22: Crypto Advocacy",
            "description": "Gitcoin is launching a curated quadratic funding round to support crypto advocacy. This round aims to allocate $100,000 to pre-selected projects contributing to crypto advocacy and policy efforts.",
            "isOpen": false,
            "closeDate": "2024-11-06T00:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/648",
            "governanceURI": "sov@gitcoin.co",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-18T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:641",
            "name": "Growing the Public Gardens",
            "description": "This round aims to support and grow the ecosystem of projects building on or integrating with Gardens v2. We seek to fund established and emerging projects that contribute to the advancement of Gardens v2, aiming to drive innovation and development within the Gardens v2 ecosystem. Innovative projects that are open source or can be categorized as public goods can also apply if they are active in Gardens.",
            "isOpen": false,
            "closeDate": "2024-10-29T23:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/641",
            "governanceURI": "https://t.me/+UfNSRjaoRnU3N2U8",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-10-15T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:383",
            "name": "Decentralized Science and Art in Psychedelics",
            "description": "### Empowering Decentralized Science and Art in Psychedelics\n\nOur funding round aims to support innovative projects that advance the artistic and scientific understanding of psychedelics. We seek proposals focusing on history, scientific research, therapeutic applications, aesthetic experiences, and storytelling through music and narrative. By providing resources and a collaborative platform, we empower researchers, artists, and storytellers to explore and share the profound impacts of psychedelics. Projects must demonstrate community engagement, impact potential, feasibility, and ethical standards, contributing to a vibrant ecosystem of knowledge and creativity in the field of psychedelics.",
            "isOpen": false,
            "closeDate": "2024-08-02T19:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/383",
            "governanceURI": "brad@psychedelicpuppet.show",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-25T02:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:386",
            "name": "OpenCivics Collaborative Research Round",
            "description": "The OpenCivics Collaborative Research Round is designed to foster collaboration among researchers, civic innovators, and community organizers through open source research and knowledge production. Projects in this round are committed to contributing critical research into the commons and collaborating with others to share that knowledge in forms that directly empower community organizers.",
            "isOpen": false,
            "closeDate": "2024-08-21T11:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/386",
            "governanceURI": "team@opencivics.co",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-24T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:367",
            "name": "Unlock Protocol x Arbitrum : Builders Retro Funding II",
            "description": "This round is to retroactively reward creators, builders, event hosts, communities, and projects who have used Unlock Protocol in any way, on Arbitrum. \n\n**Unlock use cases include:** Event Ticketing -- Recurring Subscriptions -- Time-Based Memberships -- Certifications & Credentials -- Event ticketing, check-in, and proof of attendance NFTs -- Membership access to content, video, software, music, podcasts --- memberships, community, DAO, and event access -- On-chain certifications for skills and continuing education -- Gaming -- Loyalty Programs -- Attendance NFTs -- Digital Collectibles -- Game subscriptions, in-game items, rewards -- Customer rewards, benefits, and recognition -- Attendance, participation, and commemoratives -- PFP collections, art NFTs and brand collections",
            "isOpen": false,
            "closeDate": "2024-08-02T04:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/367",
            "governanceURI": "https://t.me/+uMnOwqA5WUtmZDQx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-10T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42220:22",
            "name": "AgroforestDAO Round",
            "description": "The AgroforestDAO Round  is a partnership between AgroforestDAO, GreenPill Brazil and Regen Coordination and support from Kolektivo and Kokonut Network. The goal of this round is to incentivize participants of the I Jornada AgroforestDAO who are promoting food forest culture using web3 to coordinate. To participate, projects must have at least one Journey POAP, define seasonal goals and commit to sharing goals updates. The round will distribute a $3,500 USDGLO fund, using the quadratic funding model. The round will be publicized through social networks, community calls and online events.   PORTUGUÊS: A I Rodada da AgroforestDAO é uma parceria entre AgroforestDAO, GreenPill Brazil e Regen Coordination para incentivar participantes da I Jornada AgroforestDAO que estão usando a Web3 para promover a cultura agroflorestal em rede. Para participar, os projetos têm que ter ao menos uma POAP da Jornada, definir metas sazonais e se comprometer a compartilhar atualizações das metas. A rodada vai distribuir um fundo de $3.500 USDGLO, utilizando o modelo de financiamento quadrático. A rodada será divulgada por meio de redes sociais, chamadas comunitárias e eventos online. ",
            "isOpen": false,
            "closeDate": "2024-12-19T03:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42220/22",
            "governanceURI": "agroforestdao@gmail.com",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-12-06T00:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:30",
            "name": "ETH Dublin Hackathon 2024",
            "description": "Gitcoin and ETH Dublin are proud to introduce an IRL QF Grant Round, empowering hackathon projects to thrive. Join us to experience firsthand how GTC = Grants = Growth, and make your mark by contributing to impactful and regenerative community projects!",
            "isOpen": false,
            "closeDate": "2024-06-10T22:59:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/30",
            "governanceURI": "https://t.me/+IWWzOPzS4x9iYTIx",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-05-29T18:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:748",
            "name": "Contribuidores da Jornada AgroforestDAO",
            "description": "Essa rodada pretende recompensar as pessoas que colaboraram para fazer acontecer a primeira Jornada AgroforestDAO",
            "isOpen": false,
            "closeDate": "2024-11-22T03:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/748",
            "governanceURI": "agroforestdao@gmail.com",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-03T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:758",
            "name": "Students clubs & Youth groups round",
            "description": "Student clubs and youth groups can evolve into vital nodes of community engagement, innovation, and social impact. Beyond traditional roles in extracurricular and community activities, they hold the potential to become micro-ecosystems generating significant societal value in edu/acc and gen/acc.",
            "isOpen": false,
            "closeDate": "2024-12-14T21:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/758",
            "governanceURI": "victorwakariuki@gmail.com",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-09-03T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:11",
            "name": "Gitcoin Testing Meme Round",
            "description": "This is an internal testing round to get familiar with Allo v2 and prep for GG20!",
            "isOpen": false,
            "closeDate": "2024-03-29T15:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/11",
            "governanceURI": "meg@gitcoin.co",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-03-27T13:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "42161:38",
            "name": "HyperLocalizer Round One",
            "description": "Experimental round to fund public goods for local impact",
            "isOpen": false,
            "closeDate": "2024-05-16T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/42161/38",
            "governanceURI": "https://t.me/hyperlocalizer_chat",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-15T19:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:25",
            "name": "The Network IRL QF",
            "description": "The Network IRL speakers QF",
            "isOpen": false,
            "closeDate": "2024-05-16T23:20:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/25",
            "governanceURI": "https://linktr.ee/iberoam",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-05-15T13:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "8453:10",
            "name": "HyperLocalizer Round One",
            "description": "Experimental round to fund public goods for local impact",
            "isOpen": false,
            "closeDate": "2024-05-16T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/8453/10",
            "governanceURI": "https://t.me/hyperlocalizer_chat",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-15T19:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "534352:12",
            "name": "HyperDeSci 🧠🔬📖 Round Two",
            "description": "Decentralized science (DeSci) is a movement that aims to build public infrastructure for funding, creating, reviewing, crediting, storing, and disseminating scientific knowledge fairly and equitably using the Web3 stack.DeSci aims to create an ecosystem where scientists are incentivized to openly share their research and receive credit for their work while allowing anyone to access and contribute to the research easily. DeSci works off the idea that scientific knowledge should be accessible to everyone and that the process of scientific research should be transparent. DeSci is creating a more decentralized and distributed scientific research model, making it more resistant to censorship and control by central authorities. DeSci hopes to create an environment where new and unconventional ideas can flourish by decentralizing access to funding, scientific tools, and communication channels.Decentralized science allows for more diverse funding sources (from DAOs, quadratic donations(opens in a new tab) to crowdfunding and more), more accessible data and methods, and by providing incentives for reproducibility.",
            "isOpen": false,
            "closeDate": "2024-06-03T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/534352/12",
            "governanceURI": "https://t.me/hyperdesci",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-05-20T21:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:18",
            "name": "HyperLocalizer Round One",
            "description": "Experimental round to fund public goods for local impact",
            "isOpen": false,
            "closeDate": "2024-05-16T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/18",
            "governanceURI": "https://t.me/hyperlocalizer_chat",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-15T19:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "43114:1",
            "name": "mo's round on avalanche",
            "description": "description",
            "isOpen": false,
            "closeDate": "2024-03-22T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/43114/1",
            "governanceURI": "blablalbalba@gmail.com",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-03-26T12:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "1329:7",
            "name": "Testing Payouts",
            "description": "look ma i'm testinggggggg",
            "isOpen": false,
            "closeDate": "2024-07-10T05:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/1329/7",
            "governanceURI": "umar@gitcoin.co",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-07-31T16:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "10:94",
            "name": "gen/acc Meme QF Round",
            "description": "As part of our closing day activities, you'll put your Web3 knowledge into action through a fun Quadratic Funding round! Create two meme grants about your gen/acc experience - one that follows our eligibility criteria and one that doesn't. This hands-on exercise will help you understand how QF works in Web3 while celebrating our journey together. We have a $100 matching pool, and you'll get to experience firsthand how grant submissions, matching funds, and community voting shape funding decisions. Let's wrap up gen/acc by turning your creativity into practical Web3 experience!",
            "isOpen": false,
            "closeDate": "2024-12-18T17:30:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/10/94",
            "governanceURI": "adarsh@civicsunplugged.org",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-12-17T19:30:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "534352:6",
            "name": "HyperLocalizer Round One",
            "description": "Experimental round to fund public goods for local impact",
            "isOpen": false,
            "closeDate": "2024-05-16T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/534352/6",
            "governanceURI": "https://t.me/hyperlocalizer_chat",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-15T19:00:00+00:00"
        },
        {
            "type": "GrantPool",
            "id": "137:10",
            "name": "HyperLocalizer Round One",
            "description": "Experimental round to fund public goods for local impact",
            "isOpen": false,
            "closeDate": "2024-05-16T00:00:00+00:00",
            "applicationsURI": "https://explorer.gitcoin.co/#/round/137/10",
            "governanceURI": "https://t.me/hyperlocalizer_chat",
            "attestationIssuersURI": null,
            "requiredCredentials": [],
            "image": null,
            "coverImage": null,
            "startDate": "2024-04-15T19:00:00+00:00"
        }
    ]
}
