{
    "@context": "http://www.daostar.org/schemas",
    "type": "Project",
    "id": "daoip5:celo-org:project:Earthist Seeds for Regeneration",
    "name": "Earthist Seeds for Regeneration",
    "description": "The Earthist project is strategically utilizing hypercerts; a digital certification system designed to record and incentivize ecological practices. It will move to the Celo blockchain, as lower gas fees facilitate numerous small transactions and high transaction speeds, making it meaningful to issue hypercerts for various ecological actions without significant overhead.\n\nThis will focus on key environmental areas: soil, water, air, biodiversity, equity, carbon sequestration, and education.\n1) Soil Health: Document improvements in soil organic matter and erosion control through regenerative agricultural practices.\n2) Water Conservation: Track reductions in water use facilitated by efficient irrigation systems and rainwater harvesting.\n3) Air Quality: Monitor reductions in air pollution from adopting natural pest management and other sustainable agricultural practices.\n4) Biodiversity: Verify activities related to habitat restoration and native species planting that contribute to ecosystem diversity.\n5) Community&Equity: Document community involvement and equitable access to natural resources through participatory ecological projects.\n6) Carbon Sequestration: Track carbon capture amounts linked to afforestation, reforestation, and sustainable land management practices.\n7) Education: Log participation and completion of educational workshops focusing on sustainability practices and ecological impact awareness.\n\nSuch examples:\n*Non-GMO Seed Distribution:\nContributors involved in distributing or planting non-GMO seeds are issued hypercerts as proof of their ecological contributions. This encourages the adoption of sustainable agricultural practices.\n\n*Hemp Planting for Carbon Sequestration:\nThe planting of hemp is a significant activity for carbon sequestration. By documenting this on Celo, the project issues hypercerts that not only quantify but also validate the carbon captured, promoting broader adoption of hemp cultivation.\n\n*Rewarding Workshop Participation:\nParticipants in ecological workshops receive hypercerts, recognizing their efforts to expand their environmental knowledge and practices.\n\nPossible implementations on Celo:\n1) Community Engagement: Utilize Celo’s mobile-first approach to document ecological contributions easily and effectively, directly from community members’ mobile devices.\n2) Smart Contracts: Use smart contracts on Celo to automate the process of documenting and verifying ecological impacts for each activity.\n3) Integration with other agro technologies: exploring the integration of IoT for real-time data collection and blockchain for robust, decentralized data storage and access on Celo.\n\nAdditionally, the project will facilitate rewards for community members through Earthist Validator as part of a collaborative effort with the Regen Network. These rewards will be distributed to those who actively contribute to regenerative practices that have been validated and approved via hypercerts on Celo blockchain.\n\n\n\n\n",
    "email": "sohto@earthist.network"
}
    // TODO: Add to OSS-Directory
