{
    "@context": "http://www.daostar.org/schemas",
    "name": "Celo Public Goods",
    "type": "Entity",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "mint_growth",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:1",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/pay-protocol-5097697649845812",
                    "projectId": "daoip-5:celopg:project:pay-protocol",
                    "projectName": "Pay Protocol",
                    "createdAt": "2024-10-10T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/pay-protocol-5097697649845812",
                    "description": "Pay Protocol",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Payments",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "metamerlin@payprotocol.network",
                        "celopg.payeeAddress": "0x23534EE59D836607310A313Ce1193A65a6171874",
                        "celopg.teamOverview": "Cofounder & CEO: Richie Li - has over 8 years of experience in the blockchain industry and has been an early investor in numerous projects, including Ethereum, Aave, and others. He co-founded HPB, a prominent public chain projcet that once had an FDV exceeding one billion Dollars. Before entering the blockchain sector, Richie served as a senior analyst at Guo Tai Jun An Securities. He holds a Ph.D. in Finance from the Central University of Finance and Economics.\n\nCofounder & CEO: Yolanda Liu - graduated from ETH Zurich with a Bachelor's degree in Computational Science and Engineering. In her previous career, as the Asian Representative for Arctic Circle Data Center and Intrahouse, she led BTC mining operations and closed $12 million in deals within a month.\n\nCofounder & Head of Product: Amo Huang - has over 15 years of developing experience in internet development and product design. Previously, Amo co-founded a Defi product Oin as the CTO, and priort to that, he worked as an CTO of zg.top, one of the big exchanges platforms.",
                        "celopg.region": "North America",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/ee1f6104-5ec4-4b9b-99e8-eed7e3e1e594/8aaf7e4e-b0f4-4fb0-8b99-a5ceb9f98bec/Pay-Protocol-LOGO.png",
                        "celopg.priorWorkExamples": "HPB, a prominent public chain projcet that once had an FDV exceeding one billion Dollars.Oin, a robust turnkey stablecoin issuance platform built for the multi-chain universe."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:2",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/giveth-house-web3-space-for-good-8525788120341209",
                    "projectId": "daoip-5:celopg:project:giveth-web3-house",
                    "projectName": "Giveth Web3 House",
                    "createdAt": "2024-11-14T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/giveth-house-web3-space-for-good-8525788120341209",
                    "description": "Giveth House Web3 Space for Good",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Incubator",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "givethhouse@proton.me",
                        "celopg.payeeAddress": "0xB6989F472Bef8931e6Ca882b1f875539b7D5DA19",
                        "celopg.teamOverview": "- Founder: Griff Green - Cofounder of Giveth, CommonsStack, General Magic, and Dappnode.\n\n- House Manager: Franco\n\n- Core Team: Giveth House Contributors – embodying a \"Collective Effort,\" where everyone contributes to the mission and daily operations, reinforcing the community-driven ethos at the heart of Giveth House.",
                        "celopg.region": "Europe",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/748d3c51-2b30-4d9f-b031-b884613bc950/4a8a69a4-b817-4d25-9133-b4139a813cfc/logogiveth.png",
                        "celopg.priorWorkExamples": "Griff Green has been involved in the Ethereum ecosystem for many years and has significantly contributed to the Public Goods scene through his leadership in several key initiatives:Giveth: Decentralized donation platform for transparency and financial inclusion. - www.giveth.io The Commons Stack: Sustainable funding models for public goods. - www.commonsstack.org DappNode: Decentralized infrastructure empowering users to run their own nodes. - www.dappnode.com Praise: Community recognition system fostering collaboration. - www.givepraise.xyz Pairwise: Voting tool for community-led governance. - www.pairwise.vote"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:3",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/minah-io-project-6771436809394364",
                    "projectId": "daoip-5:celopg:project:minah",
                    "projectName": "Minah",
                    "createdAt": "2024-12-07T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/minah-io-project-6771436809394364",
                    "description": "Minah.IO Project",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "hgakpe@minah.io",
                        "celopg.teamOverview": "The project is led by two co-founding brothers, Julien and Herve GAKPE, a team of three developers, and a few strategic supporters.\n    \n    Julien began his career as an M&A investment banker and later joined Bpifrance as an institutional investor focused on blockchain. As a Fund of Funds investor, he completed investments totaling over €200M. Julien also worked as a full-stack web developer for three years after training at 42, a renowned french coding school. He graduated from Toulouse Business School and completed an executive program in Blockchain and Decentralized Finance at Ecole Polytechnique. He currently dedicates 80% of his time to Minah.\n    \n    Herve is an experienced CFO who started his career in project financing for African infrastructure before moving into the startup sector. He held positions as Financial Manager and CFO at SMASH Group, supporting over 30 startups and SMEs with financial structuring. He now oversees Minah's operational and financial development. Herve graduated from ESSEC and EMLyon and dedicates 80% of his time to Minah.\n    \n    The development team includes Erwan Lajouannique (42 graduate, GitHub: https://github.com/erlajoua) and members of the Dar blockchain team, with whom they collaborate closely, including Hatem ([GitHub](https://github.com/hatemua): https://github.com/hatemua) and Yessine ([GitHub](https://github.com/yessinemaalej):https://github.com/yessinemaalej).\n    \n    They also have a strategic contributor, Tiziana Bonbassei, based in Dubai (Marketing and Partnerships), along with advisors such as the Founding Partner of TRGC, an investment fund in Amsterdam.",
                        "celopg.region": "Europe",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/3e600aca-5ba9-41e7-b07b-74e04200544b/bc1e2e95-bbcf-4d66-8c8b-dce3fa2f72b5/Minah---Logo-white-Back-(black)---minah.io.png",
                        "celopg.priorWorkExamples": "⇒ Julien Gakpe brings a complete mix of technical, financial, and blockchain expertise. His participation in the Executive Education Program at Ecole Polytechnique, focusing on advanced blockchain and decentralized finance (DeFi), directly aligns with Minah.io's core technology. Also, his Masters from Toulouse Business School in International Finance and Management and his experience at 42 School in coding provide a strong foundation in both the financial and technical aspects of blockchain technology. His professional background in private equity, crypto, and tech M&A further justifies his role as the Chief Investment Officer in Minah.io, guiding the investment strategies that we’ll deploy. He invested more than 200 M$ in funds and managed a 100 M$ fund strategy for the French sovereign fund. ⇒ Hervé Gakpe offers a unique combination of technical and financial expertise. His time at Le Wagon Paris gave him strong skills in data sourcing and analysis, which are essential in the data-driven landscape of blockchain and real estate investment. Furthermore, his education at EM Lyon Business School, with a Specialized Master in Corporate Finance, and at ESSEC Business School, with a focus on corporate finance, and M&A/Private Equity, complements his technical skills with a robust financial basis. This blend of tech and finance knowledge is crucial for his role as Chief Operations Officer, overseeing the project's operational and compliance aspects."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:4",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/fanera-2380877676452695",
                    "projectId": "daoip-5:celopg:project:fanera",
                    "projectName": "Fanera",
                    "createdAt": "2024-10-12T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/fanera-2380877676452695",
                    "description": "Fanera",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "mo@fanera.co",
                        "celopg.teamOverview": "Our team consists of experienced founders and blockchain enthusiasts. Mohamed Kilany, CEO, has over 15 years of experience in Web3, digital strategy, and entrepreneurship. Mohamed Barhoush, CTO, is an expert in AI and blockchain technologies, and Ash Abumaraq, CPO, brings a strong background in product management and sports-tech innovation. Together, we’ve successfully built Fanera, a Web3-powered platform with over 500K users.\nLinkedIn:\n\nMohamed Kilany: linkedin.com/in/kilany1982\nMohamed Barhoush: linkedin.com/in/mbarhoush\nAsh Abumaraq: linkedin.com/in/ashabumaraq",
                        "celopg.region": "Asia",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/bbfbfd23-611d-4df6-a576-e3ad87154504/23179b32-abed-408d-9359-908885166639/lgooo-(2).PNG",
                        "celopg.priorWorkExamples": "Fanera has been recognized as a top sports-tech startup globally. The platform is live with 500K+ users, and our NFT marketplace is built on Polygon. We’ve raised over $650K from various investors."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:5",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/wadao-6201528807622523",
                    "projectId": "daoip-5:celopg:project:wadao",
                    "projectName": "WADAO",
                    "createdAt": "2024-11-29T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/wadao-6201528807622523",
                    "description": "WADAO",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "davidmachuche@gmail.com",
                        "celopg.payeeAddress": "0x037Eb04AD9DDFf984F44Ce5941D14b8Ea3781459",
                        "celopg.teamOverview": "David Machuche CEO - X https://x.com/machuche1\n & Linkedin - https://www.linkedin.com/in/david-machuche-1a9954b7/\n\nDavid leads Washika DAO with a strong background in Web3 integration and decentralized governance. With extensive experience in governance roles at PrimeDAO, Inverter Network, ThreefoldDAO, and Gitcoin, David brings a wealth of knowledge in managing decentralized communities and utilizing blockchain solutions for real world use cases. His prior experience in the banking industry adds a unique understanding of traditional financial systems, which he leverages to bridge the gap between conventional finance and DeFi. David is committed to advancing public goods and supporting meaningful innovation.\n\nVictor Muhagachi CSO, Chief of Strategy - X https://x.com/victorthetravlr\n& Linkedin - https://www.linkedin.com/in/victor-muhagachi-ab4234160/\n\nVictor serves as the strategic mind behind Washika DAO’s growth and product design. With a background in strategy and product development at Inverter, SportsPesa, Chatafisha, and Threefold, Victor plays a critical role in ensuring that Washika DAO delivers a user-friendly and impactful solution. His experience in crafting strategies for digital platforms, particularly in financial services and decentralized ecosystems, ensures that Washika DAO is positioned for success in scaling across Africa & beyond.\n\nSimalike Musika COO, Head of Operations & Community manager - X https://x.com/0xmedicineman?s=21&t=hj2iETJ0AG45JhGdjSLNcg\n& Linkedin - https://www.linkedin.com/in/simalike-musika-1b07485b/\n\nAs Chief Operating Officer, Simalike oversees the day-to-day operations and drives community growth. With a strong background in sustainability and community engagement, Simalike has been involved in socio-economic initiatives that focus on empowering marginalized communities. He has a proven track record of successfully linking these initiatives with local government to drive adoption and scalability. His experience at Chatafisha has further honed his skills in operations, making him a critical asset in ensuring that Washika DAO operates smoothly and meets its community-driven goals.\n\nClinton Njogu, Full-stack developer  \nLinkedin - https://www.linkedin.com/in/clinton-njogu/\nGithub - https://github.com/clint911\n\nClinton is the technical powerhouse behind Washika DAO, specializing in full-stack development on the Celo blockchain. His expertise spans smart contract development, front-end, and back-end integrations, ensuring that the platform remains secure, scalable, and user-friendly. Since late 2022 his work has been mostly within the local Celo community all across 2023 & 2024 [B2B Loyalty Management System, Incentivized Citizen Journalizing Platform, Donation Management Platform, cKes bulk payment solutions for businesses & individuals, z-capitals DCA Strategies algorithms, Merchant Pay for integration cKES as part of ecommerce payments]. In 2024 he started working more closely in collaboration with Web3 Clubs where he is part of the team that handles local B2B solutions.",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/335c294c-d64f-4aa6-8597-514ac547bdc3/a2f8fb0d-2823-4b7b-8ff3-ed703d16aefa/Screenshot-2024-10-15-at-11.40.30-AM.png",
                        "celopg.priorWorkExamples": "Pilot on Community currencies & Fractional Reserves in Tanzania with $NYOTA https://drive.google.com/file/d/1AugyqIbeEeNcYRg10_a71mHU6_mzyZTi/view?usp=sharingWe have also worked on Chatafisha, an infrastructure for proof of impact to unlock ecological credits where we worked closely with Regen Network to develop a credit class for waste as well as facilitate the removal of 10 tonnes of verified waste, empowering waste pickers who previously received $0.10 per kg to a mere $0.4 per kg of waste. Our team has always been passionate about working on-ground along the lines of financial inclusion and prosperityLink To report: https://docs.google.com/document/d/1gaZ95kaYa2TvP4e3k_cXyeI9soCmLfMz0AtI5YSrOA0/edit"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:6",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/quidmint-foundation-7401608984597177",
                    "projectId": "daoip-5:celopg:project:qud",
                    "projectName": "QU!D",
                    "createdAt": "2024-11-14T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/quidmint-foundation-7401608984597177",
                    "description": "QuidMint Foundation",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Incubator",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "rico@quid.io",
                        "celopg.payeeAddress": "0x42cc020Ef5e9681364ABB5aba26F39626F1874A4",
                        "celopg.teamOverview": "Our quant / frontend senior is a PhD student in pure math. Our backend master interned for the world's first CBDC in Ukraine, and participated in the Bretton Woods conference in 2020: \n\ntwo years before the inception of the foundation which \nowns Quid Labs, when its director left his role at Liquity AG:\nhttps://github.com/ricktobacco?tab=overview&from=2020-11-01&to=2020-11-30\n\nPrior to Liquity, director worked at CertiK, prior to that at Bancor\nhttps://github.com/ricktobacco?tab=overview&from=2019-11-01&to=2019-11-30\n\nand prior to that at a company now known as FRAX: \nhttps://github.com/samkazemian/DecentralBank/commits/master/",
                        "celopg.region": "North America",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/80c6c6d1-a1a4-47b9-adcf-65b12e541587/b872ee30-3f72-4ce7-9ef9-52c38d7b9a9b/Logo_png_transparency.png",
                        "celopg.priorWorkExamples": "8 other repos in our github.com/QuidLabs/"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:8",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/sargo-enhancing-access-to-education-through-university-based-mutual-credit-28776215710594166",
                    "projectId": "daoip-5:celopg:project:unlocking-education-with-mutual-credit",
                    "projectName": "Unlocking Education with Mutual Credit",
                    "createdAt": "2024-11-14T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/sargo-enhancing-access-to-education-through-university-based-mutual-credit-28776215710594166",
                    "description": "Sargo - Enhancing Access to Education through University-Based Mutual Credit",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "alesh@sargo.io",
                        "celopg.payeeAddress": "0xd3887daa234D004feFe2Ce196B92228974fFA7Bd",
                        "celopg.teamOverview": "Our team brings a wealth of experience in blockchain and financial inclusion:\n\n- Grassroots Economics (Sarafu): Pioneer of mutual credit in Africa, with $60M in trade volume and partnerships with the Red Cross and World Food Programme. Sarafu’s mutual credit system is academically recognised for its economic resilience impact.\n\n- Sargo Exchange: Experts in DeFi, enabling stablecoin and fiat swaps. Supported by Prezenti and experienced in humanitarian cash transfers.\n\n- Lukenya University Leadership: Dr. AbdulHakim Maina and Dr. Ooko George (Staff of School of Business and Economics (SOBE) oversee project implementation, research and staffing within the university.",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/74d5f77f-aaae-46b5-b8f3-d4416a6e952a/d5404a81-36ed-4703-b2f7-17003666f239/unnamed.png",
                        "celopg.priorWorkExamples": "Sarafu: Over 60,000 users and $60 million in trade volume across Kenya. Here’s a quick 3 min recording from the BBC that explains the solution from the perspective of a Sarafu user. Here’s a second short documentary from Ledger.Published reports include:World Food Program: https://docs.google.com/document/d/1aykqeVJIQiN_WyDdbeFwExDSlMBLvp5btoeYMbnIFUU/edit?tab=t.0DOEN Foundation: https://docs.google.com/document/d/1cb_kdrat6NRF3Tx92Ro8tcqaUzbbt0Y4bQ1kYCzMQvg/edit?tab=t.0GE Final Report: https://docs.google.com/document/d/17NoKYV2E5sQiUv_Of7a9C7XcoTGJbKj522h4k4tk1tQ/edit?tab=t.0GIZ Final Report: https://docs.google.com/document/d/12s_oVStIhYH9iqy3sBTb0dnlnsmgRc6dfoPTBrKf6OM/edit?tab=t.0#heading=h.ntway4q0c776Sargo: Before building Sargo, its team:Setup donation systems connecting humanitarian aid and crypto. Designed payment retention systems for the UK construction industry. Run a Celo validator. Delivered cUSD humanitarian cash transfers. Developed non-custodial wallets for KaiOS feature phones, bringing DeFi to people using basic mobile devices.Dr. Maina (Lukenya University): Extensive experience in Islamic Finance and mutual credit, collaborating with Resilient Community Waqfs on Sarafu.Network in other communities."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:9",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/blackfrog-5649821464678286",
                    "projectId": "daoip-5:celopg:project:asm4web3",
                    "projectName": "ASM4Web3",
                    "createdAt": "2024-11-15T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/blackfrog-5649821464678286",
                    "description": "BlackFrog",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "ReFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "wika@blackfrog.xyz",
                        "celopg.teamOverview": "Our international team of commodity and computer engineers is well connected in the commodity sector and web3 space. In europe, we work with the UN, development banks and the german ministry of economics and energy. In Africa, we work with various governments, including the D.R. Congo, Rwanda and Kenya. As early defi adopters, we like to put on a suit or rubber boots as needed and have a feel for momentum and market trends.  We know how to build the first commodity unicorn in DeFi to support a sustainable energy transition.",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/fc4de45a-69ab-40e1-8778-2cb1b5b36d39/e5c276e0-b539-4972-afee-ad335cd80aa8/blackfrog-light-theme(3).png",
                        "celopg.priorWorkExamples": "BlackFrog (formerly IotaOrigin) was funded by the German Federal Ministry for Climate Protection and Energy to develop a critical mineral mobile first tracking system for minerals important for the the energy transition. 1. Introduction 2. ASM In addition, BlackFrog has developed Snippool, a DApp that focuses on NFT liquidity, where NFTs (ERC 721) are traded in pools like ERC20. This can improve the future liquidity of RWAs that are represented as NFTs.https://www.snippool.xyz/ https://medium.com/@iotaorigin/nfts-are-the-front-defi-the-back-end-ece03d0c338d Further work includes an on-chain climate hedgefund run by AI and further NFT liquidity options like NFT liquidity mining within NFTpools."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:10",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/greybox-growth-3124194753595635",
                    "projectId": "daoip-5:celopg:project:greybox",
                    "projectName": "Greybox",
                    "createdAt": "2024-11-08T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/greybox-growth-3124194753595635",
                    "description": "Greybox - growth",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Payments",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "bruce.kweku@gmail.com",
                        "celopg.payeeAddress": "0x401eb1ec217851955614f29d751ddd2c4a9d3e3b",
                        "celopg.teamOverview": "Kweku Bruce, CEO; Decade experience in banking in Ghana- https://www.linkedin.com/in/kwekubruce\nWasiu Adegoke, CPO; Github: https://github.com/damzylance\nProjects:\nBitgifty.com:crypto gifting platform\nminipay.bitgifty.com: Bill payment widget built for Opera MiniPay\nJeffery Oke-Samuel, Engineering Lead; https://github.com/jefferyokesamuel\nProjects; Managed blockchain projects for Shiga dApp",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/58d747d1-afb4-409d-b755-86859d6260d8/d6128a66-bc73-4955-a60e-f0b2b17c0a9f/PHOTO-2024-02-15-11-53-07.jpg",
                        "celopg.priorWorkExamples": "We have previously built an MVP on minipay as part of our celo camp 8 accelerator program.https://drive.google.com/file/d/1ViDu_7REQDrDx_U-mZw8MBiRYOXP0nKE/view?usp=drive_link"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:11",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/popcoin-9761776820241521",
                    "projectId": "daoip-5:celopg:project:popcoin",
                    "projectName": "PopCoin",
                    "createdAt": "2024-11-06T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/popcoin-9761776820241521",
                    "description": "PopCoin",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "xcelsis02@gmail.com",
                        "celopg.payeeAddress": "0x72B0a5CCCa7eEc647B291b4a3Bf48ae05514e143",
                        "celopg.teamOverview": "Our team brings together a wealth of experience in blockchain development, design, and product innovation, with a strong track record of successful contributions across various projects and ecosystems.\n\nYinka (https://Gitcoin.co/layinka, https://devpost.com/xcelsis02) is a highly accomplished blockchain developer and serial hackathon winner. As a former Celo Sage and a participant in both the Celo Camp and the Celo African DAO Camp, Yinka has a deep commitment to and understanding of the Celo ecosystem. He is also a former Gitcoin top earner and has actively contributed to the open-source community, notably enhancing the Mask wallet with integrations for Yearn and Aave.\n\nJoseph(https://devpost.com/amirejoseph83) is an experienced full-stack developer who collaborated with Yinka to develop a multichain IDO launchpad, which won recognition in a Celo-sponsored hackathon. His expertise spans from frontend to backend blockchain development, adding robust technical capabilities to our team.\n\nRichard(https://devpost.com/richard122) brings product design expertise, having worked on multiple projects within web3 and AI spaces. His focus on intuitive design enhances the usability and appeal of our blockchain solutions.\n\nTogether, we previously developed a platform for file backup and crypto estate management, earning a prize in a NEAR hackathon in 2022. This past project exemplifies our capability to deliver high-quality, functional solutions within blockchain and decentralized ecosystems.",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/954ea799-22a2-4104-aef9-79e5ae124565/ac3a2600-003d-40c1-a2d9-4497ba4ae1dd/logo-800.png",
                        "celopg.priorWorkExamples": "Our team has a strong portfolio of projects that showcase our experience and commitment to blockchain development, particularly within the Celo ecosystem.zSales (Multichain IDO Launchpad) (zsales.xyz) – Yinka and Joseph previously collaborated on zSales, a multichain IDO launchpad that won at a Celo-sponsored hackathon. zSales highlights our ability to design and implement robust multichain solutions that enhance accessibility and flexibility for decentralized projects.Storefront (Crypto POS Solution) – Yinka developed Storefront, a crypto point-of-sale solution designed for merchants on Celo’s MiniPay. This solution, which won at the BWC Hackathon, demonstrates our focus on practical, merchant-facing tools that leverage the Celo blockchain to simplify crypto payments.HeirTrust (heirtrust.com) - a File Backup and Crypto Estate Management Platform – Together, we created a secure file backup and crypto estate management platform, which earned us a prize in a NEAR hackathon in 2022. This project reflects our experience in designing secure, user-friendly blockchain solutions with a focus on practical use cases."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:12",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/greenpill-commons-5373303396435993",
                    "projectId": "daoip-5:celopg:project:greenpill-commons",
                    "projectName": "Greenpill Commons",
                    "createdAt": "2024-11-15T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/greenpill-commons-5373303396435993",
                    "description": "Greenpill Commons",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "ReFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "greenpillcommons@greenpill.builders",
                        "celopg.payeeAddress": "0x73dA71F1994100F21739206647bB3Bf60c7A82C5",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:13",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/bitgifty-49838863895194563",
                    "projectId": "daoip-5:celopg:project:bitgifty",
                    "projectName": "BitGifty",
                    "createdAt": "2024-11-09T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/bitgifty-49838863895194563",
                    "description": "BitGifty",
                    "status": "Awarded",
                    "extensions": {
                        "celopg.category": "Payments",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "dolapo@bitgiftyapp.com",
                        "celopg.payeeAddress": "0xb25141912c811aB85f5Dd554453Fd1fd421fad42",
                        "celopg.teamOverview": "Adeagbo Adedolapo - CEO / Growth Manager\n\nAdedolapo is a growth marketer with over 5 years of experience working with international crypto exchanges like Remitano in different growth-related roles including acquisitions and retention.\n \nhttps://www.linkedin.com/in/adedolapom/\n\n\nWasiu Adegoke - CTO / Frontend developer\nAdegoke is a front-end developer with over 5 years of experience. Adegoke was the lead developer on a startup crypto exchange platform - switcha.africa and a gamified savings platform - onecap.africa. He also had a pet project called 9jacoinrate which he worked on during his spare time, a coinmarketcap equivalent for the Nigeria market.\n\nhttps://github.com/damzylance\nhttps://www.linkedin.com/in/adegokewasiu/\n\n\nPrincewill Olaiya - Project Lead / Backend & Blockchain Developer\nPrincewill is an amazing developer with over 5 years of experience in backend and blockchain development. Before joining BitGifty, he was the lead backend developer at 0xEngine labs and the lead developer at Trevlo. He was also the Solutions Architect at DocuSoft Nigeria.\n\nhttps://github.com/just-nibble\nhttps://princewill.onrender.com\nhttps://www.linkedin.com/in/princewill-olaiya/",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Feedback",
                        "celopg.originalStatus": "Passed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/9d9b73f5-1777-45e1-b47f-e8e713226010/f1b0ebea-2a66-4ec5-b907-eb2b0ba85fec/Logo-w-inverted-bg.png",
                        "celopg.priorWorkExamples": "In the past, we have built our crypto gifting infrastructure which allows users to send and receive crypto as gift cards.We also built a 'spend' product that allows crypto users to spend their crypto on payments and bills in their daily lives. Payments and bills like airtime, electricity, grocery shopping, cable TV, sports betting top-up, airtime, and data.We have also integrated BitGifty on Minipay and have gone live in five countries: Nigeria, Ghana, Kenya, Uganda, and South Africa.See -bitgifty.comBitGifty on MinipayEnterprise BitGifty"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:14",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/globachain-stablecoin-payment-platform-6972637070901655",
                    "projectId": "daoip-5:celopg:project:globachain",
                    "projectName": "Globachain",
                    "createdAt": "2024-11-08T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/globachain-stablecoin-payment-platform-6972637070901655",
                    "description": "Globachain StableCoin Payment Platform",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Payments",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "cairon@globachain.com",
                        "celopg.payeeAddress": "0x2553Cea599Dc009A7849ADc1F8F670661d693f6a",
                        "celopg.teamOverview": "Our founding team all come from strong business and technology backgrounds.\n\nAs a Business Consultant Kola is experienced in building solution for clients including customer facing banking applications for tier 1 banks – HSBC, RBS, Santander. This means Kola is used to building business impacting solutions. \n\nhttps://www.linkedin.com/in/kola-azeez-andoyi-69682684/\n\nCairon is a technology expert well versed in development and building solutions, this technical background means that we are able to develop in-house and lead our development team from the front – Investec, Vodafone, Virgin Media, HSBC. Previously built tixhive.com NFT events platform.\n\nhttps://www.linkedin.com/in/cairon-clarke-b0008637/\n\nZeeshan is a compliance expert who has worked for a number of top financial institution – HSBC, RBS, Barclays, Deutsche Bank, he is a certified MLRO and ensures that Globachain is fully compliant to engage in business and fully aware of the evolving regulation within the blockchain space. He also previously co-founded yielders.co.uk. The UK's first sharia compliant, FCA complaint property crowdfunding platform, raising over $6m.\n\nhttps://www.linkedin.com/in/zeeshan-uppal-cams-74a16355/",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/9d66ed8b-6682-4d92-a3a0-84d7441f2829/b7aa01cf-43a0-49c7-802e-5635e0562763/Globachain-FF-(1).png",
                        "celopg.priorWorkExamples": "Previously built www.tixhive.com. Built www.africanvaluables.comBuilt www.yielders.co.uk exitedCurrently working on www.globachain.com"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:15",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/clixpesa-6321289725811574",
                    "projectId": "daoip-5:celopg:project:clixpesa",
                    "projectName": "Clixpesa",
                    "createdAt": "2024-11-14T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/clixpesa-6321289725811574",
                    "description": "Clixpesa",
                    "status": "Awarded",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "kachisa.dn@clixpesa.com",
                        "celopg.payeeAddress": "0x0536757f82fb7bc487548acfe354df3c437d8aaf",
                        "celopg.teamOverview": "1. Derrick Kachisa | Co-Founder: Product\nDerrick has  a background in robotics and automation with 8 years in developing robotics and automations systems with 3 years building web applications and 2 in the blockchain space building Clixpesa. Derrick has strong skills in react and react-native, UI design, solidity and robotics. \n\n2. Samuel Moyi | Co-Founder: Technology\nSamuel is a full stack developer with a background in cyber security and forensics. Samuel has 4 years experiences in the Kenyan tech ecosystem developing health-tech and insurance solutions and 1.5 years in the blockchain space building Clixpesa. He boasts great skills in react, vue, serverless technologies, blockchain integrations and system design. \n\n3. Cecilia Njoroge | Finance\nCecilia has a background in economics and finance with stint at the Central Bank of Kenya and Kenya's national housing cooperation. Cecilia is currently a PhD candidate and upcoming Development economist. She has exemplary knowledge in micro and macro finance, has a CPA and is great with business research and financial data analysis.\n\n4. Nasidai Kidali | Marketing\nNasidai is digital marketing strategist with 6 years experience as a marketer and content creator. She boasts a wealth of experience in copywriting, marketing strategy, market research, content strategy, advertising and digital Marketing.",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Feedback",
                        "celopg.originalStatus": "Passed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/24d09414-5c21-447c-aa50-d5f7bf119b45/f14ea0aa-b097-454b-945c-6a1cc1e87ff6/dark.png",
                        "celopg.priorWorkExamples": "Clixpesa Savings and P2P lending (PRE 122)Clixpesa started with ROSCAs are a market entry product in the Clixpesa MVP, where we onboarded users through their ROSCAs (Chamas as they are refereed to in Kenya). Through the chamas users save together and also are able to lend each other money in the chamas. This has been a very great instrument to understand how our target market (low income earners with little knowledge of crypto) onboard, interact and utilize a web3 product. So far through the MVP Clixpesa has onboarded over 53 chamas with over 400 active users, disbursed 296 loans to members in the chamas. This has been a good measure of how our product is utilized and improvements needed."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:16",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/blocknative-bringing-celo-s-gas-markets-onchain-with-gas-network-6496492904977742",
                    "projectId": "daoip-5:celopg:project:blocknative",
                    "projectName": "Blocknative",
                    "createdAt": "2024-11-11T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/blocknative-bringing-celo-s-gas-markets-onchain-with-gas-network-6496492904977742",
                    "description": "Blocknative - Bringing Celo's Gas Markets Onchain with Gas Network",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Application",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "foundations@blocknative.com",
                        "celopg.payeeAddress": "0xf14613626f1287600d97cBf55AEDd924B62c2af6 (ETH Mainnet)",
                        "celopg.teamOverview": "Matt Cutler - CEO \nMatt Cutler is CEO & Co-Founder of Blocknative, a pioneering provider of real-time Observability infrastructure for the Ethereum ecosystem. Matt is a recognized thought leader on pre-chain topics, including block building, ERC-4337, PBS, MEV, and more. He has founded multiple successful technology startups, including web analytics pioneer NetGenesis (IPO, then acquired by SPSS/IBM) and Collaborate.com (acquired by Cisco).\n\nhttps://twitter.com/mcutler\n\nChris Meisl - CTO \nChris began his career at NASA’s Jet Propulsion Lab developing image processing software for planetary missions. Since then, he has led teams to build and scale numerous Internet products in search, adtech, music, and other industries. He’s skilled in system architecture, user experience, and data science/visualization. Outside of Blocknative you can find Chris skiing, hiking, and biking in the Rocky Mountain wilderness.\n\nhttps://twitter.com/ChrisMeisl \n\nBert Kellerman - Head of Research \nBert has been building systems in the Ethereum ecosystem since 2018. He designed Blocknative's Gas Estimation, the most popular gas estimation tool for Ethereum. Before that he worked at Reflexer Finance, designing the novel stablecoin RAI. He's worked at various data and risk startups for Ethereum and other cybersecurity firms. Bert is also an advisor to some decentralized stablecoin projects, a cub scout leader, a father of four, and a US Navy veteran.\n\nhttps://twitter.com/BertKellerman",
                        "celopg.region": "North America",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/72f17c49-180d-4f7d-ad12-321714485fbf/ae3475a3-f995-4b1c-9f40-b9166ecd9682/BlocknativeLogo_Symbol_RGB_FullColor_Gradient_D.png",
                        "celopg.priorWorkExamples": "Blocknative has worked with the: Ethereum Foundation to build Ethernow.xyz OP Foundation across several grants, most recently to enable support for OP-Mainnet in our gas APIPOL Foundation on gas supportOffchain Labs / ARB Foundation on gas support MatterLabs / ZK Sync on transaction decoding"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:17",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/grant-application-for-sacra-falling-of-myrd-02077764808239979",
                    "projectId": "daoip-5:celopg:project:sacra-falling-of-myrd",
                    "projectName": "Sacra: Falling of Myrd",
                    "createdAt": "2024-11-14T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/grant-application-for-sacra-falling-of-myrd-02077764808239979",
                    "description": "Grant Application for Sacra: Falling of Myrd",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "DeFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "george@sacra.cc",
                        "celopg.payeeAddress": "0x0644141DD9C2c34802d28D334217bD2034206Bf7",
                        "celopg.teamOverview": "VSEVOLOD GRIGOROVICH (full-time) Founder, Lead Solidity Developer - Main game designer, responsible for all game mechanics and its overall vision. https://www.linkedin.com/in/belbix/\n\nALEXANDR SAZONOV (full-time) Full Stack Developer - Developed the infrastructure, integrated the subgraph and minor servers. https://www.linkedin.com/in/alex-sazonov/\n\nMAKSIM GONCHAROV (full-time) Lead Front End Developer - Lead front-end developer, responsible for the entire UI. https://www.linkedin.com/in/maksim-goncharov/\n\nROSTISLAV TIULBEROV (full-time) Game/Narrative Designer - Game designer and lead narrative designer, wrote all the lore and stories of the game, created all the monsters, equipment, and other game elements, and composed their descriptions. https://www.linkedin.com/in/rost-tolberi-550947258/\n\nPAVEL ZBOROVSKII (full-time) 2D Artist - Created some artworks that were later refined by the art lead. https://www.linkedin.com/in/pavel-zborovskii/\n\nKATSIARYNA AKULICH (full-time) PM - Lead the operations office. https://www.linkedin.com/in/kitenkate/\n\nANNA CHAIKOVSKAYA (full-time) Marketing Head - N/A\n\nIVAN (full-time) Community Lead - N/A\n\nVLADISLAV PESTRIKOV (part-time) BD Head. https://www.linkedin.com/in/vladislav-pestrikov-65aa7473/\n\nGEORGE CHERKASOV (part-time) BD. https://www.linkedin.com/in/george-cherkasov/",
                        "celopg.region": "Europe",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/37d39af7-7081-4c9a-b8c9-41f33965e8e0/a266bf8e-92d6-4b3a-8705-d8a6954db06b/Main-Sacra-Logo.png",
                        "celopg.priorWorkExamples": "https://tetu.io/ dystopia.exchange cone.exchange"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:18",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/ultragreen-trees-8405465299846706",
                    "projectId": "daoip-5:celopg:project:ultragreen-trees",
                    "projectName": "UltraGreen Trees",
                    "createdAt": "2024-11-14T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/ultragreen-trees-8405465299846706",
                    "description": "UltraGreen Trees",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "ReFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "djimo@silvi.earth",
                        "celopg.payeeAddress": "0xa7CA400d49BBa87EB606ee05af93689BD21FaB99",
                        "celopg.teamOverview": "Djimo Serodio – Co-Founder & Lead Strategist. Djimo has a background in environmental science, engineering, and agriculture. He previously scaled a citizen science curriculum to 40,000 students and has extensive experience in blockchain-based environmental initiatives.\nSev – Product Manager. Sev oversees agile workflows at Silvi\nMoses - Backend engineer\nCaue - An ecologist with a passion for biodiversity and technology projects. \nHannah - A user experience and interface designer. \nAthus - A web3 technologist with a background in data science. \nDennis - A frontend developer that’s also very active in the Kenyan Celo Community. \nJeremic - A smart contract developer and environmental scientist expert \nAdam - A regenerative design strategist",
                        "celopg.region": "Africa",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/8f891d56-af48-482a-a59e-e172a7e465bd/ec80c38c-5bdc-4b6a-9bc2-7bf9c903e8bd/Silvi-logo-fullgreen-(1).png",
                        "celopg.priorWorkExamples": "Silvi has a strong foundation within the Celo ecosystem, collaborating closely with Climate Collective to amplify impact. We’ve successfully participated in various Gitcoin grant rounds, including the Climate and MaEarth rounds, where our project has been the most successful participant. Silvi’s achievements also include winning the ReFi award at Celo Camp, which recognized our innovative approach to environmental impact within the blockchain space. Our app (app.silvi.earth) empowers users to track, verify, and engage in real-time reforestation efforts on the blockchain, enhancing transparency and accountability in environmental restoration. Silvi currently supports approximately 30 global projects, with our flagship initiative based in Kakamega Forest, Kenya. Additionally, we lead Operation WebTree, a global reforestation fund & web3 onboarding initiative with 20+ pilot projects across 14 countries, and Treekipedia, an open-source, comprehensive, and interoperable database of tree knowledge."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:19",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/commons-prezenti-44854173753948023",
                    "projectId": "daoip-5:celopg:project:commons-protocol",
                    "projectName": "Commons Protocol",
                    "createdAt": "2024-11-16T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/commons-prezenti-44854173753948023",
                    "description": "Commons Prezenti",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "ReFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "commonsprotocol.info@gmail.com",
                        "celopg.payeeAddress": "commonsprotocol.eth",
                        "celopg.teamOverview": "Residents of Funding the Commons residency",
                        "celopg.region": "Asia",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/88a4633e-d91d-4ba5-a7eb-e90d33a4eb27/95f10fe0-bf4b-40dc-8e63-31ec79a68adf/photo_2024-11-16-11.29.27.jpeg",
                        "celopg.priorWorkExamples": "impactMarket.com, GainForest.net, Hypercerts"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:20",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/community-quadratic-funding-matching-fund-impactqf-7187288707333883",
                    "projectId": "daoip-5:celopg:project:community-quadratic-funding-matching-fund-impactqf",
                    "projectName": "Community Quadratic Funding Matching Fund (ImpactQF)",
                    "createdAt": "2024-12-07T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/community-quadratic-funding-matching-fund-impactqf-7187288707333883",
                    "description": "Community Quadratic Funding Matching Fund (ImpactQF)",
                    "status": "Awarded",
                    "extensions": {
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "nina@gainforest.net",
                        "celopg.teamOverview": "David Dao - Co-founder, GainForest\nSharfy Adamantine - Co-founder, GainForest\nNiña Cerilla - Founder’s Associate, GainForest\nNurfatin Hamzah - Community Manager, GainForest\nDiego Rivera Buendia - Software Engineer, GainForest\nRodrigo Ferreira - Software Intern, GainForest\nSejal Rekhan - Grants Innovation, Gitcoin \nLauNaMu - Founder, Metrics Garden",
                        "celopg.region": "Asia",
                        "celopg.proposalStep": "Feedback",
                        "celopg.originalStatus": "Passed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/6f22e80c-7fc9-4bdb-9755-59f9d486b244/79febf33-40f8-4c7c-8473-4f5e68b26372/gainforest-logo.png",
                        "celopg.priorWorkExamples": "Conservation Data Income (CDI): A mechanism that transforms ecological monitoring into sustainable revenue streams for local communities. Through this system, communities collect and verify ecological data about their environments using remote sensing and blockchain technology. This verified data becomes a valuable digital asset that can be sold to organizations needing environmental data, such as researchers, companies, and governments. By creating direct financial incentives for conservation activities, CDI provides communities with an economic alternative to destructive land use practices while strengthening their capacity for ecological monitoring. The system ensures transparent and verifiable conservation outcomes while aligning economic incentives with environmental protection goals. The first small-scale pilot was co-financed in 2022 by Celo Foundation (a 5K USD grant) and collected more than 5000 data points in the Philippines.See tweet for deployment on Celo: https://x.com/dwddao/status/1821108787752710239 or gainforest.app to explore the data and past transactions."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:21",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/citizen-wallet-plugin-development-17085133045213596",
                    "projectId": "daoip-5:celopg:project:citizen-wallet-plugin-integrations",
                    "projectName": "Citizen Wallet plugin integrations",
                    "createdAt": "2024-11-15T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/citizen-wallet-plugin-development-17085133045213596",
                    "description": "Citizen Wallet plugin development",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Application",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "jonas@citizenwallet.xyz",
                        "celopg.payeeAddress": "0xa39e7b901570120f6f963bcce8f5ea4d883cb2ee",
                        "celopg.teamOverview": "Xavier Damman (Entrepreneur, Developer) (Storify, Open Collective, Regens Unite) (https://: One of the founders of Citizen Wallet.\nRoles: Core Contributor, Development, UX, Community Building\nLinkedIn: https://www.linkedin.com/in/xavierdamman/\nOpen source contributions: https://github.com/xdamman. https://github.com/citizenwallet: deeplink, topup, marketplace\n\nKevin Sundar Raj (Entrepreneur, Developer) (TECHI, Appspotr): One of the founders of Citizen Wallet.\nRoles: Core Contributor, Development, Solution Architect, Project Management\nLinkedIn: https://www.linkedin.com/in/kevin-sundar-raj-92261b33/\nOpen source contributions: https://github.com/kev-techi. https://github.com/citizenwallet: app, indexer, smartcontracts, sdk, community\n\nJonas Boury (Entrepreneur, Product Manager)\nRoles: Product Management, Business Development\nLinkedIn: https://www.linkedin.com/in/jonasboury/\n\nOther roles: We cover other roles as needed (UI/UX designer, extra development) by reaching out to the community. Through Xavier's experience building startups over the years and Kevin's experience running development teams, we have enough of a network to solve problems. As our project grows, we intend to maintain a core team to maintain the core platform.",
                        "celopg.region": "Europe",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/50d3dbae-b0d7-40b5-b45b-433de1783e96/73ec58d4-c1a2-4896-b21c-1362f8bd7d22/Citizen-Wallet-Big-Icon.png",
                        "celopg.priorWorkExamples": "Citizen Wallet https://citizenwallet.xyzOpen source development repos: https://github.com/orgs/citizenwallet/repositories NFC Wallet: https://nfcwallet.xyz/ . Built at ETHGlobal (finalists!) and integrated into Citizen WalletWolugo: https://www.wolugo.be/ . Civic engagement platform.Community topup page: https://topup.citizenwallet.xyz/"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:22",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/cdrex-6358699150692539",
                    "projectId": "daoip-5:celopg:project:cdrex-brl-stablecoin-initiative",
                    "projectName": "cDREX - BRL Stablecoin Initiative",
                    "createdAt": "2024-11-15T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/cdrex-6358699150692539",
                    "description": "cDREX",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "Stablecoin",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "adonis@crefi.io",
                        "celopg.payeeAddress": "0xe64b8daed11031c986759435fb670c024d97e202",
                        "celopg.teamOverview": "Our team is composed of seasoned professionals with expertise in blockchain technology, cryptography, and financial regulations. We collaborate with renowned development teams like Megalodon Tech, known for their cutting-edge technology solutions, and work closely with regulatory bodies such as the Central Bank of Brazil to ensure compliance and integration with financial systems. This combination of skills and partnerships allows us to create secure, scalable solutions that meet both technological and regulatory requirements.",
                        "celopg.region": "South America",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/bbc3343e-77cf-45e2-b853-823296a0010a/236b9e7c-8635-4a95-9786-c8c68cba3302/FullLogo_Transparent_NoBuffer.png",
                        "celopg.priorWorkExamples": "Here are examples of previous work that demonstrate our capabilities:cDrex: A comprehensive documentation outlining our stablecoin framework designed to integrate with Brazil's CBDC, DREX. This whitepaper highlights our strategic approach, technical processes, and the compliance measures adhered to during the development.Whitepaper: https://docs.google.com/document/d/12LAtEfqcCmd1X5kK3Vn_sVnzZ5hG5S5udE12aEJS9-w/PoC:https://docs.google.com/document/d/14n-4mmunKAFJMMaFr5C5JyWXWbGiLfA9le_Uj412O-A/DREX (Brazilian CBDC) PoC: Successfully developed and tested a Proof of Concept integrating the Brazilian CBDC (DREX) with blockchain technology, showcasing our ability to work with national digital currencies.Repository: https://github.com/bacen/pilotord-kit-onboardingGlobal Integration (BRN MVP): Led the integration of a stablecoin within Near Global, ensuring compliance with financial regulations and enhancing transaction security. This project highlighted our leadership in managing complex blockchain integrations with a focus on regulatory compliance and security."
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:celopg:grantPool:mint_growth:grantApplication:23",
                    "grantPoolId": "daoip-5:celopg:grantPool:mint_growth",
                    "grantPoolName": "mint_growth",
                    "projectsURI": "https://app.charmverse.io/prezenti-grants/earth-9359831342470715",
                    "projectId": "daoip-5:celopg:project:earth",
                    "projectName": "$EARTH",
                    "createdAt": "2024-11-15T00:00:00Z",
                    "contentURI": "https://app.charmverse.io/prezenti-grants/earth-9359831342470715",
                    "description": "$EARTH",
                    "status": "Rejected",
                    "extensions": {
                        "celopg.category": "ReFi",
                        "celopg.poolType": "Growth",
                        "celopg.round": "Mint",
                        "celopg.quarter": "Q4 2024",
                        "celopg.grantManagementTool": "Prezenti",
                        "celopg.contactEmail": "progress@solarpunkdao.earth",
                        "celopg.payeeAddress": "0x4B4A57B59D13F03100fb5FbA8c33248F495fd647",
                        "celopg.teamOverview": "Founder (Utkarsh) of $EARTH has a background in Environmental Science and Economics, with extensive experince of running multiple startups and also a auto component manufacturing unit.Has extensive experience working in the solar, organic farming, EVs and forest conservation sectors.Been in crypto since 2019 and an integral/super active part of the Regenerative Finance ecosystem. https://twitter.com/solarpunkmaxi\n\nTech lead (Vishal) has a past experience of 12 yrs building apps for SASS, Mobile and now focussed on blockchain. Has been a co founder for 2 startups before where he managed tech teams of over 15 individuals. https://www.linkedin.com/in/vishalpatel1401/\n\nOur designer (Rahil) has been doing UI, branding for startups for more than 4 yrs and is fully immersed into the web3 ecosystem now. https://twitter.com/rahilkoshti\n\nOur social media savant (Sayan) is a yogi who is passionate about using the power of social media and copywriting to create a positive impact in this world.\n\nhttps://twitter.com/sayan6250",
                        "celopg.region": "Asia",
                        "celopg.proposalStep": "Outcome",
                        "celopg.originalStatus": "Failed",
                        "celopg.logoURL": "https://cdn.charmverse.io/user-content/b724b3e5-2d89-4165-bdfb-dc9853ea62c1/36923858-e7d6-485c-a583-235fef6972b4/Symbol-color-1024px.png",
                        "celopg.priorWorkExamples": "Conducted a QF round denominated in $EARTH for 42 IMPACT projects - https://x.com/solarpunkdao/status/1783089003282976962$EARTH treasury has funded the following projects so far -Sustainable coffee production (Ethic Hub) - https://x.com/solarpunkdao/status/1775824288190546205Eco Village in Abela by Traditional Dream Factory - https://x.com/solarpunkdao/status/1775419489967853905Solar Energy in Africa with Helios - https://x.com/solarpunkdao/status/1817071166751699394Clean Energy in Mexico - https://x.com/solarpunkdao/status/1780174198465310825Assortment of Clean Energy projects in India - https://x.com/solarpunkdao/status/1818188290450714692 Launched NODES - https://x.com/solarpunkdao/status/1807738094361489754Launched $EARTH on Polygon earlier this year - https://x.com/solarpunkdao/status/1744652708605223324High level overview of $EARTH so far - https://www.solarpunkdao.earth/dashboard"
                    }
                }
            ]
        }
    ]
}