{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar Community Fund",
    "type": "Entity",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf_37",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:1",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:smilepay-global",
                    "projectName": "Smilepay Global",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Smilepay is an app and API that enables users to send (off-ramp) stablecoins (USDC, EURC, PYUSD) from the U.S. and Europe directly into bank accounts and mobile money wallets across Africa.",
                    "fundsApprovedInUSD": 50000.0,
                    "extensions": {
                        "stellar.productsAndServices": "Problem  \nSending money across borders in Sub-Saharan Africa costs an average of 7.9%, compared to the global average of 6.4%, making it the most expensive remittance corridor in the world. To avoid high fees, millions are turning to stablecoins like USDC. However, converting these digital assets into local currencies remains costly, opaque, and largely informal, creating risks and inefficiencies. In many African countries, including Ethiopia, there is no formal way to off-ramp stablecoins into bank accounts and mobile money networks. Users must rely on black-market channels that are expensive, slow, and prone to fraud - further discouraging adoption and trust.  \n\nSolution  \nSmilepay is an app and API that enables users to send (off-ramp) stablecoins (USDC, EURC, PYUSD) from the U.S. and Europe directly into bank accounts and mobile money wallets across Africa. We integrate with regulated local banks and mobile money networks in Africa - and soon in Latin America and Asia, to provide seamless, low-cost, and fully compliant stablecoin off-ramps, making cross-border payments as easy and affordable as sending a WhatsApp message.  \n\nProduct 1 (App):  \nExample, a user can send $100 worth of PYUSD (PayPal’s stablecoin) from Venmo to the Smilepay app. From there, the user has two options: they can either instantly transfer that PYUSD peer-to-peer to another Smilepay user in Ethiopia who will receive the stablecoin directly in their wallet or they can send it to any of the 29 banks we’ve integrated in Ethiopia. In the latter case, the recipient will receive the equivalent amount in Ethiopian birr (ETB), directly deposited into their bank account.  \n\nOur partner bank receives the PYUSD and can convert it into fiat currency at their discretion. This flow is straightforward to implement, as our partner banks are motivated to earn foreign exchange. Integrating PYUSD is seamless due to its upcoming support on the Stellar network (check link below 👇🏻), which Smilepay is also built on. This model is simple and straightforward to expand and will soon be extended to other African and Asian countries.  \n\nhttps://stellar.org/press/paypal-pyusd  \n\nProduct 2 (API):  \nOur API allows any regulated financial app, whether fintech, mobile banking, or crypto wallet - to offer cross border payments to Africa, Asia, and Latin America using stablecoins.  \n\nOur API customers fall into two categories:\n\na. Web3 native platforms (e.g., Venmo, Cash App, crypto wallets): If a Web3-native platform like Venmo integrates our API, users won’t need to download the Smilepay app. They can directly send PYUSD to any of the 29 integrated banks in Ethiopia and eventually to banks across all supported countries in Africa, Asia, and Latin America. And with just one integration with Venmo, we can serve more than +90 million people.  \n\nb. Web2 fiat based platforms (e.g., Bank of America, Zelle, ING): Our API isn’t limited to crypto-native apps. Traditional fiat-based banking apps can also integrate Smilepay API to offer international transfers through stablecoins without needing to become Web3-native themselves or disrupting the user experience. There are two key flows:  \n\n• Fiat-to-fiat: A user sends local fiat (e.g., USD or EUR) from their bank app to a recipient in Africa or Asia. Behind the scenes, Smilepay API converts it into stablecoins (e.g., USDC or PYUSD), routes it efficiently through blockchain rails, and then off-ramps it into fiat in the recipient’s country, dramatically lowering costs and settlement times.  \n\n• Fiat-to-stablecoin: Alternatively, the sender can choose to have the recipient receive the funds directly in stablecoins like USDC, EURC, or PYUSD, giving them access to dollarized savings and on-chain financial tools.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1cBk2POsUOW3zqBzoKWYg-9Fe7QGffxCe5lYcX6cKrOA/edit?usp=sharing",
                        "stellar.successCriteria": "##### 1. USDC On-Ramping\n\n##### Success Criteria:\n\n-   Users successfully deposit USDC into their Smilepay wallets.\n    \n-   Transactions are confirmed on Stellar and reflected in the app.\n    \n-   No critical errors in deposit flow.\n    \n\n#####   \n2. USDC Off-Ramping to 29 Banks (Pilot Group)\n\n##### Success Criteria:\n\n-   Test users complete USDC-to-fiat transactions into local banks.\n    \n-   Transfers settle successfully within expected time.\n    \n\n##### 3. Utility Payment API Integration\n\n##### Success Criteria:\n\n-   Utility (e.g., electricity, water, or airtime) live and functional.\n    \n-   Successful user payments processed.\n    \n-   Receipts confirmed and visible in user/app history.\n    \n\n#####   \n4. Stablecoin Admin Dashboard Update\n\n##### Success Criteria:\n\n-   Admin dashboard shows real-time stablecoin flows.\n    \n-   Transactions are searchable and exportable.\n    \n\n#####   \n5. KYC/AML for Ethiopia\n\n##### Success Criteria:\n\n-   All Ethiopian users complete identity verification.\n    \n-   System meets local compliance standards.\n    \n-   KYC status visible to admins.\n    \n\n#####   \n6. Official Launch of Off-Ramping in Ethiopia\n\n##### Success Criteria:\n\n-   Off-ramp feature open to all verified users.\n    \n-   Transactions processed in first month.\n    \n-   System runs smoothly with no major bugs.",
                        "stellar.goToMarketPlan": "1. Leverage Stellar Ambassadors in Ethiopia for User Acquisition  \nWe plan to collaborate closely with Stellar’s existing ambassador network in Ethiopia. These ambassadors are already engaged in blockchain education and advocacy, and can play a key role in driving adoption of our stablecoin off-ramp solution. By onboarding them as local champions of Smilepay, we’ll tap into their trust networks to accelerate user sign-ups and provide direct product onboarding support, especially for freelancers, crypto users, and tech-savvy youth in Addis Ababa and other major cities.  \n\n2. Community Engagement Through Local Blockchain Events  \nWe’ll organize and co-sponsor meetups, workshops, and panel discussions with Ethiopia’s growing blockchain community. These events will demonstrate how Smilepay bridges global stablecoins and local fiat, giving attendees hands-on experience with the app. We’ll also host hackathons to invite developers to build with Smilepay and Stellar, deepening local ecosystem engagement and attracting integration partners.  \n\n3. Strategic Social Media Marketing & Influencer Outreach  \nOur campaign will focus on visibility through respected tech personalities in Ethiopia and the diaspora. We’ll engage Ethiopian tech influencers, fintech founders, and African crypto thought leaders to post about Smilepay—highlighting our real-time bank transfers and stablecoin use cases. This will give Smilepay credibility and boost user interest organically.  \n\n4. Cross-Marketing With Partner Bank  \nWe’ll run joint campaigns with our partner bank, including shared social media announcements, radio ads, and educational posts about how Smilepay helps attract forex through stablecoins. Since the bank benefits directly from these flows, they are incentivized to promote us across their channels, branches, and user base. This partnership gives Smilepay immediate institutional legitimacy and reach within Ethiopia’s regulated financial system.",
                        "stellar.tractionEvidence": "1.  We have integrated with 29 Ethiopian Banks\n    \n1.  We launched five weeks ago and are currently live on both Android and iOS in the U.S., Canada, South Africa, UAE, and Ethiopia. Users in these countries with a USD debit or credit card can send money directly to any of the 29 Ethiopian banks we’ve integrated. So far, we’ve processed over $9,600 in transaction volume while focusing on fixing bugs, improving the user experience, and optimizing onboarding. This initial traction has been achieved with zero paid marketing—driven purely by word of mouth and a few organic social media posts.\n    \n1.  Every new user is automatically issued a Stellar blockchain wallet on the backend—laying the foundation for our upcoming stablecoin off-ramping feature. Soon, users in the U.S. and Ethiopia will be able to off-ramp stablecoins like USDC and PYUSD directly into local bank accounts. Currently, as you can see on the explorer link below, the accounts created on-chain are issued our own branded stablecoin, but we are transitioning to USDC to ensure broader compatibility, trust, and liquidity.  \n    https://stellar.expert/explorer/public/asset/STUSD-GBGOD4GCZ4DZY5UQD26LU2OGANHPTYTVO4XSEAP5ITNI6FUMSAG3QTB7-2\n    \n1.  We’ve already completed a successful 2-month stablecoin off-ramp pilot with one of our Ethiopian partner banks, which demonstrated strong institutional demand. Banks are excited to participate because stablecoin and remittance flows often bypass their systems. Smilepay gives them a direct channel to capture these foreign exchange inflows—critical in high-forex-demand markets.\n    \n1.  Our main goal for SCF 37 is to expand this stablecoin off-ramping capability beyond the pilot to all 29 banks we’ve integrated with in Ethiopia.\n    \n\nExperience the app: Download the app from Android or iOS from the link below and sign up using your phone number to register. Fill in the basic information and activate your account. To experience the speed and simplicity of the app, you can send $5 to a charity like Birara Genet Charitable Organization by selecting Commercial Bank of Ethiopia, entering account number 1000434925766, and confirming your payment. Visit their website to learn more: https://www.biraragenet.org/. Or, if you prefer, you can buy me a coffee using the same bank; my account number is 1000404738977, under the name Muluken Mengesha Bekele.  \n\nAndroid: Click  \niOS: Click  \n\nFor users outside supported countries (USA, Canada, UAE, Ethiopia, South Africa), use the credentials below to explore the app, however this account can not perform a transaction:  \n\nTEST ACCOUNT 1:\n\n- Phone Number (USA): +12025550000\n\n- Static OTP: 361831\n\n- Security PIN: 111111\n\n  \nTEST ACCOUNT 2:\n\n- Phone Number (USA): +15005550001  \n\n- Static OTP: 361831\n\n- Security PIN: 222222",
                        "stellar.tranche1Deliverables": "1. Implement Stablecoin (USDC) On-Ramping\n\n-   Description: Enable users to on-ramp USDC via external wallets\n    \n-   Measurement: Users successfully deposit USDC into their custodial Smilepay wallets.\n    \n-   Estimated Completion: August 30, 2025\n    \n-   Budget: $8,333.33  \n    \n\n2. Implement Stablecoin (USDC) Off-Ramping to 29 Banks (Pilot Group)\n\n-   Description: Enable a small group of users to test USDC off-ramping into 29 Ethiopian bank accounts.\n    \n-   Measurement: Successful USDC-to-fiat transactions completed by test users, as well as user-generated posts about the experience on social media.\n    \n-   Estimated Completion: September 30, 2025\n    \n-   Budget: $8,333.33",
                        "stellar.tranche2Testnet": "3. Integrate one Utility Bill Payment API (Electricity or Water or Airtime)\n\n-   Description: Enable users to pay for local utilities using off-ramped fiat or stablecoins via Smilepay.\n    \n-   Measurement: At least one utility (e.g., Ethiopian Electric Utility or airtime) live in production.\n    \n-   Estimated Completion: October 31, 2025\n    \n-   Budget: $8,333.33  \n    \n\n4. Update Stablecoin Admin Dashboard\n\n-   Description: Build and deploy a UI/UX and backend update to the dashboard.\n    \n-   Measurement: Stablecoin data and flows visible and functional in the admin dashboard.\n    \n-   Estimated Completion: November 15, 2025\n    \n-   Budget: $8,333.33",
                        "stellar.tranche3Mainnet": "5. Implement KYC/AML for Ethiopia\n\n-   Description: Build and integrate a local KYC/AML system tailored to Ethiopian regulations for identity verification.\n    \n-   Measurement: Successful KYC registration and compliance check for users in Ethiopia.\n    \n-   Estimated Completion: Dec 15, 2025\n    \n-   Budget: $8,333.33  \n    \n\n6. Official Launch of Stablecoin Off-Ramping in Ethiopia\n\n-   Description: Move the off-ramp functionality from pilot to full production, open to all users.\n    \n-   Measurement: Stablecoin off-ramping available to any verified user on Smilepay in Ethiopia.\n    \n-   Estimated Completion: Jan 1 - 31, 2026\n    \n-   Budget: $8,333.33",
                        "stellar.teamMembers": "Muluken Bekele, Fikremariam Awoke, Nav",
                        "stellar.urls": {
                            "website": "https://apps.apple.com/us/app/smilepay-send-money/id6744557221",
                            "videoURL": "https://youtube.com/shorts/_VTpC2yi4ts"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/in/mulukenmengesha/",
                            "twitter": "https://x.com/smilepay_global"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 16666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 42405.48,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:2",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:tipper",
                    "projectName": "Tipper",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Tipper is the platform for LaAm content creators who want to monetize their audience & receive USDC on Stellar",
                    "fundsApprovedInUSD": 70875.0,
                    "extensions": {
                        "stellar.productsAndServices": "Tipper is the best platform for Latin American influencers, artists, and communities who want to monetize their audience, receive support from fans around the world, and automatically convert tips and earnings into Digital Dollars by receiving USDC on Stellar. Creators love to finally be able to receive and withdraw their funds in Dollars anytime, from anywhere—especially those who do not have a U.S. dollar bank account, and even those who do not even have a bank account.\n\nTipper enables content creators to receive small payments from their fans around the world and converts those payments into Digital Dollars (USDC on Stellar); this feature enables content creators to unleash revenue streams, creates new product opportunities, and allows them to be more independent and free.\n\n**After completing and being awarded a validation prize during the kickstarter program, we're have been adding those insights and suggestions into our roadmap: we are ready to hit mainnet fast, and focus on growth and scale.\n\nTipper is composed of three different modules; we'll build the first two for our initial launch\n\n-   Content creator’s hub: This is where creators can share their personal story, their passion and links to their social media and best work. This hub will allow creators to channel their following to read and learn from them,  and share love from their fans, as well as it being the epicenter for them to sell their artwork or subscriptions.\n    \n-   Monetizing network: Once the fan agrees to support their favorite creator’s , they are then moved to the monetizing hub, where fans select in which way they want to pay for the support they are giving. Initially card payments , as well as USDC on Stellar are enabled. In the future this will also have other less common payment methods, as well as other crypto.\n    \n-   Tipper APP: IN A FUTURE SUBMISSION we will build a non-custodial app that receives funds and withdraws to one whitelisted address to begin with, and will improve the app for our future versions, in order to improve the tipper experience. WE’ll do this as a result of our interviews and first interactions with content creators, after delivering our proof-of-concept MVP in order to validate our initial kickstart findings.\n    \n\nThrough seamless integration of all its components, Tipper offers a platform that empowers content creators to monetize their passion and audience in an easy and affordable way, while automatically receiving payments via the Stellar network—helping to drive greater adoption of Stellar, increasing demand and awareness for Stellar as the driving force on the space and a real-world tool of crypto adoption.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1UB06IfbNqtfYWXmpnDVdZ_uEqgX0_OKv/edit?usp=sharing&ouid=110653500898179745003&rtpof=true&sd=true",
                        "stellar.successCriteria": "We will focus our user acquisition for our early adopters on those jurisdictions, as we focus on solving one main problem: Social media content creators in these regions cannot monetize their content in an automatic way.\n\n-   Run our MVP with around 50 test users by launch; grow to 100 testers in first months; surpass 500 registrations before end of 2025, and achieve at least 5000 registered users in H1 2026.\n    \n-   Transact the first 1,000 USDC on Stellar in the first month, then get to 5,000 ARR in Q1 2026\n    \n-   Get to high 3 figures of TX count in 2025, then surpass mid 4 figs in 2026\n    \n-   Grow our social media presence to a community of over 5,000 in H1-2026",
                        "stellar.goToMarketPlan": "#### Our growth strategy for the MVP phase focuses on three key actions:\n\n-   Drive usage among beta testers and design partners.  \n    We aim to generate at least $1000/month in transactions from our initial dozen beta testers and design partners. We’ll refine and improve the product based on their feedback and encourage them to recommend Tipper to their network. Our goal is to grow this a closed group of 50 early adopters in a private community.\n    \n-   Kickstart adoption in three underserved niches.  \n    We’ll target cosplayers, musicians, and donation-driven animal shelters — groups that are now overlooked but rely heavily on small, loyal networks. Growth in these niches will be driven by word of mouth and an invitation-only sign-up process, helping us reach our first 500 users by the end of Q4.\n    \n-   Focus on three underserved regions.  \n    We’ll concentrate on Bolivia, Paraguay, and Venezuela — markets not served today by incumbent companies. Initially, access will remain invitation-only, then expand via access codes. This approach will allow us to build a strong foundation, enabling our goal of reaching at least 5,000 subscriptions by 2026.\n    \n\nTo execute this, we’ll partner with mid-sized social media creators who already have engaged audiences in regions with complex financial systems — starting with Venezuela and Paraguay, and exploring Bolivia, Caribbean islands, and similar markets.\n\nWe are working with the following users as initial design partners:\n\n-   Fax1703 (IG 2540 Follows) \n    \n-   albanycoiman (IG 6042 Follows)\n    \n-   carlospenalozao (IG 42.6k Follows)\n    \n-   CheoChop_Oficial (IG 92k Follows) \n    \n-   ReveronRichie (IG 102k Follows)\n    \n-   @cxrrly (Twitter/X 173.2k Follows)\n    \n-   6 others (Combined following of around 100k, including Ezio Rojas, and more)\n    \n\nWe will focus user acquisition for our early adopters on those jurisdictions, as can solve a big issue they have: Content creators in these regions cannot monetize their content.\n\n#### Offer/Message:\n\n-   For Creators: \"Now you can finally get direct support from your fans. With Tipper you can earn more, and build stronger relationships with your fanbase.\"\n    \n-   For Fans: \"Support your favorite local creators instantly. Small tips, big impact.\"\n    \n\n#### Distribution and specific plan:\n\n﻿Work and fine-tune our product by working closely with our first 50 content creators:\n\n-   Closed invitation only beta product for the first 50 creators leveraging our personal networks (Personal, plus X and Linkedin invitations from founding team); heavy social media marketing actions.\n    \n-   Establish direct relationship with influencers (partner with relevant creators to promote Tipper; offering zero fee for a year, which has no cost to us)\n    \n-   For sign ups after the 50 first creators, we will create FOMO with a waitlist\n    \n-   Organize influencer marketing meetup or/and webinar\n    \n\nThe other component of our launch plan includes working on Fan Acquisition:\n\n-   Social media marketing (target fans of specific creators)\n    \n-   Social media promotions: Meet & greet days\n    \n-   Creator promotion (creators encourage their fans to use Tipper)\n    \n\n#### With this plan we will grow, by organically onboarding our first 50 users, then growing to 100, then 1000, and then 5000 in the first 3 Qs.",
                        "stellar.tractionEvidence": "In a nutshell, we have:\n\n-   Grown 451% followers on main social media (Instagram) by sharing we will soon be available. IG grew from 100 followers to almost 600 in just one month. [[Visit Tipper's IG]](https://www.instagram.com/tippercreator/?hl=en)\n    \n-   We grew 5,320% visits to our website, after sharing we'll soon be available. Today, our only traffic source is IG. We'll triple once we add more channels.\n    \n-   Through website visits we have a whitelist of +200 possible beta testers, who organically registered to our website.\n    \n-   Group of 20 design partners who use social media for income, and want to increase their performance.\n    \n-   Combined reach of 550,000 followers from our first dozen beta testers/design partners.\n    \n\nSince we began validating the idea and interviewed content creators as design partners, we secured a loyal group of two dozen launch partners who have more than 500,000 followers in aggregate.\n\nYou can see a detailed report of our grown on this three slide doc:\n\nhttps://docs.google.com/presentation/d/1fCGUg0Vq4ROs2KciVq0L4Ev_Nrh3XPZlwtMtN00epro/edit?usp=sharing\n\nA key insight we want to share is that every one of the initial group of influencers has invited someone else on their network as a Tipper user for our closed beta; this happens because Tipper solves a real pain point they are frustrated with: LatAm influencers are currently limited on how to monetize their audience.\n\nWe initially set to speak to only ten influencers and through their own interest, we crossed over 24 interviews.\n\nIn our closed-door demo, during bitcoin pizza day in Venezuela, 100% of surveyed attendees liked the concept, 93% of them signed up to join  the waitlist, and almost ½ of them requested more features, such as shared revenue from promoted sales, and adding specific tipping amounts for crowdfunding, which are As a result of this, we conclude our product concept has strong market demand.\n\nEven though we have not gone live with our platform, the demand we are seeing on social media, leads us to expect hundreds of new accounts signups per month during all of launch in Q4 2025, as our posts get dozens of comments of people wanting to try it out.",
                        "stellar.tranche1Deliverables": "Brief description: Build the base and working functionalities for the Content creator’s hub. This hub will allow creators to channel their following to read and learn from them,  and share love from their fans, as well as it being the epicenter for them to sell their artwork or subscriptions.\n\nHow to measure completion: Creator’s page is working and they are able to create, edit and share their profiles, so their followers can learn more about them and their passions \n\n#### Budget:\n\n-   Component 1:  Core System (Backend)\n    \n    Description: Authentication, profile creation, tip system, public/private feed\n    \n    Estimated hours: 110 ; Cost: 13750\n    \n-   Component 2: Core System (Web frontend)\n    \n    Description: Authentication, profile creation, tip system, public/private feed\n    \n    Estimated hours: 90 ; Cost: 11,250\n    \n    Estimated date of completion: 1 month after beginning.",
                        "stellar.tranche2Testnet": "Tranche 2 - Testnet: *\n\nBrief description: Monetizing network build; this is the component where fans select in which way they want to pay for the support they are giving. We will Initially card payments , as well as USDC on Stellar. In the future this will also have other local, common payment methods, as well as other crypto.\n\nHow to measure completion: Monetizing page is working, and fans are able to select an amount they want to tip and pay. As well as sharing a message with the tip\n\n#### Budget:\n\n-   Component 3: Credit Card Cash-In Integration\n    \n    Description: Integration with Card cash in rails and integration for receiving card payments (Using legal set up company of sister company)\n    \n    Estimated hours: 30 ; Cost: 3,750 USD\n    \n-   Component 4: Bank transfer cash-in (Mexico, Colombia and Argentina)  \n    Description: Integrate into secondary anchor or another gateway (Alfred Pay and more)\n    \n    Estimated hours: 55 ; Cost: 6,875 USD\n    \n-   Component 5: USDC cash-in\n    \n    Description:Integrate USDC on Stellar as cash in payments\n    \n    Estimated hours: 35 ; Cost: 4,375 USD\n    \n-   Component 6: Cash-Out Integration with Stellar Horizon\n    \n    Description: Wallet setup, withdrawals, balance check, transaction signing and submission\n    \n    Estimated hours: 45 ; Cost: 5,625 USD\n    \n    Estimated date of completion: 4 weeks after tranche 1.",
                        "stellar.tranche3Mainnet": "Tranche 3 - Mainnet: *\n\nTipper Go-Live\n\nDescription: The platform is live, operating with the first group of beta testers openly.\n\nHow to measure completion: The page is working properly and anyone with an invitation is able to create a profile, and we are operationally active, with a complete KYC system and all parts functioning correctly.\n\n#### Budget:\n\n-   Component 7: KYC system set up\n    \n    Description: Integrate manual KYC system on influencer side based on global standards (Manage first 1000 subs)\n    \n    Estimated hours: 50 ; Cost: 6,250 USD\n    \n-   Component 8: Legal review and documentation\n    \n    Description: Obtain legal opinion; prepare Terms & conditions; and get tailored privacy policy done for the cash in needs\n    \n    Cost: 9,000 USD in legal fees, as per quotation\n    \n-   Component 9: Admin Dashboard for Influencers\n    \n    Description:  Stats dashboard, tip history, withdrawal options via Stellar\n    \n    Estimated hours: 40 ; Cost: 5,000 USD\n    \n-   Component 10: QA, user testing, and deployment support\n    \n    Description:  Functional testing, bug fixing, deployment assistance\n    \n    Estimated hours: 40 ; Cost: 5,000 USD\n    \n    Estimated date of completion: 6 weeks after tranche 1.",
                        "stellar.teamMembers": "Ernesto Contreras , Ruben Padilla, Ezio Rojas",
                        "stellar.urls": {
                            "website": "https://tipper.lat/",
                            "codeRepository": "https://docs.google.com/document/d/1UB06IfbNqtfYWXmpnDVdZ_uEqgX0_OKv/edit?usp=sharing&ouid=110653500898179745003&rtpof=true&sd=true",
                            "videoURL": "https://www.youtube.com/watch?v=F67H3Y3avss&feature=youtu.be"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/tippercreator/",
                            "twitter": "https://x.com/tippercreator"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 47250.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 120737.77,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:3",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:domipago",
                    "projectName": "DomiPago",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Send money to the Dominican Republic through a simple WhatsApp chat—powered by Stellar USDC, with zero crypto experience needed.",
                    "fundsApprovedInUSD": 110000.0,
                    "extensions": {
                        "stellar.productsAndServices": "DomiPago turns a simple WhatsApp chat or web session into a full‑featured remittance hub.\n\n#### What senders can do\n\n-   Quote & lock FX instantly – type “Rate” in WhatsApp or click “Check rate” on the web/app to see a live Stellar‑USDC quote in <1 s.\n    \n-   Fund in one tap – approve a bank, card, or SEPA/Interac pull; we mint USDC on Stellar and move it across‑border in seconds.\n    \n-   Smart address book – save beneficiaries and pre‑set amounts (“Send 100 USD to mamá” auto‑fills the flow).\n    \n-   Real‑time receipts & history – every on‑chain transaction ID and status update appears in chat and in the app’s timeline.\n    \n-   Conversational support – the same chat thread handles FAQs, rate alerts, and payment confirmations—no new app to learn.\n    \n\n#### What receivers can do\n\n-   Request funds with context – choose “Groceries”, “School fees”, etc.; a payment link is pushed to the sender’s chat in seconds.\n    \n-   Choose how to get paid – bank deposit, wallet top‑up, or soon QR cash‑out—all selected inside WhatsApp or the web portal.\n    \n-   Instant in‑chat notifications – “Funds delivered” messages arrive the moment Stellar USDC is off‑ramped.\n    \n-   Personal ledger – view incoming amounts, purposes, and senders in a clean, mobile‑first history.\n    \n\n#### What makes DomiPago different\n\n1.  Chat‑first UX – no separate app download is required; the entire flow lives in a WhatsApp conversation most users already trust and use daily.\n    \n1.  Stellar‑native settlement – every transfer rides USDC on Stellar, delivering sub‑second speeds and near‑zero fees that traditional rails can’t match.\n    \n1.  Two‑way dynamic – receivers aren’t passive; they trigger requests, set purposes, and steer payout preferences, turning remittances into a dialogue.\n    \n1.  Multi‑surface access – identical functionality is mirrored in a responsive web/app for users who prefer a traditional interface.\n    \n1.  Consumer‑grade simplicity, crypto‑grade transparency – senders and receivers experience a 60‑second flow, while every hop is verifiable on‑chain.\n    \n\nDomiPago hides the complexity behind crypto, wraps it in everyday chat, and delivers value where it’s felt immediately: family support that arrives faster, cheaper, and with zero guesswork.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1nNtzQGWsxsQoD7sEkv_ftOBXfF1uD8X_/edit",
                        "stellar.successCriteria": "Success for DomiPago is measurable in three data‑driven dimensions—adoption, usage, and ecosystem impact—within 12 months of mainnet launch:\n\n1.  Adoption   \n    • ≥ 15 000 total users onboarded, of which 40 % are monthly actives (≥ 6 000 MAU).  \n    • At least 5 banking partners in the DR embed the “Request via DomiPago” flow, giving us sustained receiver acquisition at <$5 paid CAC.\n    \n1.  Usage   \n    • Cumulative remittance volume ≥ USD 1.5 million, processed across ≥ 6 000 transfers.  \n    • Average active user sends ≥ 3 transfers per month; month‑over‑month retention ≥ 50 %.  \n    • Average door‑to‑door settlement time ≤ 40 seconds; average fee savings vs. legacy rails ≥ 50 %.\n    \n1.  Ecosystem impact on Stellar   \n    • ≥ 75 % of total volume settles as USDC on Stellar rails, evidenced by on‑chain transaction hashes.  \n    • 1 000+ Soroban escrow contracts executed in production, securing ≥ USD 250 K.  \n    • Publish open‑source docs and SDK snippets; target ≥ 3 external developers or wallets integrating our escrow status endpoint.\n    \n\nHitting these metrics means tens of thousands of dollars saved in fees for Dominican families, thousands of new users interacting with Stellar for the first time, and a live Soroban use case that demonstrates real‑world programmable money at scale.",
                        "stellar.goToMarketPlan": "1. Anchor the receiver side through Dominican banks (Month 0).  \nWe are finalizing integrations with two Tier‑1 banks that collectively hold >60 % of retail deposit accounts. Each bank will add a “Solicitar dinero con DomiPago” button inside its mobile app and WhatsApp broadcast lists. When a customer taps it, our bot pre‑fills a payment request linked to the user’s IBAN—no app download, no new KYC. The bank wins higher deposit inflow and an innovation headline; we instantly gain thousands of verified receivers with near‑zero CAC.\n\n2. Pull in senders with co‑branded corridors (Months 0-3).  \nOnce requests are flowing, we flip on diaspora‑side acquisition through:\n\n-   Visa “Back‑to‑School” and “Navidad” co‑promos (landing pages + interchange rebates) targeting U.S./CA cardholders who already send money home.\n    \n-   Diaspora NGOs & hometown associations that can share referral codes in group chats; each first remittance earns the receiver a fee waiver and the NGO a small donation paid out of spread.\n    \n-   Influencer live demos on TikTok/Instagram showing “Watch me send $50 in 40 seconds.”\n    \n\n3. Reinforce virality with product‑led loops (Months 3‑6).  \nEvery successful payout pushes a “Share your link” nudge to both sides. Because the entire flow lives in WhatsApp, a single tap forwards that request into family group chats, multiplying exposure at marginal cost ≈ $0.\n\n4. Expand corridors once liquidity flywheel spins (Months 3‑12).  \nWith DR receivers activated and U.S. volume ramping, we replicate the same playbook for EU SEPA and Canada Interac senders, using local bank newsletters and ethnic‑media radio to seed the first wave.",
                        "stellar.tractionEvidence": "Since launch, DomiPago has proven that WhatsApp-based remittances are not just possible—they’re preferred. By removing the need for apps or crypto knowledge, we’ve built a product that fits seamlessly into users’ daily lives while delivering real-time financial value. Our traction reflects not just early adoption, but strong signals of product-market fit, retention, and readiness to scale with Stellar rails.\n\n-   $676 K in remittance volume moved to date—all generated organically, with zero paid advertising.\n    \n-   +3 000 users onboarded, with  25 % monthly actives—driven primarily by WhatsApp referrals and diaspora community word‑of‑mouth.\n    \n-   High engagement: each active sender completes 3.7 transfers on average, at an $233 average ticket, covering both micro‑ and mid‑sized remittances.\n    \n-   Retention that signals stickiness: 50 % month‑over‑month retention—half of first‑time senders return the very next month, outperforming most retail‑remittance benchmarks.\n    \n-   Operational proof‑points: end‑to‑end settlement ≤ 40 s; customer‑support median response < 5 min through the same chat thread.\n    \n-   Market validation: recently launched joint campaigns with Visa and multiple Dominican banks, promoting DomiPago inside their user bases to request funds via our WhatsApp flow—setting the stage for a substantial growth surge over the coming quarters.",
                        "stellar.tranche1Deliverables": "Deliverable 1 – EU SEPA on‑ramp via Bridge  \nExtend our existing Bridge integration so euro deposits (SEPA) mint USDC on Stellar and appear in WhatsApp. Completion = 20 end‑to‑end SEPA transfers in staging; internal QA is bundled into development hours. Budget $18 000 (backend + chat integration hours).\n\nDeliverable 2 – Canada Interac on‑ramp via Borderless  \nWire Borderless Payments into the same flow for CAD deposits. Completion = 20 CAD → USDC transfers in staging. Budget $18 000 (API integration, compliance coding, chat hooks).\n\nDeliverable 3 – Multi‑corridor FX & quote engine  \nUnify FX look‑ups; guarantee sub‑second quotes for US/EU/CA corridors. Completion = latency under 1 s in load test. Budget $2 000 (backend optimisations).",
                        "stellar.tranche2Testnet": "Deliverable 4 – Soroban escrow contract (testnet)  \nBuild the contract that locks USDC until the receiver accepts in chat (24 h auto‑release). Completion = contract live on testnet; 50 escrow cycles succeed. Budget $16 000 (contract coding + unit tests). External audit is covered by LaunchKit credits; no SCF funds used.\n\nDeliverable 5 – Chat‑embedded escrow UX  \nAdd “Send with escrow / Accept funds” buttons; wire to testnet contract. Completion = 25 users complete full flow. Budget $6 000 (bot front‑end work).\n\nDeliverable 6 – Monitoring & oracle service  \nDeploy indexer that listens to Horizon & Soroban events and fires webhooks. Completion = 99.5 % uptime over 30 days. Budget $4 000 (backend hours; infra covered by LaunchKit).\n\nDeliverable 7 – Hybrid‑custody prototype (SEP‑10)  \nImplement WebAuth + SEP‑10 for optional key export. Completion = 25 testnet accounts migrated. Budget $10 000 (backend & front‑end hours).",
                        "stellar.tranche3Mainnet": "Deliverable 8 – Harden & deploy Soroban escrow on mainnet  \nRefactor contract based on testnet findings, run external audit (LaunchKit credit), and migrate to mainnet. Completion = audit report shows no critical issues; contract deployed. Budget $14 000 (developer remediation, deployment scripting, gas costs).\n\nDeliverable 9 – Production rollout & migration  \nMake escrow the default settlement path in WhatsApp. Completion = first 100 mainnet escrows and $250 K secured volume within 60 days. Budget $14 000 (chat‑flow refactor, migration scripts, load tuning).\n\nDeliverable 10 – Post‑launch monitoring & developer docs  \nScale metrics to 1 000 concurrent escrows and publish open‑source docs so third‑party wallets can query escrow status. Completion = load test passes and docs merged to GitHub. Budget $8 000 (backend hardening + documentation hours).",
                        "stellar.teamMembers": "Omar",
                        "stellar.urls": {
                            "website": "https://domipago.com/",
                            "codeRepository": "https://github.com/melomar10/stellar_integration",
                            "videoURL": "https://www.youtube.com/shorts/Cge3vBITA6M"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 36666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 91988.28,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:4",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:lumenshade-privacy-pools",
                    "projectName": "LumenShade: privacy pools",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "LumenShade gives Stellar users a powerful new option for financial privacy, paving the way for fully compliant private DeFi on Stellar.",
                    "fundsApprovedInUSD": 135000.0,
                    "extensions": {
                        "stellar.productsAndServices": "At LumenShade, we're bringing financial discretion to Stellar.\n\nWe were inspired by projects like Tornado Cash, 0xbow’s Privacy Pools and Railgun.\n\nOur mission is simple: empower users with financial privacy, while building the foundation for fully compliant, private DeFi on Stellar.\n\nMotivation\n\nStellar is an incredible platform for fast, low-cost global payments, especially across emerging markets.\n\nBut today’s users don’t have strong privacy options.\n\nWe believe that privacy is a necessity, not a luxury, and it’s time for Stellar to start offering real options.\n\nRight now, payments on Stellar are fully public.\n\nWe strongly believe that mainstream blockchain adoption will come when privacy is integrated by default.\n\nThink about NGOs working in sensitive regions, businesses wanting to protect their payment flows, or just regular individuals who simply don’t want their entire transaction history displayed to the world…\n\nLumenShade can help make this possible.\n\nOur modular components will be reusable for other projects in the ecosystem, fueling further innovation in privacy across the Stellar developer community.\n\nDescription\n\nIn simple terms, LumenShade lets users deposit Stellar assets (like XLM and USDC) into a shared pool, and withdraw them later without anyone being able to trace the link between the deposit and the withdrawal.\n\nHere's how it works:\n\n-   When a user deposits funds into the pool, he receives a unique note (a secret) that proves ownership of that deposit\n    \n-   Later, when the user wants to withdraw, he generates a zero-knowledge proof showing they own one of the previous deposits, by proving knowledge of the previous “note”\n    \n-   The smart contract verifies the proof and, if correct, releases the funds to a specified address. There’s now no way to link that withdrawal with any deposit\n    \n-   The more deposits, the bigger the anonymity set, the more private each user is\n    \n\nHere are some of the key features we're excited to deliver:\n\n-   Privacy-preserving deposits and withdrawals, thanks to zero-knowledge proofs\n    \n-   Intuitive frontend and CLI tools, for a seamless user experience\n    \n-   An innovative compliance layer featuring:\n    \n    -   selective disclosure: users can prove the origin of funds when needed\n        \n    -   admin control on deposits: blacklisting if required\n        \n-   Modular, reusable smart contracts and circuits, enabling future ZK projects on Stellar\n    \n\nWe also take inspiration from Railgun, which has set a high bar for compliant privacy pools with features like “private proof of innocence”. LumenShade is built to move Stellar in that same direction.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1cVhnmMx6q_nvB-kN6veLVP9DS-sDI19ehNMtaTL7aVw",
                        "stellar.successCriteria": "-   Technical Success:\n    \n    -   Fully working privacy pool on mainnet\n        \n    -   Circuits audited and proven sound\n        \n-   User Adoption:\n    \n    -   1000+ real users\n        \n    -   Integration into 1+ Stellar wallet\n        \n-   Community & Compliance:\n    \n    -   Feedback from Stellar community integrated into v1.0\n        \n    -   Demonstrate compliance aligned with MiCA: allow users to prove origin of funds",
                        "stellar.goToMarketPlan": "'-   Partner with Stellar wallet providers to integrate LumenShade\n    \n-   Highlight real-world use cases (NGOs, private remittances, institutional privacy)\n    \n-   Educate with blog posts, zk explainers, and workshop sessions\n    \n-   Run an engaging testnet campaigns: encourage participation and provide hands-on experience with LumenShade\n    \n-   Work with regulatory experts to refine compliance\n    \n-   No fees at launch. A small protocol fee may be added later to sustain operations",
                        "stellar.tractionEvidence": "Our team has a strong track record in zero-knowledge, smart contracts, and full-stack development:\n\n-   David (teddav): ZK auditor, working on real-world zero-knowledge use cases. Previously built a stablecoin protocol on Ethereum (peaked at $200M TVL)\n    \n    -   https://x.com/0xteddav\n        \n    -   https://github.com/teddav/\n        \n    -   https://teddav.github.io/\n        \n-   Oba: Cryptography & ZK expert. Currently building Kakarot, a zkEVM written in Cairo\n    \n    -   https://x.com/obatirou\n        \n    -   https://github.com/obatirou\n        \n    -   https://obatirou.xyz/\n        \n-   Alex: Full stack developer specialized in web and mobile apps\n    \n    -   https://github.com/Amanukyan/\n        \n\nWe've already started early discussions with Stellar wallet providers to ensure a smooth integration and provide an excellent user experience.",
                        "stellar.tranche1Deliverables": "Estimated time: 2 months\n\nEstimated Budget: $60,000\n\n-   Implement ZK circuits: ideally in Circom, but we’ll also explore Noir for a more future-proof project\n    \n-   Integrate Circom (or UltraHonk) verifier in Soroban\n    \n-   Soroban contracts\n    \n-   Frontend interface (proof generation, UI for deposits/withdrawals)\n    \n-   Conduct rigorous internal testing to ensure stability and security.\n    \n-   Initial compliance feature: opt-in transaction disclosure to third parties\n    \n\nHow to verify completion?\n\n-   Public repo with zk circuits, Soroban contracts\n    \n-   Working PoC on devnet:\n    \n    -   deployable Soroban contracts\n        \n    -   ability to send money to the pool and withdraw anonymously\n        \n-   Demo video and frontend walkthrough",
                        "stellar.tranche2Testnet": "Estimated time: 2 months\n\nEstimated Budget: $50,000\n\n-   Enhanced compliance tooling:\n    \n    -   Admin filtering logic (address blacklist)\n        \n    -   Interfaces for compliance disclosure requests\n        \n    -   Community discussion around decentralized admin structure\n        \n-   Deploy fully functional MVP to testnet\n    \n-   UI/UX polish\n    \n-   Start Stellar wallet integration(s)\n    \n-   Developer-oriented documentation (Soroban integration examples)\n    \n-   Release testing tools to facilitate user interaction with testnet (ex: faucet)\n    \n-   Enhance test suite: fuzzing and edge-case testing\n    \n\nHow to verify completion?\n\n-   Public testnet with working UI\n    \n-   Documentation and codebase published\n    \n-   Confirmation of testnet usage: at least 10000 testnet deposits",
                        "stellar.tranche3Mainnet": "Estimated time: 1 month\n\nEstimated Budget: $25,000\n\n-   Launch on Stellar mainnet with public frontend\n    \n-   Documentation\n    \n-   Finalize compliance layer features and logic: admin dashboard for managing deposits’ blacklist\n    \n-   Compliance guide\n    \n-   UI polish:\n    \n    -   Hire a designer for branding and UI/UX improvements\n        \n    -   Design clean and user-friendly interface\n        \n-   Audit (provided by Stellar):\n    \n    -   Prepare for audit of contracts and circuits\n        \n    -   Fix all findings\n        \n-   Organize trusted setup ceremony (for Circom circuits)\n    \n\nHow to verify completion?\n\n-   Public launch with open-source code and docs\n    \n-   Successful trusted setup ceremony\n    \n-   Live deployment on Mainnet",
                        "stellar.teamMembers": "David",
                        "stellar.urls": {
                            "videoURL": "https://youtu.be/hwoRhxYUd8U"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/0xteddav"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 45000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 112894.7,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:5",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:dockingzone",
                    "projectName": "docking.zone",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Test Transaction",
                    "description": "docking.zone is a dynamic NFT platform enabling creators to mint, upgrade, and trade NFTs that evolve with user activity.",
                    "fundsApprovedInUSD": 75000.0,
                    "extensions": {
                        "stellar.productsAndServices": "What is docking.zone? A Dynamic NFT Creator Hub on Stellar\n\ndocking.zone is a dynamic NFT creator hub designed to unlock new cultural and technical experiences on Stellar. It is built around three core zones:\n\nLaunching Zone\n\n-   Mint NFTs using no-code, drag-and-drop tools\n    \n-   Launch chain-specific storefronts for different collections\n    \n-   Example: Zone Sentinels NFTs\n    \n\nUpgrading Zone\n\n-   Enhance NFTs with on-chain upgrades tied to user actions\n    \n-   Supports gamified progression, POAP-style rewards, and trait evolution\n    \n-   Example: Gaming achievements, event participation, metaverse wearables\n    \n\nTrading Zone\n\n-   Trade full NFTs or individual traits (e.g., skins, badges, upgrades)\n    \n-   Built for Stellar’s low fees and fast transaction finality\n    \n-   Example: Buy/sell a Plasma Blade or a Governance Voter badge",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1R51NH-rcWfHtoGZN96NDHcdSIVdXxP9KuBhzt0iFs28/edit?usp=sharing",
                        "stellar.successCriteria": "Output : 10K users, 50K NFTs minted, 100K dynamic upgrades.  \nImpact : Position Stellar as the go-to chain for dynamic NFT innovation, driving long-term ecosystem growth.",
                        "stellar.goToMarketPlan": "Go-To-Market Strategy – Without Budget\n\n1. Launch with Zone Sentinels NFT\n\n-   Dynamic Upgrades: NFTs evolve as users engage with Stellar (e.g., trading, event attendance).\n    \n-   Example: Attend a Stellar event → claim a POAP NFT → upgrade it over time with traits like “Governance Voter” or “Top Trader.”\n    \n\n2. Gaming Integration (Example)\n\n-   Survival Game Demo:\n    \n    -   Start with a base character NFT (e.g., “Stellar Drifter”)\n        \n    -   Find in-game items (armor, weapons) → upgrade your NFT on-chain\n        \n    -   Trade items/NFTs freely (e.g., sell a “Plasma Blade” to another player)\n        \n-   Zone Sentinel Upgrade: Showcase dynamic NFT mechanics via a Stellar-based game.\n    \n\n3. Strategic Partnerships\n\n-   HOT: Integrate wallet tools for seamless NFT trading\n    \n-   Stellar: Co-host events and workshops to onboard creators\n    \n\n4. Community Building\n\n-   Weekly Twitter Spaces: Discuss dynamic NFT use cases and lore-building\n    \n-   IRL Events: Distribute dynamic POAPs that upgrade over time (e.g., “Stellar Summit Attendee” → “Governance Contributor”)\n    \n\n5. Onboarding Tools\n\n-   Zone Sentinel Robot: Telegram/Discord bot for wallet setup, spam protection, and airdrops\n    \n-   Frictionless UX: Space-themed interface with Stellar’s low fees for instant upgrades/trades\n    \n\n6. Viral Growth Tactics\n\n-   Dynamic Challenges: Upgrade NFTs by trading 10 NFTs → earn rare traits\n    \n-   POAP Scavenger Hunts: Attend 3 events → unlock airdrops or whitelist spots\n    \n\n7. Metrics for Success\n\n-   10K users, $50K+ NFT volume, 50K+ dynamic upgrades in 6 months\n    \n-   3+ Stellar partnerships (e.g., HOT wallet)",
                        "stellar.tractionEvidence": "Team Execution – Proven Track Record on NEAR\n\nOur team has delivered high-impact products and tools within the NEAR ecosystem. Now, we’re applying that experience to Stellar through docking.zone, in collaboration with the Stellar Hub team.\n\nKey Past Projects on NEAR\n\n#### BlackDragonForever NFT\n\n-   500+ holders\n    \n-   5,000 NEAR in trading volume\n    \n-   $120K raised for the DAO\n    \n-   NEAR Foundation CEO uses this NFT as their profile picture\n    \n\n#### ShardDog\n\n-   335,000 unique wallets\n    \n-   700,000 NFTs minted\n    \n-   Seamless, user-friendly onboarding tool for mass NFT distribution\n    \n\n#### Dragon Tech Bot\n\n-   11,000+ unique users\n    \n-   Deployed across 211 Telegram groups\n    \n-   Used by all major NEAR communities for automation and engagement\n    \n\nBringing This Expertise to Stellar\n\nWe’re building docking.zone with the same executional rigor now aligned with Stellar’s ecosystem.",
                        "stellar.tranche1Deliverables": "Tranche 1 – MVP\n\nTotal Budget: $25,000  \nGoal: Launch the foundational platform and onboard beta users\n\nDeliverable 1: docking.zone NFT Creation Tool\n\nBudget Allocation: $18,000\n\nObjective:  \nDevelop a no-code, drag-and-drop platform to mint dynamic NFTs using OpenZeppelin’s Stellar-compatible, upgradeable contracts.\n\n#### Frontend Development – $7,000\n\n-   Design: Space-themed UI/UX inspired by interstellar docking, collectibles, and exploration\n    \n-   Functionality: Intuitive interface for creators to mint NFTs without writing code\n    \n-   Wallet Integration: HOT integration for walletless onboarding (via Zone Sentinels)\n    \n\n#### Backend Development – $11,000\n\n-   Contract Deployment:\n    \n    -   Use nft-enumerable and upgradeable standards from OpenZeppelin's Stellar contracts\n        \n    -   Ensure compatibility with Stellar's smart contract architecture\n        \n-   Dynamic Metadata Engine:\n    \n    -   System to update NFT metadata post-mint (e.g., traits, statuses, levels)\n        \n    -   Storage layer and logic to persist upgrades over time\n        \n\nDeliverable 2: Zone Sentinel Robot\n\nBudget Allocation: $7,000\n\nObjective:  \nBuild a bot to facilitate wallet setup, user onboarding, community engagement, and platform security across Discord and Telegram.\n\n#### Bot Features:\n\n-   Wallet Generation: Instant Stellar wallet creation (no manual setup)\n    \n-   NFT & Token Buy Notifications: Real-time alerts for new NFT mints, trades, or token purchases\n    \n-   Role-Based Access Control: Token-gated channels for verified users\n    \n-   Airdrop Distribution: Automated airdrop claim and verification for events or achievements\n    \n-   Portal Protection: Anti-bot and spam filters to guard entry points to Discord/Telegram\n    \n-   Report Commands: Users can flag bad actors or issues via simple commands\n    \n-   Multi-Tool Integration: Designed for easy plug-and-play with other creator and community tools\n    \n\n#### Deployment Goal:\n\n-   Launch in 50+ Discord/Telegram communities\n    \n-   Support 100+ active beta users on the docking.zone platform",
                        "stellar.tranche2Testnet": "Tranche 2 – Testnet\n-----------------------\n\nTotal Budget: $25,000  \nGoal: Develop and test the dynamic NFT upgrade engine and gaming interaction layer\n\nDeliverable 3: Upgrade Zone + Dynamic NFT Integration\n\nBudget Allocation: $25,000\n\nObjective:  \nEnable users to evolve NFTs on-chain based on actions like event attendance or in-game achievements.\n\n#### Dynamic Logic Development – $12,000\n\n-   Contract logic for tracking NFT progression (e.g., badges, item ownership)\n    \n-   Smart contract hooks to support on-chain upgrades\n    \n-   Zone Sentinel Upgrade Game Demo:\n    \n    -   Base NFT character gains new traits through gameplay (e.g., Plasma Blade, Armor)\n        \n\n#### Testing, Deployment, QA – $8,000\n\n-   Deploy on Stellar testnet\n    \n-   Conduct large-scale simulation with 10K+ dynamic upgrades\n    \n-   Collect performance metrics and user feedback\n    \n\n#### Tooling – $5,000\n\n-   Dynamic NFT SDK for third-party developers/creators\n    \n-   API layer to connect off-chain data (e.g., game actions → trait updates)\n    \n-   Documentation and examples for integration",
                        "stellar.tranche3Mainnet": "Tranche 3 – Mainnet\n\nTotal Budget: $25,000  \nGoal: Launch a full-featured Stellar-native NFT marketplace with trait trading\n\n-   _ _\n    \n\nDeliverable 4: Marketplace Zone\n\nBudget Allocation: $25,000\n\nObjective:  \nEnable users to trade NFTs and their traits (like item skins or POAPs) with full on-chain functionality.\n\n#### Marketplace Contract Development – $10,000\n\n-   Orderbook and listing logic for NFTs and traits\n    \n-   Initial research into future cross-chain capabilities\n    \n-   Trait composability and modular upgrades (e.g., equipping items, trait staking)\n    \n\n#### UI/UX Development – $6,000\n\n-   Visual storefront for creators and collectors\n    \n-   Auction functionality, trait-based filters, walletless buying\n    \n-   Dynamic listing previews (updated as NFT traits change)\n    \n\n#### Infrastructure + Initial Ops – $6,000\n\n-   Cloud infrastructure (RPC endpoints, metadata storage, CDN)\n    \n-   Initial gas fees to subsidize 1,000+ trades\n    \n-   Rate-limiting and protection against spam\n    \n\n#### Security – $3,000\n\n-   Internal code reviews, testing, and security hardening\n    \n-   Bug bounties and integration testing (SCF covers formal audit credits separately)",
                        "stellar.teamMembers": "Ash",
                        "stellar.urls": {
                            "website": "https://docking.zone/",
                            "videoURL": "https://vimeo.com/1096034521/76e7532d28?ts=0&share=copy"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/in/sheranhussain/",
                            "twitter": "https://x.com/TatToTheToo"
                        },
                        "org.stellar.communityfund.awardType": "Build"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:6",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:ben-wallet-a-kale-wallet",
                    "projectName": "Ben Wallet (a KALE wallet)",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Ben is a platform built to support the 🥬 KALE ecosystem on Stellar.",
                    "fundsApprovedInUSD": 77910.0,
                    "extensions": {
                        "stellar.productsAndServices": "The platform consists of several components, which include:\n\n1.  An Android mobile app, named Ben Wallet.\n    \n1.  A WebApp, to provide account information and details view on account transactions and account stats, named MyBen hosted on https://myben.xyz.\n    \n1.  An RPC server that handles blockchain interaction as well as Launchtube interactions, named BEN RPC.\n    \n1.  A monitoring and reporting server to provide timeseries information on the platform's status, as well as consolidated stats, named Ben OpenStats.\n    \n1.  An offload-compute server, for part of the farming cycle, so devices can offload compute-intensive tasks, named Remote Grow.\n    \n1.  A Kotlin SDK for Android mobile apps, to support building Stellar-based apps on mobile devices.\n    \n\nIt is important to highlight that once Protocol 23 is deployed, higher limits will require higher network usage to re-test; the mobile app has the potential to bring additional “test” users (where load comes from real-life interactions).\n\nComplete information on the platform can be found on our live docs: https://ben-wallet.gitbook.io/ben-wallet",
                        "stellar.technicalArchitecture": "https://ben-wallet.gitbook.io/ben-wallet/sdlc/development/architecture/context",
                        "stellar.successCriteria": "'-   At least 15% conversion rate from Web-based farmer to Ben Wallet, after mainnet launch\n    \n-   3% MAU increase after mainnet launch\n    \n-   Branding-wise: Ben wallet becomes a well known player in the ecosystem.\n    \n-   Kotlin SDK adoption and other mobile apps are made by third parties (or by us) with our SDK.\n    \n-   Our Gitbook serves as a guide for other SCF candidates; meaning, they use our docs structure as a template for their submissions (we think we are on the right track structure and information wise). Standardization would go a long way to help reduce burden of SCF reviewers while conducting reviews.",
                        "stellar.goToMarketPlan": "We don't intend to wait until mainnet to start promoting Ben Wallet, as the advantage of sideloading means early users can try out the app (and platform) even while we are on alpha and beta releases.\n\nOur releases will be published on our github as .apk, and an Installation guide will be provided not only on Github but also on our live docs at: https://ben-wallet.gitbook.io/ben-wallet/help/user-guide\n\nOnce we have stabilized at least our mobile application, we would like to promote via socials (mentions on @buildonstellar would be appreciated!) as well as with the team at LumenLoop. We will also reach out to Ambassador groups for amplification, as well as the Stellar Global Discord.",
                        "stellar.tractionEvidence": "We're basing our initial traction on the one brought so far by KALE, and high-usage of the network by its operations.",
                        "stellar.tranche1Deliverables": "Our MVP will focus on the Tractor (harvest) function since it requires the most basic setup for transactions to be made.\n\nThis means the following platform components are 1. implemented, 2.tested and 3. released, to the extent of making transactions using InvokeHostFunctionOp:\n\n1.  Kotlin SDK: XDR Module\n    \n    a.  XdrGen Kotlin Generator if chosen as best path\n        \n1.  Kotin SDK: RPC Module\n    \n1.  Kotlin SDK: Transactions (InvokeHostFunctionOp)\n    \n1.  Ben Wallet: UI 1.0 (Jetpack Compose)\n    \n\nFor complete roadmap, check our live docs: https://ben-wallet.gitbook.io/ben-wallet/roadmap\n\nPlease note we're trying to keep things simple in the submission, there are many additional sub-components, modules and test runners that are needed for the above. Full details will be published on our live docs https://ben-wallet.gitbook.io/",
                        "stellar.tranche2Testnet": "For our \"testnet\" tranche we are focusing on deliverables that handle Passkeys and Launchtube.\n\nThis means the following platform components are 1. implemented, 2.tested and 3. released, to the extent of having fully featured, alternative to console-miners, mobile application:\n\n1.  Kotlin SDK: Passkeys module\n    \n1.  Kotlin SDK: Balances module\n    \n1.  Kotlin SDK: Horizon module (evaluate if needed at this point)\n    \n1.  Kotlin SDK: Launchtube module\n    \n1.  Ben Wallet: Account Management (of C addresses)\n    \n1.  Ben Wallet: UI 2.0 (Jetpack Compose)\n    \n\nPlease note we're trying to keep things simple in the submission, there are many additional sub-components, modules and test runners that are needed for the above. Full details will be published on our live docs https://ben-wallet.gitbook.io/",
                        "stellar.tranche3Mainnet": "For our \"mainnet\" tranche we are focusing on deliverables that handle the KALE farming cycle.\n\nThis means the following platform components are 1. implemented, 2.tested and 3. released, to the extent of having fully functional mobile application, available for sideloading:\n\n1.  KALE ops: Plant (seed)\n    \n1.  KALE ops: Work (grow)\n    \n    a.  Android NDK -> Rust | C++ (evaluate which NDK) for compute-intensive component.\n        \n    a.  Remote Grow POC (precursor to Google Play Store policy compliance)\n        \n1.  Physical and Virtual device tests: Automated & Manuel Firebase TestLab runners.\n    \n\nNote: We're basing our budget estimate of $77,910 on a 3.5 month timeframe, from MVP to Mainnet (all three tranches).\n\nPlease note we're trying to keep things simple in the submission, there are many additional sub-components, modules and test runners that are needed for the above. Full details will be published on our live docs https://ben-wallet.gitbook.io/",
                        "stellar.teamMembers": "Matias Wald",
                        "stellar.urls": {
                            "website": "https://ben-wallet.gitbook.io/",
                            "codeRepository": "https://github.com/Ben-Platform",
                            "videoURL": "https://youtube.com/na"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 25970.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 65152.79,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:7",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:rosen",
                    "projectName": "ROSEN",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "ROSEN enables over 1 billion digital natives in emerging markets to earn and transfer value globally using Stellar-native stablecoins and gasless microtransactions.",
                    "fundsApprovedInUSD": 75000.0,
                    "extensions": {
                        "stellar.productsAndServices": "ROSEN is building the next-generation social earning app, seamlessly connecting a global community through borderless, inclusive social economies. Our core innovation lies in integrating Stellar-native compliant stablecoins (USDC and eventually PYUSD) to revolutionize how users earn, transfer, and interact globally.\n\nHere's a breakdown of how Stellar fits into our key features:\n\n1. 1-Click Stablecoin Onboarding (USDC & PYUSD)\n\n-   What’s being added? Streamlined Stellar Account Creation via Circle Programmable Wallets and social logins (Google, email) for instant access to Stellar-native stablecoins like USDC (and later PYUSD).\n    \n-   How does Stellar help? Stellar's account model and Circle integration abstract away crypto complexities (keys, wallet setups), lowering the barrier for non-crypto users.\n    \n-   What’s the impact? Directly solves \"Onboarding Complexity.\" Ensures our 30,000+ users and thousands of new monthly users can effortlessly use Stellar payments, driving mass adoption for global digital economy participation.\n    \n\n2. Gasless Microtransactions\n\n-   What’s being added? Enabling Stellar-native USDC (and soon PYUSD) deposits/withdrawals with ROSEN covering all network fees (XLM) via Fee Abstraction.\n    \n-   How does Stellar help? Stellar's near-zero fees ($0.00001 XLM) and native fee-sponsoring make absorbing costs viable, ensuring micro-transactions are economically sound and user-friendly.\n    \n-   What’s the impact? Directly addresses \"Global Payment Friction\" for \"Digital natives in emerging markets.\" Users transact cents without gas worries, fostering a highly active and liquid digital labor market.\n    \n\n3. Cross-Border Social Economy (In-Chat Stablecoin Payments)\n\n-   What’s being added? Integration of in-chat stablecoin payments (USDC/PYUSD on Stellar) with AI translation for features like Instant Tipping and Micro-Task Rewards.\n    \n-   How does Stellar help? Stellar's sub-5-second settlements and design for high-frequency, low-value payments enable truly instant, affordable, borderless value transfer within social interactions. Compliant stablecoins ensure trust.\n    \n-   What’s the impact? Directly tackles \"Limited Economic Opportunities\" and \"Global Payment Friction.\" Creates a liquid digital labor market, strengthens communities, and provides instant, global monetization for skills.\n    \n\n4. Global Decentralized Recruitment (Talent Matching & Community Incentives)\n\n-   What’s being added? Businesses can post jobs and pay incentives/salaries in USDC (and later PYUSD) on Stellar. We also use Stellar-native stablecoins for in-community voting and contribution rewards.\n    \n-   How does Stellar help? Stellar's speed, low cost, and transparency are ideal for P2P and community payments. Compliant stablecoins provide a reliable medium of exchange, aligning with our decentralized vision.\n    \n-   What’s the impact? Expands economic opportunities via transparent, efficient global talent matching, free from traditional banking hurdles. Strengthens decentralized social networks through instant participation incentives and rewards.\n    \n\n5. Non-Custodial Withdrawals\n\n-   What’s being added? Integration of Stellar SEP-0007 (Deep Links) for Wallet Connect, allowing users to easily withdraw their Stellar assets to preferred non-custodial wallets (e.g., Lobstr, Albedo).\n    \n-   How does Stellar help? SEP-0007 provides a seamless, secure standard for app-to-external wallet interaction, giving users self-custody over their assets without forcing a specific solution.\n    \n-   What’s the impact? Offers crucial user optionality and builds trust. Empowers users with self-custody for Stellar-native stablecoins, demonstrating commitment to user sovereignty while maintaining ease of use.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1BgNARxH3Bs6Az3TD78PqG69LOl627XyP/edit?usp=sharing&ouid=112109329003859869790&rtpof=true&sd=true",
                        "stellar.successCriteria": "Output (What We Deliver)\n\n-   2,000 Stellar-Enabled ROSEN Users on Mainnet: Onboard at least 2,000 existing users to Stellar features within one month of full rollout.\n    \n-   400 Unique On-Chain Transactions: Achieve at least 400 unique Stellar transactions from these users within one month.\n    \n-   Seamless Non-Custodial Withdrawals: Successfully execute 50+ USDC withdrawals to external Stellar wallets on Mainnet.\n    \n-   \"Stellar-Ready\" Platform for Additional Stablecoins: Complete infrastructure to integrate future stablecoins like PYUSD once they launch on Stellar.\n    \n\nOutcome (The Impact We Create & Future Outlook)\n\n-   Boosted Economic Participation & Financial Inclusion: We'll empower digital natives in emerging markets by removing payment barriers, enabling them to easily monetize skills and receive instant, low-cost global payments. This greatly enhances financial access by simplifying crypto adoption (no gas fees, easy onboarding), bringing non-crypto users into the Stellar ecosystem.\n    \n-   Reduced Global Payment Friction: Our solution will demonstrate a major reduction in fees and settlement times for small cross-border payments, making Stellar the go-to rail for high-frequency, low-value transactions within our social economy.\n    \n\nDriving Stellar Adoption & Network Effect: We'll onboard a substantial number of active, real-world users, showcasing Stellar's practical utility for the gig economy. Our goal is to gradually convert our existing 30,000+ ROSEN users to Stellar users, ensuring thousands of new monthly ROSEN users automatically adopt Stellar. This will spark a powerful network effect, leading to a dramatic increase in transaction volume and liquidity on Stellar, solidifying its role in borderless digital economies.",
                        "stellar.goToMarketPlan": "Our Go-To-Market (GTM) strategy will drive organic Stellar adoption by leveraging ROSEN's existing community and proven growth channels post-Mainnet launch.\n\nLaunch Timeline\n\n-   Month 5.5 (Pre-Launch): Internal \"Stellar Ready\" campaign to ambassadors and top community members.\n    \n-   Month 6 (Initial Rollout): Phased launch of Stellar (USDC) integration to active ROSEN users via in-app announcements, push notifications, and email.\n    \n-   Month 6.5+ (Full Rollout & Growth): Gradual rollout to all users, continuous iteration, and integration into standard new user onboarding.\n    \n\nTarget Audience & Channels\n\nWe'll focus on our 30,000+ existing ROSEN users, especially micro-earners and cross-border transactors, and expand to new global audiences.\n\n-   ROSEN In-App: Dedicated Stellar onboarding flows, feature spotlights, and comprehensive in-app support.\n    \n-   Ambassador Network: Our 40 regional ambassadors will educate and guide their local communities on Stellar integration.\n    \n-   Influencer Network: We'll run a social media campaign, leveraging our LatAm influencer resources (from our team, an ex Kuaishou influencer manager) to create authentic content showcasing gasless & borderless Stellar payments.\n    \n-   Community-Led Growth: Incentivizing user invites & activities and leveraging product-led growth loops where sharing Stellar transactions becomes a natural viral mechanism.\n    \n\nStrategic Partners & Pilots\n\nWe'll maximize impact through key collaborations:\n\n-   Circle Partnership: Leverage our official partnership for co-promotion and ecosystem collaborations.\n    \n-   Stellar Ecosystem: Engage with SDF and other Stellar projects for cross-promotion and joint educational initiatives.\n    \n-   Future Fintech Partners: Explore pilots for direct fiat on/off-ramps with local fintechs in emerging markets (future scope, not grant-funded).\n    \n\nMeasuring Early Adoption\n\nWe'll measure success through direct on-chain and in-app metrics:\n\n-   On-Chain Metrics: Track new Stellar accounts created, total on-chain transactions (send/receive/tip) by ROSEN users, and usage of non-custodial withdrawals.\n    \n-   In-App Engagement: Monitor feature adoption rates, retention of Stellar users, and gather direct user feedback.\n    \n-   Network Performance: Assess ambassador and influencer campaign effectiveness (e.g., attributed sign-ups, activity).\n    \n\nOur strategy ensures a powerful, organic growth trajectory for Stellar adoption within and beyond the ROSEN ecosystem.",
                        "stellar.tractionEvidence": "ROSEN is well beyond the idea stage, with a proven track record of user acquisition, product validation, and industry recognition. Our current operational app and significant existing user base position us perfectly for a rapid and impactful integration with Stellar.\n\nKey Metrics & User Base:\n\n-   Existing User Base: ROSEN currently boasts over 30,000 global users on our live application (available on App Store and Google Play Store: https://play.google.com/store/search?q=rosen&c=apps&hl=en). These users represent a highly engaged community actively participating in micro-earning and social interactions.\n    \n-   Rapid User Growth: We consistently acquire thousands of new users monthly. This organic growth highlights strong product-market fit and the significant demand for our solution.\n    \n-   High Conversion Potential: All current 30,000+ ROSEN users are poised to instantly become Stellar users upon integration, providing an immediate and substantial boost to Stellar's on-chain activity and user count. Our continuous new user acquisition pipeline ensures a steady stream of new Stellar users.\n    \n-   Influencer-Driven Acquisition: Our prior campaigns, leveraging our team's expertise as former Kuaishou Latin America influencer leads, have successfully driven growth. By inviting 50 LatAm influencers to promote ROSEN, we achieved over 10,000 organic user registrations. Example: (9) Instagram And we have 25000+ influencers network to be leveraged once we are ready to scale. This demonstrates a highly effective and scalable user acquisition channel that will be leveraged for Stellar adoption.\n    \n-   Regional Ambassadors: We have an active network of 40 regional ambassadors who are instrumental in community building and user support. This network will be key to localized Stellar onboarding and education.\n    \n\nProduct Validation & Industry Recognition:\n\n-   Google x PayPal PYUSD Global Hackathon (2nd Place): Our strong performance in this hackathon, focusing on PYUSD integration, demonstrates our technical capability and alignment with major payment innovators.\n    \n    -   Media Link 1: https://x.com/StackUpHQ/status/1919448469632385273\n        \n    -   Media Link 2: https://www.linkedin.com/posts/stackupofficial_congrats-to-the-winners-of-our-google-activity-7325203972372254720-WhXU?utm_source=share&utm_medium=member_desktop&rcm=ACoAACPFRoUBSyL8fhV0x8TdRwoX9buMoUUNhvA\n        \n-   PayPal Annual Dev Day Hackathon (3rd Place): Further validation of our technical expertise and commitment to integrating leading payment solutions. Our project focused on upgrading a global social trading app powered by PYUSD.\n    \n    -   Media Link 1: https://x.com/paypaldev/status/1917997655214702623\n        \n    -   Media Link 2: https://www.youtube.com/watch?v=v0JKxyZZe2g\n        \n-   Draper University Accelerator Selection: Being selected into Silicon Valley's top-tier Draper University Accelerator program signifies strong investor confidence and mentorship.\n    \n    -   Media Link 1:https://x.com/draper_u/status/1909388809818849337\n        \n-   Paris Blockchain Week 2025 (Global Top 100 Startups): Recognition as a Global Top 100 Startup at a premier international blockchain event underscores our innovation and potential within the Web3 space.\n    \n    -   Media Link: https://x.com/go_rosen/status/1899464175409336789\n        \n-   Circle Grant Recipient & Official Partner: Receiving a grant from Circle, the issuer of USDC, and becoming an official partner validates our technical approach and provides direct access to critical stablecoin infrastructure.\n    \n    -   Media Link 1: https://x.com/circle/status/1882824208759026013\n        \n    -   Media Link 2: https://x.com/BuildOnCircle/status/1861801693433954757\n        \n    -   Media Link 3: https://www.linkedin.com/posts/circle-internet-financial_how-rosen-bridge-is-revolutionizing-cross-border-activity-7289690894469935104-yUqu?utm_source=share&utm_medium=member_desktop&rcm=ACoAACPFRoUBSyL8fhV0x8TdRwoX9buMoUUNhvA",
                        "stellar.tranche1Deliverables": "This tranche focuses on establishing the foundational Stellar integration for core user onboarding and basic USDC deposit transactions on the Testnet.\n\n-   Deliverable 1.1: Stellar Account & Basic USDC Integration\n    \n    -   Brief description: Implement 1-Click Stellar account creation via social login (Google/Email) using Circle Programmable Wallets. Enable internal testing of receiving USDC on Stellar Testnet.\n        \n    -   How to measure completion:\n        \n        -   Successful creation of 20 Stellar wallet accounts by internal testers via social login, verified on Stellar Testnet.\n            \n        -   Successful completion of 20 end-to-end Stellar-USDC receive/deposit transactions on Testnet on Rosen App by internal testers.\n            \n    -   Estimated date of completion: Month 2\n        \n    -   Budget: $20,000",
                        "stellar.tranche2Testnet": "This tranche expands on the MVP, integrating full micro-earning flows and non-custodial withdrawals with USDC, while preparing the infrastructure for future stablecoin expansions on the Testnet.\n\n-   Deliverable 2.1: Full Micro-Earning & Non-Custodial Gasless Withdrawal on Testnet (with USDC)\n    \n    -   Brief description: Implement and test the complete user flows for Instant Tipping and Micro-Task Rewards using USDC on Stellar Testnet. Integrate and test Stellar SEP-0007 for secure non-custodial gasless withdrawals to external Stellar-compatible wallets (e.g., Lobstr, Albedo) on Testnet.\n        \n    -   How to measure completion:\n        \n        -   50 successful end-to-end cycles of tipping and micro-task rewards completed by beta users on Testnet, with accurate balance updates and transaction records.\n            \n        -   25 successful gasless withdrawals of Testnet Stellar-USDC from the ROSEN app to external Stellar wallets by beta users.\n            \n    -   Estimated date of completion: Month 3\n        \n    -   Budget: $25,000\n        \n-   Deliverable 2.2: Stablecoin Expansion Readiness (Testnet)\n    \n    -   Brief description: Set up the necessary infrastructure and preliminary code on Testnet to facilitate the integration of additional stablecoins (such as PYUSD, once officially launched on Stellar mainnet), ensuring our system is extensible for future asset additions.\n        \n    -   How to measure completion: a mockup of additional stablecoin assets (e.g., a test PYUSD asset) on Stellar Testnet, demonstrating readiness for future mainnet integration.\n        \n    -   Estimated date of completion: Month 3\n        \n    -   Budget: $5,000",
                        "stellar.tranche3Mainnet": "This final tranche focuses on the critical deployment of Stellar-powered USDC features to the ROSEN Mainnet and the initial rollout to our existing user base, with a conditional plan for future stablecoin activations.\n\n-   Deliverable 3.1: Mainnet Deployment & Phased User Rollout (with USDC)\n    \n    -   Brief description: Deploy core Stellar-integrated features (1-Click Onboarding, Gasless Microtransactions & Withdrawals, Cross-Border Micro-Earning) using USDC to a phased rollout on the ROSEN Mainnet for our existing user base.\n        \n    -   How to measure completion: Successful onboarding of 1,500 ROSEN users to Stellar-enabled features on Mainnet, with at least 300 unique on-chain transactions initiated by these users within one month of rollout.\n        \n    -   Estimated date of completion: Month 5\n        \n    -   Budget: $20,000\n        \n\n-   Deliverable 3.2: Additional Stablecoin Mainnet Activation (Conditional)\n    \n    -   Brief description: Full integration and activation of additional stablecoins (e.g., PayPal USD (PYUSD) or other relevant assets) on Stellar Mainnet within ROSEN, pending their official launch and regulatory approvals on the Stellar network. This deliverable will be executed only when these stablecoins become available and stable for integration on Stellar Mainnet.\n        \n    -   How to measure completion: Successful processing of 50+ transactions with the newly integrated stablecoin(s) on Mainnet by early adopters within ROSEN, once available.\n        \n    -   Estimated date of completion: 0.5 months after the specific stablecoin's official mainnet launch on Stellar (flexible, as this is dependent on external factors).\n        \n    -   Budget: $5,000",
                        "stellar.teamMembers": "SIDA ZHENG",
                        "stellar.urls": {
                            "website": "https://gorosen.xyz",
                            "codeRepository": "https://github.com/GoROSEN/rosen-stellar",
                            "videoURL": "https://youtu.be/o00yvV_kYRA"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/gorosen/",
                            "twitter": "https://x.com/go_rosen"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 25000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 55502.42,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:8",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:tucambio-wallets",
                    "projectName": "TuCambio Wallets",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Stellar-based wallet to help remittance users beat inflation using USDC and instant conversion to local currency",
                    "fundsApprovedInUSD": 75000.0,
                    "extensions": {
                        "stellar.productsAndServices": "We are building TuCambio Wallet, a non-custodial, Stellar-based wallet designed to enable fast, affordable, and secure cross-border remittances in USDC. Below, we break down the key deliverables and how each adds value to the ecosystem:\n\n1. Non-custodial USDC Wallet with Stellar SDKs\n\n-   What we're building: A mobile and web wallet that automatically creates and activates a non-custodial Stellar address (including XLM funding and USDC trustline setup).\n    \n-   Value: Enables users without crypto experience to hold digital dollars securely without relying on intermediaries. Promotes financial autonomy in inflationary economies. We will activate 14,000 wallets for our existing users, driving immediate adoption and strengthening the Stellar ecosystem.\n    \n\n2. Direct On/Off-Ramp API Integrations (LatAm & U.S.)\n\n-   What we're building: Integrations with local banks, fintechs, and payment processors via API in Chile, Peru, Colombia, Venezuela, Argentina, Bolivia, Panama, and the U.S.\n    \n-   Value: Allows users to receive USDC from abroad and convert to local fiat in minutes. Reduces reliance on slow or expensive legacy rails, and enables last-mile cash-out in underbanked areas.\n    \n\n3. USDC Remittance Transfer Layer\n\n-   What we're building: A cross-border remittance engine that enables USDC transfers across users and wallets on Stellar, using memos and unique transaction references for KYC tagging and tracking.\n    \n-   Value: Creates a transparent, auditable, and compliant remittance rail at near-zero cost, helping meet SDG 10.C by reducing fees to under 3%.\n    \n\n4. User Interface with Stablecoin Education & Local Language Support\n\n-   What we're building: A mobile/web UX optimized for first-time users of crypto wallets, with native language support and educational content around USDC, Stellar, and security.\n    \n-   Value: Increases adoption by making the wallet usable for low-tech users, including migrants and remittance recipients unfamiliar with blockchain.\n    \n\n5. SDG-Linked Social Impact Reporting Framework\n\n-   What we're building: A data layer that tracks fee reduction, access improvements, and financial outcomes per transaction to measure impact against UN SDGs (especially 10.C).\n    \n-   Value: Empowers to track measurable impact while scaling low-cost digital financial access in emerging markets.",
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1VypMPjpdFPIcYcRzHynIbRyJH4lP0kav/view?usp=drive_link",
                        "stellar.successCriteria": "14,000 wallets created and actived on Stellar Mainnet within 6 months",
                        "stellar.goToMarketPlan": "Our go-to-market strategy focuses on leveraging our existing base of over 14,000 remittance users to drive early adoption of TuCambio Wallet. We plan to launch a closed beta on Stellar Testnet in Q3 2025, followed by a full Mainnet deployment in Q4 2025 with USDC on-ramp functionality in Chile and off-ramp in Venezuela. In Q1 2026. Our target users are migrants in stable economies sending money to families affected by inflation. We will activate wallets via in-app prompts and highlight advantages for customers throughout their remittances process. Adoption will be measured by wallet activations, on/off-ramp usage volume, and KYC completion. We also collaborate with education partners like Campus On Chain and engage Stellar ecosystem participants to build technical feedback loops, ensuring strong user-driven growth without relying on paid marketing.",
                        "stellar.tractionEvidence": "TuCambio has over 14,000 active users, including both remittance senders and recipients—each representing a wallet ready for immediate activation. To date, we've processed more than USD $5 million across 60,000+ transactions.\n\nThis solid traction proves strong market demand and provides a ready user base for the adoption of our USDC wallet solution.\n\nFor transparency, here's a direct link to our Google Analytics dashboard with historical daily user data from our web app:\n\n https://lookerstudio.google.com/reporting/84b70eea-1ed5-4d9e-8e2a-b71bbd139e01",
                        "stellar.tranche1Deliverables": "●   Deliverable 1: Wallet UI/UX\n\nBrief description: Initial wireframes and click-through experience for wallet design and user journey.\n\nHow to measure completion: UX validated by internal team and focus group in a testing environment.\n\nEstimated date of completion: 6 weeks | August 2025.\n\nBudget: USD 4,000\n\n●   Deliverable 2: Automatic Wallet Creation +Trustline Setup for USDC  (Keypair + Funding)\n\nBrief description: integrate the Stellar SDK to interact directly with the Stellar network and perform operations such as creating accounts, fund with XLM, and prepare for use. Automatically add a trustline for USDC to each wallet. Through Horizon API to provide blockchain data access.\n\nHow to measure completion: 10 wallets created automatically via onboarding by waiting list.\n\nEstimated date of completion: 8 weeks | August 2025.\n\nBudget: USD 13,000\n\n●   Deliverable 3: KYC/AML modules for compliance\n\nBrief description: Implementation of KYC (Know Your Customer) and AML (Anti-Money Laundering) Tu Cambio modules  into the flow of TuCambio Wallets. This includes identity verification (ID upload, facial recognition), watchlist screening (OFAC, PEP, sanctions), and transaction monitoring tools.\n\nHow to measure completion: Fully integrated KYC flow in TuCambio Wallet.\n\nEstimated date of completion: 4 weeks | September 2025.\n\nBudget: USD 5,000",
                        "stellar.tranche2Testnet": "●   Deliverable 1: On-ramp Integration (Chile -CLP)\n\nBrief description: API-based integration to enable users to convert local fiat currencies into USDC\n\nHow to measure completion: 10 test conversions completed.\n\nEstimated date of completion: 4weeks | October 2025\n\nBudget: USD 12,000\n\n●   Deliverable 2: Off-ramp Conversion Trigger System (Venezuela -VES)\n\nBrief description: Backend logic to allow conversion trigger (USDC → fiat (VES)).\n\nHow to measure completion: 50 Transactions processed with correct fiat payout.\n\nEstimated date of completion: 4 weeks | October 2025\n\nBudget: USD 8,000\n\n●   Deliverable 3: Key Management Layer\n\nBrief description: Custodial wallet option with secure local key storage or encrypted vault infrastructure\n\nHow to measure completion: Secure key generation and encryption process implemented, Vault or local storage system fully integrated.\n\nEstimated date of completion: 4weeks | November 2025\n\nBudget: USD 7,000",
                        "stellar.tranche3Mainnet": "●   Production Deployment\n\nBrief description: Full wallet deployment on Stellar mainnet.\n\nHow to measure completion: 100 Users actively transacting with USDC.\n\nEstimated date of completion: 6 weeks | January 2026\n\nBudget: USD 14,000\n\n●   Live Off-Ramp in Venezuela\n\nBrief description: Enable off-ramp functionality with 2 off-ramp providers in Venezuela.\n\nHow to measure completion: 1,000 real transactions processed.\n\nEstimated date of completion: 8 weeks | January 2026\n\nBudget: USD 12,000\n\nNote: Deliverables listed above will be fully integrated into TuCambio’s existing web-based remittance platform. This integration will leverage our current agreements with payment rail and on/off-ramp providers across Latin America and the U.S., ensuring real-world interoperability and fast time-to-market. Furthermore, we will actively engage with potential Stellar Anchor partners to explore and expand fiat on/off-ramp coverage.",
                        "stellar.teamMembers": "Luis Saavedra Correa, Jose Campos, Carla Leal",
                        "stellar.urls": {
                            "website": "https://www.tucambio.app/business",
                            "codeRepository": "https://docs.google.com/document/d/1dNGfDZMEGBQU86XxkVRcXewhxGYJc2UxUhDw-zNnwuQ/edit?usp=sharing",
                            "videoURL": "https://youtu.be/1whz0iWeE8A"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/tucambiospa"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 25000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 63791.23,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:9",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:stellar-integration-in-adamik-api",
                    "projectName": "Stellar Integration in Adamik API",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Unified blockchain API helping developers integrate Stellar in days, not weeks, with major read/write operations.",
                    "fundsApprovedInUSD": 74800.0,
                    "extensions": {
                        "stellar.productsAndServices": "After years of integrating 50+ blockchains at Ledger—including Stellar��we experienced firsthand the pain of learning each protocol's quirks, maintaining separate codebases, and watching months slip by for each integration. Adamik is the unified API we desperately wished for back then: one interface, consistent across all chains.\n\nWith this proposal, Adamik's unified blockchain API will add full Stellar support, enabling developers to:\n\n-   Query XLM/asset balances and transaction history via standard REST endpoints\n    \n-   Build and encode Stellar transactions (transfers, trustlines, memos) using our universal format\n    \n-   Integrate with enterprise key management (Ledger, Fireblocks, Turnkey)\n    \n\nImpact: Existing Adamik users can add Stellar in 48-72 hours. New developers bypass Stellar-specific complexity entirely. Stellar will receive ongoing maintenance and protocol updates as part of Adamik's standard operations, no additional funding required.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1zN6cmaF1WW_k78IAv8xnogxOt3XRW6iN/edit?usp=sharing&ouid=102887145092235139642&rtpof=true&sd=true",
                        "stellar.successCriteria": "'-   Technical Success:\n    \n    -   Full Stellar support live on mainnet/testnet with feature parity\n        \n    -   Achieve 99.9% uptime for Stellar endpoints\n        \n-   Adoption Metrics:\n    \n    -   10+ active developers using Stellar endpoints within 3 months\n        \n    -   10,000+ Stellar API calls within first month\n        \n-   Ecosystem Impact: Enable 3+ wallets/fintechs to add Stellar support\n    \n-   Developer Experience: 90% reduction in Stellar integration time (days vs weeks)\n    \n-   Timeline Commitment: Complete integration within 18 weeks of grant approval",
                        "stellar.goToMarketPlan": "Stellar integration will be available to all existing Adamik API users (250+ developers across 60+ chains). Our developer-first approach includes:\n\n-   Comprehensive Stellar documentation in our API reference\n    \n-   Integration tutorials at tutorial.adamik.io\n    \n-   Open-source Stellar support in Adamik MCP Server for AI-assisted development\n    \n-   Free Stellar API calls for first 3 months to encourage adoption\n    \n-   Direct outreach to existing enterprise clients needing Stellar support",
                        "stellar.tractionEvidence": "Adamik is already powering multichain access for leading Web3 companies including Ledger Enterprise, NGrave, and OpenWallet.  \nThese platforms rely on Adamik to integrate multiple blockchains through a single, standardized API, drastically reducing time-to-market and engineering overhead.\n\nSince January 2025, we’ve onboarded 4 new enterprise clients ahead of our go-to-market push. We’ve also partnered with MPC providers Sodot and Turnkey to offer a flexible, signer-agnostic stack that serves as a practical alternative to Fireblocks.\n\nOur API now processes 500k+ calls daily, with growing adoption among wallets, staking providers, and institutional applications.  \nThis traction demonstrates strong demand for non-custodial, multichain access and Stellar will immediately benefit from being included in this rapidly growing network.",
                        "stellar.tranche1Deliverables": "Description: Implement core Stellar read operations and basic transaction encoding\n\nDeliverables:\n\n-   Account XLM Balance Retrieval (User Story #1) - $7,000\n    \n-   Pubkey to Address Conversion (User Story #2) - $6,000\n    \n-   Chain Details Endpoint (User Story #4) - $6,000\n    \n-   Address Validation (User Story #5) - $6,000\n    \n-   XLM Transfer Encoding without signing (User Story #3) - $10,000\n    \n\nCompletion Metrics: All 5 core endpoints functional with internal testing, documented API responses, unit test coverage >90%\n\nBudget: $35,000\n\nTimeline: 6 weeks",
                        "stellar.tranche2Testnet": "Description: Complete Stellar feature set on testnet including assets and transaction history\n\n  \nDeliverables:\n\n-   Fee Estimation and Minimum Balance Logic (User Story #6)\n    \n-   Transaction Details Retrieval (User Story #7)\n    \n-   Stellar Digital Asset Transfer Encoding (User Story #8)\n    \n-   Trustline Management (User Story #9)\n    \n-   Send Max Feature Implementation (User Story #10)\n    \n-   Complete testnet integration with partner validation\n    \n\n  \nCompletion Metrics: Full Stellar testnet support, partner testing completed, comprehensive documentation published\n\n  \nTimeline: 10 weeks (No budget - as per Stellar guidelines)  \n  \nNote: While this tranche requires significant development work, SCF guidelines allocate no budget to testnet phases. The value of this phase is to prepare the groundwork for mainnet phase (tranche 3).",
                        "stellar.tranche3Mainnet": "Description: Deploy production-ready Stellar support with reliable Horizon infrastructure, monitoring, automated testing, and full integration into Adamik's 60+ chain ecosystem\n\nDeliverables:\n\n-   Production Horizon infrastructure setup and optimization - $10,000\n    \n-   Comprehensive monitoring and alerting systems - $8,000\n    \n-   Automated testing and CI/CD pipeline integration - $10,000\n    \n-   Full ecosystem integration with existing 60+ chains - $10,000\n    \n-   Production documentation and developer tutorials - $1,800\n    \n-   Demo application at tutorial.adamik.io\n    \n\nCompletion metric: Stellar mainnet live on api.adamik.io with documentation, tutorials, and demo app integration at tutorial.adamik.io\n\nTimeline: 18 weeks from approval\n\nBudget: $39,800\n\nBy the end of tranche 3, Stellar will be fully usable in production environments alongside our 60+ supported chains, with full documentation, integration guides, and tutorials.",
                        "stellar.teamMembers": "Fabrice Dautriat, Hakim, Roman-Adamik",
                        "stellar.urls": {
                            "website": "https://adamik.io",
                            "codeRepository": "https://github.com/adamikhq",
                            "videoURL": "https://youtu.be/aGSp-CMziik"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/adamik",
                            "twitter": "https://x.com/adamik_io"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 24933.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 62552.02,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:10",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:sorobanhooks",
                    "projectName": "SorobanHooks",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "A no-code automation platform for real-time alerts and AI-powered insights on Stellar assets, contracts, and wallets",
                    "fundsApprovedInUSD": 30000.0,
                    "extensions": {
                        "stellar.productsAndServices": "1. Asset Alerts ( extended features from previous submission)\n\n-   Features: Monitors price changes of Stellar/Soroban assets in real time and provides historical pricing data apis for developers (OHLCV).\n    \n-   Example: Get a Telegram alert when $MYTOKEN drops or goes up, or fetch the past 30 days of price history for charting or analysis, Generating custom graphs\n    \n\n2. Contract Alerts  ( extended features from previous submission)\n\n-   Features: exposes historical contract data via API.\n    \n-   Example: For any dApp/project if they need historical data, can be done from this api\n    \n\n3. Smart Monitoring\n\n-   Feature: Converts raw on-chain data (wallets, contracts, assets) into clear, human-readable summaries — with real-time feed for telegram, discord and webhook support.\n    \n-   Example: Instead of showing JSON logs, display: “User A received 500 Blend from Contract X – Reason: Weekly yield.”\n    \n\n4. Smart Analysis\n\n-   Feature: Analyzes patterns in contract/wallet/asset activity and generates daily, weekly, or monthly summaries.\n    \n-   Example: “Here’s your weekly Blend protocol summary: 120 new deposits, 8 liquidations, 12% TVL growth, top 3 active users.”",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/13tohLYc_JL4nlwIVl9V6n-PRbirEIkfSSJWNRuCbiMM/edit?usp=sharing",
                        "stellar.successCriteria": "1. Asset Alerts\n\nObjective: Provide real-time and historical insights into Stellar/Soroban asset price changes.\n\nSuccess Metrics:\n\n-   Real-time alerts for price changes delivered under 5 seconds latency.\n    \n-   Support for 100+ assets with OHLCV history API coverage.\n    \n-   At least 1,000 API calls/day from developers during testnet.\n    \n-   Verified integration of alerts with Telegram, Discord, and Webhooks.\n    \n-   Enable custom chart generation (line/candle) from historical data.\n    \n\n2. Contract Alerts\n\nObjective: Expose reliable historical and live smart contract data via API.\n\nSuccess Metrics:\n\n-    Index and expose historical data for at least Soroban contracts.\n    \n\n3. Smart Monitoring\n\nObjective: Simplify raw blockchain data into human-readable updates for both users and developers.\n\nSuccess Metrics:\n\n-    Daily event summaries generated for wallets, assets, and contracts.\n    \n-    Integrated with Telegram, Discord, and Webhook bots.\n    \n-    Human-readable format for 90%+ of on-chain actions supported.\n    \n\n4. Smart Analysis\n\nObjective: Turn raw on-chain activity into actionable, AI-powered summaries.\n\nSuccess Metrics:\n\n-   Generate daily, weekly, and monthly digest for any wallet or contract.\n    \n-   Summary templates available for DeFi, NFT, and DAO use cases.\n    \n-   Delivered to users via email, TG, Discord with > 90% delivery success.\n    \n-   Highlight key metrics like TVL changes, active users, liquidations, etc.",
                        "stellar.goToMarketPlan": "1.  Stellar/Soroban developers\n    \n1.  DeFi/NFT projects on Stellar\n    \n1.  Hackathon participants & SCF builders\n    \n1.  Wallets, Indexers, and Analytics platforms\n    \n1.  Telegram/Discord-based token communities\n    \n1.  Non-technical founders needing real-time compliance/monitoring",
                        "stellar.tractionEvidence": "1.  60+ developers and project using our platform \n    \n1.  Communities using our product for real time token pricing : Dic Inu, Poye, Afreum with 300 tokens and more communities in in talk with above requested features\n    \n1.  Top Project using our sorobanhooks and requested few updated features : Kryptos, scopex, Laina, Blend, NFT bridge, Freelii, FastBuka Delivery, lumoscore\n    \n1.  Social Media mentions : https://x.com/Peejaytheprince/status/1937958768857202701, https://x.com/poye_token/status/1937710005496463520\n    \n1.  Growing with social media presence : https://x.com/sorobanhooks\n    \n1.  Dev and Projects Usage Evidence : https://drive.google.com/drive/folders/1qqpVDfpdV_93yDcH8lnLUnShsBu33jXq?usp=drive_link",
                        "stellar.tranche1Deliverables": "Duration: Week 3-4\n\nBudget : $10000\n\nDeliverables:\n\n##### 1. Asset Alerts ( extended features from previous submission)\n\n-   Features: Monitors price changes of Stellar/Soroban assets in real time and provides historical pricing data apis for developers (OHLCV).\n    \n-   Example: Get a Telegram alert when $MYTOKEN drops or goes up, or fetch the past 30 days of price history for charting or analysis, Generating custom graphs\n    \n\n##### 2. Contract Alerts  ( extended features from previous submission)\n\n-   Features: exposes historical contract data via API.\n    \n-   Example: For any dApp/project if they need historical data, can be done from this api",
                        "stellar.tranche2Testnet": "Budget : $10000\n\nDuration: Week 3-4\n\nDeliverables:\n\n3. Smart Monitoring\n\n-   Feature : Converts raw on-chain data (wallets, contracts, assets) into clear, human-readable summaries — with real-time feed for telegram, discord and webhook support.\n    \n-   Example: Instead of showing JSON logs, display: “User A received 500 Blend from Contract X – Reason: Weekly yield.”",
                        "stellar.tranche3Mainnet": "Budget : $10000\n\nDuration: Week 3-4\n\nDeliverables:\n\n4. Smart Analysis\n\n-   Feature: Analyzes patterns in contract/wallet/asset activity and generates daily, weekly, or monthly summaries.\n    \n-   Example: “Here’s your weekly Blend protocol summary: 120 new deposits, 8 liquidations, 12% TVL growth, top 3 active users.”",
                        "stellar.teamMembers": "Vishal, dev (Sorobanhooks)",
                        "stellar.urls": {
                            "website": "https://sorobanhooks.xyz/",
                            "codeRepository": "http://github.com/sorobanhooks/",
                            "videoURL": "https://www.youtube.com/watch?v=MYclVVyXHj0"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/sorobanhooks"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 20000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 50471.42,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:11",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:reblue-securing-austere-supply-chains",
                    "projectName": "reBlue: Securing Austere Supply Chains",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "reBlue hybridizes Stellar with off-chain analysis to vet supply chains in fragile states and enable frontier market access.",
                    "fundsApprovedInUSD": 100000.0,
                    "extensions": {
                        "stellar.productsAndServices": "reBlue delivers Trust-as-a-Service in environments where formal systems fail and informal systems can’t be conventionally audited. By shifting the burden of trust from opaque local networks to our blockchain-backed ledger, we enable institutions to operate with confidence in regions previously deemed too high-risk.\n\nWe monetize this trust infrastructure across multiple channels:\n\n● Monitoring and Evaluation Service: USAID’s M&E expenditures in Ethiopia were billed at $10M/ year. Visibility into operations like UN cash flights to Kabul (>$40M every 10 days) unlocks additional millions in potential revenue.\n\n● Decentralized (peer to peer) Humanitarian Aid: Global remittances are valued as high as $850B, with IVTS exceeding $1T. 2-5% monitoring fees are competitive with formal remittance companies.\n\n● Multilateral Data Subscriptions: Passive information collection from previously unmonitored sources supports planning, compliance, and geopolitical risk models.\n\n● Turnkey Platform Development: Organizations can license reBlue’s infrastructure under their own branding to meet compliance and assurance needs.\n\n● Market Entry Services: For LMM firms expanding into high-risk regions, reBlue’s Market Entry Services offer a plug-and-play compliance layer, enabling growth without the overhead of in-house risk teams.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1vLnCAZltypCB8m5T4LQTrSjY9ZgjYHPHglrsYnyRPm8/edit?usp=sharing",
                        "stellar.successCriteria": "'-   Mainnet deployment of full stack. All modules (scan/custody ledger, chatbot, escrow, NFT, OCR) operational in a live corridor with real asset flow.\n    \n    -   3-6 external orgs onboarded, two persistent pilots converted to revenue generating Medical and identity corridors are fully transitioned from test to production, with continuous event logging and partner feedback.\n        \n    -   OCR module field-tested. Offline scans and low-literacy label reading proven viable in field conditions.\n        \n        -   Poised for full Vernam Cipher integration.\n            \n-   High-volume stress testing completed. 1,000+ events logged under a single event occurring varied real-world conditions (offline, low literacy, network instability) without data loss or failure.\n    \n-   Escrow release and NFT receipts in production. At least 10 successful payout transactions triggered by verified delivery scans, each with linked on-chain receipt.\n    \n-   Successful completion of Hawala 2.0 pilot program, with results presented to the House Foreign Affairs Committee.\n    \n    -   HR 260 pilot findings included in Department of State report issued to Congress with special exemption to the Treasury Department's General Licenses under consideration.  \n        \n\nNote: any Afghanistan related pilot program will be executed in accordance with Stellar's Sanctions Compliance Policies",
                        "stellar.goToMarketPlan": "'-   Convert active pilots into paid use. Start with Medical Bridges, turning the live corridor into a production deployment once payouts are activated and the logistics tracking capability is validated\n    \n-   For LMM firms expanding into high-risk regions, reBlue’s Market Entry Services offer a plug-and-play compliance layer, enabling growth without the overhead of in-house risk teams.\n    \n-   Lead with the OCR edge. Post-distribution verification is a known blind spot in the post distribution component of humanitarian aid delivery and frontier Market engagement. our OCR system offers a unique value proposition by logging handwritten or printed delivery artifacts.\n    \n    -   Position escrow and NFT layers as compliance tools. Stable-asset payouts and digital receipts serve both audit and regulatory functions—especially for US-funded partners.\n        \n-   Lean heavily on our policy pilots to wedge in. Georgetown’s HMA partnership opens a gateway into donor frameworks and country-level coordination, and our remote vetting platform and experience with Afghanistan-centric NGOs. puts us on the forefront of Central Asian Immigration\n    \n    -   Speaking of policy pilots, our Hawala 2.0 concept could not have been better timed to respond directly to Congress’s requirements stemming from H.R 260.This is a massive opportunity: we have the platform, we are doing the corresponding research at Oxford, and we even have the connections in Congress (CEO Thomas Kasza testified to the same committee last year)",
                        "stellar.tractionEvidence": "Our pilot programs are frequently updated here: https://docs.google.com/document/d/1ZC0nUwSUR3re-phENHuEMEFcqP1s8CPlC-EIAKRHLtg/edit?usp=sharing\n\n  \nA logistics pilot with a Houston-based medical-supply NGO is tracking roughly $1.2 million of equipment bound for Ukraine and Kenya. Every pallet scan fires a smartphone-triggered smart contract that stamps GPS and device metadata onto Stellar, giving the shipper an immutable chain-of-custody without any new hardware or connectivity burdens. This corridor is our first real-world stress-test of the logistics module and sets the groundwork for an Afghan lane now being scoped.\n\nUsing the exact same code-base, we spun up a remote-vetting application for at-risk Afghans pursuing Special Immigrant Visas. Participants submit time-stamped, geotagged “pattern-of-life” check-ins through the mobile interface, creating an auditable proof-of-presence ledger that immigration advocates can reference during the application process. The pivot demonstrates how the platform shifts effortlessly from freight assurance to human-movement verification without touching the underlying architecture.\n\nNext in the queue is a Humanitarian Mine Action module being in partnership with Georgetown University’s McDonough School of Business. The project will apply reBlue’s verification stack across all five HMA pillars (clearance, risk education, victim assistance, advocacy and stockpile destruction) through a mixed-methods research program scheduled to launch in 2025. While pre-deployment, the partnership signals a clear path into a third vertical and shows how the same trust layer can be ported into any high-friction domain where provenance decides impact.  \n\nOur most notable source of recent traction might need to be approached in a separate SCF Submission, as it deviates from what we pitched in June. However, it is extremely noteworthy, as we believe it to have the highest overall upside, not to mention that engaging with informal value transfer systems was our original focus prior to the collapse of USAID.\n\n H.R.260, or the \"No Taxpayer's Dollars for Terrorists Act\" is a bill which passed the US House of Representatives and June 24, 2025, and seeks to explore the movement of US funds to Afghanistan. Notably, the bill explicitly calls for an examination of cash assistance programs, and transactions made using Hawala – an informal value transfer system that is ubiquitous across the Middle East, Central Asia, and North Africa.\n\nThe objective of this pilot is to show that despite its checkered history, Hawala is a critical lifeline to Afghan Allies, and can be modified to be transparent and auditable while also bypassing Taliban control measures. Veteran-led NGOs – (of whom reBlue’s CEO is a founder) have long used Hawala or other informal systems to deliver aid—will serve as the backbone and coordinating body for a live demo of a U.S.-based, blockchain-enabled Hawala tracking system.  \n  \nThis pilot will be paired with an Oxford-backed research project (our founders are MSc and PhD students respectively) and the findings of both will be presented directly to the House Foreign Affairs Committee, with whom we have an existing relationship.",
                        "stellar.tranche1Deliverables": "'-   Open-source scan-to-ledger pipeline that anchors delivery event metadata (GPS, timestamp, IMEI) to the Stellar testnet using Soroban\n    \n    -   Completion: Codebase published on GitHub with functioning testnet contract and signed event metadata visible on-chain.\n        \n-   Mobile-friendly interface for scanning QR codes on pallet or package labels, with structured event payload signing via smartphone\n    \n    -   Completion: Successful capture and submission of at least 100 QR-scanned events using a smartphone, with signed payloads stored in event logs.\n        \n-   Chatbot integration to provide delivery confirmation. (Refer to the “consensus” codes in our technical docs)\n    \n    -   Completion: Chatbot live and responding with consensus codes based on event status; test suite confirms correct outputs for at least 10 event scenarios.\n        \n-   Basic dashboard output for monitoring custody events across test corridors\n    \n    -   Completion: Web-based dashboard deployed, displaying event history and metadata from both pilots in near real-time.\n        \n-   Structured integration into two persistent pilots: one logistics-focused (e.g. Medical Bridges container lane), one identity-focused (e.g. SIV proof-of-presence)\n    \n    -   Completion: Both pilot tracks active and generating event logs over a 30-day period with at least 50 events each.  \n          \n        Estimated Date of Completion: September 15th, 2025  \n        Budget: $50,000\n        \n\n  \nNOTE: The introduction of H.R.260 --which is mentioned frequently through this application-- is arguably the single greatest opportunity that reBlue has encountered. In no small part, this is because engaging with informal value transfer systems is both reBlue's original purpose prior to USAID's collapse, and is CEO Thomas Kasza's area of research at Oxford. However, given that the bill was introduced on June 24th, our budget request is still aligned with the scope of our original application.",
                        "stellar.tranche2Testnet": "'-   OCR module replacing QR-based system to support scanning of printed text, manifests/invoices and serial numbers. This will provide a first of its kind capability for post-distribution efficacy.\n    \n    -   Completion: OCR functionality deployed and tested on-device, with successful scan-and-log of at least 30 non-QR inputs across multiple formats (typed, handwritten, serial).\n        \n-   Event volumes increased sufficiently to stress-test throughput and event integrity under real-world network and device constraints. (Namely, this will be accomplished via an expansion of or “remote vetting” capability)\n    \n    -   Completion: Remote check-in module scaled to at least 1000 new event submissions across multiple geographies; logs analyzed for event loss, duplication, or data corruption under varied connectivity conditions.\n        \n-   Offline-optimized Application allowing scan events to be cached locally and broadcast once the device regains signal (enables coverage in areas with poor or intermittent service)\n    \n    -   Completion: Offline mode tested with at least 50 scan events stored and successfully broadcast after network reconnection; no loss or corruption during sync process.  \n          \n        Estimated Date of Completion: November 15th, 2025\n        \n        Budget: N/A",
                        "stellar.tranche3Mainnet": "'-   Escrow contract using stable-assets (USDC on Stellar) to release funds automatically upon verified delivery scan (Subject to MSB licensing restrictions)\n    \n    -   Completion: Escrow contract deployed to Stellar mainnet with demo funds held and released based on in a live environment.\n        \n-   NFT minting tied to delivery confirmation. Transaction metadata bundled to serve as a cryptographic receipt\n    \n    -   Completion: At least 10 NFTs minted on mainnet, each containing bundled metadata from a confirmed delivery event, viewable on-chain.\n        \n-   Fully deployed mainnet instance running all modules (scanner-ledger interface, custody chain, escrow) within a live, revenue-generating corridor\n    \n    -   Completion: Live corridor operational with all three modules functioning in sequence, and at least one external partner invoiced or under paid contract.\n        \n-   Implement a proprietary verification system that merges OCR with a Vernam Cipher.\n    \n-   Completion: Cipher-integrated OCR module tested and verified to encrypt and decode scanned data consistently in a live environment; technical documentation published once patent is granted.\n    \n    Estimated Date of Completion: January 15th, 2026\n    \n    Budget: $50,000\n    \n    Note: any Afghanistan related pilot program will be executed in accordance with Stellar's Sanctions Compliance Policies",
                        "stellar.teamMembers": "Thomas Kasza",
                        "stellar.urls": {
                            "website": "https://www.reblue.io/",
                            "codeRepository": "https://docs.google.com/document/d/1vLnCAZltypCB8m5T4LQTrSjY9ZgjYHPHglrsYnyRPm8/edit?usp=sharing",
                            "videoURL": "https://drive.google.com/file/d/15qP1xG6W7LbX0GB6yzGpwWXIrbXUMKaW/view?usp=drive_link"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/reblue-inc/"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 33333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 85054.96,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:12",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:dobprotocol",
                    "projectName": "Dobprotocol",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Dobprotocol unlocks secure decentralized funding by proving real revenue from physical infrastructure.",
                    "fundsApprovedInUSD": 143330.0,
                    "extensions": {
                        "stellar.productsAndServices": "Dobprotocol unlocks secure decentralized funding by proving real revenue from physical infrastructure.\n\nWe enable structured DeFi investment into real-world assets such as EV chargers, solar panels, and data centers by validating their future cash flows before any token is issued.\n\nOur system addresses two major bottlenecks in real-world asset (RWA) finance:\n\nFirst, on the investor side, there is a lack of verifiable data. Infrastructure investments often rely on subjective claims, limiting trust and adoption. Dobvalidator solves this by bringing auditable, revenue-based data onchain. This transparent scoring system replaces subjective trust with objective, data-driven assessments.\n\nSecond, on the operator side, infrastructure teams face limited access to decentralized funding. Even strong projects struggle with the complexity of tokenization and the absence of a reliable process. Dob Token Studio addresses this by transforming validated future cash flows into programmable tokens with automated onchain payouts. This makes infrastructure assets ready for integration into DeFi from the beginning.\n\nDobprotocol is building foundational financial infrastructure for real-world yield: secure, composable, and integration ready.\n\n  \n\nOur system consists of two core components:\n\nDobvalidator\n\nDobvalidator brings real world infrastructure data onchain through a transparent and accountable scoring process. Assessments are based on verifiable criteria, such as revenue, uptime, location, and technical specs, and are recorded onchain for public inspection. Projects are evaluated against a consistent set of risk and revenue factors. Our aim is to make this process fully transparent and auditable onchain. This approach replaces blind trust with transparent, methodical validation, ensuring only infrastructure with verifiable cash flows and operational quality can issue tokens and enter DeFi.\n\nDob Token Studio\n\nDob Token Studio is a token creation suite that issues programmable tokens backed by validated infrastructure revenue. These tokens represent future revenue streams and include built-in logic for automated, decentralized revenue sharing. Investors receive payouts directly, with no intermediaries. Tokens are composable and ready to plug into lending markets, AMMs, and dApps.\n\nBy combining Dobvalidator and Dob Token Studio, Dobprotocol transforms real-world infrastructure into yield-bearing digital assets that can be integrated across the decentralized economy.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1Kn3WPiuZDqN91N1lDFSCZPm3dyTMWY5I6YrS4eCG0xo/edit?tab=t.0#heading=h.byaoi144ub2a",
                        "stellar.successCriteria": "Short term (by January 2026):\n\n-   Validate and score a minimum of 5 infrastructure operators through Dobvalidator, covering assets such as EV chargers, solar panels and data centers.\n    \n-   Launch two revenue-backed token issuances via Dob Token Studio, representing over $150,000 in projected cash flows over a 12–18 month period.”\n    \n-   Deploy the full protocol stack on Stellar Mainnet, including validation scoring, token issuance, and automated payout logic, meeting SCF Build’s third tranche requirements.  \n      \n    \n\nMedium term (by June 2026):\n\n-   Expand to 10 active, revenue-generating infrastructure assets tokenized onchain.\n    \n-   Surpass $1 million in cumulative future revenue tokenized through Dobprotocol.\n    \n-   Complete at least 2 integrations with DeFi protocols or primitives to enable use cases such as secondary markets, collateralization, or staking.\n    \n-   Facilitate participation from ecosystem partners and early institutional users leveraging our infrastructure-backed tokens.  \n      \n    \n\nPrimary KPIs:\n\n1.  Total projected revenue tokenized through Dobprotocol (value of future cash flows validated and issued onchain).\n    \n1.  Total revenue distributed to tokenholders (measured by actual onchain payouts).\n    \n1.  Performance ratio: percentage of projected revenue that has been successfully paid out onchain.",
                        "stellar.goToMarketPlan": "Dobprotocol is ready to scale. After validating our technical architecture and product-market fit during Stellar Kickstart, we now focus on expanding real-world integrations and onboard infrastructure assets and investors. Our Infra Readiness Sprint sits at the heart of this strategy.\n\n#### Infra Readiness Sprint: Free pre-validation for real-world infrastructure\n\nAs part of our Go-to-Market strategy, we offer a fully subsidized Infra Readiness Sprint, funded by Dobprotocol. This consists of a 1–2 hour pre-validation session where our team meets directly with infrastructure operators to assess their project’s financial, technical, and operational readiness for tokenization.\n\nDuring this session, we provide strategic guidance, review available data, and help determine whether the project is ready to move forward with onchain validation and token issuance. If not, we prepare a readiness report outlining the gaps and next steps to qualify for tokenization in the future.\n\nThis program is Dobprotocol’s way of lowering the barrier to entry and ensuring that only serious, well-prepared infrastructure projects advance into our validation pipeline.\n\n#### Validation tiers and pricing model\n\nPost-sprint, operators move into one of three paid validation tiers based on project scale:\n\nTier: Small\n\nFee (USD): $4,500\n\nExpected Infrastructure Type: Pilots, installations under $250K\n\nTier: Medium\n\nFee (USD): $9,000\n\nExpected Infrastructure Type: Infrastructure between $250K–$1M\n\nTier: High\n\nFee (USD): $18,000+\n\nExpected Infrastructure Type: Infrastructure over $1M or high complexity\n\nThese tiers allow us to serve a broad spectrum of projects, from early-stage EV networks to large-scale mining or solar deployments.\n\nOperator traction and early deployments\n\nWe’re actively validating and preparing real infrastructure projects for onchain tokenization:\n\n-   eHive (EV chargers): First validator integration completed and ready for tokenization in the Build phase. This marks our first full deployment across the validation and token issuance stack.\n    \n-   Bas3 (data centers): Validation logic is underway. We’re collaborating closely to complete the data ingestion and scoring process before designing the tokenization structure.\n    \n-   Solar and mining pipeline: We’ve initiated conversations with key stakeholders in Chile’s energy and mining sectors, including outreach through the Universidad de Chile Mining Engineering alumni network. These sectors attract significant investment at the corporate level, but mid-sized operators and high-potential projects often struggle to access efficient or transparent funding.\n    \n\nTo extend our reach, we’ve launched a strategic referral program targeting advisors, brokers, and consultants who are already connected to infrastructure operators, especially in mining and renewable energy. These experts often have first hand access to capital hungry projects and can help identify operators that would benefit from tokenizing their future revenue. By offering aligned incentives and a clear onboarding path, we turn industry knowledge into a scalable source of qualified leads and long term ecosystem partners.\n\n#### Revenue model\n\nOur business model is aligned with long-term platform growth and real asset performance. We monetize through:\n\n-   Investment fee: 1.5%, applied when investor funds are transferred and locked into the infrastructure-backed token issuance.\n    \n-   Management fees: 0.5%, charged on revenue streams distributed through our smart contracts.\n    \n\nThis dual-fee structure allows us to support infrastructure operators while creating a sustainable model for protocol operations and development.",
                        "stellar.tractionEvidence": "Since being selected for the Stellar Kickstart cohort on May 3rd, Dobprotocol has demonstrated rapid execution, delivering product, onboarding partners, and validating demand.\n\nProduct and technical milestones\n\nDob Validator\n\n-   We have developed and deployed on mainnet (https://validator.dobprotocol.com) our first version of Dobvalidator in almost 320 commits documented transparently in our repo: https://github.com/dobprotocol/dobvalidator\n    \n-   We accomplished full kickstart submission for July 4 (all four deliverables), just five weeks after receiving the funds on June 1st. All four deliverables of this project are ready and we are now on beta testing, allowing infrastructure operators to submit and track their project validations. \n    \n-   We launched a specific early investor program for Dobvalidator, creating high quality beta testers, in just 2 days (from 03/07/2025 to 05/07/2025) we have onboard more than 20 people at the time of this writing. Here is the form: https://forms.gle/5mEW95YkHmsh4FJr7 and here the whatsapp group of the program: https://shorturl.at/DiMLo \n    \n\nDob Token Studio\n\n-   ​​One Beta platform (on base network) launched at dobprotocol.com, enabling tokenization and real-time distribution of infrastructure revenues\n    \n-   Token Studio architecture scoped and aligned with Stellar asset standards to support programmable revenue tokens. \n    \n\nMarket and financials\n\n-   Three real-world infrastructure assets tokenized or in progress to be tokenized on-chain:\n    \n    -   EV chargers (eHive)(Tokenized)\n        \n    -   Solar panels (Infinita City)(to be tokenized)\n        \n    -   Data center infrastructure (Bas3)(to be tokenized). \n        \n-   Three additional operators in the mining sector undergoing Infra Readiness Sprint assessments. \n    \n-   Early pipeline includes over ten infrastructure projects, representing several million dollars in future tokenizable revenue.\n    \n-   Over 20 Web3 investment funds pitched through the Odisea Labs program\n    \n\nResearch and Academic Contributions\n\n-   Nine user experience tests conducted with early adopter community and inside team, all publicly in our UX/UI Repo here: https://shorturl.at/DOi14\n    \n-   5 peer-reviewed publications authored by our CTO Fernando Castillo: https://shorturl.at/d3Nyh\n    \n    -   “Trustworthy Decentralized Autonomous Machines: A New Paradigm in Automation Economy” - arXiv preprint, 2025, Co-authored with Simón Espínola and Oscar Castillo.\n        \n    -   “Towards Credential-Based Device Registration in DApps for DePINs with ZKPs” - IEEE International Conference on Blockchain, 2024\n        \n    -   “TrustOps: Continuously Building Trustworthy Software” - EDOC 2024 Workshops (iRESEARCH), 2024\n        \n    -   “Trusted Compute Units: A Framework for Chained Verifiable Computations” - arXiv preprint, 2025\n        \n    -   “Advocate—Trustworthy Evidence in Cloud Systems” - 6th Conference on Blockchain Research & Applications, 2024\n        \n    \n\nCommunity and Social Media Traction\n\n-   More than 43K impressions in our Q2 with an engagement rate over 11% in our last two months (May and June) on https://x.com/dobprotocol. 83 Total active subscribers in our mailing list (+18 news members the last month with Early Investor Program campaign) Here is our Social Performance Q2 Report: https://shorturl.at/QElRv\n    \n-   28 real beta testers onchain users trying dob validator:  https://shorturl.at/JGsDN\n    \n-   32 users on the product waitlist with Early Investor Program. Here is the link for the whatsapp group: https://shorturl.at/DiMLo \n    \n-   Over 340 community members on Telegram: https://t.me/dobprotocol_official\n    \n-   Only in the last month and a half we have been presenting Dobprotocol in 4 IRL events: Stellar en la Nube in Valdivia, Global Pizza Party Santiago, Ime Link at Matucana 100 and Charlas Stellares - Campus on Chain at Pontificia Universidad Católica de Chile. Here is the photo album: https://shorturl.at/c2Ick\n    \n-   We've participated in 6 online events (live on streaming): 3 “Infra Talks” sessions, the  first online space in LatAm to discuss DePIN (+1200 views); a Spotlight session with Tellus Cooperative, a collaborative latam project developed on Stellar (+125 views); and 2 build-in-public streams with our own community via X (+500 views). Here is all the metrics and details of this online events: https://shorturl.at/zosAc \n    \n\nAwards and Recognition\n\n-   Winners of the Stellar X Draper University Founder Residency 2025\n    \n-   Best Consumer Product at the Aleph Mantle Hackathon\n    \n-   Second place at AVAX Chile Pitch Demo Day 2025\n    \n-   Finalist at ApeCon Miami 2025\n    \n-   Named one of the Top 50 startups in Latin America by Rayuela (Lisk)\n    \n-   Finalist at Virtuals Hackathon 2025\n    \n-   Prototype delivered in under 24 hours for the Red Pill Challenge on Virtuals.\n    \n-   Accelerated by OdiseaLabs 2025\n    \n\nTeam\n\nWe are a team of 4 devs (CEO, CTO, Front end, Backend) and 4 business (CBO, CMO, CGO and UX)",
                        "stellar.tranche1Deliverables": "'-   Complete KYC provider integration (Weeks 1–2)\n    \n-   Develop investment marketplace user interface (Weeks 3–4)\n    \n-   Implement basic smart contracts for asset registration and investor participation (Weeks 5–6)\n    \n-   Conduct internal testing and iterative improvements (Weeks 7–8)\n    \n\nBudget Allocation: $38,000 (~26.5% of total)",
                        "stellar.tranche2Testnet": "'-   Launch testnet deployment of core features\n    \n-   Release investor dashboard with simulated portfolio and flows (Weeks 9–10)\n    \n-   Implement risk scoring system logic for infrastructure projects (Weeks 11–12)\n    \n-   Perform integration testing across UI, scoring engine, and contracts (Weeks 13–14)\n    \n\nBudget Allocation: $45,000 (~31.4% of total)",
                        "stellar.tranche3Mainnet": "'-   Complete integration with Anchor for mainnet deployment (Week 15)\n    \n-   Configure payout mechanisms for tokenized future revenue (Week 16)\n    \n-   Deploy Dobprotocol and Token Studio to Stellar mainnet (Weeks 17–18)\n    \n-   Onboard a minimum of 5 infrastructure operators\n    \n-   Launch at least 2 revenue-backed token offerings\n    \n-   Begin live monitoring, optimization, and structured feedback collection\n    \n\nBudget Allocation: $60,330 (~42.1% of total)",
                        "stellar.teamMembers": "Cristobal Oyarzun",
                        "stellar.urls": {
                            "website": "https://www.dobprotocol.com/",
                            "codeRepository": "https://github.com/dobprotocol/dobvalidator",
                            "videoURL": "https://youtu.be/ffMfuD6Q4lo"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/dobprotocol",
                            "twitter": "https://x.com/dobprotocol"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 47776.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 119860.73,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:13",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:moonlight-protocol",
                    "projectName": "Moonlight Protocol",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Brings private payments to Stellar Mainnet using a UTXO model and provider-mediated channels for compliance and control.",
                    "fundsApprovedInUSD": 134990.0,
                    "extensions": {
                        "stellar.productsAndServices": "Before continuing, we strongly recommend watching this demonstration video.\n\nMoonlight provides the full infrastructure and tooling required to enable compliant, privacy-preserving payments on Stellar. We deliver the complete protocol implementation, from smart contracts to SDKs and service frameworks, so ecosystem participants can build, operate, and integrate privacy-enabled services with reduced complexity. Our offering includes:\n\n-   Privacy Channels: On-chain Soroban solutions that maintain private UTXO ledgers, support multi-party bundled transfers, and enforce channel-specific asset and provider policies.\n    \n-   Trusted Privacy Provider (TPP) Framework: A modular off-chain relayer service that handles authenticated bundle submission. Moonlight provides a compliant-ready base implementation that can be customized and extended to meet specific regulatory needs, such as KYC or sanctions screening.\n    \n-   Moonlight SDK: A TypeScript library that abstracts UTXO key derivation, balance fragmentation, provider integration, and transaction lifecycle management, simplifying development.\n    \n-   Reference Wallet: A minimal, open-source client that connects to privacy channels via selected TPPs, enabling users to send private, self-custodied transactions with a unified UX.\n    \n-   Protocol Governance Layer: Smart contract layer for channel configuration, provider quorum management, and compliance policy enforcement at the protocol level.\n    \n\nThese components are delivered as open-source tools to reduce the entry curve for wallets, institutions, and service providers. Moonlight makes it easier to integrate privacy on Stellar while maintaining custody, composability, and regulatory flexibility.",
                        "stellar.technicalArchitecture": "https://moonlight-10.gitbook.io/moonlight-docs/readme/whitepaper",
                        "stellar.successCriteria": "Moonlight’s success will be judged on real usage, growing liquidity, and broadened asset coverage on Stellar Mainnet. We track four signals: provider count, daily transactions, private TVL, and supported assets.\n\nBy Month 3 after launch, the system should look alive, not lab-grade: at least 3 production Trusted Privacy Providers, 1 live wallet integration, 25–50 private transfers per day, and roughly $100 000 locked in a single XLM privacy channel.\n\nBy Month 6 after launch, we need clear traction: 6 active TPPs, 2 additional wallets or fintech partners, 150–200 daily transfers, over $250 000 held privately, and three assets (likely XLM, USDC, EURCV) flowing through multiple channels. These numbers show that users and liquidity stick around once the novelty wears off.\n\nBy Month 12 after launch, network effects should be visible: 10 or more TPPs including at least one regulated institution, 500-plus daily transfers, $1 million in private balances, and 5 assets serviced. Hitting these marks proves Moonlight can scale privacy without draining liquidity from Stellar’s public pools and sets the stage for private Soroban-based DeFi.",
                        "stellar.goToMarketPlan": "Moonlight’s launch strategy is built around one guiding principle: make privacy on Stellar feel like an overnight upgrade, not a multi-month integration project.\n\n1- Positioning & Core Promise\n\nMoonlight turns any wallet, exchange, or fintech running on Stellar into a privacy-enabled service—without forcing them to cede custody or rewrite their compliance stack. Everything is open source on day one, so the community can inspect, fork, and improve the code as it grows.\n\n2- Early-Mover Focus\n\nWe will start with three launch partners already in our pipeline: xBull Wallet (retail users), Palta Labs (infrastructure), and one EU-based institution partner from Aha Labs (e.g. Société Générale, etc). Their combined user base gives us immediate real-world volume and a feedback loop to harden the product before broad release.\n\n3- Three Phases, Twelve Months\n\n-   Developer Preview (Month 1-3) – We maintain one testnet privacy channel (XLM) and publish a TypeScript SDK, reference wallet, and tutorial quests on Stellar Quest.\n    \n-   Mainnet Pilot (Month 3-4) – After the SDF audit, we deploy audited contracts, activate the first mainnet channel, and register a quorum of three Trusted Privacy Providers (TPPs). Aha Labs also runs its own TPP for redundancy during the launch phase.\n    \n-   Ecosystem Expansion (Month 4-12) – We add USDC, EURCV, and two regulated assets, invite additional TPPs, and launch a permissionless-provider beta.\n    \n\n4- Adoption Channels\n\nWe rely on three low-cost levers: (a) co-marketing with partners through blog posts, X Spaces, and Stellar Meridian workshops; (b) hackathon sponsorships (e.g. Dora hackathon style) that award bounties for the best Moonlight integrations; and (c) in-wallet prompts that encourage users to upgrade to private transfers in a single click.\n\nWith a tight, phased rollout and concrete early adopters, Moonlight positions itself to become Stellar’s default privacy layer.",
                        "stellar.tractionEvidence": "Moonlight is already live on the Stellar testnet with a working proof of concept, including deployed Soroban contracts for UTXO-based transaction abstraction and off-chain components that support SEP-10-based authentication and bundle submission. This testnet implementation validates the core architecture and demonstrates the feasibility of compliant, private payments on Stellar. You can watch this demo video for more information.\n\nMoonlight is developed by Aha Labs, a leading Stellar integration partner with a proven delivery record. The team helped Société Générale-FORGE launch the EURCV stablecoin on Stellar, designed key portions of the Soroban/Stellar CLI, and maintains Loam, a Soroban developer toolchain with over 40K downloads across its CLI and SDK (according to Crates.io). Loam is in production or active pilots at firms like EquitX, Ziriz, Société Générale, and others.\n\nMoonlight has strong early interest from the ecosystem. xBull Wallet’s maintainer plans to integrate Moonlight privacy channels in its next release. Key SDF collaborators, including Tyler van der Hoeven and Tomer Weller, have reviewed and endorsed the architecture. Palta Labs has committed to integrating Moonlight once mainnet support is live.\n\nAs part of Station F since September 2024, Aha Labs has expanded its European institutional outreach and is already working with multiple financial institutions on tokenization and payments. Moonlight serves as a natural privacy and compliance extension to these ongoing engagements.\n\nMoonlight is also part of the 2025 cohort of the DraperU X Stellar residency program.",
                        "stellar.tranche1Deliverables": "#### Deliverable 1: Core Privacy Channel Contracts\n\nBrief description: Implement the core smart contracts required to operate a privacy channel on Stellar testnet. This includes the UTXO module, batch processing, liquidity tracking, and provider governance.  \nHow to measure completion: Successful deployment of the privacy channel to testnet with working UTXO execution logic. Public release of contract source code.\n\nDate of completion: 8/8/2025  \nBudget: $14,870\n\n--\n\n#### Deliverable 2: Initial SDK for Key Derivation and Signing\n\nBrief description: Develop the first release of the Moonlight TypeScript SDK, supporting deterministic key derivation and transaction bundle signing and core account abstraction.  \nHow to measure completion: SDK published to GitHub with working implementation for fully interacting with the core protocol in Testnet. Includes documentation and test examples.\n\nDate of completion: 8/15/2025  \nBudget: $13,960",
                        "stellar.tranche2Testnet": "#### Deliverable 1: Protocol Management Contracts and Channel Configuration\n\nBrief description: Implement and deploy the protocol management layer, enabling registration, configuration, and governance of privacy channels and provider quorums.  \nHow to measure completion: Protocol management contracts deployed to testnet. Privacy channel registered and configured via governance interface.\n\nDate of completion: 8/29/2025  \nBudget: $11,350\n\n--\n\n#### Deliverable 2: Trusted Privacy Provider (TPP) Service Deployment\n\nBrief description: Develop and deploy the first production-grade Trusted Privacy Provider backend in a staging environment, integrated with the testnet channel.  \nHow to measure completion: TPP server deployed with support for SEP-10 authentication, bundle relay, and logging. Live integration with testnet privacy channel.\n\nDate of completion: 9/12/2025  \nBudget: $16,175\n\n--\n\n#### Deliverable 3: Full SDK Integration and Public Testnet Release\n\nBrief description: Extend the SDK to support full interaction with the privacy channel and TPPs. Finalize and publish testnet deployment with public documentation.  \nHow to measure completion: SDK updated to support channel interaction, provider connection, and bundle submission. Public testnet environment released for developers.\n\nDate of completion: 9/19/2025  \nBudget: $11,350\n\n--\n\n#### Deliverable 4: Reference Wallet – Testnet Release\n\nBrief description: Launch a minimal, provider-agnostic wallet connected to the testnet privacy channel. The wallet will demonstrate the full transaction lifecycle from address derivation to UTXO submission.  \nHow to measure completion: Wallet deployed and capable of sending and receiving private testnet transfers via a registered TPP. Includes provider selection, signing flow, and basic UI.\n\nDate of completion: 9/26/2025  \nBudget:$14,235",
                        "stellar.tranche3Mainnet": "#### Deliverable 1: Security Audit and Remediation\n\nBrief description: Conduct a third-party (free) audit of all core Moonlight contracts through SDF's Audit Program. Team resources will then be allocated to implement and verify fixes for any critical or high-priority findings prior to mainnet deployment.  \nHow to measure completion: Formal audit report delivered. All critical and high findings resolved. Final audited contracts tagged for release.\n\nDate of completion: 10/17/2025  \nBudget: $16,175\n\n--\n\n#### Deliverable 2: Mainnet Deployment and Privacy Channel Activation\n\nBrief description: Deploy Moonlight Protocol V1 to Stellar Mainnet, including all audited contracts, the governance system, and the first asset-backed privacy channel (e.g. XLM). Register a quorum of production-grade TPPs.  \nHow to measure completion: Contracts deployed and verified on Stellar Mainnet. Channel active with live asset. Operational quorum of registered TPPs.\n\nDate of completion: 10/24/2025  \nBudget: $22,640\n\n--\n\n#### Deliverable 3: Reference Wallet – Mainnet Release and Monitoring Infrastructure\n\nBrief description: Release the mainnet-compatible version of the reference wallet with support for real asset transfers through live TPPs. Deploy monitoring tools and governance observability infrastructure to support operations and upgrades.  \nHow to measure completion: Wallet connected to mainnet and publicly available. Monitoring dashboards deployed. Governance tooling in place for TPP and contract lifecycle management.\n\nDate of completion: 10/24/2025  \nBudget: $14,235",
                        "stellar.teamMembers": "Enzo Soyer, fazzatti, Chad Ostrowski, Willem Neal Wyndham",
                        "stellar.urls": {
                            "website": "https://moonlight-10.gitbook.io/moonlight-docs",
                            "codeRepository": "https://github.com/Moonlight-Protocol",
                            "videoURL": "https://youtu.be/7q2lzW2EXek?si=gObzEiR03Woqu0kc"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/aha-labs-dev"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 44996.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 110031.26,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:14",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:stellar-transaction-visualizer",
                    "projectName": "Stellar Transaction Visualizer",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Stellar Transaction Visualizer is a professional-grade tool designed to help developers and users analyze, simulate, and debug Stellar blockchain transactions with clarity and ease. Built on modern web technologies, this visualizer transforms complex transaction data into intuitive, interactive experiences.  At its core, the platform features a dynamic visual graph that displays each transaction's flow - complete with color-coded connections, animated sequencing, and detailed operation nodes sho...",
                    "fundsApprovedInUSD": 50000.0,
                    "extensions": {
                        "stellar.productsAndServices": "We are building a Stellar Transaction Visualizer and Debugger, a developer-focused tool that makes it easier to understand, simulate, and debug both Stellar Classic and Soroban smart contract transactions. Using Stellar SDK and the Soroban client, the platform offers interactive visualizations, smart contract call analysis, testnet simulations, and error diagnostics. By clearly displaying the flow and structure of transactions, the tool supports both new and advanced developers building on Stellar. Future plans include providing a lightweight SDK for seamless integration into existing wallets and explorers, increasing its accessibility and ecosystem impact. This directly supports Stellar’s goal of growing a strong, tool-rich smart contract development environment.\n\nOur tool is not intended to compete with full-featured explorers like Stellar Expert, but rather to complement them by focusing specifically on transaction visualization, debugging, and Soroban smart contract introspection—features not currently offered in traditional explorers.\n\nWhile Stellar Expert excels at displaying transaction data and account history, it does not provide a flow-based view or interactive debugging for Soroban contracts. Our tool bridges that gap by offering a developer-friendly visual layer that shows the sequence and relationships between operations, contract calls, and errors.\n\nTo avoid duplicating existing explorers, we plan to release an SDK that enables platforms like Stellar Expert, Freighter, or custom dApps to embed our visual flow component or debugging features within their own UI. This modular approach reduces friction and increases adoption, allowing users to access deeper transaction insights without leaving their preferred explorer.\n\nUltimately, the goal is to integrate rather than compete, making our tool a back-end service and front-end component that can serve the broader Stellar ecosystem and enhance the debugging experience across tools.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1O5zpEHvipaswRPdukDhHyE9nNvz27XW8qtD_2FrtZkI/edit?pli=1&tab=t.0",
                        "stellar.successCriteria": "-   Developers can visualize Stellar and Soroban transactions in a clear flow format.\n    \n-   SDK is adopted by at least one external explorer or wallet.\n    \n-   The tool successfully supports both testnet and mainnet transactions.",
                        "stellar.goToMarketPlan": "Our primary audience includes developers building on Stellar and Soroban who need better tools for debugging and understanding transactions. The initial focus is to launch the tool for testnet transactions and gather developer feedback via Stellar community forums and Soroban channels. We will then release an SDK to enable integration into third-party explorers and wallets, increasing exposure. As the product matures, we aim to collaborate with existing tools like Stellar Expert for adoption",
                        "stellar.tractionEvidence": "While still in the early stages, I've made significant progress:  \nA working MVP is functional on the testnet.  \nA public demo and GitHub repository is already published.  \nI will start exploratory conversations with teams in the ecosystem regarding SDK integration and feedback collection.  \nI'm committed to ongoing community engagement and transparent development.  \n  \n*It's important to highlight that the tool has already been deployed as a fully functional MVP on testnet, allowing anyone to test it firsthand, a clear demonstration of both the project's feasibility and my technical capabilities.",
                        "stellar.tranche1Deliverables": "Phase 1 – MVP ($5,000) - Already ready.  \nDeliverables:  \nVisual flowchart of Stellar testnet transactions.  \nDisplay all operations with basic success/fail status indicators.  \nShow source account, operation types, and transaction metadata.  \nBasic error messaging for failed operations.",
                        "stellar.tranche2Testnet": "Phase 2 - Soroban MVP (Testnet) (20,000$)  \nDeliverables:  \nSmart contract execution simulator  \nReal-time debugger: logs, stack traces, CPU/memory insights  \nVisual operation flow (with animated logic graph)",
                        "stellar.tranche3Mainnet": "Phase 3 – SDK & Ecosystem Integration (25,000$)  \nDeliverables:  \nSDK release with comprehensive documentation  \nIntegration with selected community wallets and explorers  \nFull mainnet compatibility",
                        "stellar.teamMembers": "Gemy",
                        "stellar.urls": {
                            "website": "https://stellarvisualizer.vercel.app/",
                            "codeRepository": "https://github.com/NibrasD/Stellar-Transaction-Visualizer",
                            "videoURL": "https://drive.google.com/file/d/18_icO5JxnJvNv4doNqo-RwQH1SmNeBsl/view?usp=drive_link"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 16666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 42527.49,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:15",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:stellar-ai-agent-kit",
                    "projectName": "Stellar AI Agent Kit",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Enable secure, AI-powered interaction with Soroban contracts by generating MCP servers and streamlining smart wallet adoption through accessible Policy Signer tools",
                    "fundsApprovedInUSD": 108000.0,
                    "extensions": {
                        "stellar.productsAndServices": "Executive Summary:  \nAs AI agents become more prevalent in fintech and automation, developers need secure ways to let those agents interact with blockchain contracts. The Stellar AI Agent Kit offers the first complete toolchain for safely connecting AI agents to Soroban contracts using MCP servers and delegated signer infrastructure.\n\nThe Stellar AI Agent Kit is a secure developer toolkit designed to make Soroban contracts safely accessible to AI agents. It enables developers to expose contracts via Model Context Protocol (MCP) servers, while also providing signer infrastructure and testing tools to ensure predictable, permissioned execution.\n\nImportant note: This toolkit does not use LLMs to write or generate contracts. Developers still write their own contracts. The tools in this kit help generate supporting infrastructure—similar to how TypeScript bindings are generated from existing specs—not the core logic.\n\n1. MCP Server Generator (CLI Plugin)\n\nParses Soroban contract interfaces to generate MCP-compliant server bindings in both TypeScript and Python, following the Model Context Protocol (MCP) standard.\n\nImpact: This is not an AI tool writing contracts. It’s a developer utility—like TypeScript binding generators—that translates a contract’s existing spec into a format that AI agents can safely understand and call. With Python support, this makes Stellar contracts accessible from AI development platforms like LangChain, OpenAI, and Claude, without any backend boilerplate.\n\n2. Policy Signer Generator (Interactive CLI)\n\nA structured, interactive CLI that generates scoped signer rules from contract interfaces, allowing developers to define secure, rule-based policies for delegated execution.\n\nImpact: This tool does not use AI or natural language processing. It’s a straightforward developer utility—like a configuration assistant—that helps builders define signer logic using structured inputs. By leveraging the Soroban contract spec, it guides developers through permission setup (e.g. function-level access, destination restrictions, quotas) and outputs deployable signer configurations. This eliminates the need to write custom signer logic in Rust, while giving developers full control over what agents are authorized to do. It's an essential bridge to adopt Stellar’s powerful Policy Signers without deep protocol expertise.\n\n3. Policy Sandbox Web App\n\nA visual, browser-based simulator for testing how Policy Signers behave during various contract calls and transactions.\n\nImpact: Before connecting agents to real wallets, developers need to validate their signer logic. The Sandbox allows them to create test wallets, assign policies, simulate contract calls, and observe whether the signer allows or rejects the request—making it easier to debug and onboard safely.\n\n4. MCP Client SDK (npm)\n\nAn SDK to simulate transactions, manage delegated signing, and submit them to Stellar, fully integrated with MCP server outputs and smart wallet models.\n\nImpact: This SDK enables real applications—bots, voice agents, UIs—to safely interact with Soroban contracts through previously defined signer rules. With no need for full private key access, apps can execute contract logic within secure, delegated boundaries, guided by the developer’s own permissions setup.\n\n-  \n\nTogether, these tools form secure infrastructure—not speculative AI automation. They support developers by reducing boilerplate, enabling safe agent interactions, and enforcing strict contract-level controls across the entire lifecycle.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1yk4VSQFQrf35UfSnRO-OpOQ0rxs-dIjlh_GeZK4x_NA/edit?usp=sharing",
                        "stellar.successCriteria": "Success for this project means delivering a complete, secure, and composable toolchain that allows developers to build AI agents capable of interacting with Soroban smart contracts — regardless of their interface, language, or use case.\n\nWe will consider this submission successful when the following criteria are met:\n\nContract → MCP Server (Language-Agnostic)\n\n-   Developers can convert any Soroban contract into a fully compliant MCP server, using the CLI tool.\n    \n-   Both TypeScript and Python bindings are supported, enabling integration with a broad range of agent platforms (e.g. OpenAI, Claude, LangChain, ReAct, custom agents).\n    \n-   **Contracts produce AssembledTransaction XDRs and include auto-generated parameter validation and prompt-ready tool descriptions.  \n    **\n    \n\nPolicy-Based Agent Access\n\n-   Developers can create secure policy signer configurations through the Policy Signer Generator CLI, using only contract specs — no deep Rust/Soroban internals required.\n    \n-   **Signer logic can be safely tested in the Policy Sandbox Web App, simulating agent-triggered calls before deployment.  \n    **\n    \n\nAgent SDK Integration\n\n-   The MCP Client SDK allows any AI agent (chat, voice, or backend automation) to:\n    \n    a.  Discover tool functions from an MCP server,\n        \n    a.  Simulate transactions,\n        \n    a.  Sign with the correct delegated key (e.g. a policy signer),\n        \n    a.  Submit securely to Stellar via MCP-compatible flows.  \n        \n\nThis means developers can build:\n\n-   Voice-controlled wallets (“Send 10 USDC to my cousin”)\n    \n-   Chat agents that manage account permissions\n    \n-   **Automated agents that rebalance portfolios, initiate payouts, or optimize yield  \n    — all without needing full access to a private key.  \n    **\n    \n\nEcosystem Signals of Success\n\n-   At least 3 live agent demos (chat or voice-based) using the toolchain by external builders or during hackathons.\n    \n-   MCP CLI plugin is accepted into the Stellar CLI ecosystem or maintained as a widely adopted dev tool.\n    \n-   Public tooling and server endpoints maintain >99.9% uptime post-mainnet launch, tracked via our status page.",
                        "stellar.goToMarketPlan": "This is not a product commercialization campaign. It is a developer-focused release strategy aimed at delivering secure, composable infrastructure that enables AI agents to safely interact with the Stellar network. Our focus is on making Soroban contracts AI-accessible while preserving full developer control through signer policies, simulation tooling, and real-world agent integrations.\n\nOngoing Collaboration with Stellar’s Product Team\n\nThroughout development, we will work closely with the Stellar Product team to ensure alignment with the ecosystem’s long-term vision. This includes continued collaboration with VP of Product Nick Gilbert and John Canneto, who have already expressed support and emphasized how this work lowers the barrier to entry for new developers while prioritizing security through policy enforcement. Their feedback will guide integration priorities, plugin architecture, and documentation standards.\n\n-  \n\nPhased Release Plan\n\n-   **Phase 1 – MCP Server Generation  \n    **We will release the MCP Server Generator CLI, allowing developers to generate AI-ready servers directly from Soroban contracts. These tools will output AssembledTransaction-compatible interfaces, following Stellar best practices and schema conventions.  \n      \n    \n-   **Phase 2 – Smart Wallet Security via Policy Signers  \n    **Once MCP interfaces are in place, we will launch the Policy Signer Generator CLI and the Policy Sandbox Web App. These tools make signer configuration and testing approachable, without requiring Rust or Soroban internals.  \n      \n    \n-   **Phase 3 – Agent Integration & SDKs  \n    **The final phase includes a public release of the MCP Client SDK (npm), enabling developers to simulate, sign, and submit transactions from AI agents or applications through policy-governed, delegated execution.\n    \n\n-  \n\nDeveloper Community Commitment\n\n-   **Meridian 2025 Showcase  \n    Our roadmap is aligned with Stellar's next global developer event. We plan to present demos, onboarding materials, and working agent integrations at Meridian 2025** to accelerate developer adoption and ecosystem awareness.  \n    \n-   **AI + MCP Discord Channel  \n    We will propose and moderate a new #ai-agents-and-mcp** channel in the Stellar developer Discord, offering a space for discussion, support, and shared experimentation with agent-based architectures.  \n    \n-   **Open Feedback Loop  \n    **We’ll maintain ongoing engagement with the community via GitHub, Discord, and live office hours. Feedback will directly shape CLI improvements, signer workflows, and developer documentation.  \n    \n-   **Mentorship & Hackathon Support  \n    **As a multi-time Stellar hackathon winner and contributor to passkey and signer tooling, I’ll support new teams participating in AI tracks by offering technical guidance, sample projects, and one-on-one mentorship.  \n      \n    \n\n-  \n\nDeveloper Support Infrastructure\n\n-   **Centralized Documentation Portal  \n    **All tooling will be documented in a single, versioned site including CLI commands, SDK methods, signer templates, and example integrations.  \n      \n    \n\n**Stellar CLI Plugin Submission  \n**The MCP Server Generator will be submitted as an official Stellar CLI plugin, improving discoverability and aligning with broader ecosystem tooling standards",
                        "stellar.tractionEvidence": "The Stellar AI Agent Kit has rapidly evolved from a prototype into a working, multi-component toolchain with growing developer interest and internal ecosystem validation.\n\n✅ Ecosystem Validation\n\n-   Endorsed by Stellar Product Leadership: VP of Product Nick Gilbert described the kit as “key infrastructure” for the ecosystem, emphasizing its alignment with long-term goals of improving developer onboarding, riding the AI wave responsibly, and securing agent interaction via Policy Signers.\n    \n-   Supported by John Canneto (Product Team): Active feedback and alignment with product priorities show internal interest in moving this into more official tooling over time.\n    \n-   Stellar Core Contributor Feedback: After submitting a pull request to Stellar’s CLI, maintainers encouraged us to turn it into a plugin for long-term adoption, showing openness to deeper integration.  \n    \n\n🚀 Developer Demand\n\n-   Hackathon Momentum: In recent Stellar hackathons (both virtual and in-person), over 50% of submissions included AI agents. This overwhelming interest confirms a rising need for infrastructure like MCP servers and secure signer tooling.\n    \n-   Community Conversations: Discussions with multiple active Stellar developers confirmed that most teams are either experimenting with or exploring AI-powered interfaces—especially in agent-based apps, support automation, and financial tooling.  \n      \n    \n\n📦 Developer Adoption (npm)\n\nSince the initial launch of early prototypes:\n\n-   Released 4 npm packages supporting MCP server generation, signer rule creation, and contract metadata parsing.\n    \n-   Reached 2,047 total downloads in the first 7 weeks.\n    \n-   Peaked at 837 downloads in a single week, indicating strong early interest.\n    \n-   Usage has included developers from both AI-first platforms and core Stellar teams testing integration scenarios.  \n    \n\nThe initial npm distribution strategy was chosen to unblock early adopters while the project matured toward official plugin form. Despite being unofficial, it validated the tooling’s usefulness and accessibility.\n\n🧪 Working Prototypes\n\n-   Built a fully functional CLI tool that transforms Soroban contract specifications into MCP servers, outputting TypeScript interfaces compatible with both Stellar's AssembledTransaction model and Anthropic’s MCP agent standards.\n    \n-   Deployed and tested a working MCP Server implementation that supports:\n    \n    -   Agent-initiated transactions.\n        \n    -   Passkey-based smart wallets.\n        \n    -   Delegated signing via custom Policy Signers.  \n        \n-   Built the first version of the Policy Signer Generator CLI, allowing scoped policy definitions without Rust or signer internals\n    \n-   Developed a live Policy Sandbox Web App for developers to:\n    \n    -   Create and test smart wallets.\n        \n    -   Assign and simulate signer rules.\n        \n    -   Preview and debug real contract calls before production deployment.  \n          \n        \n\nTogether, these components already form a developer-friendly pipeline from contract → policy → agent interaction—something that didn’t exist in the Stellar ecosystem before.",
                        "stellar.tranche1Deliverables": "Timeline: We are targeting a 4–5 month accelerated delivery schedule aligned with Meridian 2025, Stellar’s flagship developer conference.\n\nWe are accelerating development to ensure a stable release of the Stellar AI Agent Kit is ready ahead of Meridian 2025. This milestone provides visibility, validates market readiness, and ensures the ecosystem has access to secure, production-grade tools for AI-integrated dApps on Stellar.\n\n-  \n\n🟩 Tranche 1 – CLI Plugin Conversion & Core Infrastructure\n\nGoal: Convert CLI prototypes into ecosystem-ready plugins and publish the foundational backend and agent flows.\n\nDeliverables:\n\n-   MCP Server Generator – CLI Plugin Integration\n    \n    -   Convert current MCP CLI into an official Stellar CLI plugin (as per feedback from core maintainers).\n        \n    -   Maintain TypeScript binding generation from Soroban specs.\n        \n    -   Preserve support for AssembledTransaction XDR output and schema validation.\n        \n-   Stellar MCP Server (Backend MVP)\n    \n    -   Lightweight backend for handling signed XDR submissions via passkey smart wallets or delegated signers.\n        \n    -   Integrated with LaunchTube and/or direct RPC endpoints.\n        \n-   Policy Signer Generator CLI (v1)\n    \n    -   Structured, interactive CLI to define scoped signer rules using contract specs.\n        \n    -   Outputs JSON or Rust templates compatible with passkey-kit and custom signer deployments.\n        \n    -   Focused on common rulesets (function scoping, recipient whitelists, limits).\n        \n-   Infra Setup\n    \n    -   CI/CD pipelines and GitHub Actions for generated servers.\n        \n    -   Standardized server packaging and deployment templates.  \n        \n-   Demo Agent\n    \n    -   Telegram or CLI agent showcasing a full flow: natural language prompt → MCP call → signed contract execution.\n        \n-   Standardization Effort – Phase 1\n    \n    -   Begin internal documentation and terminology alignment for agent + signer flows.\n        \n    -   Gather early developer feedback (not a formal SEP yet).  \n          \n        \n\nBudget: $36,000",
                        "stellar.tranche2Testnet": "Tranche 2 – Python Support, Policy Testing, and Developer Tools\n\nGoal: Expand access to Python devs, simplify signer testing, and launch developer-facing validation tools.\n\nDeliverables:\n\n-   Python Bindings for MCP Server Generator\n    \n    -   Generate Python-compatible MCP servers from contract specs.\n        \n    -   Supports LangChain, OpenAI Tool Calling, Anthropic, and other Python-based agent platforms.\n        \n-   Policy Signer Generator CLI (v2 - Focused Enhancements)\n    \n    -   Extend v1 with additional utility features (e.g. conditional inputs, common rule presets).\n        \n    -   Not a complete rework—improvements based on v1 feedback and real-world usage.\n        \n-   Policy Sandbox Web App (v1)\n    \n    -   Web UI for testing signer rules and contract calls using testnet identities.\n        \n    -   Visual output for accepted/rejected transactions and signer behavior explanations.\n        \n    -   Focused on onboarding, validation, and debugging—not meant for mainnet use.\n        \n-   Standardization Effort – Phase 2\n    \n    -   Combine Tranche 1 findings with developer feedback into a concrete draft standard.\n        \n    -   Optionally prepare a SEP if community interest supports it.  \n          \n        \n\nBudget: $36,000",
                        "stellar.tranche3Mainnet": "Tranche 3 – SDK, Starter Templates, and Production Tooling\n\nGoal: Finalize the ecosystem-facing components so developers can build real, secure agent-integrated apps with zero vendor lock-in.\n\nDeliverables:\n\n-   MCP Client SDK (npm v1)\n    \n    -   Type-safe client for simulating, signing, and submitting transactions to MCP servers.\n        \n    -   Includes full XDR lifecycle: simulate → sign → submit.\n        \n    -   Built for frontend, backend, and bot use cases.\n        \n-   Developer Templates & Starter Kits\n    \n    -   Production-grade templates for common agent flows (e.g. Telegram bot, smart wallet UI).\n        \n    -   Show integration between MCP servers, signer CLI, sandbox, and SDK.\n        \n-   Finalization of Standardization Work\n    \n    -   Publish final proposal or SEP draft (based on usage, feedback, and adoption signals)\n        \n-   Production Infrastructure Enhancement\n    \n    -   Security hardening, rate-limiting, monitoring for public-facing server deployments.\n        \n    -   Launch stable infrastructure for developers using generated MCP servers.\n        \n-   Developer Portal\n    \n    -   Full documentation site with CLI usage, SDK reference, sandbox walkthroughs, and integration guides.\n        \n    \n\nBudget: $36,000",
                        "stellar.teamMembers": "Jose Toscano",
                        "stellar.urls": {
                            "website": "https://stellarsandbox.dev/",
                            "codeRepository": "https://github.com/JoseCToscano/stellar-ai-demo",
                            "videoURL": "https://www.loom.com/share/1d0868ed999d4d1f958390ab2c63cc11?sid=d004d1a2-d010-4d46-bf8b-b8e743ce0cbc"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 36000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 90315.76,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:16",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:arkafund",
                    "projectName": "Arka.fund",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Offers a non‑custodial Soroban protocol that lets portfolio managers launch automated, multi‑asset funds (Arkas) and retail users invest with a single token.",
                    "fundsApprovedInUSD": 144000.0,
                    "extensions": {
                        "stellar.productsAndServices": "Arka.fund turns Stellar into a venue for professional‑grade, on‑chain portfolio management:\n\n-   One‑click Fund Creation – managers configure fees, asset whitelist, rebalance cadence, and deposit/withdrawal caps.\n    \n-   Atomic Rebalancing Router – executes best‑path, multi‑hop swaps across Aquarius, SoroSwap, Balanced AMM, and Blend lending adapter while respecting slippage limits.\n    \n-   Dual Coverage System – managers may lock part of their vault as insurance, while users can stake assets in a community coverage fund earning platform‑token yield to backstop catastrophic losses.\n    \n-   DAO Governance – powered by Soroban Governor & Timelock; token‑holders vote on asset listings, upgrades, and fee schedules.\n    \n-   Manager Tier Program – consistently profitable strategies unlock higher AUM ceilings and a greater share of protocol revenue.\n    \n\nEach feature is implemented with Soroban contracts (Factory, Arka, Router, Adapters, Governor, Timelock) and emits on‑chain events for full transparency.",
                        "stellar.technicalArchitecture": "https://github.com/dogstarapps/arka.fund/blob/main/technical-architecture.md",
                        "stellar.successCriteria": "'-   6 m TVL: $4 M\n    \n-   6 m Active Arkas: ≥20\n    \n-   12 m TVL: $8 M\n    \n-   User Retention: ≥60 % depositors rebalance ≥1×\n    \n-   Protocol Revenue (12 m): $200 k",
                        "stellar.goToMarketPlan": "1.  Dev‑first Alpha for Stellar community (Discord).\n    \n1.  Manager Onboarding – guided wizard, office hours.\n    \n1.  Liquidity Incentives – project & partner tokens for early TVL.\n    \n1.  Cross‑protocol Collabs with integrated AMMs and Blend.\n    \n1.  Thought Leadership – blog & Twitter Spaces on on‑chain asset management.",
                        "stellar.tractionEvidence": "'-   Prototype phase: Factory & Arka base contracts drafted and unit‑tested; Router design complete.\n    \n-   Letter of intent from infrastructure partner Ethernodes.io (custodian of >$160 M TVL) to supply validator infrastructure.\n    \n-   Previously collaborated with 10+ Stellar ecosystem projects\n    \n-   Dogstar ecosystem traction: >2k followers on X, XTAR token >6k holders (~$150 k liquidity), and >7.5k‑user Dogstar platform",
                        "stellar.tranche1Deliverables": "Tranche 1 – Minimum Viable Product (MVP) – $48 000\n\n-   Factory & Arka base contracts (Testnet)  \n    Measure: contracts deployed & 100 % unit‑test coverage.  \n    ETA: 26 Aug 2025.  \n    Budget: $12 k.\n    \n-   Router core + Aquarius adapter  \n    Measure: successful multi‑hop swap on Testnet.  \n    ETA: 2 Sep 2025.  \n    Budget: $15 k.\n    \n-   SoroSwap adapter & slippage logic  \n    Measure: integration tests pass (≤0.5 % slippage).  \n    ETA: 9 Sep 2025.  \n    Budget: $9 k.\n    \n-   Minimal React dApp (create / deposit / redeem)  \n    Measure: end‑to‑end flow captured in demo video (Testnet).  \n    ETA: 9 Sep 2025.  \n    Budget: $12 k.",
                        "stellar.tranche2Testnet": "Tranche 2 – Testnet Expansion – $48 000\n\n-   Balanced adapter (AMM)  \n    Measure: swap executed on Testnet.  \n    ETA: 16 Sep 2025.  \n    Budget: $8 k.\n    \n-   Blend lending adapter  \n    Measure: deposit / withdraw cycle on Testnet.  \n    ETA: 23 Sep 2025.  \n    Budget: $8 k.\n    \n-   Coverage Vault logic & manager lock  \n    Measure: manager can set and lock insurance percentage via contract call.  \n    ETA: 30 Sep 2025.  \n    Budget: $8 k.\n    \n-   Community Coverage Fund contract  \n    Measure: users can stake assets and receive yield token on Testnet.  \n    ETA: 7 Oct 2025.  \n    Budget: $8 k.\n    \n-   DAO contracts (Soroban Governor & Timelock)  \n    Measure: proposal executed on Testnet.  \n    ETA: 14 Oct 2025.  \n    Budget: $8 k.\n    \n-   Manager Tier module + UI  \n    Measure: tier upgrade triggered in dApp.  \n    ETA: 21 Oct 2025.  \n    Budget: $8 k.\n    \n    Protocol audit will be requested via the Audit bank immediately after completion of Tranche 2.",
                        "stellar.tranche3Mainnet": "Tranche 3 – Mainnet Launch – $48 000 – Mainnet Launch – $48 000\n\n-   Indexer & NAV API (serverless)  \n    Measure: NAV endpoint avg latency <200 ms.  \n    ETA: 27 Oct 2025.  \n    Budget: $12 k.\n    \n-   Monitoring & alerting stack  \n    Measure: PagerDuty alert triggers on simulated failure.  \n    ETA: 3 Nov 2025.  \n    Budget: $6 k.\n    \n-   Mainnet deployment (contracts)  \n    Measure: contracts verified on Mainnet explorer.  \n    ETA: 10 Nov 2025.  \n    Budget: $12 k.\n    \n-   Public SDK & developer docs  \n    Measure: npm package published + docs site live.  \n    ETA: 17 Nov 2025.  \n    Budget: $6 k.\n    \n-   Launch of ≥5 whitelisted Arkas  \n    Measure: aggregated Mainnet TVL ≥$100 k.  \n    ETA: 24 Nov 2025.  \n    Budget: $6 k.\n    \n-   Liquidity incentives module  \n    Measure: incentive distribution transaction executed.  \n    ETA: 1 Dec 2025.  \n    Budget: $6 k.",
                        "stellar.teamMembers": "Jordi Viladiu, Marcos Oliva Morente, Alphagrowth Sl",
                        "stellar.urls": {
                            "website": "https://arka.fund/",
                            "codeRepository": "https://github.com/dogstarapps/arka.fund",
                            "videoURL": "https://arka.fund/akrfund.mp4"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 48000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 117375.36,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:17",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:rivool-finance-rwa-in-emerging-markets",
                    "projectName": "Rivool Finance: RWA in Emerging Markets",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Earn yield from real credit opportunities in emerging markets",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.productsAndServices": "What we’re adding\n\n-   End-to-end deal manager on Rivool: onboarding, KYC, asset tokenisation, servicing.\n    \n-   Live tokenised pools of Brazilian private-credit sourced from regulated originators.\n    \n-   Investor portal for FI advisors and funds with real-time risk analytics and collateral tracking.\n    \n\nHow Stellar helps\n\n-   Soroban smart-contracts automate issuance, coupon/principal sweeps, and role-based access control.\n    \n-   Wallet abstraction via Stellar SDK lets TradFi users invest with e-mail/passkey—no crypto set-up.\n    \n-   Native stablecoin rails + fiat on-ramps move capital in and out instantly, cutting FX and custody friction.\n    \n\nImpact\n\n-   Bridges global capital to low-volatility, high-yield emerging-market credit—in days/weeks, not months.\n    \n-   Proves Stellar as a fully compliant RWA backbone, opening a US $120 B addressable funding gap in Brazil rural credit\n    \n-   Delivers cheaper credit to 500+ farmers while giving 200+ investors a +9 % USD net yield.",
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1k4h9dzK0UN51AiotbFfea4m6NOOe8x6l/view?usp=sharing",
                        "stellar.successCriteria": "Define what “success” looks like: Launch our first US$2M credit pool on the Stellar blockchain\n\nOutput: Onboard 200 investors to a Stellar-based pool that deploys credit to 500 small and mid-sized farmers.\n\n  \nOutcome: Create the first global channel for financing middle-market farms in emerging markets.",
                        "stellar.goToMarketPlan": "Target audience and channels:\n\n-   Global investors seeking stable yield (9%+) from real-world assets\n    \n-   Primarily in the US, Europe, and Latin America\n    \n\nChannels:\n\n-   B2B: we have a waitlist of 480 independent financial advisors in Brazil which we will offer them our pools in partnership\n    \n-   B2C: We have a +1.200 accredited investors waitlist in Brazil with more than 1M USD in investments offering our pools\n    \n-   Partner Network: Asset Managers who wants build private credit pools on-chain\n    \n\nStrategic partners or pilots:\n\n-   Local Partnerships with Fintechs – we’ve partnerships and MOUs’ signed with rural credit originators operations already tokenized\n    \n-   Veriff – KYC/KYB/AML provider integrated from day one\n    \n-   Machado Meyer Law firm incubator – Ongoing legal partner advising on regulatory structuring (CVM 88, CVM 160), connection with institutional players and investors roadshows\n    \n-   Polygon & Stellar – Cross-chain tokenization and yield distribution infrastructure\n    \n-   Select group of global early investors in the waitlist\n    \n\nHow we'll measure early adoption:\n\n-   $ 2.000.000,00 in net new money on Stellar Pools\n    \n-   200 new investors onboarded on a pool \n    \n-   Monthly active wallets receiving yield via Stellar smart contracts",
                        "stellar.tractionEvidence": "Since launching our Polygon main-net MVP in January 2025, Rivool has moved from idea to proven execution. We have already tokenised R$ 3.6 million in Brazilian private-credit assets and signed a contract to expand that figure to R$ 10 million with Nagro Securitizadora. All loans are current—zero defaults—benefitting 131 rural producers across 23 states while delivering 9-11 % net USD yield to investors.\n\nDemand is strong: 1 269 qualified investors and 480 financial-advisor leads have joined our wait-lists. Strategic partners are in place, including Nagro for origination, Veriff for KYC/AML, and Machado Meyer’s incubation programme for legal oversight. We also receive infrastructure credits from the AWS and Google for Startups programmes.  \n \n\n-   Research:\n    \n    -   Rivool Articles\n        \n    -   Market Report\n        \n    -   Complementary documentation\n        \n    -   Market Data\n        \n    -   Proof of go to market events/research\n        \n    \n-   Waitlists, signups, or beta users\n    \n    -   1269 Qualified Leads list on our platform\n        \n    -   480 Qualified Leads list of financial advisors  \n        \n-   Partnerships\n    \n    -   Machado Meyer Law Firm Incubation program\n        \n    -   Nagro Agro Securitizadora (Fintech credit originator)\n        \n    -   Veriff - for KYC/AML services\n        \n    -   Amazon for startups - Credits on AWS services\n        \n    -   Google for startups - Credits on Google services\n        \n\n  \nOn-chain activity is publicly verifiable through our live pools at Polygon mainnet live investment pools\n\n-   0xF82CD8Fb23e378F66855F6Bd5D22Bb3BEFc3bBF1\n    \n-   0x230D1Ad3dd891630aAab7E36AcF0d8193a26b019  \n    \n\nSupporting resources—market reports, blog posts, and traction dashboards—are available on our website and linked drive folders. Building on this foundation, our roadmap targets US $1.5 billion TVL within ten years, with Stellar’s cost-efficient Soroban contracts and native stablecoin rails chosen as the critical next step to reach that scale.",
                        "stellar.tranche1Deliverables": "##### Deliverable 1: Core RWA Smart Contracts\n\n##### Description: Develop foundational Soroban contracts for tokenizing rural credit pools, including issuance, yield distribution, and role-based access control. Note: Although the team has experience with EVM-based smart contracts (Polygon), this deliverable includes new Soroban contracts designed specifically for Stellar. Contracts will follow a modular, upgradeable proxy pattern and cover issuance, yield distribution, and multi-role access control.\n\n##### How to Measure Completion:\n\n-   Functional smart contracts for pool creation and token issuance\n    \n-   Automated yield distribution system tested locally\n    \n-   Access control with investor/manager/auditor roles implemented\n    \n\n##### Estimated Completion Date: August 30th, 2025\n\n##### Budget Allocation: $35,000 USD\n\n##### Deliverable 2: Passkey Wallet Abstraction\n\n##### Description: Build email/passkey authentication system enabling non-crypto investors to participate without managing private keys.\n\n##### How to Measure Completion:\n\n-   Working prototype with WebAuthn integration\n    \n-   Account creation in under 60 seconds\n    \n-   Recovery mechanism functional\n    \n\n##### Estimated Completion Date: September 15th, 2025\n\n##### Budget Allocation: $15,000 USD",
                        "stellar.tranche2Testnet": "##### Deliverable 3: Testnet Deployment & Validation\n\n##### Description: Deploy all contracts to Stellar testnet with comprehensive testing including load tests and integration validation.\n\n##### How to Measure Completion:\n\n-   All contracts deployed and verified on testnet\n    \n-   Successful stress test with 1000+ simultaneous transactions\n    \n-   Integration test suite passing 100%\n    \n-   Security validations\n    \n\n##### Estimated Completion Date: September 30th, 2025\n\n##### Budget Allocation: $15,000 USD\n\n##### Deliverable 4: Banking Orchestration for Fiat Onramp\n\n##### Description: Integrate an automated banking orchestration system to enable fiat-based investments. Scope includes sandbox-level testing with PIX and TED/TEF via Assas and Grafeno. This integration aims to reduce onboarding friction for investors using Brazilian fiat and simulate token issuance based on successful payment events.\n\n-   Functional integration in sandbox/testnet environment\n    \n-   Simulated investment using a local bank account processed successfully\n    \n-   Automatic reconciliation and token issuance triggered by payment confirmation\n    \n\n##### Estimated Completion Date: September 30th, 2025\n\n##### Budget Allocation: $7,000 USD\n\n##### Deliverable 5: Create the Portfolio Manager and Financial Advisor Portals\n\n##### Description: Integrate and automate the developed risk system analysis and go/no-go system to a new portfolio manager area. Additionally, to launch a user interface for financial advisors to manage their referred clients increasing platform adoption. Financial advisors will be selected from our waitlist of 480+ leads, and feedback will be collected via structured NPS-style forms and interviews.\n\n##### How to Measure Completion:\n\n-   Functional portfolio manager portal with real-time access to risk assessments and investment decisions.\n    \n-   Onboard at least 5 waitlisted financial advisors partners to test the platform and provide feedback\n    \n-   Advisor dashboard live with client referral management features.\n    \n-   User feedback collected and ≥80% satisfaction rate in initial pilot.\n    \n\n##### Estimated Completion Date: October 30th, 2025\n\n##### Budget Allocation: $28,000 USD",
                        "stellar.tranche3Mainnet": "##### Deliverable 6: System Integration & Feedback Optimization\n\n##### Description: Refine end-to-end platform workflows based on testnet findings and user feedback. Enhance integrations between smart contracts, the investor interface, portfolio manager tools, and banking orchestration layers. Establish continuous feedback loops to improve user experience and operational performance ahead of mainnet deployment. \n\n##### How to Measure Completion:\n\n-   All user-facing systems connected via API or direct calls to on-chain contracts\n    \n-   Real-time error tracking and system logs implemented\n    \n-   UX improvements based on feedback from at least 10 test users\n    \n-   Internal dashboard live for monitoring investment flows and user interactions\n    \n-   All components pass pre-launch QA checklist\n    \n-   Security validations\n    \n\n##### Estimated Completion Date: November 15th, 2025\n\n##### Budget Allocation: $15,000 USD\n\n##### Deliverable 7: Mainnet Launch & First Pool\n\n##### Description: Deploy audited contracts to mainnet and launch first $2M rural credit pool with 200 investors; Pool activation & monitoring setup; Investor onboarding & KYC ops;\n\n##### How to Measure Completion:\n\n-   Mainnet contract addresses published and verifiable\n    \n-   Pool fully subscribed with $2M tracked on-chain\n    \n-   All investor accounts active and mapped to tokens\n    \n-   Fiat-to-token flow tested and used in real conditions\n    \n\n##### Estimated Completion Date: December 10th, 2025\n\n##### Budget Allocation: $35,000 USD",
                        "stellar.teamMembers": "Felipe Sena, Tiago Piassum, Cristiano Oliveira, Lorrayne, Hallan",
                        "stellar.urls": {
                            "website": "https://rivool.finance/",
                            "codeRepository": "https://gitlab.com/rivool-finance/asset-smart-contract",
                            "videoURL": "https://www.youtube.com/watch?v=Bzy9zzWSs6c"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/rivool-finance/",
                            "twitter": "https://x.com/rivoolfinance"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 127582.46,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:18",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:indentura",
                    "projectName": "Indentura",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "Rebuilding credit markets on top of stablecoin rails.",
                    "fundsApprovedInUSD": 120000.0,
                    "extensions": {
                        "stellar.productsAndServices": "Indentura lets borrowers pledge high-quality offchain collateral and draw on stablecoin credit lines from a global onchain liquidity pool. Our offchain infrastructure gives lenders enforceable legal claims and real-time visibility into collateral while preserving borrower privacy.\n\nOur first product enables speciality lenders to access revolving credit lines to manage cash flow more effectively and also offer similar revolving products to SMEs.\n\nTo do so, we’re developing three key pieces of infrastructure:\n\n1.  Soroban Credit Vaults: Vaults that support ERC-4626 behavior on deposit and ERC-7540 on withdrawal, adapted to Soroban’s native architecture. At a high level, a lender deposits Stellar USDC into a vault, and receives in return a yield-bearing receipt/share token representing its position. The vault allocates all deposited capital into whitelisted protocols to generate yield. When a borrow wants to draw down a credit line, a designated MPC wallet calls a function to unwind yield positions and release stablecoins or offramped USD to the borrower. Interest is accrued and tracked on a block-by-block basis. This represents a new asset primitive for the Stellar ecosystem and an adaptable vault standard that leverages best practices from EVM protocols to interface between onchain and offchain capital flows, driving real-world utility to Soroban.\n    \n1.  Custody and Compliance: Vault depositors require a legal security interest over the collateral backing their credit exposure. Borrowers, in turn, require institutional-grade interfaces, including bank accounts for fund disbursement and MPC wallets to manage on-chain obligations. This demands a legal and operational layer built around bankruptcy-remote SPVs that support custody, loan servicing, and payment flow management on behalf of vault participants. We’re building the robust, institutional-grade bridge required for assets to flow safely between traditional legal structures and the Stellar network.\n    \n1.  Reporting and Automation: Moving funds from a Stellar USDC vault deposit to a borrower’s bank account involves treasury operations across various systems, including yield management, compliance checks, and disbursements. On repayment, syncing borrower data back to on-chain vault interfaces requires connecting private data warehouses with privacy-preserving pipelines. This infrastructure ensures capital flows and reporting are seamless, secure, and trustworthy for all participants.\n    \n\nThis grant will allow us to develop and launch these infrastructure components on Soroban, beginning with a live credit facility for a U.S.-based specialty lender. It’s the first step toward building stablecoin-native credit rails that are programmable, transparent, and globally accessible.",
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1yIp7U9HXTbqb99xsBUmvB8C96LQXtI57A7fijTXf5v4/edit?usp=sharing",
                        "stellar.successCriteria": "We’ll consider this build successful if we meet the following criteria:\n\n-   One real-world borrower is live on mainnet, accessing a stablecoin-denominated credit line via Soroban vault infrastructure.\n    \n-   One lender vault is deployed and capitalized, with $500k of Stellar USDC earning yield via a mix of DeFi strategies and borrower repayment.\n    \n-   At least one half of a repayment cycle is completed, demonstrating stablecoin flow from vault to borrower and back through fiat on/off-ramp infrastructure.\n    \n-   All supporting infrastructure is live: custody (MPC), legal structure (SPV), and lender-facing reporting.\n    \n-   End-to-end flows are auditable via on-chain data and off-chain reporting, ensuring transparency for vault participants and protocol stakeholders.\n    \n\nImpact:\n\nThis launch will demonstrate that stablecoins can serve as more than just payment rails. They can function as the foundation for programmable, enforceable credit infrastructure. That opens the door to:\n\n-   Improved capital access for businesses excluded from traditional credit.\n    \n-   New sources of yield for lenders seeking real-world exposure beyond volatile DeFi tokens.\n    \n-   A new class of financial products on Stellar that serve real economic activity.\n    \n\nThis deployment will serve as a reference implementation for future vaults and borrowers, laying the foundation for permissionless credit infrastructure across the Stellar ecosystem.",
                        "stellar.goToMarketPlan": "We’re sequencing our go-to-market by pairing crypto-native capital with real-world borrowers, starting with a market wedge where stablecoin mechanics unlock new products that banks and credit funds can’t offer.\n\nOur distribution strategy scales both capital and credit demand, with each phase unlocking new types of depositors and borrowers. A more detailed view into our 4-phase expansion plan can be found in the Indentura Thesis Document here: https://www.notion.so/indentura/Indentura-Thesis-Document-225c4663170780adb8e5de0045ac1224.\n\nInitial Borrower Strategy\n\nOur first borrower will be a U.S.-based specialty finance company that originates term loans or revenue based financing to small businesses and has expressed explicit demand for a revolving credit structure. We are collaborating directly with this partner to structure the initial facility, validate the legal + off-chain infrastructure, and confirm repayment data flows.\n\nThis initial borrower relationship gives us:\n\n-   A controlled underwriting + servicing relationship.\n    \n-   Clear operational requirements for drawdowns and repayments.\n    \n-   A proving ground for cross-chain and off-chain capital orchestration.\n    \n\nInitial Lender Strategy\n\nOur first vault will be capitalized through closely held sources: the team, advisors, and aligned partners with experience in DeFi and credit underwriting. These stakeholders understand the risk profile and serve as both early liquidity providers and feedback channels.\n\nWe especially want to focus on lenders who already have positions in DeFi protocols, as Indentura provides an additional way to stack yield on top of their existing positions.\n\nThis demonstrates:\n\n-   Programmatic yield movement between DeFi and borrower capital.\n    \n-   Stablecoin liquidity that can be committed, drawn down, and repaid.\n    \n-   Transparent, auditable performance and credit behavior.\n    \n\nFuture Growth\n\nOnce the first facility is live and stable, we will expand across both borrower and lender channels:\n\n-   Borrower side: additional specialty finance firms, fintechs offering embedded credit products, and eventually businesses operating entirely on stablecoins.\n    \n-   Lender side: crypto-native family offices, DAO treasuries, and eventually fintechs or neobanks embedding Indentura-powered yield products.\n    \n\nOver time, we aim to support the creation of permissionless credit vaults, enabling anyone to launch programmable credit pools backed by real-world collateral, with Stellar serving as the primary infrastructure layer for compliance, liquidity, and settlement.",
                        "stellar.tractionEvidence": "Our approach to validation is grounded in our team’s experience in the credit industry. Our founder, Tom Meister, has structured debt transactions at both funds and fintechs, led legal and operations at unicorn fintech companies, and advised and backed leading DeFi lending protocols. His background gives us confidence that this pain point, the absence of flexible, programmable credit infrastructure, is both acute and systemically underserved.\n\nThat perspective led us to validate the problem directly with our target users: nonbank specialty lenders. We’ve already received clear confirmation through direct conversations and formal letters of support, one of which is enclosed below.\n\nThe lender, a U.S.-based specialty finance firm originating term loans to SMBs, provided a signed letter describing the structural challenge: they cannot access or offer revolving credit due to limitations in how their capital sources operate, and the inefficiencies of traditional financial rails.\n\nIn the letter, their CEO writes:\n\n“If lenders like [us] could draw on a revolving credit facility in stablecoins, we would incur significantly lower interest costs and could pass the savings along to our borrowers... We would be interested in piloting a borrower-facing revolving credit facility backed by stablecoins.”\n\nHe also confirms this is an industry-wide issue:\n\n“Virtually none of … businesses [like ours] are able to access revolving bank lines of credit, and so we are forced to obtain term loan credit facilities that present the financial drawbacks I have described above. This puts businesses like [ours], and the small and medium sized businesses we serve, in a much worse position than we would be in if revolving credit were available.”\n\nThe full letter is enclosed and signed. We’re currently in active discussions with other specialty lenders facing the same problem and can secure additional letters over the coming weeks, if needed. We have also received interest from a venture philanthropy looking to deploy this type of solution within their market. A copy of their signed letter of support is also attached.\n\nThis validation affirms strong borrower demand and growing pull from institutional participants who, while traditionally unfamiliar with crypto, are eager to adopt Stellar-based solutions that solve real-world capital inefficiencies.\n\nSupport letters are available at https://drive.google.com/drive/folders/1LGQLNPqNh380raMT_UG2hRzAagavhi8i?usp=sharing.",
                        "stellar.tranche1Deliverables": "This tranche covers the design of the core smart contract architecture and the structuring of our first real-world credit facility. It includes prototyping of the Soroban vault system, legal design for off-chain custody, and scoping the first borrower credit line, including underwriting and capital sourcing.\n\nCompletion:\n\n-   Credit Vault specification document (architecture and flow diagrams).\n    \n-   Legal scaffolding specification for custody and interest representation.\n    \n-   Onboarded into Fireblocks with a test MPC wallet created.\n    \n-   Draft or signed borrower term sheet and credit memo.\n    \n-   Frontend mockup showing lender deposit and borrower drawdown flow.\n    \n\nTimeline: 6 weeks\n\nBudget: $40k in XLM",
                        "stellar.tranche2Testnet": "This tranche funds full testnet deployment and simulation of vault + borrower flows, including lender deposits, yield allocation, drawdowns, fiat ramping, and repayments. We will also build frontend functionality to interact with test contracts.\n\nCompletion:\n\n-   Soroban Credit Vault contracts deployed to testnet (contract address provided).\n    \n-   Transaction history showing: lender deposit, DeFi allocation, borrower drawdown, and repayment.\n    \n-   Testnet yield integration (e.g., Blend) with logs confirming allocation and unwind.\n    \n-   Final or near-final borrower credit agreement or servicing workflow documentation.\n    \n\nTimeline: 4 weeks\n\nBudget: $40k in XLM",
                        "stellar.tranche3Mainnet": "This tranche covers mainnet deployment with real capital and a live borrower, validating end-to-end use of stablecoin rails, custody, and repayment. It marks the first production credit line on Indentura’s infrastructure.\n\nCompletion:\n\n-   Audited Soroban Credit Vault contracts deployed to mainnet (contract address shared).\n    \n-   Fully functional front end with lender deposit and withdrawal flows enabled.\n    \n-   Signed credit agreement with borrower (redacted version or summary deck).\n    \n-   Borrower’s mainnet Fireblocks wallet address or bank account set-up (if fiat).\n    \n-   Legal formation documents for SPV structure.\n    \n\nTimeline: 6 weeks\n\nBudget: $40k in XLM",
                        "stellar.teamMembers": "Thomas Meister",
                        "stellar.urls": {
                            "website": "https://www.thawdigital.com/",
                            "videoURL": "https://www.youtube.com/watch?v=AKWE7L7jNR0"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 88803.87,
                                "denomination": "XLM"
                            }
                        ]
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf_37:grantApplication:19",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf_37",
                    "grantPoolName": "scf_37",
                    "projectsURI": "",
                    "projectId": "daoip-5:stellar:project:liqvidxyz",
                    "projectName": "Liqvid.xyz",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "",
                    "status": "Awarded",
                    "description": "A firm commitment to deploy on Stellar and bring yield-generating institutional tokenized RWAs.",
                    "fundsApprovedInUSD": 137500.0,
                    "extensions": {
                        "stellar.productsAndServices": "Liqvid X Stellar (product deck)  \nhttps://docsend.com/v/v5rxq/stellar_scf  \nThe grant will enable Liqvid to bring institutional-grade infrastructure to Stellar for compliant tokenization, capital formation, and secondary liquidity for tokenized private market assets.\n\nWe aim to onboard the first $5–10M from institutional investors into initial tokenized deal(s).\n\nSpecifically, we plan to:\n\n-   Deploy smart contracts for compliant RWA issuance, redemption, and investor access control (on Stellar L1 or Soroban)\n    \n-   Onboard the Liqvid platform to Stellar, utilizing L1 or Soroban to issue tokenized private market deals\n    \n-   Launch the first institutional-grade tokenized transactions on Stellar, targeting $5–10M in AUM\n    \n-   Promote this first deal as a flagship use case to drive future AUM/TVL growth and attract institutional attention to both the Stellar ecosystem and Liqvid platform. This transaction will serve as a live showcase of our partnership—positioning Liqvid as a trusted infrastructure provider and Stellar as a high-performance blockchain for institutional-grade yield opportunities in private markets.",
                        "stellar.technicalArchitecture": "https://drive.google.com/drive/folders/1hiDCh3sdYA-tFPiQuTSTP4W5eFZR6Vkp?usp=sharing",
                        "stellar.successCriteria": "Success = Real institutional capital and programmable RWAs deployed via Stellar.\n\nWhat does success and impact look like?\n\n-   $3M+ AUM Deployed through Stellar (minimum)\n    \n-   1+ Fully Tokenized Deal live on Soroban with yield-generating asset flow\n    \n-   Verified Institutional LPs onboarded through KYC/KYB\n    \n-   Integration with rwa.io or similar for public AUM/TVL tracking\n    \n-   All compliance and contract logic live and tested in production\n    \n-   First omnichain RWA-ready asset on Stellar, enabling future expansion through Asterizm cross-chain stack\n    \n\nBonus impact: We demonstrate Stellar as a credible Layer 1 for institutional-grade private credit — compliant, fast, and yield-enabled.",
                        "stellar.goToMarketPlan": "Liqvid is already live on mainnet in production with $3M+ AUM deployed (off-Stellar). This grant will help us bring the next $5–10M of institutional assets on-chain via Stellar.\n\nGo-to-Market Strategy Includes:\n\n-   Deal Syndication via Partner Network: We collaborate with originators and family office allocators to onboard real yield private credit deals.\n    \n-   Investor Pipeline: Liqvid already has institutional LPs in onboarding, seeking 10–15% APR tokenized deals. The first Stellar-based deal will be distributed directly to this network.\n    \n-   Showcasing Real Yield on Stellar: The tokenized deal launched on Stellar will act as a live showcase for the ecosystem. We will actively promote the structure (non-promotional, educational content only) to demonstrate technical viability and yield performance.\n    \n-   Integration into Liquidity Aggregators: Liqvid’s assets will be listed in analytics and tracking tools (e.g., rwa.xyz, rwa.io) to ensure visibility.",
                        "stellar.tractionEvidence": "🚀 Liqvid Protocol v1 launched June 6, 2025\n\n✅ First tokenized deal raised: $12,000,000\n\n💲 Current AUM/TVL: $5,040,000 (deployed)\n\n-   Attracted participation from multi-strategy funds and treasury managers targeting double-digit yield\n    \n-   Full backend and compliance infrastructure live, including KYC/KYB, wallet onboarding, and transaction management\n    \n-   Multiple tokenized deal pipelines in progress, representing over $20M in potential AUM\n    \n\nDisclaimer:\n\nIntegration with RWA.io is currently in progress. To view Liqvid’s real-time AUM/TVL, investors must complete onboarding on the platform.\n\nAccess is available exclusively to verified institutional participants. Public visibility of AUM/TVL via RWA.io will be available soon.\n\nYou can use this screenshot from platform dashboard\n\nhttps://docsend.com/v/v5rxq/dealstvl\n\nGITHUB: https://github.com/Liqvid-Protocol\n\nBASE: https://basescan.org/address/0xBF2a0573b7fdEA7c9308888F4C994f469F42aE46#code\n\n📈 Deal Flow\n\n$75M+ in live deal flow now available on Liqvid v1\n\nTargeting double-digit net APR for qualified investors\n\nDEALS TEASERS  \nhttps://docsend.com/view/s/8yxqbjdbi4rrzxs2\n\n🧳 Investor Onboarding\n\nOver $5B in estimated AUM from onboarded investors\n\nIncludes multi-strategy funds, family offices, treasury managers, credit funds, hedge funds, and HNWIs\n\n🎯 Boosts & Incentives\n\nFirst yield boosts secured from L1 blockchain\n\nIncentivizing up to $10M in tokenized assets\n\n##### 🏆 Recognition\n\nTop 4 Protocol at Paris Blockchain Week\n\nFinalist at WebSummit Qatar\n\n##### Pre-seed closed in 10 days\n\nbacked by: Optic Capital | Blockchain Founders Fund | V3NTURES |\n\nFunders VC | WebWise Capital | Cicada Capital | Oversubscribed Capital\n\n##### ✨ The first official event for institutional investors and capital allocators took place in May 2025 in Dubai as part of Token2049.\n\nhttps://www.linkedin.com/feed/update/urn:li:activity:7327763755088404480\n\n✅ In process of listing at https://www.rwa.io/ live data will be available soon with $5 040 000 in AUM/TVL",
                        "stellar.tranche1Deliverables": "Omnichain stack Integration on Soroban for Liqvid baskets\n\nBrief Description:  \nPort Asterizm’s omnichain cross-chain logic to Soroban (Rust/WASM) to enable messaging and validation between Stellar and other chains.\n\nDeliverables:\n\n-   Soroban-native Initializer and Translator contracts\n    \n-   Event-emission logic and hash/xID generation for Asterizm relayers\n    \n-   Off-chain relayer and Docker tooling adapted to Soroban\n    \n-   Full E2E simulation of messaging from Stellar to EVM testnet\n    \n\nHow to Measure Completion:\n\n-   Contracts deployed to local and Soroban devnet\n    \n-   Relayer detects Soroban events and validates hash/xID\n    \n-   Cross-chain simulation succeeds with proof relay (with any EVM chain)\n    \n\nEstimated Completion:  \nSeptember 25, 2025\n\nBudget Allocation:\n\n-   Smart contract & relayer development: $35,000\n    \n-   Backend/off-chain agent work: $10,000\n    \n-   Internal QA & test infra: $5,000  \n    Total: $50,000",
                        "stellar.tranche2Testnet": "Deployment of Liqvid Infrastructure\n\nBrief Description:  \nDeploy Liqvid’s smart contract framework for RWA issuance and compliance-gated transfer mechanics, built on top of Asterizm logic.\n\nDeliverables:\n\n-   Smart contract with multisig, mint, burn, settle, crossChainTransfer\n    \n-   Full KYC/KYB off-chain investor onboarding logic + frontend dashboard v1\n    \n-   Integration with oracle feed for real-time NAV updates\n    \n-   Whitelist-based permissioning and investor flow simulation\n    \n-   Test tokenized deal simulation on Stellar testnet\n    \n\nHow to Measure Completion:\n\n-   Contracts deployed on Soroban testnet and functional\n    \n-   Asset lifecycle flows verified\n    \n-   RWA onboarding and omnichain mint simulated\n    \n\nEstimated Completion:  \nOctober 20, 2025\n\nBudget Allocation:\n\n-   Contract + backend infra (incl. compliance/KYC): $35,000\n    \n-   Oracle feed + frontend + API integrations: $15,000\n    \n-   DevOps + test infra: $5,000  \n    Total: $55,000",
                        "stellar.tranche3Mainnet": "Mainnet Launch & Success-Based Expansion\n\nBrief Description:  \nLaunch first real-money tokenized RWA deal (min. $3M AUM) via Soroban. Connect live contract to rwa.io and prepare for scaling.\n\nDeliverables:\n\n-   Smart contracts launched on Soroban mainnet\n    \n-   Real capital onboarded via Liqvid platform ($3M+ AUM)\n    \n-   Integration with rwa.io (or another public listing) for live AUM/TVL tracking\n    \n\nHow to Measure Completion:\n\n-   Live smart contract addresses published\n    \n-   TVL > $3M tracked on Stellar\n    \n-   Yield dashboard activated for LPs\n    \n-   Contract integrated and visible via rwa.io (or another public listing)\n    \n\nEstimated Completion:  \nDecember 15, 2025\n\nBudget Allocation:\n\n-   rwa.io integration (or another public listing), monitoring & launch support: $5,000\n    \n-   Final deployment ops: $37,500 (smart contract methods modification and deployment)  \n    Total: $37,500 (unlocks only upon meeting AUM/TVL criteria)",
                        "stellar.teamMembers": "Denis Polulyakhov",
                        "stellar.urls": {
                            "website": "https://liqvid.xyz/",
                            "codeRepository": "https://drive.google.com/drive/folders/1hiDCh3sdYA-tFPiQuTSTP4W5eFZR6Vkp?usp=sharing",
                            "videoURL": "https://youtu.be/SrNzYNqMfEI"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/liqvidprotocol",
                            "twitter": "https://x.com/liqvid_xyz"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 45833.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 108289.61,
                                "denomination": "XLM"
                            }
                        ]
                    }
                }
            ]
        }
    ]
}