{
  "@context": "http://www.daostar.org/schemas",
  "name": "Stellar",
  "type": "Foundation",
  "grantPools": [
    {
      "type": "GrantPool",
      "name": "scf-10",
      "applications": [
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:1",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reccZhjIQWWzQ12PS",
          "projectId": "daoip5:stellar:project:smilepay",
          "projectName": "Smilepay",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reccZhjIQWWzQ12PS",
          "fundsApproved": [
            {
              "amount": 470189,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 50000,
          "description": "Send money like a text, globally.",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "WHAT WE DO\n\nSmilepay is a Peer-to-Peer mobile app and USSD that helps African diasporas send money, buy airtime, and pay utility bills for friends and family in Africa, in real-time and free of charge.\n\nHOW IT WORKS\n\nBoth the sender abroad and recipient in Ethiopia download the Smilepay app (recipients in Ethiopia can also use Smilepay USSD). The sender connects their credit/debit card and tops up their Smilepay App. The sender sends money instantly and free of charge to the recipient using their phone number or Smile-tag. Recipients receive money in their local currency. Users receive money in local currency and can spend it in the app to pay bills or buy airtime or withdraw to their bank account remotely, which avoids cash pickups. The sender can also directly buy airtime and pay bills from abroad for friends and family in Ethiopia, allowing them more control over how money is spent.\n\n*Through the Smilepay app, the sender can also send money directly to the recipient's bank account with a 1% transaction fee. It's not a must for the recipient to download the Smilepay app to receive payment, but they can benefit from free transaction fees when they use the app to receive money.\n\nWHY?\n\nHigh transaction fee by the incumbent: The average cost of sending money to Africa is 8.17%, making it the world’s most expensive remittance corridor. Recipients in Africa have to physically go to the remittance company branch to collect the cash that their family and friends sent them. It's time-consuming and an unnecessary hassle. Senders do not have control of how the money they send is used by the recipients. For example, money sent for utility bills is misused.\n\nOUR UNIQUE ADVANTAGE\n\nWe use Blockchain technology to make cross-border money transactions free or extremely cheap. Diasporas will be able to send as small as 50 cents to Africa instantly, 24/7. Other than sending money, Smilepay will enable diasporas abroad to pay for utility bills and buy airtime for friends and family back home, and we are the first to do all of this in Ethiopia.\n\nOUR TARGET CUSTOMERS\n\nDiasporas living abroad that have family and friends in Africa. African youth that have family and friends abroad. Freelance workers that get paid from abroad.\n\nCUSTOMER INDUSTRIES\n\nBusinesses that want to sell their services through the Smilepay app (Airlines, Utility companies, airtime distributors, sports betting, and more).\n\nOUR MISSION\n\nOffer free, instant, and frictionless movement of money domestically and across borders to Africa.\n\n*We are starting by helping Ethiopian diasporas living in the USA to send money to Ethiopia.\n\nHOW WE USE STELLAR\n\nWe are going to issue a stablecoin that is tethered to the USD and Ethiopian national currency Ethiopian “Birr” and maintain the equivalent fiat reserve with our partner bank. On ramp for senders: We are using “Stripe API” to enable users in the USA to top-up money to their Smilepay app using their credit/debit card. Off ramp for the recipient: We are using “Ethio Switch API” to enable users to withdraw money that they have received from the Smilepay app to any of their local bank accounts in Ethiopia.\n\nWHY STELLAR?\n\nWe needed affordable, secure, and fast transactions. It allows our app to hold multiple currencies. It is simple and fast to integrate. Future innovation opportunities. It fits our future goal of introducing cryptocurrency purchase, storage, exchange, and more.",
            "stellar.teamMembers": "Muluken Bekele, Fikremariam Awoke, Nav",
            "stellar.urls": {
              "website": "https://smilepay.app",
              "videoURL": "https://www.youtube.com/watch?v=OAeI5m3cTCI",
              "pitchDeck": "https://docs.google.com/presentation/d/1dxjBot__mfO0zWSS0CA9wNdI0kHpaDIyM6HQcJYFvmc/edit?usp=sharing"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/in/mulukenmengesha/",
              "twitter": "https://x.com/smilepay_global"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 50000.0,
                "denomination": "USD"
              },
              {
                "amount": 470189.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:2",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reccHsP7ESotRVcIv",
          "projectId": "daoip5:stellar:project:pluto-loans-b2b",
          "projectName": "Pluto Loans",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reccHsP7ESotRVcIv",
          "fundsApproved": [
            {
              "amount": 455896,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 48480,
          "description": "Self-repaying loans: Spend your future yield today",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "Pluto Loans allows users to spend their future yield today. With Pluto Loans, users can deposit yield-producing collateral and get a loan of their future yield immediately. No liquidation risks. The loan debt is time-based and self-repaying. While the long-term objective for Pluto Loans is to be global, the initial rollout will be focused in Argentina, with plans to quickly expand to the rest of LATAM.\n\nThe Problem: A quick summary\n\nArgentina has an inflation rate of over 50%. The Argentinian peso has devalued 2,609% since 2012. Argentina has a ban on purchasing foreign currency, but not on cryptocurrencies. Fixed-term deposits in USD have a yearly interest rate of 0.75% - 2%. Users of platforms such as Mercadopago who deposit ARS benefit from a ~32.3% annual interest rate, which is worse than the aforementioned ~50% inflation rate. Personal loans in Argentinian pesos have an interest rate of >76% (and most have early cancellation or repayment fees).\n\nThe Opportunity\n\nPluto is LATAM-focused, with most of its core team members being based in Argentina, and with Argentina being its main country of operation. Cryptocurrency is legal in Argentina. Users can make use of regional anchors to buy ARS issued on the Stellar network or use exchanges to buy XLM. Users deposit yUSDC and get a loan of 50% of their collateral loaned out in pUSD. pUSD is a token backed by the future yield generated by yUSDC, intended to trade 1:1 with yUSDC through various pegging mechanisms. Self-repaying; a loan gets paid by the yield generated by the collateral of yUSDC (and other reward mechanisms), at the maturity of the loan, a user gets back their collateral and keeps their loan. Get more than yUSDC’s APY due to our “Shared Yield” mechanism where Pluto Loans vault shares “unclaimed” APY with all borrowers. No risk of liquidation. No early cancellation fees. Build on top of other Stellar projects (Ultrastellar’s yUSDC), strengthening the ecosystem.\n\nWhile the concept of self-repaying loans exists in other chains such as Alchemix, the fees charged by the ETH network make it prohibitive for the average Argentinian to make use of. Thanks to Stellar’s low network fees and broad network of Anchors, we are able to bring financial inclusion to the personal loans space to every Argentinian.\n\nThe Problem: In depth\n\nTo fully understand the potential of Pluto Loans, it is important to take a look at the unique economic situation of Argentina. The Nobel prize-winning economist Simon Kuznets is said to have remarked that there were four types of countries: the developed, the underdeveloped, Japan, and Argentina. Argentina has one of the highest inflation rates in the world. On an annual basis, consumer prices soared 55.1 percent, the fastest annual rise since June of 2019, quickening from a 52.3 percent surge and beating market forecasts of 53.8 percent. This inflation chart comes hand in hand with the depreciation of the Argentinian Peso, a currency that has suffered a massive devaluation in the past few years, going from requiring ARS 4.42 to buy USD 1 in May 2012, to requiring 115.32 to buy 1 USD as of April 2022. The unique positioning of Pluto Loans in the Argentinian market could not be completely explained without also mentioning the ban on purchasing foreign currency that was reinstated in Argentina on September 1st, 2019, which has created a parallel market that is often used as a reference for the “true price” of the USD, currently with a ~100% gap with the official exchange rate. This has made Argentinians seek to hold their savings in crypto stablecoins, especially USD-pegged ones, which can be legally bought and traded in the country.\n\nThe Solution: Pluto Loans\n\nThe core concept presented by Pluto Loans is simple: A user takes out a loan by locking away yUSDC which is a yield-generating asset, with an estimated yield of 9% at the time of writing and 50% of the locked amount is loaned out in the form of pUSD (therefore, pUSD is backed by the future yield of yUSDC). After the yield produced by the collateral has covered the loan amount, a user can get back their initial investment and keep their loaned amount. In order to illustrate the basic operation behind Pluto Loans, let’s consider a user who wants to take out a loan. They would deposit 100 yUSDC into Pluto Loans’ platform which would be securely locked away and start generating a daily interest thanks to yUSDC’s mechanics, and immediately get 50 pUSDC disbursed to their account. This happens atomically in one single transaction. The user is free to spend those 50 pUSD how they see fit, perhaps exchanging it to other stellar assets such as BTC or ETH because they believe the price might go up. After ~4.5 years, the original 100 yUSDC has generated 50 yUSDC in interest @ 9% APY; At this point, the owner of the loan can simply withdraw the original 100 yUSDC and keep the 50 pUSD, which are now backed by 50 yUSDC still locked in Pluto Loans’ account. Note: Pluto Loans generates revenue by keeping 10% of the APY generated from loans, which is omitted from the calculations and diagrams to keep things simple. In the above scenario, the 100 yUSDC would take ~4.87 years to generate 55 yUSDC to pay for the 50 pUSD loaned out and the 5 yUSDC service fee to Pluto Loans.\n\nExtra repayments, pegging mechanism and rewards\n\nThe Pluto Loans system allows users to pay back their loan debt at any time, with no repayment or cancellation penalty. Consider the case of our user who took out a 50 pUSD loan and locked away 100 yUSDC. If they were to regret their decision and pay back the debt immediately (50 pUSD not considering Pluto Loans’ service fee), they would pay back the 50 pUSD which would in turn be burnt (as they are no longer backed by future yield of yUSDC) and the 100 yUSDC would be sent back to the user. An important aspect of the burn mechanism is that Pluto Loans accepts pUSD always at a 1:1 rate, regardless of market price, this incentivizes borrowers to buy more pUSD when the price is low, helping to maintain a 1:1 ratio. Let’s see an example. A user deposits 100 yUSDC and gets a 50 pUSD loan. The market rate is 1:1 with yUSDC. The user buys ETH with those 50 pUSD (now they have 100 yUSDC locked and 50 USD worth of ETH). The price of pUSD drops, and is now 0.9 instead of 1:1. The owner of a loan can now purchase 50 pUSD at 0.9 yUSDC each (spending 45 yUSDC), and repay his loan with the 50 pUSD, since Pluto Loans always accepts pUSD at a 1:1 rate regardless of market price. Our user now has the 100 yUSDC back, 50 USD worth of ETH and because they bought pUSD, this drove the price up, helping to maintain a 1:1 balance. Pluto Loans considers yUSDC, USDC and USDT as valid USD assets, and any of them can be used to repay a loan at a 1:1 rate, regardless of market price, and they may choose to use any of these assets to make repayments or cancel a loan, which has an interesting consequence for the Pluto Loans ecosystem. When a user makes an early repayment in pUSD, these are burnt since they are no longer backed by the underlying asset. However, when repayments are made in USDC, yUSDC or USDT, there is no need to burn these assets since their value has a different pegging mechanism. When this happens, these funds are exchanged to yUSDC and since they don’t belong to any loan, they start creating “Shared Yield”, which is distributed proportionally based on the weight of each loan, which effectively means that the yield of Pluto Loans is always higher than the yield of yUSDC alone. Because the yield is higher than simply keeping yUSDC, some users may choose to keep their funds locked in Pluto Loans vault even if their loan has already been paid out in order to keep generating interest. This is also possible and encouraged, as a small 0.5% fee is charged and added to the “Shared Yield”. Other pegging mechanisms include rewarding those users who provide liquidity to pUSD and other valid USD pegged assets. Finally, recalling the original scenario when a loan has reached its maturity and it has been self-repaid, “... the owner of the loan can simply withdraw the original 100 yUSDC and keep the 50 pUSD, which are now backed by 50 yUSDC still locked in Pluto Loans’ account.” Those 50 yUSDC are also now generating “Shared Yield”, further helping to auto-pay down loans faster.\n\nTechnical considerations\n\nWhile Stellar has created Turrets, a clever smart contract protocol for Stellar, they have lost momentum due to the recent announcement of native Smart Contracts; Pluto has decided not to pursue an implementation using Turrets but rather build its software in a way where the server-based approach can be replaced by smart contracts once they become available. Two models are being considered at the moment, one which is purely CEFI (Pluto must be trusted as an entity), and another one which is semi-CEFI (trust is still required, but it guarantees that the funds will not be spent by Pluto). The technical design for the full-CEFI solution is as follows: From a storage perspective, Pluto Loans does not use a centralized database and instead relies on account balances stored on-chain. This design puts the system in a good place to be migrated to smart contracts later on. When a user takes out a loan, they send the money to a Pluto Loans account, and in exchange they receive tokens that represent their loan status; the reason for this approach is that any data we ask the user to store on their account can be erased by them later on, so it cannot be relied upon. We can’t store it in our own account since Stellar accounts have a 1000 subentries limit. By using the AUTHORIZE flag on the assets sent to the user we can guarantee the assets are immovable and the user cannot transfer, delete or otherwise alter their loan data. A common authorization pattern looks as follows: Operation 1: Issuer uses SetTrustLineFlags to fully authorize account A, asset pUSDDEBT. Operation 2: Payment of pUSDDEBT from Pluto Loans to A. Operation 3: Issuer uses SetTrustLineFlags to set account A, asset pUSDDEBT to AUTHORIZED_TO_MAINTAIN_LIABILITIES_FLAG state (effectively freezing the asset). The list of immovable assets we use are: pUSDDLP, which represents the loaned amount. pUSDSHARE, which represents the locked collateral (while right now it’s 2:1 ratio in the future this could be configurable which is when having separate assets is necessary). pUSSDEBT, which is used to calculate the portion of the yield generated into the Pluto Loans Vault account that each user is entitled to. When the loan has been repaid in full, either because of an early repayment or because the loan has been self-repaid, the borrower can ask Pluto Loans to get back their collateral which will then unfreeze the Pluto Loan assets and burn them, and give the user back their collateral. The technical design for the semi-CEFI solution is similar to the above, but with the following twist: Instead of one central vault, each loan will have its own vault (account) of which Pluto and the user will carry 50% each of the required weight to perform any operation. This guarantees that Pluto cannot move the funds without the users’ consent, and also that the user cannot withdraw the collateral without Pluto’s consent. Due to Ultrastellar’s innovative model, yUSDC is paid daily into this vault; the loan gets repaid over time automatically. It is innovative because generally in dApps the interaction is initiated by users (e.g. “Claim reward”). This approach has the benefit of clear accounting, but it requires managing multiple vaults which has some drawbacks: A user’s vault contains yUSDC which are 50% in the users’ control and 50% in Pluto’s control. Even after the loan is repaid, the funds cannot be moved unless the user wants to. Harder to migrate to smart contracts (locked funds would not be entirely in Plutos’ control). Pluto also pays out extra yUSDC from its shared yield vault. In the CEFI model, this is a mathematical formula that calculates how much extra yield the user has accrued, in this second approach, the shared yield would have to be paid into each vault, following Ultrastellar’s model, which increases risk of failure and is more computationally expensive. Pluto has so far implemented the fully-CEFI approach but will be seeking community feedback regarding the semi-CEFI approach.\n\nThe DAO\n\nIs Pluto a DAO? Not yet, but we want to be, and we are working very hard to achieve it. In order to show our commitment to the full decentralization of our project, Pluto has open-sourced its governance projects which will provide the on-chain voting mechanism that the DAO will be built on top of: https://github.com/PlutoDAO/gov, https://github.com/PlutoDAO/gov-ui, https://github.com/PlutoDAO/gov-worker.",
            "stellar.teamMembers": "kelo6",
            "stellar.urls": {
              "website": "https://plutoloans.com",
              "videoURL": "https://youtu.be/wuiDyzKZrto"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/plutodao/",
              "discord": "https://discord.gg/9hkx2AVhpc"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 48480.0,
                "denomination": "USD"
              },
              {
                "amount": 455896.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Financial Protocols",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:3",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rece5621BPO0nMFIe",
          "projectId": "daoip5:stellar:project:mythforge",
          "projectName": "MythForge",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rece5621BPO0nMFIe",
          "fundsApproved": [
            {
              "amount": 188075,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 20000,
          "description": "Join the World. Build your Legend.",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "NFT Gaming with P2E elements via Smart Contracts",
            "stellar.teamMembers": "Peter, Peter",
            "stellar.urls": {
              "website": "https://www.youtube.com/watch?v=EIS1PxdTrNY",
              "videoURL": "https://www.youtube.com/watch?v=EIS1PxdTrNY"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 20000.0,
                "denomination": "USD"
              },
              {
                "amount": 188075.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:4",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recgnjAu0uHmoQNGJ",
          "projectId": "daoip5:stellar:project:skyhitz",
          "projectName": "Skyhitz II",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recgnjAu0uHmoQNGJ",
          "fundsApproved": [
            {
              "amount": 1128455,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 120000,
          "description": "Music NFTs on Stellar",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "Added full support for Stellar with Wallet Connect via Lobstr Wallet. Created an in-app Stellar wallet that is extremely easy to use for users that are new to crypto. They can buy XLM with credit or debit card in a simple two-step process using Stripe. They can withdraw to any Stellar wallet at any time. They can become premium subscribers by paying $7.99 per month. Added minting, buying, and selling music NFTs support. Added pricing to each music NFT that is currently on sale. Added links to Stellar expert for each NFT minted on our platform. Created welcome, sign-up, and log-in emails.",
            "stellar.teamMembers": "Alejo Mendoza",
            "stellar.urls": {
              "website": "https://skyhitz.io",
              "videoURL": "https://www.youtube.com/watch?v=0P4mlOzkcYs"
            },
            "stellar.socialMedia": {
              "twitter": "https://twitter.com/skyhitz"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 120000.0,
                "denomination": "USD"
              },
              {
                "amount": 1128455.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:5",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rechLNmH8fN9cBMQM",
          "projectId": "daoip5:stellar:project:assemblyscript-soroban-sdk",
          "projectName": "AssemlyScript smart contracts SDK",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rechLNmH8fN9cBMQM",
          "fundsApproved": [
            {
              "amount": 554824,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 59000
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:6",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recipARqM4ji5SJK4",
          "projectId": "daoip5:stellar:project:elixir-stellar-sdk",
          "projectName": "Elixir Stellar SDK",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recipARqM4ji5SJK4",
          "fundsApproved": [
            {
              "amount": 112845,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 12000,
          "description": "Stellar support for Elixir developers",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "We encouraged ourselves to fully integrate Stellar into the Elixir ecosystem. Elixir is a dynamic, functional language that leverages the Erlang VM for building low-latency, distributed, and fault-tolerant systems. Elixir is successfully used in web development and embedded software.\n\nOur proposal is 100% open-source and it is composed of 3 libraries:\n\n1. Elixir XDR: a low-level library to encode/decode XDR data (RFC4506).\n2. Stellar Base: a library that provides a complete set of functions to read, write, hash, and sign primitive XDR constructs used in the Stellar network. This library acts as an abstraction layer allowing software and IoT developers to build their own SDKs.\n3. Stellar SDK: a top-level library for building and submitting transactions to Horizon.\n\nThe mission behind this initiative is to promote Stellar innovation and increase network participation by enabling Elixir developers to thrive in the Stellar community.\n\nDeveloped by kommitters Open-Source. The Open-Source Program Office from kommit.\n\nkommit is a Latin American tech talent and innovation incubator. Our mission is to find the best talent in its earliest stages and invest in them so they can work with international teams.",
            "stellar.teamMembers": "Miguel Nieto, Juan Hurtado",
            "stellar.urls": {
              "website": "https://github.com/kommitters"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 12000.0,
                "denomination": "USD"
              },
              {
                "amount": 112845.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Developer Tooling",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:7",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reclezdtsxQM16L25",
          "projectId": "daoip5:stellar:project:beans-app",
          "projectName": "Beans app",
          "createdAt": "2022-07-13T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reclezdtsxQM16L25",
          "fundsApproved": [
            {
              "amount": 2068835,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 220000,
          "description": "Beans is a super simple, free payments app with healthy yield on your savings.",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "Beans is a non-custodial payments and savings app built on Stellar. Most blockchain-based apps have targeted the crypto community. We have taken a different approach and will target the general public. Inside the app, all blockchain-related things have been abstracted away, offering a bank experience using blockchain technology! We are aiming to be the first app to get significant traction on blockchain payments! Next to that, we want to offer regular people a way to access crypto yield by making the process super easy.\n\nThe beans app (iOS & Android) offers: Free (international) payments, savings accounts with healthy yields, and an amazing user experience that anyone can understand.\n\nThe problem with crypto payments: For a majority of people, the world of cryptocurrencies and blockchain technologies is extremely complex and very hard to understand. News media cover stories of heavily fluctuating cryptocurrencies, feeding the uncertainty that people have about cryptocurrencies in general and their underlying blockchain technology. While struggling to learn what it is all about, the uncertainty leads to not adopting a technology that could be very beneficial to a large group of people and potentially change their lives.\n\nBecause of this, we want to enable people to start using the great functionalities that these technologies have to offer without having to bother them with complexity. Words like wallet, assets, lumens, and stablecoins do not contribute to a flawless user journey; they only cause uncertainty and scare people away. In fact, why should they even know that they are interacting with blockchain technology, unless they choose to delve into it? People are comfortable using their traditional banking apps without knowing the driving technologies behind them. Why should they bother about it this time?\n\nOur focus has been to build an app that feels like a regular banking app but uses blockchain behind the scenes. To do this, we have chosen to let users pick a preferred currency. This currency will be used to send, request, and receive payments. All payments between users, no matter the currency, will auto-convert. No need to think about currencies or trustlines ever again. Payments are free; we will even sponsor the network fees through feebumps. This is how it works.\n\nCreating an account: When setting up an account, users choose their preferred currency. A spendable balance in this currency is created. In the back-end, they will hold anchored stablecoins on Stellar. By using a fixed currency, we can create a very user-friendly, bank-like experience. We know which user prefers what currency and can use this knowledge in deposits, payments, and payment requests. Users will never have to think about trust lines or choose what asset to send. It will all be seamless. Beans, at the start, will choose one anchor per currency, so that users do not have to deal with this complexity either.\n\nSending money: When a user initiates a payment, the app will find the preferred currency of the receiver and show the right conversion window. When the user fills in the amount they want to send, in their currency, they will automatically see how much their friend will receive in their preferred currency. When two users have the same preferred currency, no conversion window is shown. In the back-end, a Stellar path payment will be used to convert the funds. Beans uses fee bump and sponsored reserves to offer a bank-like experience without charging fees. This implementation gives users the experience of a general banking app, with the advantage of near-instant, feeless, cross-border transactions. This means that if Ben sends 12 USD to John, John will actually receive 12 USD. No fees, not even network fees are deducted, giving Ben a great user experience. At the same time, Claire can send 15 USD to Mike, who prefers Peso. The app will automatically show that Mike will receive 3,000 Peso.\n\nRequesting money: Users can request a payment via a link, QR code, or other native sharing functionalities of their smartphone. If a user requests money from a user with a different preferred currency, the app will automatically fill in the conversion window so that the paying user can see an estimation of how much the payment will cost them in their preferred currency. All they have to do is accept the conversion and the payment will be done in seconds.\n\nOpening a savings account: Users can set up a savings account in, for example, USD, ARS, and EUR and earn up to 9% yield. More advanced users can also choose to save and earn in cryptocurrencies like BTC, ETH, or XLM. Conversions in and out of savings accounts will have zero fees, not even network fees. Like we said before, we will sponsor the network fees through feebumps. This way, a user in Argentina can have an ARS account for payments while saving and earning interest in USD. As a result, the user will not only earn interest but also escape inflation. Someone else can choose to pay with USD while saving in XLM, or any other combination. Users can also choose to earn and save in multiple currencies.",
            "stellar.teamMembers": "Jop Middelkamp, Wouter Arkink",
            "stellar.urls": {
              "website": "https://beansapp.com",
              "videoURL": "https://youtu.be/fsp0L-jiZbQ"
            },
            "stellar.socialMedia": {
              "twitter": "https://twitter.com/BeansApp",
              "discord": "https://beansapp.medium.com/"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 220000.0,
                "denomination": "USD"
              },
              {
                "amount": 2068835.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-13T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:8",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recxNxDjV3irG2b3s",
          "projectId": "daoip5:stellar:project:edunode",
          "projectName": "EduNode",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recxNxDjV3irG2b3s",
          "fundsApproved": [
            {
              "amount": 725973,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 77200,
          "description": "Learn Blockchain/Web3 skills, monetize your content, and reach your goals.",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "Our products and services are divided into two categories, memberships, and tailored solutions.\n\nMemberships Solutions for Students\nFor clients looking into using our cloud-based e-learning solutions, we offer educational courses and content on our website, based on a free and a monthly premium subscription, and which can be accessed by anyone from anywhere.\n\nTailored solutions for businesses.\nOn-Premise Solutions (B2B)\nOur educational platform offers flexible on-premise solutions for companies, institutions, and individuals that allow them to design their very own e-learning solutions.\n\nE-Diploma Solutions (B2B)\nOur e-Diploma solution offers innovative certification solutions for institutions and companies.\n\nContent monetization\nFor users willing to publish and monetize their content on our platform and get payments in the currency of their choice.\n\nWhat's new?\nOur product changed from a simple website with an idea, to a significantly developed blockchain-focused E-learning platform with Stellar related blogs, courses, login with Freighter Metamask and Twitter integration.",
            "stellar.teamMembers": "Olvis Enrique Gil Rios",
            "stellar.urls": {
              "website": "https://edunode.org/",
              "videoURL": "https://vimeo.com/712679632"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 77200.0,
                "denomination": "USD"
              },
              {
                "amount": 725973.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Education & Community",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:9",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWONcXU1LVBGZfQ",
          "projectId": "daoip5:stellar:project:link-io",
          "projectName": "LINK",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWONcXU1LVBGZfQ",
          "fundsApproved": [
            {
              "amount": 470189,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 50000,
          "description": "Cross border payments infrastructure for Africa",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "LINK is a different kind of Nigerian Anchor, as an infrastructure first company we are focused on a unique streamlined range of services and features that have the backbone of Stellar network.\n\nLaunch and Grow\n\nLINK for Global businesses: We allow businesses to accept payments and send payouts globally in one unified platform. Move digital money leveraging traditional payment rails and do business in a more global, scalable, and efficient way through hybrid infrastructure. LINK seamlessly connects these worlds.\n\n- Get NGNC straight from the source. Send and receive naira digital currency on-chain. All through a single portal for payments.\n- On & Off Ramp (SEP 24 implementation)\n- Treasury & Custodial Dashboard\n- Move NGNC from Stellar across multiple chains\n- Non-Nigerian businesses and Nigerian businesses alike, small or big, defi-based or traditional-based, now have access not only to possibilities of defi but local infrastructures to get paid and to pay as well.\n- We want to bridge Africa’s Internet of value. LINK is that bridge between the world, defi, and traditional rails built for global businesses.\n- Platform: Web App - https://ngnc.online/\n\nLINK P2P platform: Allows users to send, spend, and bank at the real exchange rate with transparent fees across borders.\n\n- Send and receive money from Nigeria to over 50+ countries across the globe in record time at the exchange rate seen on Google with low transparent fees allowing us to be the cheapest solution across the continent (30-50% cheaper than all existing solutions).\n- Create multi-currency accounts that can be loaded with local currencies at the real exchange rate.\n- Create a USD Virtual debit card that can be loaded with local currencies at the real exchange rate.\n- Compare our rates with other providers real-time.\n- Receive money directly through your link tag, bank, or in-person.\n- Powered by the speed, low-cost, and anchor interoperability provided on the Stellar network with our own stablecoin NGNC and other stablecoin providers on the Stellar network. As well as our built-in P2P infrastructure that works on the backend.\n- The LINK P2P platform is the only platform that would be powering payments this way and it's because our vision aligns with what we found on the Stellar network.\n- Platform: Web App - https://linkio.africa/ (Coming to IOS and Android)\n\nNGNC: NGNC for Naira Coin is a multichain stablecoin pegged and redeemable 1:1 in value to the Nigerian Naira, built to power cross-border payments and the future of the internet of value for the next billion Africans.\n\n- Currently, NGNC on- and off-ramps are only implemented on the Stellar Network compliantly with local regulations through Stellars’ SEP24.\n- NGNC represents the only Naira stablecoin that carries the true value of the Nigerian Naira on the Decentralized Exchange as well as the only multi-chain Naira asset.\n- NGNC currently exists on a stealth protocol on Solana and Polygon, coming to Stellar that would allow global forex interoperability and liquidity powered by LINK’s infrastructure as well. Coming to other exchanges soon.\n- The aim is to build that global tradability of the Naira and equitable access to defi for Africans.\n- Token link on Stellar: https://stellar.expert/explorer/public/asset/NGNC-GASBV6W7GGED66MXEVC7YZHTWWYMSVYEY35USF2HJZBLABLYIFQGXZY6-1\n- Token website: https://linkio.africa/ngnc\n\nWAVY (Vibrant for Nigeria): Wavy is a wallet app developed on Stellar by the team at LINK as one of the line of cross-border focused payments platforms. By employing Stellar, Wavy makes it possible for Nigerians (especially low-income and middle-class working individuals) experiencing inflation to purchase and hold USDC quickly, cheaply, and easily.\n\n- For Businesses\n- Wavy also works like MoonPay for Africa giving local businesses access to digital assets.\n- A USDC wallet that can be loaded with NGNC at the real exchange rate leveraging Stellars’ DEX.\n- A cheaper access to crypto and a yield feature using yUSDC and yXLM on Stellar.\n- Link to platform: https://linkio.africa/wavy (Product design for this is completed, development and launch would happen in Q1 of 2023)\n\nAPI’s: LINK would provide a suite of API’s for businesses and developers to incorporate our products and services across the ecosystem.\n\n- Existing FinTechs and competitors can leverage the fx protocol API to provide better rates for customers.\n- Launch could happen by Q3 this year in batches.",
            "stellar.teamMembers": "Emmanuel Evarist",
            "stellar.urls": {
              "website": "https://www.linkio.africa/",
              "videoURL": "https://www.youtube.com/watch?v=ZOO2wDt4Igg&list=PLOLarToiDpePYitg9c77K7vD0zKRjsFjL&index=1"
            },
            "stellar.socialMedia": {
              "twitter": "https://twitter.com/Link_IO"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 50000.0,
                "denomination": "USD"
              },
              {
                "amount": 470189.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:10",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec1UP0te2eVEQ6o0",
          "projectId": "daoip5:stellar:project:bp-ventures",
          "projectName": "BP Ventures",
          "createdAt": "2022-07-13T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec1UP0te2eVEQ6o0",
          "fundsApproved": [
            {
              "amount": 1175474,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 125000,
          "description": "Helping FinTechs Leverage Stellar Technologies",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "BP Ventures provides Stellar blockchain payment solutions and software development services for Money Transfer Operators, Exchange Houses, FinTechs, Banks, and Telcos that add new revenues, decrease fraud and charge-back rates, and improve working capital and treasury efficiencies.\n\nIn particular, BP Ventures fills a vacuum in the market by advising Money Services Businesses (MSBs) and Banks on how best to implement and use Stellar. MSBs are often skeptical of the benefits of blockchain technology. They see additional risks, like potential compliance and bank account issues, with little understanding of how to implement Stellar blockchain-powered payments into their existing business.\n\nBased on our 20 years of experience in payments and banking and our actual implementation of Stellar at Tempo, an EU-regulated payment institution, we directly address MSBs' concerns with a risk-reduced and structured Stellar onboarding process which includes 3 easy steps.\n\nStep 1: Leverage USDC as a payment mechanism for MSBs. Paying into their existing remittance system and using a non-custodial payment gateway with a one-click integration solution makes this option fast and easy to implement with little risk. In particular, using USDC as a payment mechanism solves many real-world problems for MSBs.\n\nFor example, chargebacks are growing at 20% per annum. BP’s solution has immediate value as it allows MSBs to reduce charge-back rates and fraud, as USDC payments are irreversible. Funds are immediately available, thereby assisting MSBs' working capital utilization and improving their treasury efficiencies. In contrast, card payments are credited by the processor up to 15 days following the transaction. Lower cost: USDC payment mechanism is cheaper than cards that average between 1.8 to 3.5% plus additional charge-back and fraud fees may be applicable. Our one-click integration into major money transfer systems already has thousands of clients. BP has negotiated this contract with 2 major MSB IT vendors. New customers: ability to tap into different types of customers than the MSB may typically service. One-click integration into Circle for the MSB to instantly receive digital funds. Supports USDT from Ethereum via Apay and Bitcoin Lightning path payments (that convert to USDC). BP's product roadmap with the additional SCF funding includes integrating directly into thousands of backend systems via Zoiper such as Xero, Quickbooks. Complete Circle API integration. Integrate into Temenos, opening 1,600 banks and credit unions to the Stellar blockchain. Elliptic integration.\n\nhttps://pay.bpventures.us is charged on a pay-as-you-go model to MSBs already on some key remittance systems that BP has already fully integrated with. The individual MSB pays only once they have hit the volume threshold of 10,000 USDC in volume, to encourage use. BP’s commission revenue is split with the IT platform providers, giving new revenue streams for these backend vendors.\n\nStep 2: Our Anchor in a box solution allows MSBs to connect to Stellar as a payment rail for easy cash-in and cash-out of USDC via SEP 31/6/24 as well as directly sell USDC. This new product provides new revenues and new customers to MSBs. Currently, Polaris is accessible by the Admin Panel, but it's confusing and hard for most MSBs to understand and get started. We have a customized version that allows for a junior operator to manage transactions. It also has an integrated sftp/ftp module that can send batch jobs of transactions including KYC to any website or system backend. With SCF funds, we can complete the full integration into 3 major backend providers as well as one-click integration with several KYC providers for wallet integration.\n\nStep 3: Expanded Stellar Blockchain use through BP’s White label, customized DeFi dashboard solution. The DeFi dashboard solution enables MSBs and their customers instant access to the DeFi ecosystem to trade, swap, invest in DeFi, or cash in/out all from one easy-to-use app. Expanded Stellar blockchain use thanks to BP’s DeFi dashboard solution with open API connectivity for fast, easy integration into Money Service Businesses software platforms.\n\nThe DeFi dashboard provides an easy way for those who want to protect their funds from inflation to put their funds into USDC. We think of it as a simplified Uniswap with deposit and withdrawal functionality. It supports all major DeFi wallets such as Albedo, Freighter, xBull, Rabet, and Ledger. It has a seamless onboarding process for new users to crypto. It supports mobile users via Albedo and xBull. It shows the market price via Coingecko API (may be moved to an oracle). It shows the positive or negative gain vs Coingecko (Impact). It protects users from trading too much from the Coingecko price via slippage protection. Integration into Google Analytics to help MSBs track customer usage.\n\nThe DeFi dashboard is built on Stellar blockchain technology with advanced algorithms that enable users to obtain better pricing when they swap instead of a simple path payment. Our product roadmap includes: It is build-ready to support Stellar Smart contracts when they launch later this year. Additional Liquidity Pool Staking options. Reports on incorrectly priced assets (trading opportunities). Virtual Visa Card issuance. Direct integration with Exchanges and other partners - Deposit into Bitso where the user needs only to enter their member id/memo.",
            "stellar.teamMembers": "Anthony B, Christian Aleksander Larsen, Jeff Phaneuf",
            "stellar.urls": {
              "website": "https://bpventures.us/",
              "videoURL": "https://vimeo.com/717683352"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/bpventures/",
              "twitter": "https://twitter.com/bpv_us/"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 125000.0,
                "denomination": "USD"
              },
              {
                "amount": 1175474.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Infrastructure & Services",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-13T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:11",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec54XD3QmAUoMA1r",
          "projectId": "daoip5:stellar:project:sentit",
          "projectName": "Sentit",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec54XD3QmAUoMA1r",
          "fundsApproved": [
            {
              "amount": 517208,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 55000,
          "description": "A multi-currency non-custodial Blockchain Wallet with the main Focus on Cross-Border payment.",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "Cross Border Payments\n\nSentit is built for both Cross-Border and Local payments, this is shown in our various types of payment processes targeted at simplifying Blockchain for payments. On Sentit, users can send payment to an email address (new and existing users), public key, and federated address. Users can send the same asset or cross-asset to any of the available payment methods. Below is a short explanation of these features:\n\n1. Email Payments: One of the ways we simplified cross-border payments is through email payments. Sending money across borders should be as effortless as sending an email. Sentit allows users to send payment just by knowing the recipient's email; no public key is required. Just ask for the recipient's email and users can send funds/crypto assets to their email directly regardless if the recipient is registered on Sentit or not. This takes away the issues of users sending payments to the wrong persons and it is way more user-friendly.\n\n2. Public and Federated Address Payment: For experienced users, Sentit is also for you. On Sentit, users can send federated and public key payments too, and all the above-mentioned features are also available for sending payments. This makes Sentit not just a wallet for newbies with no or little blockchain experience but a dynamic wallet that can bend to fit everyone’s purpose regardless of their level of experience with blockchain technology.\n\n3. Currency Swaps: For both experienced and new users, Sentit provides functionality to be able to swap between currencies, crypto assets, tokens, and NFTs at an extremely low fee and fast settlement time. With the recent devaluation of currencies and inflation in most countries, swapping between currencies has been a way to hedge against inflation and currency devaluation, and Sentit is the right tool for this.\n\nBill Payments\n\nOnline bill payments have become an essential part of everyone’s lifestyle these days. MTN Nigeria's 2020 financial report shows how bill payment is becoming extremely important not just for Nigeria alone but all over Africa and the world by extension. The group made N332.4 billion in data-related revenue alone with a 51.2% growth in 2020. Sentit allows any user to pay all sorts of bills like airtime, data, TV, internet, religion, educational subscriptions, cable TV subscriptions, and many more using any of their trusted token/crypto assets. This provides users with a wallet that supports their everyday bill payments alongside their crypto assets, giving users the flexibility to pay their everyday bills with just a few clicks. We believe bill payments will play an important role in blockchain adoption for cross-border payments and Sentit is at the forefront of this.\n\nOn and Off-Ramp of NGN (upcoming)\n\nOn and off-ramp of fiat is a must-have functionality of any cross-border payment platform and with Stellar Standardized Sep006 and Sep024, we provide users with the functionality to directly make deposits and withdrawals of fiat (real-world fiat), tokens, and assets (from other chains like Ethereum, Bitcoin, etc.) directly from the Sentit Wallet. We currently support BTC, ETH, and other ERC20 for Sep006 withdrawal and deposit.\n\nFor fiat deposits and withdrawals, Sentit currently supports Sep24. Any assets (fiat) that conform with this Sep Standard, users would be able to deposit and withdraw them to their banks directly from Sentit. We will continue to partner and integrate with more anchors on the Stellar network to provide users with that seamless experience that matters.",
            "stellar.teamMembers": "Afolabi",
            "stellar.urls": {
              "website": "https://sentit.io",
              "videoURL": "https://youtu.be/VizpMHxp0TU"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 55000.0,
                "denomination": "USD"
              },
              {
                "amount": 517208.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:12",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reckgIzUF9nRueLhU",
          "projectId": "daoip5:stellar:project:synced-geo-bounties",
          "projectName": "Synced Geo-Bounties",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reckgIzUF9nRueLhU",
          "fundsApproved": [
            {
              "amount": 470189,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 50000,
          "description": "Crowdfunding geospatial dashboards through Stellar-powered bounties",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "Crowdfunded geospatial dashboards, populated with data crowdsourced from Synced app users, who are rewarded with crypto bounties. People will be able to create dashboards and follow data for places they care about. They generate the data on the dashboard by issuing bounties to existing Synced app users (multiple bounties can be issued per dashboard). The bounty specifies what app users should mark. Qualifying marks are added to the dashboard, and the marker is paid a share of the bounty. We have a prototype running on the Stellar Testnet (https://synced.to/dev/dashboard), and here’s a prototype of a Synced dashboard using public third-party data (https://blog.synced.to/Complaints-Of-New-York).\n\nEach bounty has an associated Stellar account, and anyone can contribute to the bounty by paying into the account. We’ll be using Stellar USDC for simplicity & clarity, rather than minting a new token. Contributors will also be able to pay in fiat, and it’ll be converted to USDC and added to the bounty. Bounty payouts will be in USDC. A related subtask is determining how much of the bounty should be paid to each marker. Our plan is to pay based on the supply and demand of markers in a geographic region.\n\nWhat's new? The idea is the same but we’re now further along in our implementation. Some implementation details have now changed. For example, we’re switching from XLM bounties to Stellar USDC and using Circle’s APIs so users can fund bounties in crypto or fiat.",
            "stellar.teamMembers": "Tejas Shah",
            "stellar.urls": {
              "website": "https://synced.to",
              "videoURL": "https://vimeo.com/717635080"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 50000.0,
                "denomination": "USD"
              },
              {
                "amount": 470189.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:13",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recMAwrPuhoeSNk05",
          "projectId": "daoip5:stellar:project:source-of-tales",
          "projectName": "Source of Tales",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recMAwrPuhoeSNk05",
          "fundsApproved": [
            {
              "amount": 70528,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 7500,
          "description": "Own your virtual self in a friendly retro world.",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "We’re building a 2D MMO Action-RPG which will use the Stellar Network for authentication and gives the player ownership of their character and in-game possessions. Based on this ownership, the character will be able to move between various trusted servers and the player can trade their in-game assets independently of the game. With the main database living on the Stellar network instead of at a private server, we also provide a layer of protection against data loss. Overall, our goal is to develop a fun and accessible game and demonstrate how Stellar can help with player authentication, data ownership and trading value. We've previously worked on https://www.themanaworld.org and http://www.sourceoftales.org, and envision this project as a continuation of Source of Tales, adapted to take advantage of the Stellar network.",
            "stellar.teamMembers": "Thorbjørn Lindeijer",
            "stellar.urls": {
              "website": "https://www.sourceoftales.org/stellar",
              "videoURL": "https://youtu.be/-AuB3Hbadys"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 7500.0,
                "denomination": "USD"
              },
              {
                "amount": 70528.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:14",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWL9vRV4LDN339Q",
          "projectId": "daoip5:stellar:project:the-blue-marble",
          "projectName": "The Blue Marble",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWL9vRV4LDN339Q",
          "fundsApproved": [
            {
              "amount": 1692683,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 180000,
          "description": "Revolutionising Impact Investment with NFTs",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "We believe that NFT technology is nascent and there is a need to educate creators and protect buyers while we uncover the ways in which the technology can be used for safe, long-term investments. The Blue Marble allows organisations to launch NFT campaigns with ease and split sales revenues with social and environmental causes. The platform has been designed to attract audiences outside of the traditional crypto space through the development of easy-to-use interfaces for creators and credit and debit card purchase facilities for buyers.\n\nStellar is an ideal choice for the blockchain infrastructure, given the alignment of core values and the fact that the energy consumption by the Stellar network provides an important market differentiator against the incumbents such as Ethereum.\n\nServices offered by The Blue Marble:\n\n1. Curated NFT drops\n- Identifying social enterprises, creators and buyers whose relationship can be leveraged for group success\n- Providing consultancy to design financially robust NFT drops that wrap utility and value into the NFT asset\n- Marketing these drops to buyers, sourcing new buyers as well as leveraging our growing community\n\n2. Legal tooling\n- Providing the legal constructs and advice to large-scale initiatives to allow NFT usage in large-scale problem solving such as community land protection\n- Connecting customers to our legal partners who develop the legal contracts to purchase assets that can be traded via our NFTs\n\n3. NFT communities\n- Promoting the general development of our NFT communities and drops as seen in other NFT marketplaces\n- Providing community curation to identify opportunities for our buyers\n\n4. Education courses and onboarding\n- Providing onboarding to the non-technical into the NFT crypto space and groups who could benefit from more knowledge of the crypto and NFT space\n- Thought leadership and knowledge sharing around the ways in which NFTs can be used with long-term value in mind\n- Free courses to upskill anyone who would like to learn how to develop their own NFT drops that can benefit their community and/or social/environmental campaigns they want to support.",
            "stellar.teamMembers": "Steve Walker",
            "stellar.urls": {
              "website": "https://thebluemarble.io",
              "videoURL": "https://youtu.be/3wu2ieegePQ"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/5288550",
              "twitter": "https://twitter.com/thebluemarbleio"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 180000.0,
                "denomination": "USD"
              },
              {
                "amount": 1692683.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:15",
          "grantPoolId": "daoip5:stellar:grantPool:scf-10",
          "grantPoolName": "scf-10",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec4Nwk1DCefv8BKu",
          "projectId": "daoip5:stellar:project:vitreous",
          "projectName": "Vitreous",
          "createdAt": "2022-07-12T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec4Nwk1DCefv8BKu",
          "fundsApproved": [
            {
              "amount": 470189,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 50000,
          "description": "Transparent fundraising platform",
          "status": "Awarded",
          "extensions": {
            "stellar.productsAndServices": "In Slovakia, to limit corruption and unclear political funding schemes, banks provide transparent accounts (transparentneucty.sk) as it is required by the law for every political campaign to be funded through such an account. In order to prove that money is not being misused, people have started using the transparent accounts in different ways: Charity cases (e.g. poor families with disabled children receiving donations for basic necessities, churches in many villages and towns raising funds independently to help local homeless people, more recently specific accounts to help Ukrainians in various towns across Slovakia), Amateur sport clubs (e.g. people use transparent accounts to pay for sport facilities and shared equipment), Schools, Hospitals, Public activism (protests, ecology etc.).\n\nOur goal is to research transparency, make transparent data easy to understand and introduce these solutions to Stellar. By extension of Stellar’s mission to bank the unbanked, we want to provide transparent accounts in countries supported by anchors, most of which are in emerging economies, and bring money where it’s needed, while building trust that the funds are spent effectively.\n\nWhile the transparent account product is quite popular, we believe there are ways to improve it as some of the shared information is enigmatic without further explanation. The first step is to make transparent accounts available for everyone in the reach of Stellar anchors, and then we go even further by improving on what exists today.\n\nMore specifically, the current iteration of our vision includes providing discussion and other social network features in addition to basic bank account data such as balance and incoming/outgoing payments. Much like there are communities where research papers and other complex topics are discussed, Vitreous can build communities to discuss money.\n\nWhat's new? Updated vision on what it means to be transparent. Updated the product roadmap. Created a UI design. Created hashbrownies.io as a deep dive into Stellar.",
            "stellar.teamMembers": "Matus Vojcik",
            "stellar.urls": {
              "website": "https://vitreous.co",
              "videoURL": "https://youtu.be/aqEo9s7pPH0"
            },
            "org.stellar.communityfund.awardType": "Legacy v3.0 Award",
            "org.stellar.communityfund.fundsPaid": [
              {
                "amount": 50000.0,
                "denomination": "USD"
              },
              {
                "amount": 470189.0,
                "denomination": "XLM"
              }
            ],
            "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
            "org.stellar.communityfund.category": "Applications",
            "org.stellar.communityfund.mostRecentPaymentDate": "2022-07-12T00:00:00Z"
          }
        }
      ]
    }
  ]
}