{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar",
    "type": "Foundation",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf-32",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:1",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recDsUIvFwd7tIAXc",
                    "projectId": "daoip5:stellar:project:gearup---marketplace",
                    "projectName": "Gearup - Marketplace",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recDsUIvFwd7tIAXc",
                    "status": "Awarded",
                    "description": "GearUp is a Stellar-based P2P marketplace for African creators to rent, buy, sell gear, studio spaces, courses, and find gig opportunities.",
                    "fundsApprovedInUSD": 74500.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1OhTV5vFjIA9Qka51zLlzhm5GF5B1fmlQ5rN4BcfKA24/edit?tab=t.0",
                        "stellar.productsAndServices": "GearUp is a Stellar-based P2P marketplace for African creators to rent, buy, sell gear, studio spaces, courses, and find gig opportunities.\n\nProducts and Services:\n\n1.  Gear Rentals: Creators can rent equipment such as cameras, lenses, audio gear, lighting, gimbals, drones, and grip tools from local providers.\n    \n1.  Studio Space Rentals: Access to various studio spaces suitable for different creative projects.\n    \n1.  Gear Sales: A platform for buying and selling new or used creative equipment.\n    \n1.  Course Offerings: Creators can sell educational courses related to their expertise.\n    \n1.  Gig Opportunities: Enables creators to find and apply for freelance gigs, connecting them with clients seeking their skills and expertise.\n    \n\nIntegration of Stellar Blockchain:\n\nGearUp integrates Stellar's blockchain technology to enhance its platform.\n\n-   Payment Processing: Utilising Stellar's network for secure, transparent, and efficient transactions, reducing fees and processing times.\n    \n-   Asset Tracking: Implementing Stellar's asset tokenisation to monitor the movement of gear and studio spaces, ensuring accountability and reducing fraud.\n    \n-   Smart Contracts: Employing Stellar's smart contract capabilities to automate asset ownership, rental agreements, course sales, and streamlining operations.\n    \n\nCompetitive Advantages:\n\n-   Enhanced Security: The integration of Stellar Network ensures secure transactions, building trust among users.\n    \n-   Operational Efficiency: Automation of processes reduces administrative overhead, allowing GearUp to focus on user experience.\n    \n-   Scalability: Blockchain technology supports platform growth, accommodating more users and transactions through a decentralised escrow system without compromising performance.\n    \n\nBy leveraging Stellar's blockchain, GearUp aims to provide a secure, efficient, and scalable marketplace for African creators, setting itself apart in the creative industry.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Given that we've already attracted over 500 creatives and organisations on our waitlist, our success criteria would be to have over 1000 users in the first 30 days of launch.",
                        "stellar.tractionEvidence": "Current Traction of GearUp:\n\nUser Base & Transactions:\n\n-   GearUp has built a community of over 350 registered users, including creators, gear owners, and creative professionals across various regions.\n    \n-   Since launching in 2021, GearUp has facilitated over 2500 offline transactions, including rentals, sales, and creative job hires.\n    \n\nRevenue\n\n-   Generated $97,500 in sales revenue and secured $55,000 in grants, showcasing strong financial traction and external validation.\n    \n\nGeographical Presence:\n\n-   GearUp is presently active in different cities (Lagos, Benin, etc) in Nigeria, enabling creators to access gear and studio spaces without geographical barriers.\n    \n\nEvents Covered:\n\n-   Through its media entity, Cyclers Studio, GearUp has successfully covered high-profile events, including weddings, corporate functions, music festivals, and crypto events, further establishing its presence and credibility in the creative space.\n    \n\nPartnerships & Strategic Alliances:\n\n-   We partnered with the Stellar Network to integrate a decentralised escrow system, enhancing transaction transparency and efficiency.\n    \n-   We’ve established a presence in the creative community by leveraging partnerships with local and international brands, aiming to expand its network of creators and gear owners.\n    \n\nPlatform Development:\n\n-   GearUp is in the final stages of developing its peer-to-peer marketplace, with features such as gear insurance, creator hire, and blockchain-based transparency solutions.\n    \n-   GearUp is already live on the Stellar Network Testnet, see the test link below.\n    \n-   The platform is poised to go live on the Stellar Mainnet by October 16th, 2024, with over 500 creators pre-registered to use the service upon launch.\n    \n\nEvidence:\n\n-   Testnet Link: https://gearup.market\n    \n-   Over 84k views and engagement on Instagram and other social media handles. https://docs.google.com/spreadsheets/d/13Q5jZlPlSPIWXT9YzDEYnHU1toMS7Y8O/edit?gid=335701432#gid=335701432\n    \n-   545 Waitlist users, 200+ MoM paying customers/users rely on gearUp for equipment and studio rentals. Click to view the data - https://docs.google.com/spreadsheets/d/13Q5jZlPlSPIWXT9YzDEYnHU1toMS7Y8O/edit?gid=335701432#gid=335701432\n    \n-   Evidence of jobs done: Sabinus Live in Concert Tour. GearUp facilitated the rental of 70% of the Gears used for this concert. \n    \n-   Link to social media channels showcasing user testimonials, events covered, and platform development updates - Cyclers Studio 360 Camera in use, Cyclers Studio Concert Event, Cyclers Studio Concert Event, Wedding Event covered, Gear rental testimonial; Gear rental testimonial; GearUp Github\n    \n-   Links to partnership announcements with Stellar Network and other strategic alliances - Partnerships with top Nigerian Creators - Tacha; MC Edo Pikin; OmahLay; Mayorkun; Stellar Activation Grant; Sony Partnership Announcement; Partnership with BOP Community\n    \n-   Link to media coverage or press releases about GearUp’s impact in the creative industry - Cycler’s World Photography Day; The Independent;",
                        "stellar.goToMarketPlan": "1.  Customer/User Onboarding\n    \n    -   Target Audience: Media creators and clients needing creative services.\n        \n    -   Competitors: Identify gaps and opportunities.\n        \n    -   Unique Value: Blockchain transparency, decentralised escrow, and gear insurance.\n        \n1.  Product Development\n    \n    -   Finalise Features: Support gear rentals, sales, and service bookings.\n        \n    -   Optimise UX: Ensure easy listing and transaction processes.\n        \n1.  Branding & Messaging\n    \n    -   Brand Identity: Develop and maintain a strong logo and tagline.\n        \n    -   Key Messages: Highlight security, transparency, and peer-to-peer benefits.\n        \n1.  Marketing & Promotion\n    \n    -   Digital Channels: Use social media, SEO, and influencer partnerships.\n        \n    -   Email Campaigns: Personalized offers and updates.\n        \n    -   Events: Host or sponsor events to showcase GearUp.\n        \n1.  Sales Strategy\n    \n    -   Partnerships: Collaborate with industry groups and agencies.\n        \n    -   Referrals: Incentivize users to invite others.\n        \n1.  Customer Support\n    \n    -   Responsive Service: Provide excellent support.\n        \n    -   Feedback: Collect and act on user input.\n        \n1.  Launch & Growth\n    \n    -   Soft Launch: Test with a limited audience.\n        \n    -   Full Launch: Broader release with a marketing push.\n        \n    -   Monitor & Optimize: Track metrics and refine strategies.\n        \n1.  Expansion\n    \n    -   Geographic: Expand to new regions.\n        \n    -   Features: Add new services based on demand.",
                        "stellar.tranche1Deliverables": "Brief Description:\n\nIn this MVP phase, we are developing;\n\n-   Course listing for creatives to sell their digital products (Books, tutorials, Audio & Video and courses) on the platform\n    \n-   Studio rentals and lease features with rental agreements also held as Soroban smart contracts\n    \n-   Tokenisation features: Multi-ownership asset listing and fractional ownerships using soroban smart contracts.\n    \n-   We will improve our MVP's existing UI/UX for easier adoption (https://www.figma.com/proto/Y4ZrIpCg4Nu5Ixkm7QAGIL/Gearup?page-id=4573%3A23766&node-id=6690-109875&node-type=canvas&viewport=-714%2C959%2C0.11&t=QJLAully0n2TFBLI-1&scaling=min-zoom&content-scaling=fixed).\n    \n\nHow to Measure Completion:\n\n-   Successfully deployed the improved version of MVP to production with all core functionalities of the marketplace, refined UI/UX, and completed the multi-ownership asset listing feature and fractional ownership smart contracts.\n    \n-   Users will be able to buy and sell courses and rent/lease studio spaces.\n    \n\nEstimated Date of Completion:\n\n-   2.5 months after funding approval.  \n    \n\nBudget Breakdown:\n\n-   Developer salaries: $21,000\n    \n-   Smart contract development and integration: $7,000\n    \n-   UI/UX design: $3,500\n    \n-   Total for MVP Tranche: $31,500 in XLM",
                        "stellar.tranche2Testnet": "Brief Description:\n\nIn this tranche, we will:\n\n-   Develop and integrate the on/off ramping features with the marketplace. Users will be able to make payments using FIAT and XLM. \n    \n-   We will also integrate the Soroban smart contracts on testnet and open up the testnet subdomain for testnet users to interact with the contracts, fractional ownership, and multi-asset listing.\n    \n-   Audit smart contracts and test contracts to ensure security on Testnet  \n    \n\nHow to Measure Completion:\n\n-   There will be a “Pay with XLM” button on the deposit/checkout pages of the marketplace\n    \n-   Smooth on & off ramping on testnet. Sellers will be able to withdraw in FIAT or XLM\n    \n-   Pass all security audit\n    \n\nEstimated Date of Completion:\n\n-   4.5 months after funding approval  \n    \n\nBudget Breakdown:\n\n-   Developer salaries: $21,000\n    \n-   Smart contract audit for all smart contracts: $10,000 (along with Stellar LaunchKit credits)\n    \n-   Server/Infrastructure scaling: $3,000\n    \n-   Total for Testnet Tranche: $34,000 in XLM",
                        "stellar.tranche3Mainnet": "Brief Description:\n\nIn this tranche, we will:\n\n-   Launch the GearUp marketplace on Stellar Mainnet.\n    \n-   All smart contracts will be upgradeable and deployed to Mainnet, and all testnet features will be available on the marketplace.\n    \n-   On/Off ramping will be integrated into Mainnet and Gearup production.\n    \n\nHow to Measure Completion:\n\n-   https://gearup.market will be live and interacting with Stellar main nets. All features, including multi-asset listing, fractional ownership of items, and ramping, will be live.\n    \n-   All smart contracts will be deployed and follow the upgradeable pattern.\n    \n-   Have at least 1000 active users onboarded\n    \n\nEstimated Date of Completion:\n\n-   6 months after funding approval\n    \n\nBudget Breakdown:\n\nDeveloper salary: $5,000\n\nFinal user testing: $2,000\n\nMainnet transaction fee sponsoring: $2,500\n\nTotal for Mainnet Tranche: $9,500",
                        "stellar.teamMembers": "Obasi Francis",
                        "stellar.urls": {
                            "website": "https://gearup.market",
                            "codeRepository": "https://docs.google.com/document/d/1Y945jeVjA3roHo7pkgVUxZ-PNvs7ygROGnjutveWOVM/edit?tab=t.0",
                            "videoURL": "https://www.youtube.com/watch?v=lojJM0eckag"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/gearupmarket",
                            "twitter": "https://twitter.com/Gearupmarket"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 74500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 237425.68,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-07-07T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:2",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recBocurhXA9SC6Xu",
                    "projectId": "daoip5:stellar:project:palremit",
                    "projectName": "Palremit",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recBocurhXA9SC6Xu",
                    "status": "Information Collection",
                    "description": "Palremit is a digital wallet and exchange enabling safe and convenient peer-to-peer financial transactions in multiple currencies.",
                    "fundsApprovedInUSD": 60000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1ueWPaINqDer858cBYAmxAjugS7cx8MnmbjxAxWyjhrU/",
                        "stellar.productsAndServices": "1. Multi-Currency Digital Wallet: Users can store, send, and receive various currencies (e.g., USD, KES) in one wallet.\n\nStellar Integration: Stellar's blockchain enables near-instant, low-cost currency conversions and cross—border payments, ensuring efficient remittances and global access.\n\n|mpact: Reduces transaction costs and delays, increasing accessibility for users in underbanked regions.\n\n2. NFC Hybrid Card (Virtual & Physical): An NFC card accepted in over 150 countries for seamless spending and ATM withdrawals.\n\nStellar Integration: Stellar facilitates real-time currency conversions at point of sale, providing users with the best exchange rates.  \nImpact: Enhances faster transaction with contactless payment and user experience by eliminating the need for multiple currency accounts or conversion steps.\n\n3. Neo-Banking with Virtual Accounts: Provides users with virtual bank accounts in multiple countries, enabling easy cross-border transactions.\n\nStellar Integration: Leverages Stellar’s decentralized exchange to support fast, secure transactions between virtual accounts and local currencies.\n\n|mpact: Simplifies international banking, allowing users to transact as locals in various regions.\n\n4. Remittance Service: Instant, low-cost remittances via ramp and offramp merchants.\n\nStellar Integration: Stellar’s global network of anchors enables instant conversion and transfer of funds between different currencies and countries.\n\nImpact: Expands access to affordable remittance services, particularly for migrants and their families.\n\nImprovements:\n\n-   Scalability: Stellar’s infrastructure supports high transaction volumes, enabling Palremit to scale services as user demand grows.\n    \n-   More Security & Transparency: Stellar’s blockchain ensures secure, transparent transactions, enhancing user trust and compliance with regulations.",
                        "stellar.successCriteria": "#### 1. User Growth and Engagement\n\n-   Total Users: 23,675 onboarded (7,921 active) since February 2024.\n    \n-   Adoption Rate: 30% month-on-month growth.\n    \n-   App Performance: 10,000+ downloads, 300+ daily active users on Google Play and App Store.\n    \n\n#### 2. Financial Impact\n\n-   On track to achieve $2M revenue in Year 1.\n    \n-   Significant transaction volume growth driven by active user engagement.\n    \n\n#### 3. Operational Success\n\n-   High platform reliability with fast Stellar blockchain transactions.\n    \n-   Positive user retention and reviews signal strong product-market fit.\n    \n\n#### 4. Ecosystem Contribution\n\n-   Over 23,000 users onboarded to Stellar, boosting its utility.\n    \n-   Delivering accessible, affordable financial solutions for migrants, freelancers, and tourists.\n    \n\n#### 5. Growth Projections\n\n-   Short-Term: 50,000 users by Q1 2025.\n    \n-   Mid-Term: 100,000 users and $50M transaction volume by end of 2025.\n    \n-   Long-Term: 1M users globally by 2026.",
                        "stellar.tractionEvidence": "-   User Growth and Engagement:\n    \n    -   Total Users: As of November 2024, Palremit has onboarded over 23,675 users, with 7,921 active users. This means there is a strong interest and engagement with us.\n        \n    -   Adoption Rate: Palremit's month-on-month adoption rate of 30% indicates a rapidly growing user base, driven by our unique offerings and competitive fees.\n        \n    -   Google Play and App Store Performance: With over 10,000 downloads and 300+ daily active users, Palremit is clearly resonating with its target audience.",
                        "stellar.goToMarketPlan": "1. Market Opportunity\n\n-   Target Segments: Tourists, freelancers, and migrants needing cross-border payments and multi-currency solutions.\n    \n-   Market Size: $830B global remittance market, $20B freelance cross-border payments.\n    \n-   Focus Regions: Africa, Europe, North America.\n    \n\n2. Value Proposition\n\n-   Unified digital wallet for fiat and crypto.\n    \n-   Neo-banking with virtual accounts in USD and local currencies.\n    \n-   NFC Hybrid cards usable in 150+ countries.\n    \n-   Low fees, fast cross-border transactions via Stellar blockchain.\n    \n\n3. Launch Strategy\n\n#### Phase 1: Launch (3-6 Months)\n\n-   Deploy MVP with wallet, neo-banking, and basic remittance functionality.\n    \n-   Achieve 10,000 users via referral bonuses and first-transaction discounts.\n    \n-   Budget: $60K.\n    \n\n#### Phase 2: Growth (6-12 Months)\n\n-   Expand into additional remittance corridors (Africa, Asia, South America).\n    \n-   Scale to 50,000 users and $10M transaction volume monthly.\n    \n-   Add advanced features like more fiat/crypto options, currencies and networks.\n    \n\n4. Revenue Model\n\n-   Transaction Fees: Fiat/crypto transfers.\n    \n-   Subscription: Premium features and hybrid cards.\n    \n-   Interchange Fees: Card transactions.\n    \n-   Projected Revenue: $2M in Year 1, $10M in Year 2.\n    \n\n5. Competitive Edge\n\n-   Lower fees and faster transactions with Stellar blockchain.\n    \n-   Hybrid solution for fiat and crypto, targeting underserved users.",
                        "stellar.tranche1Deliverables": "Deliverable 1: Multi-currency Digital Wallet (MVP)\n\n-   Description: Develop and launch the core wallet functionality that allows users to store, send, and receive multiple currencies (fiat and crypto) with basic U!/UX.\n    \n-   How to Measure Completion: Successful deployment of the wallet on the Palremit platform, with users able to create accounts, deposit funds, and make transactions in at least two fiat currencies and one cryptocurrency.\n    \n-   Estimated Date of Completion: 1 month from project start.\n    \n\nDeliverable 2: Neo-Banking Features (MVP)\n\n-   Description: Develop virtual account functionalities for users in key markets (e.g., Nigeria, Kenya, etc) allowing access to USD accounts.\n    \n-   How to Measure Completion: Users can successfully open and operate virtual USD, EURO/GBP accounts, with transaction capability enabled.\n    \n-   Estimated Date of Completion: 2 months from project start.\n    \n-   Budget: $10,000",
                        "stellar.tranche2Testnet": "Deliverable 1: Integration with Stellar TestNet\n\n-   Description: Integrate the multi-currency digital wallet and neo-banking features developed in the MVP phase with the Stellar TestNet. This includes testing transactions in fiat and crypto using Stellar protocols, validating token issuance, and ensuring compliance with network operations.\n    \n-   How to Measure Completion: Successful execution of multi-currency transactions on Stellar TestNet, validated by at least 500 test transactions across multiple accounts and currencies.\n    \n-   Estimated Date of Completion: 3 months from project start.\n    \n\nDeliverable 2: KYC/AML Compliance Integration\n\n-   Description: Integrate a KYC/AML compliance module to verify user identities on the TestNet environment. This will ensure regulatory compliance for fiat and crypto transactions.\n    \n-   How to Measure Completion: Successful onboarding of at least 100 test users with KYC/AML verification completed, enabling them to access wallet features.\n    \n-   Estimated Date of Completion: 4 months from project start.\n    \n\nDeliverable 3: Advanced Neo-Banking Test Features\n\n-   Description: Test and validate advanced neo-banking features on Stellar TestNet, including cross-border transfers and multi-currency account management, leveraging Stellar's network for fast and low-cost transactions.\n    \n-   How to Measure Completion: Execution of at least 200 successful cross-border test transactions with a failure rate below 2%, alongside smooth operation of multi-currency account management tools.\n    \n-   Estimated Date of Completion: 4 months from project start.\n    \n-   Budget: $40,000",
                        "stellar.tranche3Mainnet": "#### Deliverable 1: MainNet Launch of Multi-Currency Digital Wallet\n\n-   Description: Deploy the fully operational multi-currency digital wallet on the Stellar MainNet. This includes fiat and cryptocurrency support with robust security and optimized UI/UX.\n    \n-   How to Measure Completion: Successful onboarding of 10,000 active users within the first month of launch, with wallet transactions (fiat and crypto) processed seamlessly on the MainNet.\n    \n-   Estimated Date of Completion: 5 months from project start.\n    \n\n#### Deliverable 2: Neo-Banking MainNet Features\n\n-   Description: Fully enable virtual account functionalities for users in key markets, allowing seamless operations with USD accounts and other key currencies on the Stellar MainNet.\n    \n-   How to Measure Completion: At least 5,000 virtual USD accounts successfully created, with users completing deposit, withdrawal, and transfer transactions.\n    \n-   Estimated Date of Completion: 6 months from project start.\n    \n\n#### Deliverable 3: Cross-Border Payments and Remittances\n\n-   Description: Launch a fully integrated cross-border payments solution utilizing Stellar’s low-cost, high-speed infrastructure for remittances and international transfers.\n    \n-   How to Measure Completion: Process at least $500,000 equivalent in transaction volume across fiat and crypto within 2 months of launch, with successful operation of ramp/off-ramp partnerships.\n    \n-   Estimated Date of Completion: 6 months from project start.\n    \n-   Budget: $10,000",
                        "stellar.teamMembers": "Palremit",
                        "stellar.urls": {
                            "website": "https://palremit.com",
                            "codeRepository": "https://github.com/palremit",
                            "videoURL": "https://youtube.com/shorts/JylFCKC0qRc",
                            "pitchDeck": "https://docsend.com/view/999uyqykrdskmzn7"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/palremit/",
                            "twitter": "https://x.com/palremit"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 130007.54,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:3",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recr8lMAr4tFTrfDt",
                    "projectId": "daoip5:stellar:project:unalivio",
                    "projectName": "Unalivio",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recr8lMAr4tFTrfDt",
                    "status": "Awarded",
                    "description": "Unalivio allows SMEs to sell online locally and internationally and get paid in USDC; ON THIS SUBMISSION we'll add Pago movil, used by almost 100% banked citizens in Venezuela, which will open up massive growth for Unalivio.",
                    "fundsApprovedInUSD": 18475.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://whimsical.com/un-alivio-november-submition-5qbeaQcPbwFgvXcFsWUiiN",
                        "stellar.productsAndServices": "Summary of what we have built & learned\n\nIn our Q4 2023 submission we built our MVP and tested demand with one cash in option as well as USDC on Stellar and Bitcoin payments; this validated interest on the product, and showed we could improve easiness.\n\nIn our July 2024 submission we added cards and three more countries for cash in, and saw usage improve importantly. We also migrated from a marketplace format to an online store for merchants, and that brought us more than 200% increase in sales.\n\nSee our growth chart for signups and transactions here: https://imgur.com/a/jh9WBd6\n\nTHIS SUBMISSION WORKPLAN:\n\nIncrease usage 3-fold and volume 5-fold by adding local payments, which will open doors to greatly grow USDC exchange via p2p\n\n1.  Add local cash in method in Venezuela: Pago Móvil\n    \n    We currently only accept payments from abroad, but after doing a pilot in one location, we realized local payments are highly desired by users and estimate that we will increase our transaction count at least 3x! This will enable us to serve 100% of their clients and not just the 10% who actually are using it now from international purchases. \n    \n1.  Work with our legal partners in order complete the set up of our legal entities in Venezuela and finetune Mexico in order have a frictionless connection to banking systems \n    \n    Set up an entity that is connected to the banking system and can allow us to launch our pago móvil collection scheme in Venezuela, and submit additional documentation to comply with local requirements in Mexico.\n    \n1.  Build exchange module base for Venezuelan fiat-USDC exchange\n    \n    After we are able to receive local fiat, we will exchange this into USDC in order to protect from inflation. In order to do this we will build and connect a rate information tool that will enable to know the exchange rate in an inflation economy in order to get accurate data for every time money is collected and exchanged to USDC via p2p systems and the official rate shared by central bank.",
                        "stellar.successCriteria": "We define success by measuring growth on three simple key metrics, and our ONE KING KPI:\n\nThree key metrics are:\n\n-Merchants onboarded,\n\n-Potential customers engaged,\n\n-Orders created\n\nKING KPI\n\n-   Paid orders\n    \n    -   Nr of orders and\n        \n    -   volume sold\n        \n\nWe expect to grow fivefold and be at an average of 500 paid orders a month at the end of Q1 2025, with a volume of at least 10k USD MRR",
                        "stellar.tractionEvidence": "Since our July proposal we have ramped up growth by focusing on fine tuning our product and customer acquisition tactics.\n\nWe focused efforts on top merchants in 15 physical locations, serving 8,000+ client/Mo. In this ecosystem we’ve achieved triple-digit growth in signups per Q, surpassing 1,000 signups/month. We are now obsessed on conversions!\n\nSee our growth graphs:\n\n-   Signups and transactions https://imgur.com/a/jh9WBd6\n    \n-   Visits to our signup page: https://imgur.com/a/zx6Kxxj\n    \n\nSome stats on Unalivio\n\n1.  71% signups growth per quarter.\n    \n1.  Average sales growth of 40% per Q\n    \n1.  We surpassed 1000 signups a month, now we will focus on conversions.\n    \n1.  Unalivio's social media community is 5k people strong. Instagram is our most important channel! Follow us on  https://www.instagram.com/somosunalivio/.\n    \n1.  Cumulative user base of 7k+ registrations (Average 30 signups/Day https://imgur.com/a/zx6Kxxj)\n    \n\nOur current customer acquisition focuses on a one-by-one process, which is ok for our current stage, and a process we will continue to use until we hit the 50 merchant mark.\n\nWe will also increase the amount of stellar transactions inside of our process by bringing more crypto users and increasing stellar transactions with a crypto specific, donation campaign. \n\nWe focus on merchants in underserved verticals, especially in gifting and quick decision purchases.",
                        "stellar.goToMarketPlan": "Ernesto, Fabian, and the founding team bring nearly 20 years of combined experience in crypto networks, payments, and fintech experience leveraging a strong network of organizations and merchants to grow Unalivio. Fabian previously founded Glufco, a P2P and payments solution tailored to Venezuela with over 15,000 users. Ernesto spearheaded Dash initiatives in LatAm, onboarding chains like Church’s Chicken and Excelsior Gama to accept crypto.\n\nUnalivio's go to market plan is now focused on two key approaches:  \n\n1.  Online Payments for Brick-and-Mortar: Simplifying online payment acceptance for retailers who want to sell online but previously could not do it . We let them have a balance of USDC on Stellar to avoid inflation.\n    \n1.  International Payments: Enabling merchants to transact cross-border payments through Unalivio, which is something they could not do at all previously.\n    \n\nWe onboarded about a dozen merchants on a one by one basis, and plan to double this before we deploy automatic tools.\n\nWe are iterating our product with laser focus before we expand, in order to avoid wasting resources.\n\nAs part of our merchant onboarding we will be testing the cross border scheme with a community in Mexico, involving incentivized brand ambassadors to sign up and promote usage.\n\nWe will continue in-store promotions, cashier training, point-of-sale materials, and social media efforts, particularly via Instagram with our 5,000 followers on  https://www.instagram.com/somosunalivio/.\n\nSee our pitchdeck here\n\nhttps://docs.google.com/presentation/d/1RMvvwe6DXJHXoRoixjGPcdswVtXsArbMKMtvX0oAN70/edit?usp=sharing\n\nAfter completing deliverables on this proposal we aim to increase our total nr of sales between three to five times as a result of having local fiat payment and overall product improvements.",
                        "stellar.tranche1Deliverables": "[D1] Add local cash in method in Venezuela: Pago Móvil\n\n1.  Brief description: We currently only accept international payments. And after a pilot, we realized local payments will increase our transaction count at least 3x, as this will enable us to serve 100% of clients and not just the % who use it now to receive international purchases. \n    \n1.  How to measure completion: Local Pago movil Bank purchases are live from Venezuela in at least one of our merchants. \n    \n1.  Estimated date of completion: 3 weeks after funding receipt (Before Jan 1st).\n    \n1.  Technical development and testing: 9,100\n    \n    a.  100 hours backend 50 $/Hr; \n        \n    a.  50 hours Frontend at 40 USD \n        \n    a.  40 hours UX/UI at 35 $/Hr each, and \n        \n    a.  20 Hours QA at 35 USD/Hr\n        \n\n(In order to make this happen legally, we will set up a Venezuelan company, see tranche two, D2)",
                        "stellar.tranche2Testnet": "[D1] Expand local cash in method in Venezuela to all our users: Pago Móvil\n\n1.  Brief description: After running our MVP in one location, we will finetune the automation process and expand to all our merchant base, and run QA \n    \n1.  How to measure completion: Local Pago movil Bank purchases are live from Venezuela in all of our merchants. \n    \n1.  Estimated date of completion: 2 weeks after funding (Around Jan 15th).\n    \n1.  Technical improvements, testing and QA: 3,100\n    \n    a.  10 hours backend 50 $/Hr; \n        \n    a.  10 hours Frontend at 40 USD \n        \n    a.  15 hours UX/UI at 35 $/Hr each, and \n        \n    a.  25 Hours QA at 35 USD/Hr\n        \n\n[D2] Complete legal requests for operation in Mexico and Venezuela for Cash in \n\nWork with our legal partners in order complete the set up of our legal entities in Venezuela and finetune Mexico in order to connect to the banking systems \n\nIn Venezuela:\n\nSet up an entity connected to banking system and can allow us to launch our pago móvil collection scheme. Our founder has completed the process previously, and has all the needed know-how.\n\nIn Mexico:\n\nWe were requested by our partners to submit additional documentation to comply with regulation, including adjusting information such as terms and conditions, and review documents that will be notarized\n\n1.  How to measure completion: Cards with PMI in Mexico and Pago movil in Venezuela are up and running for local payments.\n    \n1.  Estimated date of completion: 2 weeks after funding (January 15th.)\n    \n1.  Budget: $2,500 + 1500 (Venezuela set up + Mexican docs) Total 4,000 USD\n    \n\nTotal Tranche 2: 7,100 USD,\n\nDate of completion: January 20th",
                        "stellar.tranche3Mainnet": "[D3] Build exchange module base for Venezuelan fiat-USDC exchange and deploy on mainnet\n\n1.  Measure local fiat sales and exchange rate data for each Bolivar received\n    \n1.  Create BOT to obtain current market rate of Bolivar FIAT from official sources\n    \n1.  Send report as source to p2p liquidity exchange providers\n    \n\nHow to measure completion: Bot is working and automatically updating exchange rate on site. We can prove functionality of this bot by sharing our internal database, which will track rate changes on real time, and provide an outcome that can be validated vs source sites (Such as Venezuelan central bank)\n\nEstimated date of completion: 2 weeks after funding (February 1st.)\n\nBudget: Technical development and testing: 2,275\n\n(20 hours backend, 10 hours front-End. 10 hours UX and 15 hours QA)",
                        "stellar.teamMembers": "Ernesto Contreras , fabians19, Yenderlhy Zapata",
                        "stellar.urls": {
                            "website": "https://unalivio.com/",
                            "codeRepository": "https://whimsical.com/un-alivio-november-submition-5qbeaQcPbwFgvXcFsWUiiN",
                            "videoURL": "https://youtu.be/bZT6wz9_6Mo"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/somosunalivio"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 18475.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 55165.69,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-13T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:4",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recs9qGnchF6Ealxu",
                    "projectId": "daoip5:stellar:project:socketfi",
                    "projectName": "SocketFi",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recs9qGnchF6Ealxu",
                    "status": "Awarded",
                    "description": "SocketFi is a smart wallet app built on Soroban, providing seamless Web3 access via social media sign-ins, enabling millions of social media users to connect with dApps and Web3 projects effortlessly.",
                    "fundsApprovedInUSD": 88200.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.socket.fi/technical-details",
                        "stellar.productsAndServices": "SocketFi is a smart wallet dApp built on Soroban and the Stellar ecosystem, designed to seamlessly connect millions of social media users to Web3. It provides a non-custodial alternative to traditional wallets by enabling smart wallet creation via social media sign-ins, simplifying blockchain adoption for everyday users.\n\nWith SocketFi, interacting with Web3 dApps and blockchain tools becomes easy. Users will be able to seamlessly connect to Web3 using their preferred social sign-ins, significantly reducing the friction of onboarding millions of everyday social media users who find Web3 complex.\n\nAddressing Feedback from SCF31 Submission\n---------------------------------------------\n\nFollowing feedback from our SCF31 submission, the SocketFi team has implemented several improvements and changes:\n\nReview of Project Budget and Scope\n\nTo address concerns regarding the project’s high budget and broad scope, we have adopted a streamlined approach to enhance focus and cost efficiency:\n\n-   Clarified Objectives: SocketFi’s objectives were refined, prioritizing core goals and functionalities. Features have been categorized into essential, optional, and future enhancements. This allows us to focus on delivering critical functionalities first while deferring less urgent elements to later phases, simplifying development without compromising quality.\n    \n-   Optimized Budget: The budget was reassessed, itemizing all expenses and identifying high-cost areas. Cost-saving measures were adopted, including the use of open-source tools, existing frameworks, and outsourcing specific tasks.\n    \n-   Structured Development Process: A detailed roadmap, with clear deliverables, deadlines, and milestones, now structures the project, enabling efficient progress tracking.\n    \n\nThese measures have successfully refined the project scope, optimized the budget, and established a focused, iterative development process, positioning the project for success.\n\nSocketFi SDK and Enhanced User Experience\n\nIn response to feedback regarding the success dependency on the SocketFi dApp portal UI, we have expanded SocketFi into a service. With the development of the SocketFi SDK, a toolkit that allows Stellar-based projects to integrate the SocketFi wallet as a login option, users will be able to seamlessly connect to dApps through social login within the dApp's UI, significantly reducing reliance on the SocketFi portal for success.\n\nAdditionally, we have prioritized creating an intuitive, user-friendly interface, ensuring an exceptional user experience with a focus on accessibility and ease of use.\n\nTo bolster user acquisition, we have implemented targeted strategies, including:\n\n-   Partnerships within the Stellar ecosystem.\n    \n-   An incentivized community participation approach.\n    \n-   Engaging marketing campaigns.\n    \n\nThese efforts will strengthen our user base and drive widespread adoption.\n\nAmbitious \"Super App\" Vision with a Phased Rollout\n\nWhile SocketFi is still in the development phase, positioning it as a \"super app\" is an ambitious goal. To achieve this, we have adopted a phased rollout strategy. Initially, we are focusing on core functionalities, including the SDK that allows dApps to independently integrate the SocketFi wallet. Over time, we will expand to include broader features, ultimately enabling users to access hundreds of dApps built on Soroban and Stellar from a unified platform.\n\nTechnical Clarification: Sending Funds Using Social Media Usernames\n\nIn the current version, users can send funds from accounts created with Twitter sign-in. However, they currently need to manually enter the recipient's wallet address. Future updates will enable fund transfers using usernames.\n\nOur implementation utilizes an on-chain mapping system within the smart wallet that associates Twitter usernames (and other social platform identifiers) with Soroban smart contract addresses (smart accounts). This system ensures that when a user enters a recipient's Twitter handle (and other supported platform identifiers), it is securely mapped to the corresponding wallet address.\n\nThe mapping operates by storing username-address pairs in the main (controller) smart contract, which can be accessed through a smart contract function that securely resolves the username to its associated wallet address. To ensure security, only usernames linked to a smart accounts will be resolvable, protecting against impersonation and errors. More details on this implementation have also been included in our technical document.\n\nKey Features and Benefits of SocketFi\n-----------------------------------------\n\n-   Convenience and Accessibility: Social media login streamlines account creation and access, eliminating the need for password management and encouraging broader adoption.\n    \n-   Enhanced Security: Zero-knowledge (ZK) proofs and encrypted sensitive data ensure secure account verification without exposing private information, protecting users from phishing and brute-force attacks.\n    \n-   Streamlined User Experience: New users benefit from a simple onboarding process, while returning users enjoy quick access without re-verification.\n    \n-   Account Abstraction: Offers flexibility by allowing users to switch between external wallets and social media accounts, ensuring robust access management.\n    \n-   Engagement Incentives: Users earn rewards for wallet usage and participation in blockchain activities, boosting ecosystem involvement.\n    \n\nEcosystem Impact\n--------------------\n\nSocketFi provides distinct benefits and advantages to the Soroban and Stellar ecosystems, these includes:\n\n-   User Expansion: Simplifies Web3 access for social media users, driving adoption of Soroban and Stellar by lowering technical barriers.\n    \n-   Increased Network Activity: Incentivizes wallet use, participation in dApps, and engagement with Stellar-based projects, enhancing transaction volumes and ecosystem growth.\n    \n-   Enhanced Ecosystem Visibility: Partnerships with dApps and DeFi protocols highlight Soroban's capabilities, attracting developers and users from other blockchains.\n    \n-   Seamless dApp Onboarding: Integrates Stellar-based dApps within the wallet, offering a unified user experience that encourages exploration of the Stellar ecosystem.\n    \n-   Community Advocacy: Incentive programs and quests foster active community participation, building a supportive network that strengthens Soroban and Stellar's long-term resilience.\n    \n\nSocketFi not only simplifies Web3 onboarding for social media users but also amplifies the Soroban and Stellar ecosystems through adoption, engagement, and visibility.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success criteria for SocketFi are measured using several metrics. These include the following:\n\nSDK Integration\n\n-   Metrics: Measure the number of projects integrating the SocketFi wallet into their dApps, as well as the number of active users and the transaction volume seen on those dApps. With target of 2-5 new dApps each month and an average of 1000 active users per dApp within the first six months.\n    \n\nUser Adoption and Growth\n\n-   Metrics: Achieve target active user numbers within the first month, six months, and one year. For example, aim for 1,000 users in the first month, 25,000 users within six months, and 100,000 users within the first year.\n    \n-   Engagement Level: Measure user engagement through daily active users (DAU) and monthly active users (MAU).\n    \n-   Retention Rates: Maintain a retention rate of at least 60% over six months, indicating user satisfaction and continued app usage.\n    \n\nTotal Value Deposited by All Users\n\n-   Total Deposits Metrics: Track the total value of assets deposited by users, targeting key milestones. For example, aim for $100,000 in deposits within the first two months and $1 million within the first year.\n    \n\nTransaction Volume\n\n-   Transaction Metrics: Monitor the number and volume of transactions processed through SocketFi, with a goal of significant growth (e.g., a 30% month-over-month increase).\n    \n-   Onboarding: Track the number of users completing their first transaction within the first week of sign-up.\n    \n\nCommunity Engagement\n\n-   Active Participation: Foster participation in community quests, events, and discussions, with a target engagement rate of at least 50% (e.g., at least 50% of users participating in at least one community activity).\n    \n\nPartnerships and Collaborations\n\n-   Strategic Partnerships: Establish partnerships with at least ten leading dApps and projects in the Soroban ecosystem within the first year.\n    \n-   Joint Marketing Initiatives: Launch joint marketing campaigns to boost brand awareness and user acquisition, with measurable reach and engagement from these initiatives.",
                        "stellar.tractionEvidence": "Although SocketFi’s smart wallet super app is still in development, we have launched a minimal-feature version of the smart wallet on Soroban Futurenet, made publicly accessible on October 21, 2024. Since then, we’ve seen rapid engagement: over 250 smart subwallets have been created, each representing a unique smart contract account linked to individual users, eliminating the need for conventional wallet accounts. The dApp has logged more than 1,000 visits and over 200 transactions, with approximately $20,000 in Futurenet assets deposited.\n\nWith this early traction, we aim to exceed 1,000 active users within the next month, achieving over 10,000 transactions and managing more than $100,000 in deposited assets. These metrics highlight SocketFi’s appeal as a seamless, smart wallet alternative to conventional wallets.",
                        "stellar.goToMarketPlan": "SocketFi is a smart wallet super app built on the Soroban blockchain to connect millions of social media users to Web3. Our go-to-market approach emphasizes community-building, partnerships with dApps, projects, and KOLs, and accessible onboarding, with a strong focus on educating and engaging users unfamiliar with blockchain technology.\n\n1. Technical Support for SDK Integration\n\nProvide robust technical support to assist dApps and projects in integrating the SocketFi SDK into their platforms. This will ensure smooth integration and enhance growth and adoption:\n\n-   Comprehensive SDK Documentation: Develop and maintain detailed, easy-to-understand documentation to guide developers through the process of integrating SocketFi’s SDK into their applications.\n    \n-   Dedicated Support Channels: Set up dedicated communication channels (e.g., a support team, live chat, or Discord) where developers can ask questions, report issues, and receive quick assistance.\n    \n-   Integration Workshops and Webinars: Host regular workshops and webinars where developers can learn how to implement SocketFi into their dApps, ask questions, and get live support.\n    \n-   SDK Updates and Feature Requests: Regularly update the SDK with new features and optimizations based on developer feedback. Provide a clear process for developers to suggest new features or improvements.\n    \n\n2. Community-Driven Growth\n\nThis strategy leverages community engagement to drive awareness and adoption. Key approaches include:\n\n-   Referral and Reward Programs: Incentivize user referrals, offering referrers and new users exclusive benefits like early access, token incentives, or tiered privileges.\n    \n-   Ambassador Program: Launch a SocketFi ambassador initiative with influential users and enthusiasts to promote the app within their communities, particularly on social media. Provide educational content to aid user onboarding.\n    \n-   Virtual Events and Q&As: Host live sessions with the team for community engagement, feedback collection, and project roadmap discussions.\n    \n\n3. Quests and Gamification\n\nEngage users through quests and gamification, keeping the community active and involved:\n\n-   SocketFi Quests: Introduce both on-chain and off-chain quests where users earn points and potential rewards, encouraging continuous engagement.\n    \n-   Accessible Mini Apps: Make quests easily accessible through a Telegram mini app, where users can share referral links, participate in quests, and earn points in a gamified experience.\n    \n\n4. Collaborations with Web3 Projects and dApps\n\nFoster partnerships with DeFi, NFT, and other Web3 projects within the Soroban ecosystem to add immediate value for new users:\n\n-   Integration with Leading dApps: Work with dApps and decentralized exchanges on Stellar, enhancing the SocketFi ecosystem by improving usability and providing one-click access.\n    \n-   Cross-Promotion: Co-promote SocketFi with partner dApps through content, rewards, or limited-time promotions, demonstrating seamless integration for SocketFi users.\n    \n-   Joint Launch Events: Organize collaborative launch events and AMAs to raise awareness and engagement within the Web3 ecosystem.\n    \n\n5. Engagement with the Stellar Community\n\nLeverage Stellar’s network and resources to boost SocketFi’s user base and credibility:\n\n-   Stellar Ecosystem Events: Participate in Stellar-hosted events and community meetups to build connections and highlight SocketFi’s unique contributions.\n    \n-   Developer Engagement: Collaborate with Stellar developers to create new tools and features, enhancing SocketFi’s functionality and supporting ongoing innovations.\n    \n\n6. Targeted Social Media Marketing and KOL Partnerships\n\nIntroduce SocketFi to social media audiences with accessible, engaging marketing and partnerships with trusted influencers:\n\n-   KOL Partnerships: Collaborate with Key Opinion Leaders (KOLs) in tech, crypto, finance, and lifestyle sectors to build credibility and expand reach. KOLs can demonstrate SocketFi’s usability and benefits for both new and experienced Web3 users.\n    \n-   Influencer Marketing Campaigns: Run targeted campaigns with influencers on platforms like Instagram, Twitter, and TikTok to showcase SocketFi’s unique features.\n    \n-   Social Media Ads: Deploy paid ads targeting users interested in blockchain, DeFi, and technology advancements to drive awareness and downloads.\n    \n\n7. Educational and Onboarding Content\n\nEducate users on Web3 basics and SocketFi’s ease of use, addressing common questions and concerns for new blockchain users:\n\n-   Onboarding Tutorials: Develop step-by-step guides for account creation, asset management, token swapping, and staking, accessible in-app and across social media channels.\n    \n-   Video Content: Publish concise educational videos to demystify Web3 concepts, emphasizing how SocketFi simplifies the user experience.\n    \n-   Interactive Gamification: Incorporate gamified onboarding elements, rewarding users for completing steps or exploring app features.\n    \n\n8. Beta Launch and Early Access Program\n\nGather early user feedback to refine the app and build anticipation for the public release:\n\n-   Invite-Only Beta Access: Launch a closed beta for select users to test features and provide feedback.\n    \n-   Exclusive Beta Rewards: Offer tokens or special privileges to early users as incentives for their feedback.\n    \n-   Iterative Improvement: Regularly update the app based on beta feedback to enhance user experience before full launch.\n    \n\n9. In-App Engagement and Retention Strategies\n\nEncourage continuous use of SocketFi through rewards, gamification, and timely notifications:\n\n-   Quests, Challenges, and Rewards: Launch “engage-to-earn” quests within SocketFi, motivating users to explore features and interact with dApps.\n    \n-   Educational Challenges: Integrate in-app challenges that encourage users to complete Web3 learning modules, rewarding them for milestones.\n    \n-   Push Notifications: Keep users informed about new features, dApp integrations, and rewards to sustain engagement.",
                        "stellar.tranche1Deliverables": "Deliverable 1: SocketFi Smart Wallet Core Functionalities\n\n#### Brief Description:\n\nThe SocketFi smart wallet app MVP core functionality will be developed and accessible to users on both Testnet and Futurenet. Additionally, a closed beta version will be available on Mainnet, allowing users with early access to test these functionalities on the Mainnet.\n\nThe core functionalities include creation of account, send and receive tokens, set allowance, set external owner wallet, sign transaction etc.\n\n#### Measure of Completion:\n\nThe following measures indicate completion:\n\n-   Users will be able to create smart wallet accounts on SocketFi using social media sign-in on both Testnet and Futurenet. Users granted early access will also be able to create accounts in the Mainnet closed beta.\n    \n-   Users will be able to transfer assets to their smart wallets and send assets from their smart wallets to an external account and social usernames/identifiers on both Testnet and Futurenet. Users with early access will also be able to do the same on Mainnet closed beta.\n    \n-   Users will be able to configure account settings, such as allowances per asset and external owner wallets, on both Testnet and Futurenet. Users with early access will also be able to do this on the Mainnet closed beta.\n    \n\n#### Estimated Date of Completion:\n\nJanuary 15. 2025\n\n#### Budget:\n\n$9,800\n\nDeliverable 2: SocketFi Smart Wallet SDK\n\n#### Brief Description:\n\nThe SocketFi smart wallet SDK will be developed and made available to projects and dApps for easy integration of SocketFi wallet.\n\n#### Measure of Completion:\n\nThe following measures indicate completion:\n\n-   Projects and dApps will be able to integrate SocketFi dApp via our wallet SDK.\n    \n-   Users will be able to use SocketFi to connect and interact with dApps that has SocketFi integrated. dApp interaction will be available on both Testnet and Futurenet. Users granted early access will also be able to interact with dApps on Mainnet.\n    \n\n#### Estimated Date of Completion:\n\nFebruary 5. 2025\n\n#### Budget:\n\n$9,800\n\nDeliverable 3: SocketFi dApp Integration\n\n#### Brief Description:\n\nThe SocketFi smart wallet dApp integration will be completed for 3-5 dApps that are built on Soroban. Users will be able to test the integration on Testnet and Futurenet (for dApps with live test network dApps). Additionally, a closed beta version will be available on Mainnet, allowing users with early access to test interacting with integrated dApps on the Mainnet. This is important because some features may not be available on the test networks. For instance, swapping tokens on an integrated dApps/DEXs may not support test networks and/or test network tokens.\n\n#### Measure of Completion:\n\nThe following measures indicate completion:\n\n-   Users with accounts will be able to interact with dApps using their smart wallet. For example, swapping tokens on connected DEXs will be possible, bridge assets, buy NFTs on P2P marketplaces etc within SocketFi dApp portal.\n    \n\n#### Estimated Date of Completion:\n\nMarch 15. 2025\n\n#### Budget:\n\n$9,800\n\nTranche 1 Total Budget\n\n$29,400",
                        "stellar.tranche2Testnet": "Deliverable 1: SocketFi Smart Wallet MVP Testnet Officially Live\n\n#### Brief Description:\n\nOfficial Testnet Launch: The SocketFi smart wallet super app MVP with all the functionalities and features described in Tranche 1 will be officially live on all test networks to all users. Also, a closed beta version will be available on Mainnet, allowing users with early access to test all the wallet's functionalities and features on the Mainnet.\n\n#### Measure of Completion:\n\nThe following measures indicate completion:\n\n-   Detailed reports on bugs will be collected from dApps/projects with SocketFi integrated, and users. The team will continue to fix it in preparation for audit and Mainnet launch\n    \n\n#### Estimated Date of Completion:\n\nApril 15. 2025",
                        "stellar.tranche3Mainnet": "Deliverable 1: SocketFi Smart Wallet Mainnet Launch\n\n#### Brief Description:\n\nOfficial Mainnet Launch: The SocketFi smart wallet super app will officially go live on Mainnet and all dApps/projects building on the Stellar ecosystem will be able to integrate it and also, all users will be able to access the wallet, and use all its functionalities and features on Mainnet.\n\n#### Measure of Completion:\n\nThe following measures indicate completion:\n\n-   Projects and dApps will be able to integrate SocketFi wallet within their dApps\n    \n-   All users will be able to create smart wallet accounts on SocketFi using social media sign-in on Mainnet.\n    \n-   All users will be able to transfer assets to their smart wallets and send assets from their smart wallets to an external account on Mainnet.\n    \n-   All users will be able to configure account settings, such as allowances per asset and external owner wallets on Mainnet.\n    \n-   All users will be able to interact with dApps using their smart wallet on Mainnet, both of dApps with SocketFi integrated and on SocketFi's dApp portal.\n    \n\n#### Estimated Date of Completion:\n\nApril 15. 2025\n\n#### Budget:\n\n$29,400",
                        "stellar.teamMembers": "Shola Otitoju",
                        "stellar.urls": {
                            "website": "https://app.socket.fi/",
                            "codeRepository": "https://github.com/orgs/Socket-Fi/repositories",
                            "videoURL": "https://www.youtube.com/watch?v=Jr16v96-Xg4"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/Socket_Fi"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 58800.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 176401.52,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-01T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:5",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recy3we2U8HQUaOR6",
                    "projectId": "daoip5:stellar:project:abroad",
                    "projectName": "Abroad",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recy3we2U8HQUaOR6",
                    "status": "Awarded",
                    "description": "Connecting the Stellar Blockchain with the Colombian banking system to allow users make in-real-life payments with their USDC through local QR codes.",
                    "fundsApprovedInUSD": 56120.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1pHFnhhsqHTC_73HpjVdDyNR0j0JT6tzTPoomK-qcx4U/edit?tab=t.0#heading=h.7z2o8y7ws5yo",
                        "stellar.productsAndServices": "Products:\n\n-   Apis for easy integration.\n    \n-   Payment Widget: Wallets will be able to offer our solutions to their customers without UI development.\n    \n\n  \nServices:\n\n-   On/Off instant ramping between USDC and COP.\n    \n-   Wallet interoperability: Users will easily interact between Blockchain and TradFi, without even noticing.\n    \n-   Fiat QR payments: When an user scans a FIAT QR code for payment in local currency, we will orchestrate all the flow from Crypto to Fiat (COP).\n    \n-   Fiat QR money requests: We provide a QR code for the user to exhibit to its pair in order to obtain COP. The payee can scan the QR code with their local wallet (Nequi or any other bank), and the requester will receive the funds in USDC (in their Stellar wallet like Decaf or Beans)",
                        "stellar.successCriteria": "1.  Develop the proposed integrations and deliver on time.\n    \n1.  Integration with Decaf and at least another wallet like Beans of AirTM. This will proof that we are providing real utility of Blockchain for people.\n    \n1.  Expanding Financial Access: By integrating our solution, wallets will be able to offer instant payments and withdrawals in Colombia. Users will have more options to use their crypto in real life. We will keep and eye to understand if people is considering our solution useful. If so, this will definitely confirm our success for this initial stage.\n    \n1.  User adoption: The initial traction in Colombia will confirm the need for a solution like this in the Region.\n    \n1.  Transactional Volume: We expect to serve +50K users and process +$2M by Q2 of 2025. Meeting this numbers will confirm our success.",
                        "stellar.tractionEvidence": "The following document shows the traction obtained during the last couple of months.  \nhttps://docs.google.com/document/d/1uZ0PXWOKqOJ-Aie4ZL1aCssG7cLR-KgUopHT_xDiKLs/edit?usp=sharing",
                        "stellar.goToMarketPlan": "Our aim is to launch in Colombia with Decaf in order to solve the pain experienced by their users who are struggling to use their salaries in the country. This is a real need, and we want to provide a real solution that will improve the user experience and reliability on blockchain technologies. After Decaf, we will be able to offer our solutions to every wallet on the Stellar Ecosystem.  \nBut we won't stop there. As part of our GTM, we are already partnering with lead providers in Latin America and Asia, with the vision to cover several countries within the next 3 years.",
                        "stellar.tranche1Deliverables": "We will provide infrastructure for stellar wallets to interact with the traditional banking system in Colombia instantly.\n\nWe will develop:\n\n-   A portal for devs where they will find our APIs.\n    \n-   Integration with Persona for KYC.\n    \n-   Integration with Movii, our BaaS provider in Colombia.\n    \n-   Our smart routing system using USDC on Stellar blockchain for instant settlements. This smart routing refers to the instructions given to the wallet when the user scans a QR code. We will identify the QR code, provide the conversion from USDC to COP and send settlement instructions to Movii for payment to merchant.\n    \n-   Integration with Blend.Capital for liquidity purposes.\n    \n\nHow to mesure completion:\n\n1.  Successfully integrate Stellar Blockchain.\n    \n1.  Successfully integrate persona for KYC.\n    \n1.  Successfully develop the integration with Movii.\n    \n1.  Launch the portal where devs can check our apis and integrate it.\n    \n1.  Successfully integrate Blend.Capital  \n    \n\nEstimated date of completion: Last week of February, 2025.  \nBudged: $37.950",
                        "stellar.tranche2Testnet": "We will start the integration with our costumers, doing testing on both sides.\n\nHow to mesure completion:  \n1. Testing the integration with Decaf, our launching Partner in Colombia.  \n2. Fix bugs and solve blockers.  \n2. Successfully comply with KYC & AML.\n\nEstimated date of completion: Middle of March, 2025.  \nBudget: $5.820",
                        "stellar.tranche3Mainnet": "After successfully passing all the testing, we are ready to launch on Mainnet. The goal is to offer our solution to any wallet on Stellar, so users can rely and live 100% on their crypto, even paying in in real life.\n\nEstimated date of completion: End of March, 2025.  \nBudget: $12.350",
                        "stellar.teamMembers": "Esteban Quintero, Hollwann Leon",
                        "stellar.urls": {
                            "website": "https://getabroad.app/",
                            "codeRepository": "https://github.com/hollwann/abroad-stellar",
                            "videoURL": "https://www.youtube.com/watch?v=zsk_a68A5G8"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/getabroad/",
                            "discord": "https://discord.gg/aSw3QN95"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 56120.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 192744.09,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:6",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recVvr1MlNxJEIRvs",
                    "projectId": "daoip5:stellar:project:oneclick.fi",
                    "projectName": "OneClick.Fi",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recVvr1MlNxJEIRvs",
                    "status": "Awarded",
                    "description": "OneClick.Fi offers an all-in-one DeFi onboarding platform to help web3 users get access to the best DeFi protocols/opportunities in one click with simple UX, gamification, and AI-powered risk assessments.",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1XBn0BvU_lJlhFbBN7_ZnPk8GV8xAu6te33w9n2ue92U/edit?usp=sharing",
                        "stellar.productsAndServices": "DeFi Explorer: One Click will act as a comprehensive aggregator, allowing users to manage DeFi activities across multiple chains, including Stellar. This makes it easier for users to find and interact with Stellar-based DeFi opportunities, improving accessibility for all experience levels.\n\nAI Portfolio Builder: One Click’s AI will analyze user wallets, including Stellar-based assets, to recommend the best DeFi strategies. This helps users create portfolios tailored to their risk tolerance and find yield opportunities within Stellar's ecosystem.\n\nOne-Click Zaps: This feature enables users to execute complex DeFi actions, like providing liquidity, on Stellar in one transaction. It simplifies cross-chain interactions and ensures that users can engage with Stellar-based DeFi pools effortlessly.\n\nGamified Yield Farming: One Click will introduce fun, interactive elements like automated airdrops and reward quests for Stellar-based DeFi. This engages users and encourages them to maximize returns on Stellar through a playful experience.\n\nUPDATE since the previous SCF #30 submission of OneClick.Fi (Link to original submission: https://communityfund.stellar.org/dashboard/submissions/rec83kMMeg4sWdkla)\n\nQuestion 1: While the idea of earning yields from top protocols on other chains is interesting, it doesn’t appear to directly contribute to bringing liquidity into the Stellar ecosystem. Focusing on how to retain liquidity within Stellar or how the project can benefit Stellar-based protocols more clearly would help address this concern.  \n\nAnswer:\n\nWe will retain liquidity within Stellar and benefit Stellar-based protocols through the following products deployed by OneClick.Fi:\n\n-   Yield Explorer - the frontend for exploring every DeFi pool on every protocol on Stellar network. Yield Explorer will directly showcase the yield pools of Stellar protocols, allow users to do their due diligence, and provide users simple access to the opportunities\n    \n-   Portfolio Builder - for users who don't know where to start in DeFi, they can use Portfolio Builder to create a customized/personalized portfolio of DeFi pools on Stellar. Newbie users use OneClick's Portfolio Builder and see the Stellar pools and protocols as the end result of their onboarding. This will directly drive liquidity and usage to the Stellar ecosystem\n    \n-   Airdrop Tracker + Stellar Spaces - we will create a dedicated \"Space\" for Stellar Ecosystem that will showcase the available protocols in Stellar Ecosystem, quests, giveaways, or other promotional campaigns available in the ecosystem. In the end, users will be able to see the \"Stellar Space\" with all the available campaigns and activities which will directly drive liquidity and usage to the Stellar ecosystem. \n    \n\nYou will find the links to demo of some of the features below as well as in the presentation.\n\n  \n\nAnd although OneClick.Fi delivers DeFi smoothness across a set of networks, additionally, the Stellar Network would be prioritized on the user interface in a variety of ways, for instance by:\n\n-   Showing Stellar protocols and yield pools in the \"Featured\" section of Yield Explorer\n    \n-   Including Stellar opportunities as a one of the default options for the portfolio creation for Portfolio Builder\n    \n-   Putting Stellar Spaces in the front row / top of the UI for users to explore\n    \n-   Proactive banners and comparison of Stellar opportunities to other network opportunities\n    \n-   Etc. the exact details will be furnished\n    \n-   In addition to that, OneClick.Fi would partner with all the Stellar protocols/project (would need help from Stellar community with introductions) and organize educational campaigns to bring more awareness about the Stellar ecosystem. That would include:\n    \n-   Educational content (blog posts, threads, newsletters) about Stellar, protocols, and ecosystem around\n    \n-   AMAs with protocol founders/core team\n    \n-   Spaces, videos, podcasts with protocol founders/core team\n    \n-   ... And other activities that would bring more exposure to Stellar network. OneClick.Fi will essentially become Stellar's front page of DeFi as well as a global awareness machine with the goal of making people aware that there are cool things in Stellar DeFi and that it still exists (many crypto users don't even know that Stellar exists or is still alive after 2017-2018). We are here to change that in a simple, fun, and gamified way.\n    \n\n  \n\nQuestion 2: Additionally, the deliverables are not well-organized, making it challenging to follow the development plan. A clearer breakdown of milestones and deliverables in a logical sequence would improve the proposal’s structure.\n\nAnswer:\n\nAs described in the original submission/proposal, the implementation deliverables would be covered related to release of the features described above. The goal is to deploy each feature to support Stellar. \n\n-   Deliverable 1: Yield Explorer\n    \n-   Deliverable 2: Airdrop Tracker + Stellar Spaces (Protocol+Asset database)\n    \n-   Deliverable 3: Portfolio Builder\n    \n-   Deliverable 4: One-Click Zap function\n    \n\nThe specific scope and criteria for these deliverables are mentioned in the original submission/proposal too.   \n\nLinks and additional materials:\n\n-   Proposal deck about Stellar x OneClick.Fi integration - https://docsend.com/view/5rc8mt5pwzv4kkca\n    \n\n-   Demo UI Airdrop Tracker - https://defi.oneclick.fi/airdrops/\n    \n-   Demo UI Portfolio Builder -- https://defi.oneclick.fi/\n    \n-   Demo UI Yield Explorer - https://defi.oneclick.fi/pools",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "-   Get 10,000+ new users actively using Stellar-based DeFi pools through OneClick.Fi.\n    \n-   Bring more liquidity to Stellar’s DeFi ecosystem, with users managing assets easily using \"one-click zap.\"\n    \n-   Keep users coming back, thanks to fun DdeFi farming and smart AI portfolio recommendations. Impact:\n    \n-   Make DeFi on Stellar simple and accessible so anyone, no matter their experience, can get involved\n    \n-   Attract more liquidity from other chains, helping grow Stellar’s DeFi ecosystem.\n    \n-   Give users the tools they need to manage their assets and make the most of Stellar's DeFi.",
                        "stellar.tractionEvidence": "We have between 500-1500 daily active users on the app - https://drive.google.com/file/d/1FVSMLzfFSUpv6wIoYY3HM4C3NYsWo3ml/view?usp=sharing And 300k+ cumulative (registered + non-registered) users since alpha release, from them as of today around 45k+ signed up with email/Discord can share the signup lists User demographics - https://docs.google.com/spreadsheets/d/1FpuS7hv0tWQDfybPUGgFs9Jyl-gCUuTGcwJMzVjpE7I/edit?usp=sharing Extensive user interviews and documentation - https://oneclickfi.notion.site/One-Click-DeFi-Market-Validation-Customer-Discovery-2024-eaa6bb243fd24fd8a3ac3a8529c42a8e?pvs=4 More user interviews - https://oneclickfi.notion.site/One-Click-Beta-Testers-8004a2d716124e8f91fad99b3c75a87b?pvs=4\n\nProduct Links and additional materials:\n\n-   Proposal deck about Stellar x OneClick.Fi integration - https://docsend.com/view/5rc8mt5pwzv4kkca\n    \n\n-   Demo UI Airdrop Tracker - https://defi.oneclick.fi/airdrops/\n    \n-   Demo UI Portfolio Builder -- https://defi.oneclick.fi/\n    \n-   Demo UI Yield Explorer - https://defi.oneclick.fi/pools",
                        "stellar.goToMarketPlan": "Although OneClick.Fi delivers DeFi smoothness across a set of networks, additionally, the Stellar Network would be prioritized on the user interface in a variety of ways, for instance by:\n\n-   Showing Stellar protocols and yield pools in the \"Featured\" section of Yield Explorer\n    \n-   Including Stellar opportunities as a one of the default options for the portfolio creation for Portfolio Builder\n    \n-   Putting Stellar Spaces in the front row / top of the UI for users to explore\n    \n-   Proactive banners and comparison of Stellar opportunities to other network opportunities\n    \n-   Etc. the exact details will be furnished\n    \n-   In addition to that, OneClick.Fi would partner with all the Stellar protocols/project (would need help from Stellar community with introductions) and organize educational campaigns to bring more awareness about the Stellar ecosystem. That would include:\n    \n-   Educational content (blog posts, threads, newsletters) about Stellar, protocols, and ecosystem around\n    \n-   AMAs with protocol founders/core team\n    \n-   Spaces, videos, podcasts with protocol founders/core team\n    \n-   ... And other activities that would bring more exposure to Stellar network. OneClick.Fi will essentially become Stellar's front page of DeFi as well as a global awareness machine with the goal of making people aware that there are cool things in Stellar DeFi and that it still exists (many crypto users don't even know that Stellar exists or is still alive after 2017-2018). We are here to change that in a simple, fun, and gamified way.\n    \n\nAdditional GTM channels:\n\n-   Community: Grow our community (currently at 25k+ members in Discord) and get support from external communities, like the ones on Stellar's Discord, forums, and socials. Share simple guides and videos to get users started quickly.\n    \n-   Integrations/Partnerships: Collaborate with protocols and communities building on Stellar. Work with influencers and ambassadors to spread the word. OneClick already has a strong network of partners, including wallets like Koala Wallet, Coinomi, Nicegram, iMe, MELD, Armor, Meteor that would be great candidates to integrate Stellar as well.\n    \n-   Incentives and Campaigns: Offer airdrops, rewards, and a referral program for users who engage with Stellar pools and bring others in. We have our own One Click Points system that helps to incentivize more user activity on the app",
                        "stellar.tranche1Deliverables": "Deliverable 1: Implementation of the Public Stellar DeFi Pools Database\n\nScope: Creating a public database of top DeFi yield opportunities available on the Stellar blockchain and displaying it on OneClick.Fi frontend. Implementation:\n\n-   Database Setup:\n    \n    -   Develop both frontend and backend infrastructure for the Stellar DeFi Pools database using Node.js (backend) and React.js (frontend).\n        \n    -   Ensure the database supports indexing from Stellar smart contracts and integrates with third-party API services.\n        \n-   Data Integration:\n    \n    -   Implement data pipelines using 3rd party services or direct on-chain indexers to ingest real-time and historical data from Stellar.\n        \n    -   Enable the database to display:\n        \n    -   Historical APY and TVL data in chart form.\n        \n    -   Current TVL and APY\n        \n    -   Pool age\n        \n    -   Risk scores from at least one provider.\n        \n-   Testing and Deployment:\n    \n    -   Conduct thorough testing for performance and accuracy before deploying the database to production.\n        \n    -   Integrate CI/CD pipelines for continuous updates and improvements. Proof of Deliverable: A deliverable can be considered successfully completed upon the following conditions:\n        \n    -   A user can see a frontend application available on OneClick.Fi displaying a list of DeFi yield opportunities (at least the top 50% currently supported on DefiLlama) on Stellar blockchain\n        \n\nThe following data is available about each DeFi yield opportunity:\n\n-   Historical APY and TVL data in chart form.\n    \n-   Current TVL and APY\n    \n\n-   Pool age\n    \n-   Risk scores from at least one provider.\n    \n-   Link to the respective yield opportunity\n    \n\nTimeline: 1-2 months Budget: 25% of grant allocation\n\nDeliverable 2: Implementation of Assets and Protocol Databases\n\nScope: Develop a comprehensive database for tracking assets and protocols supported by Stellar-based DeFi products. Users should be able to access detailed information on supply, market cap, asset age, protocol TVL, and related products. Implementation:\n\n-   Backend & Frontend Integration:\n    \n    -   Build both the backend and frontend infrastructure to support the storage and display of asset and protocol data.\n        \n    -   Ensure real-time data is pulled from Stellar smart contracts and integrated into the database.\n        \n-   Data Points for Assets:\n    \n    -   Supply, circulating supply, price, volume (chart), market cap, asset age, and related products.\n        \n-   Data Points for Protocols:\n    \n    -   Protocol age, total value locked (TVL), and related DeFi products.\n        \n\nProof of Deliverable: The deliverable will be completed when:\n\n-   All Stellar assets and protocols are successfully integrated into the database.\n    \n-   Users can view and interact with real-time data on assets and protocols, including charts for price, volume, and market cap.\n    \n-   Protocol-related products and TVL are displayed for all integrated protocols.\n    \n\nTimeline: 1-2 months Budget: 25% of grant allocation",
                        "stellar.tranche2Testnet": "Deliverable 3: Integrating Stellar DeFi Opportunities Into OneClick’s AI Portfolio Builder\n\nScope: Integrating support of yield pools from Stellar at One Click’s AI portfolio builder. Users should be able to build a Stellar-based DeFi portfolio tailored to their risk tolerance.\n\nImplementation:\n\n-   AI Portfolio Integration:\n    \n    -   Extend the AI portfolio builder to include Stellar-based DeFi pools, ensuring the system can pull relevant data from the Public Stellar DeFi Pools Database.\n        \n    -   Implement algorithms that allow users to build a DeFi portfolio tailored to their risk tolerance, specifically focused on Stellar yield opportunities.\n        \n-   User Experience Optimization:\n    \n    -   Ensure seamless integration with the frontend, allowing users to easily incorporate Stellar yield opportunities into their AI-generated portfolios.\n        \n    -   Provide real-time updates on portfolio performance and risk assessments.\n        \n\nProof of Deliverable: A deliverable can be considered successfully completed upon the following conditions:\n\n-   Stellar yield opportunities from Deliverable 1 are integrated into the OneClick.Fi portfolio builder, meaning:\n    \n-   A user can generate a portfolio of DeFi yield opportunities on Stellar customized to his/her risk profile\n    \n-   A user can pass a quiz consisting of a set of behavioral questions to determine his/her risk profile\n    \n\nTimeline:1-2 months Budget: 25% of grant allocation",
                        "stellar.tranche3Mainnet": "Deliverable 4: Implementation of \"One-Click Zap\" Functionality for Stellar Pools\n\nScope: Develop the \"one-click zap\" functionality that allows users to deposit, stake, or provide liquidity into Stellar-based pools with a single transaction via OneClick.Fi interface.\n\nImplementation:\n\n-   Backend & Frontend Integration:\n    \n    -   Build and integrate backend systems to handle transactions for Stellar pools.\n        \n    -   Develop the frontend functionality that allows users to use the \"one-click zap\" directly from the One Click interface.\n        \n-   Zap Functionality:\n    \n    -   Implement the ability for users to deposit funds, stake, or provide liquidity to Stellar-based pools in a seamless fashion.\n        \n    -   Ensure seamless interaction with the Stellar-based pools integrated in Deliverable 1.\n        \n\nProof of Deliverable:\n\n-   The deliverable will be completed when:\n    \n-   Users can successfully deposit or stake assets in Stellar-based pools through OneClick.Fi UI.\n    \n-   The \"one-click zap\" functionality is fully integrated and operational for the Stellar pools covered in Deliverable 1.\n    \n\nTimeline: 1-2 months Budget: 25% of grant allocation",
                        "stellar.teamMembers": "Max Yamp",
                        "stellar.urls": {
                            "website": "https://communityfund.stellar.org/dashboard/projects/recgHxoeBSXpPnXGi",
                            "codeRepository": "https://docsend.com/view/5rc8mt5pwzv4kkca",
                            "videoURL": "https://youtu.be/UdvsWkmb0qA",
                            "pitchDeck": "https://docsend.com/view/nuh8td3wb8yhwgpk"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/oneclickfi/",
                            "twitter": "https://x.com/oneclickfi",
                            "discord": "https://discord.gg/oneclickfi"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 150000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 474973.65,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-07T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:7",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recaBi8lclJ5h3YgH",
                    "projectId": "daoip5:stellar:project:kript",
                    "projectName": "Kript",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recaBi8lclJ5h3YgH",
                    "status": "Awarded",
                    "description": "International payment checkout platform that empowers merchants in emerging markets to seamlessly receive cross-border payments powered by SEP-31 protocol",
                    "fundsApprovedInUSD": 77000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1iDql2JVaqe4D27M5BC454DBdj8DqLgTS/view?usp=sharing",
                        "stellar.productsAndServices": "Products and Services to Develop with the SCF Build Award\n\n1.  International Payment Checkout Platform\n    \n    -   Description: Develop a checkout platform that enables merchants in emerging markets to receive international payments seamlessly. Merchants can generate payment links or integrate payment buttons into their websites or apps to accept payments from international customers.\n        \n    -   How Stellar is Used: Utilize the Stellar network to process cross-border payments using digital assets like USDC. Leverage Stellar's fast transaction speeds and low fees to facilitate efficient payments. Use Stellar's Anchor network, specifically Flutterwave in Africa and Bitstamp in other regions, to convert received digital assets into local fiat currencies.\n        \n    -   Impact on Project: Enables merchants to accept international payments easily, reducing barriers to global commerce. Lowers transaction costs and settlement times compared to traditional methods. Expands merchants' customer base by allowing them to serve international clients.\n        \n1.  Integration with Stellar Anchors\n    \n    -   Description: Integrate with Stellar Anchors such as Flutterwave and Bitstamp to provide automatic conversion of digital assets into local currencies. Anchors act as bridges between the Stellar network and traditional banking systems in target regions.\n        \n    -   How Stellar is Used: Anchors facilitate the seamless exchange between digital assets on Stellar and local fiat currencies. Transactions on Stellar are settled quickly, and funds are made available to merchants through the Anchor's payout methods.\n        \n    -   Impact on Project: Simplifies the payout process for merchants by allowing them to receive funds directly in their local currency. Enhances the platform's usability and appeal in emerging markets. Leverages the existing infrastructure of Anchors to ensure regulatory compliance and efficient fund distribution.\n        \n1.  Merchant Dashboard and Analytics\n    \n    -   Description: Develop a user-friendly dashboard where merchants can monitor transactions in real-time, manage funds, and access detailed analytics about their sales and payment activity.\n        \n    -   How Stellar is Used: Utilize Stellar's transparent ledger to fetch and display real-time transaction data. The dashboard can provide insights into payment statuses, settlement times, and transaction histories.\n        \n    -   Impact on Project: Empowers merchants with clear visibility over their financial operations, aiding in better financial planning and decision-making. Builds trust by providing transparency and control over their received payments.\n        \n1.  Security and Compliance Framework\n    \n    -   Description: Implement robust security measures to protect transactions and data. Ensure compliance with regional KYC/AML regulations by leveraging Anchors' existing compliance frameworks.\n        \n    -   How Stellar is Used: Benefit from Stellar's secure, immutable ledger for transaction integrity. Use built-in compliance features and data embedding within Stellar transactions to meet regulatory requirements.\n        \n    -   Impact on Project: Enhances the platform's credibility and trustworthiness, encouraging adoption by merchants and customers. Reduces legal risks by adhering to compliance standards, facilitating smooth operations across different jurisdictions.\n        \n1.  Mobile-Friendly Payment Solutions\n    \n    -   Description: Optimize the checkout experience for mobile devices, supporting mobile wallets and payment methods popular in target regions.\n        \n    -   How Stellar is Used: Leverage Stellar's support for mobile integrations and QR code payments, enabling customers to pay conveniently using their smartphones.\n        \n    -   Impact on Project: Increases accessibility for customers in emerging markets where mobile device usage is high. Improves user experience, leading to higher conversion rates and customer satisfaction.",
                        "stellar.successCriteria": "Reaching 200,000 users and processing $50 million in transactions is a significant achievement for Kript, but the true measure of success lies in the transformative impact on:\n\n-   Financial Inclusion: Enabling merchants and individuals in emerging markets to access global financial systems.\n    \n-   Economic Development: Contributing to economic growth by empowering businesses and stimulating trade.\n    \n-   Technological Progress: Advancing the adoption of innovative technologies that can lead to broader societal benefits.\n    \n\nKript's success means creating a more connected, inclusive, and prosperous world where emerging markets are active participants in the global economy.",
                        "stellar.tractionEvidence": "Kript has demonstrated substantial traction and market validation through: - Significant Transaction Volume: Processing over $1 million per month showcases robust financial activity and trust in our platform. - Growing User Base: Partnership with 8 businesses serving 150,000 users and engagement with 2,000 individual users underline widespread adoption. - Positive Market Feedback: Direct feedback from users confirms the effectiveness and necessity of our solution. - Strategic Positioning: Aligning with reputable Anchors and leveraging Stellar's technology positions Kript for continued success. We meet the SCF Build Award criteria by: - Proving Market Fit: Validated demand through actual usage and transaction processing. - Demonstrating Execution Capability: Successfully delivering services to clients and managing growing operations. - Aligning with Stellar's Mission: Promoting financial inclusion and empowering merchants in emerging markets through innovative use of Stellar's network\n\nhere is a link to our analytics\n\nhttps://drive.google.com/drive/folders/1atH2mkuQ3wG8V-nt3RDw0097tJP1LVz-?usp=sharing\n\nhttps://docs.google.com/spreadsheets/d/18cJNy5y7YfRlQcxmrwG7Jv3j9cH9hhfhc9ml771pSfo/edit?usp=sharing\n\nUser Interviews and Feedback ( Could also pass proof of users)\n\nhttps://youtu.be/xf1Fj9D1MHY\n\n(Our wallets and bank account issiung serves our 50,000 of https://www.gowagr.app/ users that utilize Stable Coins and Fiat to power Peer to Peer Wagers)\n\nhttps://youtu.be/m36KNYZqQS4\n\n(Our Wallets and bank accoounts API serves over 60,000 crypto and fiat checkout users for Flux )",
                        "stellar.goToMarketPlan": "Go-To-Market Plan\n\nAfter completing the development and receiving approval, our go-to-market strategy includes:\n\n1.  Digital Ad Campaigns:\n    \n    -   Launch targeted online advertising across social media platforms (Facebook, Instagram, Twitter, LinkedIn) and search engines to reach potential merchants and customers in each target region.\n        \n1.  Influencer Marketing:\n    \n    -   Partner with influential figures in the fintech and entrepreneurial communities in Africa and Latin America to endorse Kript, creating credibility and increasing visibility among the target audience.\n        \n1.  Community Building:\n    \n    -   Establish online communities on platforms like Facebook Groups, LinkedIn, and Telegram where merchants and users can share experiences, ask questions, and provide feedback, fostering a supportive ecosystem around Kript.\n        \n1.  Localized Content Marketing:\n    \n    -   Produce region-specific content such as blog posts, videos, webinars, and tutorials to educate merchants and customers about Kript's benefits, tailored to the cultural context of each region.\n        \n1.  Strategic Partnerships:\n    \n    -   Collaborate with local business associations, e-commerce platforms, and fintech hubs to reach a wider audience and integrate Kript into existing business networks.\n        \n1.  Referral Programs:\n    \n    -   Implement incentive-based referral programs encouraging existing users to invite new merchants and customers to the platform.\n        \n1.  Event Participation:\n    \n    -   Attend and sponsor relevant industry events, conferences, and webinars in the target regions to increase brand awareness and network with potential partners and clients.\n        \n1.  Public Relations Efforts:\n    \n    -   Engage with local media outlets and industry publications to secure press coverage, interviews, and feature articles highlighting Kript's solutions and successes.\n        \n1.  Customer Support Excellence:\n    \n    -   Provide exceptional, multilingual customer support to build trust and encourage word-of-mouth promotion.\n        \n1.  Continuous Feedback Loop:\n    \n    -   Actively gather feedback from users to improve the platform and adapt marketing strategies, ensuring Kript meets the needs of its users effectively.",
                        "stellar.tranche1Deliverables": "#### Deliverable 1: Integration with Flutterwave as a Stellar Anchor in Africa\n\n-   Brief Description: Integrate the SEP-31 Cross-Border Payments API into the Kript platform, enabling cross-border payments and off-ramp services via Flutterwave in Nigeria and Ghana.\n    \n-   Technical, Server, and Infrastructure Work:\n    \n    a.  SEP-31 Protocol Implementation:\n        \n        -   Develop and implement SEP-31 endpoints (/info, /transactions, /transactions/:id, etc.) in compliance with Stellar documentation.\n            \n        -   Ensure secure authentication using SEP-10 and implement SEP-12 for KYC/AML compliance.\n            \n    a.  Flutterwave Integration:\n        \n        -   Establish technical integration with Flutterwave's APIs.\n            \n        -   Configure API connections for transaction initiation, status updates, and off-ramping funds to local currencies (NGN, GHS).\n            \n    a.  Off-Ramp Flow Development:\n        \n        -   Design and develop the off-ramp process through Flutterwave, allowing merchants to receive funds in their local currency.\n            \n        -   Map transaction data to Flutterwave's requirements for payout processing.\n            \n    a.  Dashboard Enhancements:\n        \n        -   Update the existing dashboard to handle multi-country support.\n            \n        -   Add features for merchants to manage payouts, view transaction statuses, and access settlement reports.\n            \n    a.  Testing and Validation:\n        \n        -   Conduct end-to-end testing of the payment flow, including initiating payments, processing through Flutterwave, and receiving funds.\n            \n        -   Perform security testing to ensure data integrity and compliance with standards.\n            \n-   How to Measure Completion:\n    \n    -   Integration Completion: Successful implementation of SEP-31 endpoints and Flutterwave integration.\n        \n    -   Functional Off-Ramp: Demonstrated ability to off-ramp funds via Flutterwave in Nigeria and Ghana.\n        \n    -   Updated Dashboard: Deployment of enhanced dashboard features supporting multi-country operations.\n        \n-   Estimated Date of Completion: 27th November- Jan 10 /2025\n    \n-   Budget: $25,000\n    \n\n#### Deliverable 2: Support for Additional African Countries (Kenya and South Africa)\n\n-   Brief Description: Extend Kript's services to Kenya and South Africa, integrating with local anchors (e.g., Flutterwave) and enabling merchants in these countries to accept international payments.\n    \n-   Technical, Server, and Infrastructure Work:\n    \n    a.  Anchor Integration in Kenya and South Africa:\n        \n        -   Integrate with Flutterwave or other Stellar anchors operating in these countries.\n            \n        -   Establish API connections and compliance agreements.\n            \n    a.  Localization Enhancements:\n        \n        -   Update the platform to support local currencies (KES and ZAR) and languages.\n            \n        -   Customize UI/UX to meet regional preferences and regulatory requirements.\n            \n    a.  Off-Ramp Flow Implementation:\n        \n        -   Implement off-ramp processes for the new regions, allowing funds to be deposited into local bank accounts or mobile money wallets (e.g., M-Pesa in Kenya).\n            \n        -   Ensure compliance with local KYC/AML regulations.\n            \n    a.  Testing and Quality Assurance:\n        \n        -   Perform thorough testing of payment flows in the new regions.\n            \n        -   Address any region-specific challenges or technical issues.\n            \n    a.  Merchant Onboarding and Training:\n        \n        -   Develop onboarding procedures and materials for merchants in Kenya and South Africa.\n            \n        -   Provide training and support resources.\n            \n-   How to Measure Completion:\n    \n    -   Operational Services: Kript platform live and operational in Kenya and South Africa.\n        \n    -   Successful Transactions: Completion of test transactions demonstrating end-to-end payment processing and off-ramping.\n        \n    -   Compliance Verification: Confirmed adherence to local regulations and successful KYC/AML implementation.\n        \n    -   Merchant Engagement: Onboarding of initial merchants in the new regions with positive feedback.\n        \n-   Estimated Date of Completion: 15 Jan- 20 Feb 2025\n    \n-   Budget: $15,000",
                        "stellar.tranche2Testnet": "#### Deliverable 1: Integration with Bitstamp as a Stellar Anchor in Latin America\n\n-   Brief Description: Expand services to Argentina and Brazil, integrating with Bitstamp and supporting local currencies (ARS and BRL).\n    \n-   Technical, Server, and Infrastructure Work:\n    \n    a.  Anchor Integration:\n        \n        -   Establish technical integrations with Bitstamp as a Stellar anchor.\n            \n        -   Configure API connections and ensure compliance with regional requirements.\n            \n    a.  SEP-31 Protocol Adjustments:\n        \n        -   Adapt SEP-31 implementation to accommodate any region-specific variations.\n            \n        -   Implement multi-currency support for ARS and BRL.\n            \n    a.  Off-Ramp Flow Development:\n        \n        -   Develop the off-ramp process for Latin American countries, enabling payouts to local bank accounts.\n            \n        -   Incorporate local KYC/AML compliance measures.\n            \n    a.  Localization and Language Support:\n        \n        -   Translate platform interfaces and documentation into Spanish and Portuguese.\n            \n        -   Adapt content to cultural and regulatory contexts.\n            \n    a.  Testing and Validation:\n        \n        -   Perform testnet transactions simulating real-world scenarios in Argentina and Brazil.\n            \n        -   Ensure smooth integration and transaction processing with Bitstamp.\n            \n-   How to Measure Completion:\n    \n    -   Integration Success: Established connections with Bitstamp and successful testnet transactions.\n        \n    -   Localization Implemented: Platform available in Spanish and Portuguese with region-specific adjustments.\n        \n    -   Compliance Confirmed: KYC/AML processes aligned with local regulations.\n        \n-   Estimated Date of Completion: 25 March 2025\n    \n-   Budget: $10,000\n    \n-   _ _\n    \n\n#### Deliverable 2: Enhanced Off-Ramp Flow via Anchors Across All Regions\n\n-   Brief Description: Extend and optimize the off-ramp flow via Flutterwave and Bitstamp to improve efficiency across all regions.\n    \n-   Technical, Server, and Infrastructure Work:\n    \n    a.  Anchor Integration Expansion:\n        \n        -   Ensure all integrations with Flutterwave and Bitstamp are optimized for all supported regions.\n            \n        -   Update API configurations and compliance protocols as necessary.\n            \n    a.  Off-Ramp Optimization:\n        \n        -   Enhance the efficiency of the off-ramp process to reduce transaction times.\n            \n        -   Implement improvements based on previous testing and user feedback.\n            \n    a.  User Experience Enhancements:\n        \n        -   Simplify the payment flow for merchants and customers.\n            \n        -   Provide real-time status updates and clearer instructions.\n            \n    a.  Security and Compliance Updates:\n        \n        -   Strengthen security measures in line with each anchor's policies.\n            \n        -   Update compliance processes as needed for new regions.\n            \n    a.  Comprehensive Testing:\n        \n        -   Conduct rigorous testing of the enhanced off-ramp flow.\n            \n        -   Verify improvements through successful test transactions.\n            \n-   How to Measure Completion:\n    \n    -   Expanded Services: Off-ramp operational and optimized in all regions.\n        \n    -   Efficiency Gains: Demonstrated reduction in transaction processing times.\n        \n-   Estimated Date of Completion: 10 April 2025\n    \n-   Budget: $10,000",
                        "stellar.tranche3Mainnet": "#### Deliverable 1: Deployment on Stellar Mainnet Across All Regions\n\n-   Brief Description: Launch the fully integrated Kript platform on the Stellar mainnet, supporting all targeted countries and ensuring seamless operations with Flutterwave, Bitstamp, and other local anchors.\n    \n-   Technical, Server, and Infrastructure Work:\n    \n    a.  Mainnet Integration and Deployment:\n        \n        -   Transition from testnet to mainnet services.\n            \n        -   Update all configurations and ensure stable operation on the mainnet.\n            \n    a.  Finalization of Anchor Integrations:\n        \n        -   Complete all technical and compliance requirements with anchors for mainnet operations.\n            \n        -   Verify end-to-end transaction flows with real-world scenarios.\n            \n    a.  Scalability and Performance Optimization:\n        \n        -   Enhance infrastructure to support increased transaction volumes.\n            \n        -   Implement load balancing and autoscaling mechanisms.\n            \n-   How to Measure Completion:\n    \n    -   Live Operations: Platform successfully processing transactions on the Stellar mainnet in all regions.\n        \n    -   Operational Stability: Demonstrated reliability under expected load conditions.\n        \n-   Estimated Date of Completion: 30 April 2025\n    \n-   Budget: $17,000",
                        "stellar.teamMembers": "Ayomide Lasaki",
                        "stellar.urls": {
                            "website": "https://kriptup.io",
                            "codeRepository": "https://docs.google.com/document/d/1H4bsDDcCZqMp77jLmqOQbANyL_a_8SjfKv2AUlpe_ts/edit?pli=1&tab=t.0",
                            "videoURL": "https://www.youtube.com/watch?v=FdsTMekSDkA&t=4s"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 51333.34,
                                "denomination": "USD"
                            },
                            {
                                "amount": 156128.44,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:8",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec3sQBgctMIdAhJ7",
                    "projectId": "daoip5:stellar:project:myaza-|-transact-across-africa",
                    "projectName": "Myaza | Transact Across Africa",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec3sQBgctMIdAhJ7",
                    "status": "Awarded",
                    "description": "Building a seamless cross-border payment solution using Stellar for travelers and businesses across Africa.",
                    "fundsApprovedInUSD": 106600.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1J3wMI4XopLOGIZ5Qqt7ZY3G3yIoMaWLozu8Xp_Q73I0/edit?usp=sharing",
                        "stellar.productsAndServices": "This submission will focus on building a cross-border payment system leveraging Stellar’s fast, low-cost blockchain to facilitate secure and instant transactions for travelers and businesses in Africa.\n\nBy integrating Stellar for foreign exchange, transaction processing, and wallet-to-wallet transfers, Myaza will enable seamless currency conversions and money transfers across borders.\n\nStellar’s interoperability and scalability will ensure that the system can support both high-volume and low-cost transactions, making it accessible to underserved markets.\n\nThese improvements will enhance user experience, reduce transaction fees, and increase the speed of cross-border payments, positioning Myaza as a leading digital payment platform in Africa.",
                        "stellar.successCriteria": "Success Metrics:\n\n1. User Growth: Over 300,000 new users in the first six months.\n\n2. Transaction Volume: Monthly processing exceeding $5 million.\n\n3. Market Expansion: Launching in 10 additional African countries within a year.\n\nImpact of Outputs:\n\n1. Financial Access: Reducing the underbanked population by providing easy access to cross-border payments and financial management tools.\n\n2. Economic Empowerment: Supporting small businesses with lower transaction fees to encourage economic growth across borders.\n\n3. Financial Literacy and Security: Enhancing user knowledge and safety in financial dealings.\n\n4. Sustainable Development: Contributing to poverty reduction and economic stability through reliable financial services.",
                        "stellar.tractionEvidence": "• Transaction Volume: Successfully processed $1.9 million in transaction volume.\n\n• Customer Base: Over 5,700 verified users, with a 26% monthly growth rate achieved through organic marketing strategies.\n\n• Cost Efficiency: Zero customer acquisition cost due to highly engaging social media campaigns and partnerships.\n\n• Market Engagement: Actively in discussions with airlines and travel agencies like Air Peace, Ibom Air, and TravelBeta to onboard their travelers.\n\n• Operational Stability: Achieved same-day settlements for specific regions, boosting user trust and satisfaction.\n\n• Scalable Framework: Built on robust financial infrastructure ready to scale and integrate with Stellar for cross-border transactions.\n\nLink 1: https://app.amplitude.com/analytics/share/dbc01e076fdf4af39a794c2562701854\n\nLINK 2: https://docs.google.com/spreadsheets/d/1Ql2IIsQdaNTD1dqxhy6L_T26zmSK7G4wpD5NuKrE0WQ/edit?usp=sharing",
                        "stellar.goToMarketPlan": "Our go-to-market strategy will focus on targeting travelers and businesses in Africa by leveraging strategic partnerships with travel agents (e.g., Travel Beta), airlines (e.g., Air Peace, Ibom Air), and tour operators. We will also utilize digital marketing campaigns across social media platforms to engage with the target audience and build brand awareness. By offering seamless cross-border payment solutions, we’ll position Myaza as the go-to app for money management in Africa. Additionally, we will run referral programs, promotions, and educational content to drive user adoption and retention, targeting a user base of 500K within the first year.",
                        "stellar.tranche1Deliverables": "1. Deliverable 1: Basic Multi-Currency Wallet\n\n-   Description: Develop a basic version of the multi-currency wallet enabling users to hold and manage 10 African currencies.\n    \n-   Completion Criteria: Users can successfully create wallets, deposit, withdraw, and hold local currencies.\n    \n-   Estimated Date of Completion: 2 months\n    \n-   Budget: $42,404\n    \n\n2. Deliverable 2: Initial Stellar Integration\n\n-   Description: Integrate Stellar to handle deposits and withdrawals using custom assets representing fiat currencies so users can swap local currencies and send across borders.\n    \n-   Completion Criteria: Successfully conducted test transactions on Stellar involving deposit and swap processes.\n    \n-   Estimated Date of Completion:1 months\n    \n-   Budget: $35,324",
                        "stellar.tranche2Testnet": "1. Deliverable 1: Enhanced Multi-Currency Exchange Features\n\n-   Description: Develop and implement currency exchange features within the wallet using Stellar’s path payment operations.\n    \n-   Completion Criteria: Execute at least 100 path payment transactions within the testnet environment without errors.\n    \n-   Estimated Date of Completion: 1 Week\n    \n-   Budget: Benefits from Stellar LaunchKit (no direct XLM award for this tranche).\n    \n\n2. Deliverable 2: User Testing and Feedback Integration\n\n-   Description: Conduct user testing sessions to gather feedback and implement initial improvements based on user interactions.\n    \n-   Completion Criteria: Complete user testing with at least 50 participants and integrate feedback into the platform.\n    \n-   Estimated Date of Completion: 1 Week\n    \n-   Budget: Included in Stellar LaunchKit benefits.",
                        "stellar.tranche3Mainnet": "1. Deliverable 1: Full Multi-Currency Wallet Launch\n\n-   Description: Launch the fully functional multi-currency wallet on Stellar’s mainnet, supporting multiple Stellar assets.\n    \n-   Completion Criteria: Wallet goes live on mainnet with all planned currencies and features functioning as intended.\n    \n-   Estimated Date of Completion: 2 Weeks\n    \n-   Budget: $28,823",
                        "stellar.teamMembers": "Charles Archibong",
                        "stellar.urls": {
                            "website": "https://www.myaza.co",
                            "codeRepository": "https://docs.google.com/document/d/108H05AvrldcpT4dsEtFOpjqhnMV9BpkDD0i9iJL1d0c/edit?usp=sharing",
                            "videoURL": "https://www.youtube.com/watch?v=Nsq6Xz4HGGk"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/myazahq/",
                            "twitter": "https://twitter.com/myazahq"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 71066.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 217688.1,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:9",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec350A9UiLypplJB",
                    "projectId": "daoip5:stellar:project:freelii",
                    "projectName": "Freelii",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec350A9UiLypplJB",
                    "status": "Awarded",
                    "description": "Freelii is a rebranding of our project Strooper Wallet. This project is a noncustodial Stellar wallet leveraging passkeys for enhanced security and ease of use. Freelii was originally built on Telegram and will be built on top of multiple socials as mini-apps to provide localized experiences to end users.",
                    "fundsApprovedInUSD": 72500.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1X1BsAcvzNs_WCv-Uta4chfI0ixqUKkX1/edit",
                        "stellar.productsAndServices": "Freelii is a re-branding and exploration on top of our original project - Strooper Wallet:\n\nStrooper Github: https://github.com/JoseCToscano/strooper-wallet\n\nStrooper Youtube Video: https://youtu.be/4faw_02YTBM\n\nFreelii explores anchor integrations and Chatbot UX, but the key feature we want to focus on building prior to testnet is the Passkey login used in Strooper Wallet. We want to continue improving on this to make a \"one click\" verification.\n\nWe will combine the tech from Strooper and Freelii as we progress to mainnet.\n\nFeatures and Stellar Integration:\n\n1.  PassKeys for Secure Transactions (Strooper Technichal Architecture)  \n    Stellar’s PassKeys enable secure transaction signing, making it easier and safer for users to manage their assets without dealing with private keys. Our main goal with these passkeys is to create a \"One Click Verification\" to create a frictionless experience.\n    \n1.  Peer-to-Peer Transfers (Freelii Technichal Architecture)  \n    Users can scan a user’s address and send Stellar assets instantly within our wallet built on social platforms, offering fast, secure transfers directly in the chat.\n    \n1.  Anchor Integrations for On-Off Ramp (Freelii Technichal Architecture)  \n    By integrating Stellar anchors, Strooper Wallet supports wallet top-ups and simple funds withdrawals, making it easier for users to move between crypto and traditional financial systems.\n    \n\nImpact of Improvements:\n\n-   Security: PassKeys and Soroban smart contracts provide robust security and flexible asset management.\n    \n\nUser Experience: Peer-to-peer transfers, customizable flows, and AI chatbot support enhance user convenience and streamline asset management.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "By the end of our first year, Freelii will aim to transact $250,000 a month. A comparable against an industry competitor. Where we want to win is sustained engagement with 50% active on a monthly basis. \n\n  \n\n50,000 Users by end of year one. Why? A Fintech Monster like Revolut was able to attract 100,000 users in their first year of operations. For Freelii, 50,000 represents a balance between achievable growth and the need for user adoption in an increasingly competitive market. Coinbase and MetaMask saw significantly larger user growth rates after their first year but benefitted from being among the first in their categories.   \n\n75% retention rate on onboarded customers. This benchmark is based on retention rates of successful wallets like MetaMask, which achieved similar retention rates due to strong product engagement.  \n\nImpact:\n\nFinancial Inclusion: As more fiat users transition to crypto wallets, they gain access to global financial systems that were previously unavailable to them due to high fees, lack of infrastructure, or exclusion by traditional banks. For example, a user in a remote area could access savings, loans, and remittance services through Strooper without the need for a traditional bank account.",
                        "stellar.tractionEvidence": "https://docs.google.com/spreadsheets/d/1KyAneWvA5Fo5OKektQUDfhoVJ2jI-P0oJGulxK3cEGU/edit?gid=0#gid=0\n\n  \n\nUser Engagement: Strooper Wallet, Freelii’s prototype, achieved 47 enrollments within just three days of showcasing, demonstrating a strong initial interest and product-market fit.\n\n  \n\nRecognition by Stellar: The Stellar Marketing Team has invited Freelii to participate in their \"Development Diary Series\", showcasing our project as a standout example of innovation on the Stellar network.\n\n  \n\nCollaborations with Stellar Teams: Actively working with the Stellar Product and Wallet teams to enhance passkey capabilities, positioning Freelii as an early adopter of this wallet technology. (John, Bruno, Jake)\n\n  \n\nHackathon Wins: Strooper Wallet/Freelii's foundational technology and concept have been validated through winning two Stellar-sponsored hackathons in a row, further solidifying the project’s potential and technical credibility.\n\n  \n\nPartnering: Freelii's team working on multiple integrations with big players: Bitso, Circle, Stripe. In discussions with local players in Philippines: Coins.PH, Ripe, Gcash.\n\n  \nOther(s): We have been pro-actively speaking with many de-fi projects, advisors, trad-fi entrepreneurs, and de-fi entrepreneurs. Examples here: https://drive.google.com/drive/u/0/folders/15qIRbF9KvsDKrvTGAuRrYgfKCmsFF5FB?ths=true",
                        "stellar.goToMarketPlan": "Target Audience\n\nPrimary Market:\n\nViber Users: Viber is a widely-used messaging platform with millions of active users. In the Philippines it is estimated that 71% of Philippines population uses Viber worldwide. This is the fastest growing social platform - In 2021 the Viber traction was only 7%. We’ll focus on attracting existing Viber users who may have limited exposure to crypto but are interested in easy-to-use financial tools.\n\nPrimary Country Market: \n\nTargeting Philippines as our initial rollout country. In 2023, the Philippines received a record-breaking $37.2 billion in personal remittances, marking a 3.0% increase from $36.1 billion in 2022. Remittances account for over 8.5% of the countries GDP.\n\nSecondary Market:\n\nStellar Community: The existing Stellar community will be a key early adopter group. We will actively engage with users already familiar with the Stellar ecosystem and Stellar-based DeFi tools.\n\nTertiary Market:\n\nNew DeFi Users: With the growing interest in decentralized finance, we will focus on users who are new to crypto and DeFi but are interested in simplified financial products like wallets, P2P transfers, and on-off ramp services.\n\nOverall Market: 1.7 Billion underbanked people send hundreds of billions of dollars a year in unconventional ways, with 75% of payments being from outdated systems.\n\n  \n\nValue Proposition\n\nSeamless Integration in Viber: No browser extensions, no separate app installations, just seamless access to Stellar's decentralised financial services for Viber users. \n\nSecurity and Simplicity: Leveraging PassKeys for secure transactions and removing the need for managing private keys will provide users with a safer, more user-friendly wallet experience. Low KYC needs.\n\nCustomizable and Automated: Our wallet offers customizable transaction flows through Soroban smart contracts, allowing users to automate asset management, bringing greater convenience to crypto transactions.\n\nOn-Off Ramp Services: By providing easy fiat-to-crypto and crypto-to-fiat conversions through Stellar anchors, Freelii bridges the gap between traditional financial systems and crypto.\n\nUX Focus: Creating social chatbots to help create familiarity to onboarding. Answer any questions pre-support needs, and help build comfort to any questions related to de-fi.\n\n  \n\nAcquisition channels:\n\n  \n\nCommunity Engagement\n\nStellar Ecosystem Partnerships: Collaborate with established Stellar-based projects and organizations to promote Strooper Wallet through joint campaigns and feature integrations.\n\nStellar Forums and Social Media: Engage with the Stellar community through Reddit, Twitter, and Discord, building excitement for the wallet’s launch.\n\n  \n\nViber  User Base\n\nViber Ads and Bots: Leverage Viber’s advertising and bot ecosystem to run campaigns directly within the platform. Create demo bots for users to explore Freelii’s features before committing to use.\n\n  \n\nInfluencer Marketing\n\nCrypto Influencers: Engage crypto influencers to demo Freelii to their audiences. This includes both Stellar ecosystem influencers and those in the broader DeFi space.\n\nCommunity-Led Referrals: Implement a referral program where users get rewards for inviting friends to join and use Freelii.\n\nTik Tok Micro influencing showing easy UX of telegram instant to Digital Wallet.\n\n  \n\nOrganic Search and Content Marketing\n\nEducational Content: Publish blog posts, explainer videos, and social media content around DeFi, crypto, and Stellar technology. \n\n  \n\nSEO & Stellar-Related Keywords: Optimize our website and content for keywords related to Stellar, DeFi, and crypto wallets.\n\n  \n\nEvents and Conferences: Continue to attend various conferences and build publicity and demo product to crypto users.\n\n  \n\nLaunch Phases:\n\n  \n\nPhase 1: Beta Launch:\n\nLaunch on Testnet: Begin with a limited launch to select users in the Stellar community and Telegram crypto groups. We’ll gather feedback on usability, performance, and security. Incentivized Beta Testing Outreach: Giving XLM tokens or enrollment bonuses to early testers who provide feedback on the beta version. Also ensuring early users that we will eat any fees based on exclusive invite codes.\n\n  \n\nBased on product feedback we will enhance the AI chatbot to help with onboarding. Using it as a demo bot with step by step guides and reducing friction for future Production rollout.\n\n  \n\nWe will use product feedback to create feature comparisons to other popular wallets looking to emphasise key differentiators such as Highlight Viber integration, PassKeys security, customizable transaction flows, ease of use, and advanced features such as customizable transaction flows using Soroban smart contracts.\n\n  \n\nPartnerships and integrations will be key in this stage. Freelii will always be looking to partner with Stellar anchors, DeFi platforms, and even non-Stellar applications to expand its capabilities. For instance, providing seamless fiat on-off ramps and advanced DeFi integration would offer a significant advantage over existing wallets. \n\n  \n\nJoseph and Jose plan to work in Philippines beginning January. Joseph is well connected with many executives, which can help target the specific country by partnering with local wallets like GCash, or PayMaya, to provide seamless fiat-to-crypto on/off-ramp services. By offering a direct bridge between their wallets and Freelii, users can easily move between fiat (PHP) and crypto. Freelii could be promoted as the crypto extension of these fiat wallets. For instance, GCash and PayMaya already have integrations allowing users to purchase crypto. Freelii can position itself as a partner for Stellar-based remittances and decentralized finance (DeFi) features that these wallets don’t fully offer yet this can easily be done through a local exchange like Coins.PH or larger exchanges globally. Jose is also well connected with a Mexican Forex trader who wants to be one of the first mass adopters of Crypto. This partner has already stated client’s willingness to help bring these projects to mainstream in Mexico. Targeting particular countries will also be our key advantage in releasing our wallet.\n\n  \n  \n\nPhase 2: Full Mainnet Launch\n\nTarget Date: April 2025\n\nMarketing Push: Coordinated promotion through Viber ads, crypto influencer partnerships, and Stellar community announcements.\n\n  \n\nReferral Program Activation: Launch a referral program to encourage viral growth, allowing users to earn rewards for bringing in new users.\n\n  \n\nStellar Community Airdrop: Airdrop an amount of XLM or other Stellar-based tokens to users who download Strooper and complete basic tasks (such as setting up their wallet or making their first peer-to-peer transfer). This incentivizes adoption and builds immediate engagement within the Stellar community.\n\n  \n\nReferral-Based Airdrops: Reward users who refer others with airdropped tokens once their referrals onboard and complete specific tasks (like making a transaction). Both the referrer and the referred user receives incentives. This dual-sided approach helps break down psychological barriers to trying a new service and results in organic user acquisition. \n\n  \n\nPartnerships: Utilise partnerships made in the Beta phase to help support our lunch and collaborate marketing pieces to build traction.\n\n  \n  \n\nPhase 3: Post-Launch Growth\n\nStellar DeFi Integration: Continue building partnerships with Stellar-based DeFi projects and anchors to expand Strooper Wallet’s feature set and user base.\n\n  \n\nOngoing Product Iteration: Based on user feedback, we’ll release regular updates with new features, such as advanced automation and expanded asset support.\n\n  \n\nCustomer Support and Retention:\n\nAI Chatbot: Based on user feedback continue to enhance our AI chatbot to offer 24/7 in-app support for users, improving user retention and satisfaction.\n\nCustomer Feedback Loop: Implement an ongoing feedback system, conducting user surveys and engaging with the community to ensure the wallet evolves with their needs.",
                        "stellar.tranche1Deliverables": "Despite finding proof of concept through winning two hackathons and finding users, we still consider ourselves in MVP stage and want to make improvements, debug, and add additional features before official publication on Testnet.\n\nTotal Cost Breakdown: $27.5K (December - February)\n\nPassKeys for Secure Transactions (Done in theory [Strooper Wallet Hackathon] - Debugging and improving) ($7.5K)\n\nCosts Breakdown:\n\nInfrastructure costs:\n\n-   Twilio Services for SMS messaging required to verify users through OTP\n    \n-   Server Hosting through Amazon Web Services\n    \n-   FIle Storage Service (AWS S3)\n    \n\n**Development costs:  \n**Our main short-term focus is improving this capability to create a \"one-click\" onboarding experience with Stellar’s PassKeys, which is a complex and resource-intensive process due to the following challenges:\n\n1.  Custom Smart Contracts:  \n    We need to design and deploy custom contracts to manage PassKeys, integrate \"C\" and \"G\" addresses, and support our seamless onboarding flow. These contracts will require audits to ensure security, which adds to the cost.\n    \n1.  Rigorous Testing:  \n    Extensive unit testing is needed to ensure every part of the system—from PassKey generation to transaction signing—works reliably and securely, especially when handling financial transactions.\n    \n1.  Policy Signer Integration:  \n    Developing support for custom policy signers is critical to connect \"C\" and \"G\" addresses. This also requires building indexing systems to track and manage accounts efficiently, adding development effort.\n    \n1.  WebAuth and MiniApp Limitations:  \n    Current webviews, like those in Telegram MiniApps, don’t natively support PassKeys. We’ll need to create custom flows to manage PassKeys and signing while ensuring a smooth user experience.\n    \n1.  PassKey Management:  \n    Managing PassKeys within the MiniApp environment requires developing secure and scalable solutions that align with the platform’s limitations. Stellar’s PassKeys enable secure transaction signing, making it easier and safer for users to manage their assets without dealing with private keys.\n    \n\nThese tasks demand significant development time, expertise, and resources, including the cost of testing, and building new features. This investment is essential to create a seamless onboarding experience that is secure, scalable, and easy to use.\n\n  \n\nPeer-to-Peer Transfers (Done in theory [Freelii Hackathon] - Debugging and improving) ($10K) \n\nCosts Breakdown:\n\n1.  **Chatbot UX Development and Licensing Fees:  \n    **Developing a seamless chatbot experience requires significant investment in UX design to ensure that users can intuitively navigate the remittance flow. Additionally, if leveraging third-party chatbot platforms and LLMs, further increasing costs.\n    \n1.  API Integration Costs:  \n    Integrating with Stellar’s ecosystem requires building robust API connections to support remittance flows. This involves working with SEPs like SEP-10, SEP-12, SEP-6, and SEP-24 for authentication, KYC, deposits, and withdrawals. Each API integration requires development time, testing, and ongoing maintenance to ensure smooth operation. Additionally, integrating with anchors, initially Circle’s USDc and additional partners for fiat on/off-ramping will involve negotiation and potential usage fees, especially for scaling in the Philippines.\n    \n1.  Backend Development:  \n    The backend must be robust and scalable to handle transaction generation, PassKey management, and policy signer integration while ensuring high availability and security. Building this infrastructure will require substantial development time, audits, and server hosting costs, as well as ongoing maintenance and updates.\n    \n\nPivoting to Viber ($2K):  \nWe originally built Freelii on Telegram, but to better reach our first target market, the Philippines, we are pivoting to Viber for the MVP. Viber’s significantly higher adoption in the Philippines aligns with our target customer base, offering greater potential for user engagement and retention. However, this shift comes with added costs:\n\n-   Viber Integration Costs: Adapting our chatbot and backend infrastructure to work with Viber’s APIs and platform-specific requirements.\n    \n-   Licensing and Operational Fees: Viber’s platform usage may incur recurring fees, particularly for advanced integrations and enterprise features.\n    \n-   Localization: Customizing the chatbot UX for cultural and linguistic relevance to the Philippines, including translations, local regulations, and market preferences.\n    \n\nDespite these additional costs, the move to Viber will allow us to focus directly on our target customers, providing a more impactful and tailored experience. By prioritizing user engagement in a high-potential market, we aim to maximize early adoption and validate our product more effectively.\n\nAnchor Integrations for On-Off Ramp (Want minimum two anchors before publication to Testnet) ($10K)\n\nCosts Breakdown:\n\nCosts for Anchor Integrations for On/Off Ramp (Target: Minimum Two Anchors, $10K)\n\n1.  Business Accounts + Verifications:  \n    Setting up verified business accounts for anchors includes legal fees, registration, and compliance checks like KYC reviews. Estimated cost: $2K-$3K.\n    \n1.  Setup & Configuration:  \n    Anchor-specific setup requires account configuration, secure API key management, and testing. Estimated cost: $1K-$2K.\n    \n1.  API Integrations:  \n    Developing secure API connections for deposits, withdrawals, and compliance with SEPs (e.g., SEP-6, SEP-24) requires thorough testing and optimization. Estimated cost: $2K-$3K.\n    \n1.  Development:  \n    Building backend modules for fiat on/off-ramping and transaction tracking, plus ongoing maintenance. Estimated cost: $3K-$4K.\n    \n    We have been in discussion with various partners for on/off ramps:\n    \n\nOur initial rollout will include the USDC Access (By Circle), and Stripe Connect for On-Ramps. For Off-Ramps, we are focused on integrating with [](http://coins.ph)Coins.PH who will enable digital wallets - GCash and Pay Maya payouts. Our second off-ramp focus will be on Bank deposits VIA InstaPay and PESONet.\n\nOther ramps post MVP:\n\nOn-Ramps: Moneygram VIA Stellar, Stripe Connect, Moonpay, ACH Transfers (Via Circle), Enrolled in USDC Access Beta (Circe), Bitso (For eventual expansion to Latam).\n\nOff Ramps (Philippines specific): Moneygram VIA Stellar, Gcash, PayMaya, Coins.PH, Bank deposits VIA Instapay and PESONet, also speaking with Union Bank who is a leading digital supporting bank in the Philippines.",
                        "stellar.tranche2Testnet": "Cost Breakdown: $20K (February - March)\n\nOur TestNet development phase will prioritize features based on user feedback, focusing on delivering key functionalities while addressing technical challenges to ensure scalability and user satisfaction.\n\n1.  **Soroban Smart Contracts ($10K):  \n    **Developing Soroban Smart Contracts will enable customizable transaction flows and automation, providing greater flexibility in asset management. However, Smart Contracts on Stellar do not inherently track balances for any asset. Instead, we must specify which assets to monitor and perform inverse searches for each asset, requiring indexing solutions to gather and display data effectively. Implementing this indexing system adds significant complexity and development costs.\n    \n1.  **Asset Management ($5K):  \n    **Providing users with the ability to view and manage their Stellar assets will involve building intuitive interfaces and backend support. Offering decentralized savings accounts through tools like (Script3) Blend introduces additional value, allowing users to earn interest. However, these features require compliance with decentralized finance protocols, as well as development efforts to ensure seamless integration and user experience.\n    \n\nKey Technical Considerations and Costs:\n\n-   Indexing Challenges: Building or integrating an indexing system for asset tracking is critical. Without it, Smart Contracts cannot natively display balances, requiring expensive backend development or third-party indexing services to handle this.\n    \n-   Smart Contracts: Ensuring the security and reliability of Soroban Smart Contracts adds further costs through audits and rigorous testing.\n    \n-   Custom Integrations: Both DEX and Oracle integrations require tailored development, testing, and maintenance.\n    \n\n  \n\nAudit (Free): Will use Stellar Launchkit and apply for credits for Audit. Already in contact with Andreas Mantzoutas, who is already looking to help us start on the technical side and future audit.\n\nLegal Incorporation ($2K): Setting up Delaware LLC, state fees, registered agent services for the first year, virtual address in the US, and operating agreement. Legal adjustments to operating agreement for our specific business such as: Non-Custodial Wallets: Clearly state that Freelii is a technology provider and does not hold or manage user funds, avoiding regulatory misclassification.Crypto Transactions: Include clauses limiting liability and emphasizing compliance to address regulatory grey areas. Cross-Border Transfers: Define how disputes across jurisdictions are handled and ensure compliance with international regulations.",
                        "stellar.tranche3Mainnet": "Support and Maintenance ($10K):\n\nSet up user support infrastructure, including ticketing systems. Ongoing maintenance to platform.\n\nMonitoring and Analytics Tools ($1K/Month + $1K Development Fees): Deploy real-time monitoring for transactions and user behavior (e.g., DataDog, Grafana).\n\nOperational Liquidity ($5-10K Reserve Based on Volume):\n\nAs non-Custodial, fund flows will need to hold “collateral”. This will allow negative revenue accounts so payouts can be authenticated before the pay-in is captured so we never hold the customer’s cash. Establish liquidity pools to handle transaction mismatches (e.g., refunds, chargebacks).\n\nInfrastructure and Hosting ($1K/Month + $1K Development Fees):\n\nEnsure reliable hosting for mainnet operations, including full nodes, APIs, and failover systems.\n\nStellar Transaction Fees Reserve ($1-5K Based on Volume):\n\nMaintain reserves to cover operational fees for a defined number of transactions.",
                        "stellar.teamMembers": "Joseph Anthony, Jose Toscano",
                        "stellar.urls": {
                            "website": "https://www.freelii.app/",
                            "codeRepository": "https://github.com/JoseCToscano/freelii/",
                            "videoURL": "https://www.youtube.com/watch?v=rWXw0ZqOxlo"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/freelii/"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 48333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 141068.69,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:10",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recPqwg9CKoHwlg3L",
                    "projectId": "daoip5:stellar:project:xcapit-smart-pay",
                    "projectName": "XCAPIT Smart Pay",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recPqwg9CKoHwlg3L",
                    "status": "Awarded",
                    "description": "We propose to develop and launch our UNICEF-backed Smart Pay Solution (B2B2C) adapted to Stellar utilizing Soroban for customization, enabling secure, SMS-based digital asset distribution and management for NGOs and users with no internet access.",
                    "fundsApprovedInUSD": 147000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1mG-KPgeZnlNWsHoXzNGoGsocxxys68cDx5FAHQ3sQRw/edit?tab=t.0",
                        "stellar.productsAndServices": "Open-Source Offline Smart Pay on Stellar  \nXcapit x UNICEF Smart Pay on Stellar will enable humanitarian organizations to distribute digital assets through SMS, designed for users in low-connectivity regions. It leverages Soroban smart contracts for programmability, offering a pioneering Digital Public Good (DPG) on Stellar—a critical feature for NGO partners. Additionally, we are adapting the Reverse Payment functionality for merchant transactions on Stellar, simplifying the payment process and making it more accessible for customers with limited digital payment knowledge.\n\n  \n\nSMART WALLET:\n\nAccount Creation: Beneficiary account setup via SMS.\n\nPayment System: Internet-free funds transfer; no SMS credit needed.\n\nTrustline & Sponsored Accounts: Seamless asset reception with NGO-funded account setup.\n\nAccount Management: Simple SMS-based fund and account balance checking\n\nCustomization: Tailored smart contract capabilities based on NGO requirements\n\n  \n\nMERCHANT SERVICES:\n\nReverse Payment Functionality: The merchant initiates the payment process, and the user confirms the transaction amount, simplifying blockchain transactions for users with no knowledge of digital asset transactions\n\nSecure Transactions: Reliable, real-time account balances and low-cost transfers\n\n  \n\nMANAGED SERVICE FOR NGOs:\n\nCustomization: Localization features and smart contract-based capabilities for custom requirements\n\nOnboarding: Streamlined onboarding and efficient cash disbursement\n\nDashboard: Tools for funds traceability and management\n\nClawback and/ or Claimable Balances Functionality: Asset recovery for enhanced control",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "SUCCESS METRICS\n\n  \n\n1. Adoption & Usage (within the first 4 months)\n\nNGOs: 2-4 partner NGOs piloting the solution on Stellar in key local markets within the first 4 months\n\nEnd-users: Onboarding 10,000+ new users in LATAM\n\n  \n\n2. Performance Metrics\n\nTransaction Speed: Fast and efficient processing of all Stellar transactions and Soroban smart contract customization \n\nTransaction Cost: Transaction costs, including SMS, remain within the limits of the original Peru pilot\n\nClawbacks: Smart contract customization minimizes clawbacks while maintaining flexibility\n\nPilot Success Rate: Success rate aligns with the outcomes of the original Peru pilot\n\n  \n\n3. Ecosystem Engagement\n\nCommunity Contributions: Active engagement and partnerships with the Stellar Ecosystem community to the open-source low tech wallet, expanding its capabilities and integration points\n\n  \n\nIMPACT\n\n1. Increased Financial Inclusion: Enables underserved populations to access and use digital assets through a low-tech offline solution\n\n2. Lower Technical Barriers: Simplifies onboarding for users and organizations with minimal technological infrastructure\n\n3. Cost-Effective Transactions: Facilitates secure and low-cost transactions for NGOs, governments, and merchants\n\n4. Enhanced Network Adoption: Drives broader adoption of Stellar, particularly in regions such as LATAM\n\n5. Fosters Ecosystem Growth: Accelerates the expansion of the Stellar ecosystem by reaching new users and use cases, while offering a critical low-tech solution for existing partner organizations.\n\n6. One of the First DPGs on Stellar: Potentially one of the first Digital Public Goods on Stellar, pending third-party certification.",
                        "stellar.tractionEvidence": "Our solution, a semi-finalist in the MIT Solve 2024 Global Economic Prosperity Challenge [1], has demonstrated its effectiveness  with over 70,000 users across 167 countries [2], supported by UNICEF's Innovation Fund three times [3]. Featured in Stanford Innovation Magazine, we’ve expanded our reach through partnerships with governments and NGOs, and are finalizing an RFP with the World Food Program, as well as exploring integration into national aid systems in Argentina.\n\nOur recent pilot in Cusco [4] achieved a 100% transaction success rate despite challenging conditions—facilitating offline transactions in remote areas with customers using basic phones [5]. Leveraging insights from this experience, we are strengthening our backend infrastructure, enhancing security, and optimizing user experience. We’re now expanding from Cusco to additional regions across Latin America and forming partnerships with key local merchant networks.\n\nAdditionally, we’ve been actively engaging with the Stellar ecosystem and product team at Circle’s Impact Competitions in New York and Washington DC, and Devcon in Bangkok. We’re also in discussions with Stellar ecosystem partners, such as Block Time Financial, to explore collaboration opportunities.\n\nFOOTNOTES\n\n[1] MIT Solve 2024 Global Economic Prosperity Challenge Semi-Finalist\n\nhttps://solve.mit.edu/challenges/2024-global-economic-prosperity-challenge/solutions/88130\n\n  \n\n[2]...70K users across 167 countries…\n\n https://drive.google.com/file/d/1xfWRhBJLTvOWQJINZ_IR3YurzgW5kOfY/view\n\n  \n\n[3] UNICEF Venture Fund Onboards Its Third Growth Cohort\n\nhttps://www.unicef.org/innovation/stories/investing-blockchain-web3-and-ai-social-impact\n\n  \n\n[4] Our recent pilot in Cuzco, Peru\n\nhttps://www.xcapit.com/en-blog-cusco-pilot \n\n  \n\n[5] Key Stats: SMS-Based Solutions\n\nOffline Population: Over one-third of the global population—around 2.6 billion people—remain offline, with limited or no access to the internet, particularly in rural, low-income areas.\n\n  \n\nAdaptability to Low-Tech Phones: Entry-level smartphones, priced at around USD 50, equate to nearly a month’s income in many low-income countries. Approximately 600 million people worldwide still use feature phones (about 8% of the global population), especially in rural regions where network coverage and affordability are significant barriers.\n\n  \n\nSources:\n\n- GSMA | The State of Mobile Internet Connectivity Report 2023 - Mobile for Development\n\n- International Telecommunication Union (ITU)",
                        "stellar.goToMarketPlan": "TARGET MARKET\n\n1. Stellar ecosystem partner NGOs\n\nNeeds: Access to low tech solutions for cash disbursement and managed service for regional/ local implementation and reporting\n\n  \n\nValue Proposition: Low-cost, managed local access to a scalable, open-source solution, significantly reducing time and technical complexity in accessing Stellar and Soroban low-tech custom wallet for cash disbursement\n\n  \n\n2. Xcapit partners: UNICEF, and more.\n\nNeeds: Access to cost-effective, secure transactions for international funds transfers, requiring seamless access to leading global digital assets for their operations and humanitarian programs\n\n  \n\nValue Proposition: Enable UNICEF to expand its global asset network with a highly efficient, low-cost solution for secure cash disbursement enhancing the reach of its global initiatives while driving the growth for the Stellar network\n\n3. Local Governments\n\nNeeds: Efficient, low-cost solutions for managing public funds and disbursing payments to citizens or vendors, bypassing legacy systems and minimizing technological requirements.\n\nValue Proposition: Provide a cost-effective, easily deployable solution for seamless fund distribution, enhancing transparency and efficiency while enabling local access to secure digital asset transactions, driving financial inclusion.\n\n3. Local Merchants Networks\n\nNeeds: A fast, secure payment solution to facilitate cash disbursement transactions and offer payments to customers with low fees\n\nValue Proposition: An innovative payment solution that allows merchants to quickly and securely accept cash disbursement funds, overcoming barriers for low-tech users and improving access for beneficiaries.\n\n  \n\nACQUISITION CHANNELS\n\n1. Stellar Ecosystem Partnerships\n\nCollaborate with SDF: Align closely with SDF to promote the Xcapit x UNICEF solution  with the broader Stellar network. Participate in ecosystem initiatives, hackathons, and accelerator programs \n\nPartner with Stellar Ecosystem partner Block Time Financial: Offer SDP access to our existing partners, enhancing collaboration and expanding regional service offerings\n\n  \n\n2. Xcapit Partnerships\n\nLeveraging established relationships with key partner organizations and governments, expanding reach, and driving adoption of our solution on the Stellar network.\n\n  \n\n3. Social Media, PR and Media Outreach\n\na) Press Releases: Announce significant milestones, including project funding, new integrations, and collaborations with Stellar ecosystem partners\n\nb) Technical Blog and Documentation: Provide a step-by-step guide to the open-source solution, highlighting key features and capabilities\n\nc) Digital Public Good (DPG) Blog: Spotlight the Xcapit x UNICEF partnership as a pioneering Digital Public Good built on Soroban & Stellar, showcasing its impact\n\nd) Conferences & Interviews: Present the DPG wallet at impact-focused conferences and media interviews, emphasizing its role in advancing financial inclusion and innovation\n\nd) Social Media: Expand our reach through social media posts on our official channels, complemented by active engagement from our team to amplify visibility and reach\n\n  \n  \n\nSTELLAR ECOSYSTEM BENEFITS\n\n1. Boosted Ecosystem Innovation: Streamlines NGO, local government, and merchant onboarding with a managed solution that reduces friction, fosters Stellar ecosystem growth, and promotes financial inclusion through a low-tech wallet\n\n  \n\n2. Blockchain for Good Use Case: Leverages Stellar’s low-cost, secure blockchain to provide an abstracted, low-tech solution that promotes financial inclusion by enabling seamless, accessible offline transactions for underserved populations, while offering advanced traceability for nonprofit organizations\n\n. \n\n3. Regional Presence in LATAM: Expands the Stellar Network footprint in Latin America with a localized, global asset solution.",
                        "stellar.tranche1Deliverables": "We propose a phased approach driven by insights from prior development, live solution testing, in-market feedback, and close collaboration with our NGO partner, ensuring a high-impact launch and smooth integration. Each phase incorporates real-world testing to enable co-creation with partner organizations while maintaining our solution’s performance standards. This strategy also enhances visibility across the ecosystem.\n\n**TRANCHE 1 - MVP  \n**During the MVP tranche, we will focus on developing and deploying the Smart Wallet MVP on Stellar, incorporating core features such as account creation, trustline setup, clawbacks, and secure transactions. Additionally, we will begin exploring Soroban smart contracts and deploying our initial smart contract features.\n\nUpon completion of this stage:\n\n- the wallet is tested in real-life local scenarios with basic transaction functionality,  \n\n- we showcase the advanced functionality of our first smart contract on Soroban, and\n\n- the code is available for public review\n\n  \n\nEstimated Completion Date: 65 days\n\nDeliverables:\n\nSMART WALLET:\n\nInitial Smart Pay MVP on Stellar\n\nReal-world testing meeting or exceeding pilot project results\n\nShowcase our first Smart Contract feature\n\nProposed fixes during testnet tranche\n\n  \n\nMANAGED SERVICES FOR NGOs AND MERCHANTS:\n\nShare video demo of functionality\n\n  \n\nPlus, documentation and open-source code available on GitLab\n\nTotal Tranche 1 Budget: $49,000\n\nBudget Breakdown:\n\nDevelopment of Smart Wallet MVP, Security, and Infrastructure: $24,500\n\nCore Feature Real-World Implementation Testing/ Ops: $17,000  \n(critical for engaging NGOs early and showcasing the solution)\n\nOpen-Source Repository & Demo Video: $5,000\n\nMiscellaneous: $2,500",
                        "stellar.tranche2Testnet": "In this trance, we will deploy the Smart Wallet on the Stellar Testnet and set up a test environment for transactions. This will include payment validation, integration with Stellar LaunchKit, and performance testing.\n\n  \n\nThis phase will involve:\n\n- Performing initial tests to validate performance\n\n- Monitoring and troubleshooting issues from real-life testing\n\n  \n\nEstimated Completion Date: 25 days\n\nDeliverables:\n\nTestnet deployment\n\nFeature testing (payment validation)\n\nTest results and documentation on GitLab\n\n  \n\nTotal Tranche 2 Budget: $49,000\n\n  \n\nBudget Breakdown:\n\nTest Environment Setup: $15,000\n\nInitial Testing Adjustment (from Tranche 1): $16,000\n\nDevOps, Monitoring & Troubleshooting: $10,000\n\nOptimization: $3,500\n\nMiscellaneous (Unexpected costs for security and tech infrastructure): $4,500",
                        "stellar.tranche3Mainnet": "In this tranche, we’ll enhance our initial product by developing custom smart contract functionality tailored to NGO needs and incorporating advanced localization features. \n\nThis tranche also involves onboarding a select merchant network to ensure immediate go-to-market readiness following the mainnet launch. Additionally, it includes adapting key features requested by NGOs, such as the reverse payment functionality. This feature allows merchants to initiate transactions, enabling users to accept payments and conduct transactions without needing to understand the underlying blockchain mechanics.\n\nFinally, we’ll complete full deployment of the Smart Wallet on Stellar Mainnet, with advanced smart contract integrations and streamlined user onboarding (B2B2C).\n\nEstimated Completion Date: 60-90 days\n\nDeliverables:\n\nSMART WALLET:\n\nFull wallet deployment on Stellar Mainnet\n\nFeature testing (payment validation, smart contracts)\n\nSmart Contract Enhancements\n\n  \n\nMERCHANT SERVICES:\n\nReverse Payment Functionality Adaptation\n\nEnhancing security and usability to address known vulnerabilities, such as scammers exploiting reverse payment features\n\nLimited Local Merchant Network Integration (off-ramp) \n\n  \n\nMANAGED SERVICE FOR NGOs:\n\nOnboarding and user metrics/ dashboard\n\n  \n\nAdditionally, this includes the open-source code, project documentation, and submission for DPG certification.\n\n  \n  \n\nTotal Tranche 3 Budget: $49,000\n\n  \n\nBudget Breakdown:\n\nSmart Contract Development: $20,000\n\nLimited Local Merchant Network Integration & Testing: $10,000\n\nClient Set-up/ Ops: Onboarding, Customization & Management: $9,000\n\nMainnet Deployment and Infrastructure Optimization: $10,000",
                        "stellar.teamMembers": "Xcapit",
                        "stellar.urls": {
                            "website": "https://www.xcapit.com/",
                            "codeRepository": "https://github.com/xcapit/stellar-poc",
                            "videoURL": "https://www.youtube.com/watch?v=mBqsxF1UFc8"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/xcapit",
                            "twitter": "https://x.com/xcapit_",
                            "discord": "https://discord.gg/R6KVz5RFjy"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 98000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 318053.0,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:11",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recIHN98Ja7MMb4DX",
                    "projectId": "daoip5:stellar:project:stellar-attestation-service",
                    "projectName": "Stellar Attestation Service",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recIHN98Ja7MMb4DX",
                    "status": "Awarded",
                    "description": "Use our attestation infrastructure to build anything from Network States, DAOs, DePIN, and RWA.",
                    "fundsApprovedInUSD": 83050.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://whimsical.com/proposal-sas-Bmwj1r1PFGod9rJrm96H8r",
                        "stellar.productsAndServices": "Problem\n\nIn many industries, verifying credentials and ensuring compliance with regulatory requirements is fraught with challenges:\n\n-   Complex and time-consuming processes that hinder efficiency.\n    \n-   High susceptibility to fraud and data tampering due to reliance on centralized systems.\n    \n-   Inherent inefficiencies in traditional methods of issuing and verifying digital attestations.\n    \n\nThese problems are particularly pronounced in sectors such as financial services, supply chain management, education, healthcare, real estate, and employment verification. Without a scalable and trust-enabling solution, organizations struggle to meet regulatory demands and user expectations for secure, reliable credentialing.\n\n-  \n\nSolution\n\nTo address these issues, we are developing the Stellar Attestation Service (SAS)—a decentralized attestation framework leveraging Soroban smart contracts.\n\nKey Functionalities:\n\n-   Issuance and Management: Enable Stellar ecosystem projects to issue, store, and verify diverse digital credentials, such as identity verifications, educational certifications, and professional qualifications.\n    \n-   Decentralized Storage: Store attestation metadata on IPFS for tamper-proof data integrity.\n    \n-   Tokenized Attestations: Represent attestations as tokenized assets, ensuring transparent and immutable credential management.\n    \n-   Seamless Integration: Provide developer-friendly APIs and SDKs for seamless integration into Stellar projects.\n    \n\nThis platform empowers Stellar projects to generate cryptographic proofs of on-chain signatories, enhancing trust and compliance for projects building Stellar .\n\n-  \n\nBenefits to Stellar\n\n1.  Enhanced Utility: Expands Stellar’s range of use cases to include identity verification, credentialing, and supply chain tracking.\n    \n1.  New Revenue Streams: Introduces schema levies and service fees, creating economic opportunities for network stakeholders.\n    \n1.  Global Adoption: Appeals to industries prioritizing privacy-preserving solutions for compliance and security.\n    \n1.  Developer Ecosystem Growth: A modular, user-friendly design encourages the development of new dApps leveraging attestation functionalities.\n    \n\n-  \n\nBuild Initiatives\n\n1.  No-Code Schema Deployer (dApp):\n    \n    -   Simplify schema creation for users without technical expertise.\n        \n    -   Provide a UI to define schema rules, levies, and conditions like expiration or revocation.\n        \n1.  Attestation Explorer and Analytics Portal (dApp):\n    \n    -   A dashboard for viewing, analyzing, and managing issued attestations.\n        \n    -   Provide detailed metrics and visualizations of attestation data.\n        \n1.  New and Improved Node.js (SDK):\n    \n    -   Empower developers to easily integrate SAS functionalities into their projects.\n        \n    -   Provide out-of-the-box tools for attestation schema management and querying.\n        \n1.  Attestation Authorities:\n    \n    -   Allow projects to become verified authorities by validating their stellar.toml file.\n        \n    -   Unlock pro features such as:\n        \n        -   Enhanced Analytics: Detailed insights into schema usage and attestation metrics.\n            \n        -   Notifications: Real-time updates via Telegram bots or channels when schemas or attestations are signed.\n            \n        -   Levy Collection: Enable authorities to collect XLM levies for attestations related to their schema.\n            \n    -   Build and deploy smart contracts to facilitate authority issuance and schema governance.\n        \n1.  CLI and SDK Integration for Authorities:\n    \n    -   Extend CLI and SDK capabilities to integrate authority-specific features seamlessly.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Attestation Volume:\n\n-   Target: 200,000 attestations and revocations on the Stellar blockchain within the first 12 months.\n    \n\nActive Authority Nodes:\n\n-   Target: 50 active verified authorities issuing attestations within the Stellar ecosystem.\n    \n\nSDK and CLI Integrations:\n\n-   JavaScript SDK: 10,000 downloads from Stellar developers.\n    \n-   CLI Tool: 5,000 installations via npm.\n    \n\nCross-Chain Attestation Usage:\n\n-   Target: 100 cross-chain attestations on Stellar with 2 unique cross-chain attestation schemas.\n    \n\nDomain Traffic to Stellar Attestation Platform:\n\n-   Target: 10,000 monthly visits to stellar.attest.so & it's sasdev.xyz counterpart\n    \n\nNumber of Schemas in Registry:\n\n-   Target: 300 unique schemas registered on Stellar attestation platform.\n    \n\nAttestation Levies:\n\n-   Target: 10,000 levies collected in 12 months, with each levy valued at $1 or more per attestation.\n    \n\nAverage Session Time for Key Actions:\n\n-   Deploying attestations: Target average session time of under 5 minutes.\n    \n-   Verifying attestations: Target average session time of under 3 minutes.\n    \n-   Attesting to a schema: Target average session time of under 4 minutes.\n    \n\nService Level Agreements (SLAs):\n\n-   Uptime: 99.9% uptime for attestation services.\n    \n-   Latency: Average latency for schema creation and attestation issuance under 1 second.\n    \n-   Throughput: Ability to handle 10,000 attestations per hour during peak usage.",
                        "stellar.tractionEvidence": "1.  Industry Engagement:\n    \n    -   Conducted 11 RFP calls with founders building use cases in identity, asset tokenization, on-chain notaries, and signatories.\n        \n        We intend to co-build with 2 of these founders to launch their products which leverage the attestation service on the Stellar blockchain.\n        \n    \n1.  Benchmark Validation(From Competitors):\n    \n    -   Sign Protocol: Proven capability with 3M+ on-chain attestations and 2.5K+ schemas.\n        \n    -   Ethereal Attestation Service Ecosystem:\n        \n        -   Over 7M attestations created.\n            \n        -   430,000+ unique attesters.\n            \n        -   6,000+ registered schemas.\n            \n1.  Research Insights and Interviews:\n    \n    -   Delivered outputs informed by extensive user research:\n        \n        -   Research Synthesis Insights.\n            \n        -   Refined User Information Architecture.\n            \n        \n        Following extensive research and interviews, we have now a new a simplified no-code attestation deployment dApp & explorer (View Design). See Checkpoint One for reference https://www.figma.com/design/0BK8NARaTm8LrPFzRZKhM3/attest.so?node-id=1-4&node-type=canvas\n        \n\n-  \n\nOur expertise in Rust-based virtual machines (VMs) positions us uniquely for multi-chain interoperability. By aligning our attestation service with industry-standard proposals, we enable seamless bridging of attestations between EVM-compatible chains and Stellar. This capability unlocks significant opportunities, simplifying migration and integration for projects across these ecosystems. It ensures ease of use and attracts developers building multi-chain solutions.",
                        "stellar.goToMarketPlan": "Engage Stellar Developer Ecosystem:\n\n-   Connect with Stellar ecosystem founders and key developers to build early traction and trust.\n    \n-   Establish relationships with influential Stellar-based projects and integrate them into the attestation network.\n    \n\nCommunity Outreach through Developer Networks:\n\n-   Partner with Stellar-focused developer communities to promote the use of the attestation framework.\n    \n-   Launch mini-bounty programs incentivizing the adoption and creation of attestations on Stellar.\n    \n\nContent & Social Media Campaign:\n\n-   Execute a 1-3 month awareness campaign using Stellar-focused content (articles, blog posts, podcasts).\n    \n-   Collaborate with Stellar influencers to drive visibility and interest within the Stellar ecosystem.\n    \n\nSoroban Source Attestation for Stellar Mainnet Projects:\n\n-   Target projects launching on Stellar through DappRadar to adopt attestation when they complete their smart contract audits.\n    \n-   Provide delegated proofs that verify the audit status of smart contracts for these projects, detailing the auditor and audit date.\n    \n\nStrategic Partnerships for Contract Verification:\n\n-   Partner with at least 12 Stellar-based smart contract developers to attests to the verification of their source code on the platform.\n    \n-   Establish a standard for code verification on Stellar, ensuring transparency and trust.\n    \n\nAuthority Setup for Stellar Ecosystem Projects:\n\n-   Work with 3+ key ecosystem projects on Stellar to establish attestation authorities.\n    \n-   Enable these authorities to create schemas and issue customized attestations within the Stellar ecosystem, empowering decentralized verification.",
                        "stellar.tranche1Deliverables": "Goal: Establish core functionalities and prepare for testnet deployment.\n\nTasks & KPIs:\n\n1.  No-Code Schema Deployer (dApp)\n    \n    -   Develop UI to define schema rules, levies, and conditions.\n        \n    -   Ensure backend integration with Soroban smart contracts.\n        \n    -   KPI: Deployer can create and manage schemas with basic rules.\n        \n1.  Node.js SDK\n    \n    -   Improve core SDK functionalities for schema management and querying.\n        \n    -   Integrate Launchtube and ensure compatibility with Stellar and Soroban environments.\n        \n    -   KPI: SDK supports schema creation and data querying with documentation.\n        \n1.  Basic Attestation Explorer\n    \n    -   Create an interface to view and manage issued attestations.\n        \n    -   Include basic data visualization.\n        \n    -   KPI: Attestation explorer allows access to attestations by schema.\n        \n\nEngineering Breakdown:\n\n    | Role | Hours | Rate ($/hr) | Estimated Cost ($) |\n\n    | Smart Contract Developer | 80hrs | 65 | $5,200 |\n\n    | Fullstack Engineer 1 | 215hrs | 45 | $9,675 |\n\n    | Fullstack Engineer 2 | 215hrs | 45 | $9,675 |\n\n    | ~510hrs of work within a 6 week timeline for $24,550 |\n\nTimeline: 6 weeks\n\nBudget: $24,550",
                        "stellar.tranche2Testnet": "Goal: Add advanced functionality, test extensively on the Soroban testnet, and ensure stable performance.\n\nTasks & KPIs:\n\n1.  Enhanced Attestation Explorer\n    \n    -   Add advanced filtering, detailed metrics, and visualizations.\n        \n    -   KPI: Explorer supports detailed querying and analytics with 99% uptime.\n        \n1.  Attestation Authorities Features\n    \n    -   Implement smart contracts for authority issuance and stellar.toml validation.\n        \n    -   Pro features: analytics, notifications, levy collection.\n        \n    -   KPI: Authorities can issue attestations with XLM levy integration.\n        \n1.  SDK & CLI Integration for Attestation Authorities\n    \n    -   Extend CLI capabilities for schema management and governance.\n        \n    -   KPI: CLI supports authority-specific commands with user guides.\n        \n\nEngineering Breakdown:\n\n    | Role | Hours | Rate ($/hr) | Estimated Cost ($) |\n\n    | Smart Contract Developer | 120 | 65 | $7800 |\n\n    | Fullstack Engineer 1 | 240 | 45 | $10,800 |\n\n    | Fullstack Engineer 2 | 240 | 45 | $10,800 |\n\n    | ~550hrs of work within an 8 week timeline for $29,400 |\n\nTimeline: 2 months\n\nBudget: $29,400",
                        "stellar.tranche3Mainnet": "Goal: Finalize, optimize, and deploy the project on Stellar mainnet.\n\nTasks & KPIs:\n\n1.  Polished No-Code Schema Deployer\n    \n    -   Optimize performance and UI/UX for scalability.\n        \n    -   KPI: Deployer is production-ready with seamless schema creation.\n        \n1.  SDK with Authority Integration\n    \n    -   Add full support for authority-specific features.\n        \n    -   Provide comprehensive developer documentation.\n        \n    -   KPI: SDK offers end-to-end integration with stellar.toml validation.\n        \n1.  Production-Ready Attestation Explorer\n    \n    -   Real-time updates, pro analytics, and notification integration (e.g. Telegram Bot).\n        \n    -   KPI: Explorer handles live attestation metrics in real-time.\n        \n1.  Mainnet Deployment\n    \n    -   Final testing, auditing, and mainnet deployment of all components.\n        \n    -   KPI: Smart contracts and all services operate with mainnet stability.\n        \n\nEngineering Breakdown:\n\n    | Role | Hours | Rate ($/hr) | Estimated Cost ($) |\n\n    | Smart Contract Developer | 60 | 65 | $3900 |\n\n    | Fullstack Engineer 1 | 240 | 45 | $10,800 |\n\n    | Fullstack Engineer 2 | 240 | 45 | $10,800 |\n\n    | Technical Writer | 120 | 30 | $3,600 |\n\nTimeline: 2 months\n\nBudget: $29,100",
                        "stellar.teamMembers": "Andrew Miracle",
                        "stellar.urls": {
                            "website": "https://daccred.notion.site/We-re-building-https-on-the-blockchain-df20b05cb5a04e379a165714aab024fb",
                            "codeRepository": "https://github.com/daccred/attest.so",
                            "videoURL": "https://vimeo.com/1012816221?share=copy"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 55366.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 164158.57,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-29T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:12",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec2Va7FjwZ5EM8y8",
                    "projectId": "daoip5:stellar:project:rust-soroban-client-library",
                    "projectName": "Rust Soroban Client Library",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec2Va7FjwZ5EM8y8",
                    "status": "Awarded",
                    "description": "rs-soroban-client is a Rust library for communicating with a Soroban RPC server and using it on the client side",
                    "fundsApprovedInUSD": 31000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://rust-soroban-client-lib.notion.site/Rust-Soroban-Client-Library-Design-85f89b7adefd4c5c9cb10025de96e951?pvs=4",
                        "stellar.productsAndServices": "Extensive and thorough testing of the Library to push it to production along with creation of documentation with examples for ease of developer adoption.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Adoption: 50+ developers and 5+ projects using the library within 6 months.\n\nEcosystem Impact: Simplified Soroban / Classic Stellar adoption for Rust developers.\n\nStability: 100% test coverage for critical modules and minimal production issues.",
                        "stellar.tractionEvidence": "I have built two rust crates for this library, stellar-baselib and soroban-client\n\nThis is crate link of the stellar-baselib, https://crates.io/crates/stellar-baselib  \nAs you can see it has over 18000+ all time downloads, as of 22nd November 2024  \nThis is the crate link for the soroban-client, https://crates.io/crates/soroban-client\n\nAs you can see it has over 12000+ all time downloads, as of 22nd November 2024\n\nIt does show a clear demand, even though the library is not in production.",
                        "stellar.goToMarketPlan": "1.  Launch\n    \n    -   Announcement on Stellar Discord, Rust communities, GitHub, and Twitter.\n        \n    -   Share clear documentation and examples.  \n        \n1.  Engage\n    \n    -   Actively support users on GitHub and the Project’s Discord.\n        \n    -   Collaborate with Stellar ecosystem projects for visibility.  \n        \n1.  Grow\n    \n    -   Collect feedback, publish tutorials, and encourage contributions.\n        \n    -   Track downloads, GitHub activity, and integrations to measure success.",
                        "stellar.tranche1Deliverables": "#### Deliverable 1\n\nTitle: Production Readiness for Soroban Transactions  \nDescription: Conduct comprehensive unit testing for all Soroban-related modules to ensure reliability, correctness, and production-grade stability. Test integration with Soroban RPC APIs, including any remaining edge cases.  \nCompletion Measure: Provide GitHub links to unit test implementations and coverage reports for each module.  \nEstimated Completion Date: January 31, 2025  \nBudget: $10,000",
                        "stellar.tranche2Testnet": "#### Deliverable 2\n\nTitle: Production Readiness for Classic Transactions  \nDescription: Perform end-to-end testing for Stellar Classic modules to validate compatibility with both Stellar and Soroban environments.  \nCompletion Measure: Provide GitHub links to unit test implementations and coverage reports for each module.  \nEstimated Completion Date: March 31, 2025  \nBudget: $15,000",
                        "stellar.tranche3Mainnet": "#### Deliverable 3\n\nTitle: Documentation and Facilitating User Adoption  \nDescription: Publish production-ready documentation and examples in the Stellar Developer Guides, ensuring ease of use and promoting developer adoption.  \nCompletion Measure: Links to published examples in the Stellar Developer Guides, and establish a feedback loop via GitHub and Discord.  \nEstimated Completion Date: May 31, 2025  \nBudget: $6,000",
                        "stellar.teamMembers": "Rahul Soshte",
                        "stellar.urls": {
                            "website": "https://crates.io/crates/soroban-client",
                            "codeRepository": "https://github.com/rahul-soshte/rs-soroban-client",
                            "videoURL": "https://www.youtube.com/watch?v=8LiDAapD6_Y"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 20666.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 59663.2,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Developer Tooling"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:13",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recP07tayhkLu9ezv",
                    "projectId": "daoip5:stellar:project:almanax",
                    "projectName": "Almanax",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recP07tayhkLu9ezv",
                    "status": "Awarded",
                    "description": "Almanax is building AI agents designed to fix vulnerabilities in blockchain applications and smart contracts before they are deployed on Stellar.",
                    "fundsApprovedInUSD": 95000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docsend.com/view/iwbwrwwu6ar8ecyb",
                        "stellar.productsAndServices": "Almanax will deliver a fully operational \"AI security engineer\" that integrates into CI/CD pipelines and code repositories. This tool will support analysis, security scanning, and remediation of vulnerabilities for any code deployed on-chain or interacting with the Stellar/Soroban network. It will be free to use up to a certain rate limit.\n\nAdditionally, Almanax will integrate Stellar/Soroban data into its Web3 Security Atlas, an open-source repository of security resources and labeled vulnerable code that can be used by developers to evaluate the performance of AI and static analysis tools, as well as to build more secure applications.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Most of the security in web3 today is outsourced to 3rd party vendors, leaving a big gap for internal security tools. We’re filling that gap.  We want to significantly reduce the costs of security from hundreds of thousands of dollars required today, allowing every developer to have bank-grade security.  \n\nAt the same time, we'll shorten the wait times for security reviews from months to seconds, facilitating faster development and deployment of projects.",
                        "stellar.tractionEvidence": "'- We raised 2 rounds of VC investments (single digit millions, the 2nd one not publicly announced yet)\n\n- Got revenues pre-launch\n\n- Built first version of the product\n\n- Achieved state-of-the-art (SOTA) performance on vulnerability detection with our AI model: https://www.almanax.ai/post/almx-1-achieves-sota-performance-in-web3-vulnerability-detection\n\n- Currently running a closed beta with some of the best security researchers and blockchain engineers in the world",
                        "stellar.goToMarketPlan": "We'll have a self-service tool that developers can sign up for and use instantly. Security scans will be free, up to a certain limit. This will allow us to penetrate organizations before we approach them to close an enterprise SaaS deal. We'll also proactively scan code that is already deployed onchain and flag vulnerabilities to the team behind them. This will allow us to also win bug bounties.",
                        "stellar.tranche1Deliverables": "Deliverable 1: Web3 Security Atlas (Data Collection & AI Model Training)\n\nBrief description: \n\n1.  Collect and curate an open-source dataset, including Stellar/Soroban-specific developer documentation, code repositories, audit reports, and various on-chain interaction data. \n    \n1.  This dataset will be used to fine-tune our agentic AI model for comprehensive analysis of all blockchain-related code. \n    \n1.  We will also be releasing an evaluation benchmark dataset on Hugging Face.\n    \n\nHow to measure completion: A robust dataset and a fine-tuned AI model capable of analyzing and securing any Soroban-related code with high accuracy. \n\nEstimated date of completion: January 2024\n\nBudget: $25k\n\n  \n  \n\nDeliverable 2: V1 Development \n\nBrief description: \n\n1.  Develop a web app that can analyze any input code with detailed reporting on vulnerabilities, customizable alerts, and enhanced repository integrations.\n    \n\nHow to measure completion: Web app can successfully analyze Github repositories of Soroban projects. \n\nEstimated date of completion: February 2024\n\nBudget: $25k\n\n  \n  \n\nDeliverable 3: CLI Tool & CI/CD Integration\n\nBrief description: \n\n1.  Develop a Command-Line Interface (CLI) tool that integrates with popular CI/CD pipelines and code repositories (e.g., GitHub, GitLab). \n    \n1.  This tool will enable developers to automatically analyze their code for vulnerabilities and issues during the development process.\n    \n\nHow to measure completion: Functional CLI tool integrated with CI/CD pipelines, enabling automated code analysis\n\nEstimated date of completion: February/March 2024\n\nBudget: $20k",
                        "stellar.tranche2Testnet": "Deliverable 4: Beta Launch – Product Deployment & Initial Integrations\n\nBrief description: \n\n1.  Launch a beta version of the product, allowing select Soroban developers to integrate the CLI into their workflows. \n    \n1.  Conduct initial integrations with major code repositories and CI/CD platforms, and gather feedback to validate functionality and performance.\n    \n\nHow to measure completion: Soroban developers are using the product\n\nEstimated date of completion: March 2024\n\nBudget: 0",
                        "stellar.tranche3Mainnet": "Deliverable 5: Product Launch – Advanced Integrations & Continuous Monitoring\n\nBrief description: \n\n1.  Public launch\n    \n1.  Introduce advanced integrations with platforms like GitHub Actions and GitLab CI, enabling real-time vulnerability monitoring and automated PR creation/remediation suggestions.\n    \n1.  Enhance the AI system to support automated and continuous monitoring of deployed code.\n    \n\nHow to measure completion: Public announcement on social media\n\nEstimated date of completion: April/May 2024\n\nBudget: $25k",
                        "stellar.teamMembers": "Francesco Piccoli",
                        "stellar.urls": {
                            "website": "https://app.almanax.ai/",
                            "codeRepository": "https://github.com/almanax-ai/almanax",
                            "videoURL": "https://www.loom.com/share/87749e1928674f17a7ba6d1bde4276ff?sid=8a11c227-e4d0-41de-969f-ea3fcaa09f84"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/almanax-ai/",
                            "twitter": "https://twitter.com/AlmanaxAI"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 95000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 316714.72,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-06-18T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:14",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recl8E9u3mHSyWh5z",
                    "projectId": "daoip5:stellar:project:soroban-rpc-sdk",
                    "projectName": "Soroban RPC SDK",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recl8E9u3mHSyWh5z",
                    "status": "Awarded",
                    "description": "This is a multiplatform, automatically maintained Soroban SDK and Boilerplate app suite, allowing Smart TV developers, .NET multiplatform native client devs, Unity game developers and potentially many other platforms to quickly start using Stellar.",
                    "fundsApprovedInUSD": 19000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://github.com/FrankSzendzielarz/SorobanRPCSDK",
                        "stellar.productsAndServices": "This is a lightweight SDK that solves all the hurdles we had to deal with getting Stellar integrated with various platforms, including Smart TVs, cross platform native .NET for mobile, Unity for gaming, and basic .NET development using neglected SDKs. It takes a strategic long-term maintenance approach of automating updates where possible, without compromising on allowing the community to extend the project with manual updates.  \n  \nIt also offers the strong possibility of being able to extend the automatically produced SDK output into native binaries for all the major platforms and CPU architectures, by offering gRPC or protobuf specs. If this aspect of the project is successful, then it means this lightweight Soroban SDK can be available permanently for any platform with manual maintenance software development.  \n  \nFurthermore, the toolkit will include working boilerplate apps allowing Smart TV , Mobile and other developers to get up and running with Stellar integrated games and apps with no learning curve.  \n  \nPlease see the project link FrankSzendzielarz/SorobanRPCSDK: A lightweight SDK for cross platform and native consumption of the Stellar Soroban RPC gateway for a detailed description.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "The downside to this is very low. Getting just one mildly successful Smart TV app out there using Stellar would cover the costs of this project. Primarily, this should extend the reach of Soroban and Stellar to more developers, while giving developers the pleasure and experience of building with Stellar.",
                        "stellar.tractionEvidence": "From our point of view the traction evidence is that we actually need this and had to build it ourselves. At least, we have a collection of ad-hoc tools and techniques in our private repo for our main project. By making the SDK available, with boilerplate apps, it can be offered by Stellar as a self-maintaining set of tools to attract various other developers onto the platform.",
                        "stellar.goToMarketPlan": "We would like to have the SDK added to the list of official Stellar SDKs, and handed over to Stellar Foundation for inclusion into their developer materials. We will include the binary SDK in our own parent project.",
                        "stellar.tranche1Deliverables": "Please see the project documentation for detailed explanations of the deliverables. All the deliverables are technical artifacts. Estimated dates of completion are provide in weeks from award confirmation.  \n  \n#### Deliverable 1: A tool to generate source and automate SDK updates  \nBrief Description  \nThis tool or set of tools includes: a custom OpenRPC -> C# class and client generator generating the entities specified need for comms with the Soroban RPC server; a modification to XDRGEN to emit 'partial' C# classes; a main tool that orchestrates the OpenRPC and XDR Generators to produce outputs, modify them further, and emit the code-generated part of the SDK. In addition, as described in 'How to measure completion,' a test suite will need to be produced (though more tests come later in other deliverables).  \n  \nHow to measure completion  \nOpenRPC Soroban RPC specs, XDR specs, and additional metadata generate source that can be included in a simple Console app to communicate with a Soroban RPC instance successfully. This can be determined using the \"examples\" section of the Soroban RPC spec, along with XDR serialisation and deserialisation between the XDR generated classes in the SDK and the strings in the examples.  \n  \nEstimated date of completion  \nT+3 weeks.  \n  \nBudget  \n7000 USD  \n  \n#### Deliverable 2: A .NET lightweight, automatically maintained Soroban RPC SDK - NuGet  \nBrief Description  \nThis adds the various utility methods and classes into the SDK, such as for signing, allowing Soroban authorisation, helpers to get the account balances and other details described in the technical documentation. The test suite will be extended.  \n  \nHow to measure completion  \nClearly defined tests will pass. The output NuGet package will be added to a simple console app demonstrating some basic scenarios, such as Account funding. (The app is extended to become a full artifact in later deliverables).  \n  \nEstimated date of completion  \nT+5 weeks.  \n  \nBudget  \n2000 USD  \n  \n#### Deliverable 3: A build variant specifically for Unity  \nBrief Description  \nIL Weaving will be applied to internalise any dependent assemblies into the main SDK library, while a new build configuration will output a Unity specific DLL. Code generators from Deliverable 1 will be extended to add compile time switches to expose Unity Editor metadata for the Unity build. A simple Unity boilerplate empty game project will be produced that demonstrates some of the intended scenarios such as interacting with a Soroban contract and funding an Account.  \n  \nHow to measure completion  \nThe DLL will be added to a Unity project and simple scenarios demonstrated. Returned entities, such as a Ledger Entry will have friendly metadata when shown in the editor.  \n  \nEstimated date of completion  \nT+7 weeks.  \n  \nBudget  \n2000 USD",
                        "stellar.tranche2Testnet": "Please see the project documentation for detailed explanations of the deliverables. All the deliverables are technical artifacts. Estimated dates of completion are provide in weeks from award confirmation.  \n  \n#### Deliverable 4: Boilerplate Applications  \nBrief Description  \nBoilerplate, skeleton apps for Smart TV, .NET Android , iOS, Windows , Linux (cross platform native), will be produced in full to allow anyone interested in these platforms to simply download the source, compile, run and already be on Stellar. The test app from the Unity deliverable will also be polished. These will all be published as sub projects in the main repo.  \n  \nHow to measure completion  \nAll the apps run demonstrably on Samsung Smart TVs, Android (as a demo), Windows, Linux, and in Unity.  \n  \nEstimated date of completion  \nT+9 weeks.  \n  \nBudget  \n2000 USD  \n  \n#### Deliverable 5: Sample usage console app  \nBrief Description  \nThe console app used in earlier deliverables to test the SDK will be polished and extended to cover various Stellar usage scenarios, as described in the technical doc, and added to the suite of boilerplate apps (in this case emphasising how Stellar is used for either client or server integration), while also being added as a comprehensive black box SDK test tool.  \n  \nHow to measure completion  \nThe app is comprehensive in scope and runs successfully.  \n  \nEstimated date of completion  \nT+10 weeks.  \n  \nBudget  \n2000 USD  \n  \n#### Deliverable 6: Attempted universal SDK  \nBrief Description  \nThis is an attempt at modifying the client generator to add a second interface that would allow users to either supply an HTTP client or some kind of in memory channel (possibly gRPC), adding a protobuf / gRPC spec file so that clients can generate their own classes in their own language, and the build output to generate precompiled optimised native binaries for all common platforms and CPU architectures. Initial research looks promising. If this works, then the SDK becomes even more generally useful as a universal Soroban SDK that is automatically maintained and offers protobuf to interface with it.  \n  \nHow to measure completion  \nEither it is infeasible, has to be deferred, is deemed supefluous by the community, or it works.  \n  \nEstimated date of completion  \nT+11 weeks.  \n  \nBudget  \n2000 USD",
                        "stellar.tranche3Mainnet": "Please see the project documentation for detailed explanations of the deliverables. All the deliverables are technical artifacts. Estimated dates of completion are provide in weeks from award confirmation.  \n  \n#### Deliverable 7: Documentation and mainnet finalisation  \nBrief Description  \nFurther documentation will be added to the project repo clarifying the build process, how to maintain, explaining how to test, and enhancing the boilerplate app guidance. A test contract can be deployed to mainnet if necessary and the test console app run against it.  \n  \nAlso - all licensing for all works will be open source.  \n  \nHow to measure completion  \nDocumentation seems sufficient, readable, and the end to end test app works on a mainnet contract. License on everything is MIT or whatever Stellar Community / Foundation prefers, as long as the SDK outputs or binaries do not mandate that derivative works are open source.  \n  \nEstimated date of completion  \nT+12 weeks.  \n  \nBudget  \n2000 USD",
                        "stellar.teamMembers": "Frank Szendzielarz",
                        "stellar.urls": {
                            "website": "https://github.com/FrankSzendzielarz/SorobanRPCSDK",
                            "codeRepository": "https://github.com/FrankSzendzielarz/SorobanRPCSDK",
                            "videoURL": "https://vimeo.com/1032767665/55f5e634f5"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 19000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 61653.92,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-03T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:15",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/reci3pJoBT0YYPpSF",
                    "projectId": "daoip5:stellar:project:defindex-defi-made-easy",
                    "projectName": "DeFindex: DeFi Made Easy",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reci3pJoBT0YYPpSF",
                    "status": "Awarded",
                    "description": "We’re live on Testnet and now we’ll improve contracts, go live on Mainnet, and provide tools to secure user funds with Keepers",
                    "fundsApprovedInUSD": 50000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1rp6bC7DZ1_66QXD_ub0foOAlE_qOmvpvoKRNpy9cGuI/edit?usp=sharing",
                        "stellar.productsAndServices": "DeFindex helps wallet providers manage DeFi investment vaults by addressing key challenges such as fund security, risk mitigation, and yield optimization. Having launched on Testnet, we now aim to improve our contracts, transition to Mainnet, and leverage Keepers to rescue funds if a strategy becomes unhealthy. Wallet providers will also be able to earn fees from the yield generated on deposited funds.\n\nOur strategies utilize existing DeFi protocols on Soroban, such as auto-compounding with Blend, where USDC is supplied, BLND rewards are swapped for USDC, and reinvested. To enhance these strategies, we will refine our contracts, collaborate with an audit company (funded by the Audit Bank), and prepare for Mainnet deployment.\n\nTo secure user funds, we will develop Keepers using Mercury’s infrastructure, integrating Zephyr Programs for metrics and automation tools for execution. These tools will enable wallet providers to automate fund rescues for risky strategies and gather metrics for informed rebalancing.\n\nAdditionally, we plan to enhance the user experience for creating vaults, ensuring a seamless and intuitive design that simplifies onboarding and platform interaction.\n\nRead more athttps://docs.defindex.io/",
                        "stellar.successCriteria": "Short term: On March 2025 we expect to have at least 2 onboarded wallets with more than 100k TVL in total  \n  \n\nMedium term: On December 2025 we expect to have onboarded at least 5 wallets with at least 1M in TVL. At least 500 retail crypto native users",
                        "stellar.tractionEvidence": "We have developed our first version of DeFindex in almost 500 commits in a very active repo: https://github.com/paltalabs/defindex and we have already deployed a Factory Contract, a Vault Contract and 2 Strategies contracts. You can find their addresses in https://github.com/paltalabs/defindex/blob/main/public/testnet.contracts.json  \n  \nOur protocol has been live on Testnet since November 18th, and we have run 5 meetings with different stakeholders like Beans App, Blend Capital, Soroswap, Orbit CDP, and people from SDF in order to gather insights and get feedback. We also presented DeFindex on Meridian, check the video here: https://youtu.be/FMZr-JQcpG4?t=1104  \n  \nYou can see more stats on views and interaction of our dApp and contracts in this document: https://docs.google.com/document/d/1iQz_UKaygBBvQxx9PISCn_JMko_oJ7YMYaDU7gZuJn8/edit?usp=sharing \n\n  \nYou can see all our deliverables from our previous grant in our SCF Tracker file:  https://github.com/paltalabs/defindex/blob/main/scf-tracker.md",
                        "stellar.goToMarketPlan": "1.  Deploy on Mainnet with 2 safe and audited strategies.\n    \n1.  Onboard 2 wallets (Beans App and Meru) as early adopters. \n    \n1.  Gather feedback from wallets and add new features.\n    \n1.  Leverage success metrics to build trust and onboard more wallets.\n    \n1.  Wallet onboarding through presence in Web3 conferences and B2B marketing.\n    \n1.  Develop advanced strategies for sophisticated users.\n    \n1.  Expand to retail crypto-native users on Soroban with complex strategy vaults.",
                        "stellar.tranche1Deliverables": "We already finished our MVP while developing DeFindex for the Consensus Hackathon 2024. You can check our progress in https://github.com/paltalabs/defindex",
                        "stellar.tranche2Testnet": "We already deployed DeFindex on Testnet. \n\nCheck more info and how to interact with on https://docs.defindex.io/tutorials/01-test-defindex-testnet \n\nCheck the deployed addresses in https://github.com/paltalabs/defindex/blob/main/public/testnet.contracts.json",
                        "stellar.tranche3Mainnet": "1.  [Deliverable 1] Contracts: Bring DeFindex from Testnet beta to Mainnet final version:\n    \n    a.  Run rounds with testers and get their feedback to improve our Vault Contract and Strategy Crate.\n        \n    a.  Move from Total Management Funds fee to Performance Fee, meaning fee is charged on the profits made by the Vault.\n        \n    a.  Improve the 2 strategies we have as MVP in our Testnet Deployment to be ready for Mainnet: 1) Blend USDC Rewards Autocompound, 2) Hodl Stragegy\n        \n    a.  Work closely with an audit company (funded by the AuditBank) to secure our contracts.\n        \n    a.  How to measure completion: Contracts will be audited and published in our repo\n        \n    a.  Estimated date of completion: Mid January 2024\n        \n    a.  Budget: 20k  \n          \n        \n1.  [Deliverable 2] Metrics\n    \n    a.  Brief description: Write Zephyr Programs to get metrics to estimate the profitability and health state of Blend Strategies. Show these metrics on our Dashboard. Provide metrics to Keepers and Bots\n        \n    a.  How to measure completion: Zephyr Contracts will be published on our repo, Dashboard will be available on our frontend\n        \n    a.  Estimated date of completion: Mid February 2024\n        \n    a.  Budget: 10k  \n          \n        \n1.  [Deliverable 3] Rescue funds Keeper:\n    \n    a.  Brief description: Creation of predetermined Keepers that monitor the health of strategies and can trigger a rescue fund transaction on Soroban to secure funds of end users.\n        \n    a.  How to measure completion: Managers will be able to fork our project, set up the keeper and run a keeper easily\n        \n    a.  Estimated date of completion: early March \n        \n    a.  Budget: 15k  \n          \n        \n1.  [Deliverable 3] UX improvement:\n    \n    a.  Brief description: Hire agency to improve design. Implement design\n        \n    a.  How to measure completion: Dashboard looks good, with all the needed functionality\n        \n    a.  Estimated date of completion: end of March\n        \n    a.  Budget: 5k",
                        "stellar.teamMembers": "Francisco, Esteban Felipe Iglesias Manríquez, Joaquin Soza Guerra",
                        "stellar.urls": {
                            "website": "https://communityfund.stellar.org/dashboard/projects/recrVM1I6sT7UGSC2",
                            "codeRepository": "https://github.com/paltalabs/defindex",
                            "videoURL": "https://youtu.be/FQ8pIUJ0V4A",
                            "pitchDeck": "https://docs.google.com/presentation/d/1OmubddhfH36PPEG8Su5c0cFP08d6P0gkXBuORNbv93o/edit?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/defindex_"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 33333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 102105.14,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Financial Protocols"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:16",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec6VkAae8WVHS0XA",
                    "projectId": "daoip5:stellar:project:eascrow",
                    "projectName": "Eascrow",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec6VkAae8WVHS0XA",
                    "status": "Awarded",
                    "description": "Eascrow is a web3 escrow platform powered by Stellar smart contracts, ensuring secure and transparent online transactions. It simplifies cross-border payments and builds trust for freelancers, businesses, and individuals.",
                    "fundsApprovedInUSD": 99050.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://github.com/Eascrow/Eascrow/blob/main/ARCHITECTURE.md",
                        "stellar.productsAndServices": "#### What Eascrow Is:\n\nEascrow is an innovative web3 escrow service that harnesses the power of Stellar smart contracts to streamline and secure online transactions. It acts as a trusted intermediary, ensuring that funds are safely held and released according to the terms agreed upon by the involved parties. This service is essential for various financial dealings, ranging from material goods trade to freelance services.\n\n  \n\n#### The Problem: \n\nTraditional online transactions often face challenges like fraud, disputes over contract terms, and inefficiencies in fund transfer, especially in international settings. These issues erode trust and complicate the transaction process.\n\n  \n\n#### Solutions by Audience:\n\n-   For Individuals and Businesses in Material Goods Trade: Eascrow reduces fraud risk by securely holding funds until confirmation of goods' delivery and satisfaction is received. This streamlines the transaction process, providing assurance to both buyers and sellers.\n    \n-   For Freelancers and Employers: It ensures secure and streamlined payment for services, holding funds until the completion of agreed work. This simplifies the payment process and offers peace of mind to both parties.\n    \n-   For International Transactions: Eascrow simplifies and secures cross-border transactions using Stellar smart contracts. It streamlines compliance with international regulations, handling complexities like currency exchange and legal requirements.\n    \n\n  \n\n#### Benefits of Eascrow:\n\n-   Enhanced Security: Significantly reduces the risk of fraud and default in transactions.\n    \n-   Streamlined Process: Simplifies and accelerates the transaction process, from initiation to fund release.\n    \n-   Transparency and Trust: Stellar smart contracts provide a clear, immutable record of terms, fostering trust among parties.\n    \n-   Ease of Use: User-friendly for all parties involved, regardless of their technical know-how.\n    \n\n-  \n\n####   \nHow It Works and Its Use of Stellar:\n\nEascrow leverages Stellar to automate and streamline the escrow process through smart contracts. These contracts clearly define the terms of transactions and hold funds securely until conditions are met. The use of Stellar ensures a transparent, immutable, and efficient process, making complex financial transactions secure and user-friendly. This integration not only enhances security but also significantly speeds up the entire transaction lifecycle, making Eascrow an ideal solution for a wide range of online financial interactions.\n\nFor more in-depth information about Eascrow's technical architecture and how it utilizes Stellar to streamline transactions, please refer to the accompanying architecture document.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "1. Adoption Rate\n\n-   **Number of Active Users and Businesses on Eascrow:  \n    Success will be defined by reaching 50 active users and businesses** using Eascrow within the first six months after launch. These users will include freelancers, businesses, and individuals utilizing the escrow service for secure transactions.  \n    Impact: Increased adoption will demonstrate the demand for trustless escrow services on Stellar, ensuring greater financial security for users and driving more transactions on the blockchain.\n    \n-   **Monthly Growth Rate in New Users:  \n    We aim for a 10% monthly growth rate** in new users adopting Eascrow. This growth will be driven by targeted marketing campaigns, partnerships, and word-of-mouth referrals.  \n    Impact: Steady growth in users will validate the need for decentralized escrow services and encourage broader use of Stellar’s blockchain for secure financial transactions.\n    \n\n2. Transaction Volume and Activity\n\n-   **Total Escrow Transactions:  \n    Our goal is to reach 500 completed escrow transactions** within the first year of launch. Each transaction represents a successful interaction secured by the Eascrow platform, whether between freelancers, businesses, or individuals.  \n    Impact: High transaction volume will indicate growing trust in the platform, and by processing payments efficiently, Eascrow will reinforce Stellar’s position as a reliable blockchain for cross-border and trustless financial interactions.\n    \n-   **Total Funds Secured through Eascrow:  \n    We aim to secure over $500,000 in transaction value** processed through the platform within the first 12 months.  \n    Impact: This reflects the platform’s ability to handle high-value contracts and further boosts the Stellar network’s credibility for handling secure financial services.\n    \n\n3. Developer Engagement and Platform Integration\n\n-   **API Call Volume:  \n    We expect to reach 2,500 monthly API calls** by the end of the first year, which will track how often developers and businesses interact with Eascrow’s smart contracts to manage escrow transactions.  \n    Impact: High API usage will demonstrate strong developer engagement and seamless integration of Eascrow into various applications, driving further adoption of Stellar infrastructure for decentralized financial services.\n    \n-   **Stellar Ecosystem Integration:  \n    We plan to secure 3 partnerships** with other Stellar-based platforms, allowing them to integrate Eascrow as their default escrow solution. These partners may include decentralized marketplaces, NFT platforms, and other businesses requiring trustless payments.  \n    Impact: Strategic partnerships will extend the reach of Eascrow within the Stellar ecosystem and drive its integration into various sectors, reinforcing the blockchain’s utility for diverse financial use cases.\n    \n\n4. Customer and Community Engagement\n\n-   **User Satisfaction Rate:  \n    We will conduct user surveys to measure satisfaction, aiming for a 75% satisfaction rate** from businesses and freelancers using Eascrow. Feedback from these surveys will be used to improve the user experience, platform reliability, and customer support.  \n    Impact: High satisfaction rates will reflect Eascrow’s ability to meet the needs of its users, ensuring trust and encouraging long-term loyalty to the platform.\n    \n-   **Community Participation:  \n    We aim to build an active community of at least 150 participants** on platforms like Stellar’s Discord, GitHub, and other social channels within the first six months.  \n    Impact: Strong community participation will foster collaboration, innovation, and feedback, driving continuous improvement of Eascrow and increasing its visibility within the Stellar ecosystem.\n    \n\n5. Broader Ecosystem Impact\n\n-   **Financial Inclusion and Access:  \n    Success will also be defined by the ability of Eascrow to provide accessible escrow services to users in emerging markets, where trust and access to secure financial services are limited. Our goal is to onboard at least 20% of users from underbanked regions**.  \n    Impact: Eascrow’s use on Stellar will contribute to expanding financial inclusion by offering low-cost, secure transaction services to users in regions with limited traditional banking infrastructure.\n    \n-   **Contributions to Stellar's Transaction Volume:  \n    We expect to contribute to Stellar’s overall transaction volume by adding 5% more escrow-based transactions** to the network within our first year, driving both usage and awareness of Stellar’s capabilities.  \n    Impact: This will enhance the Stellar blockchain’s reputation as a hub for decentralized financial services, attracting more projects and users to the ecosystem.",
                        "stellar.tractionEvidence": "While Eascrow is still in the early stages of development, we have already conducted several validation activities that demonstrate strong interest and potential adoption of our platform within the Stellar ecosystem and beyond.\n\n1) User Surveys\n\nIn March 2024, we conducted a survey among 500 freelancers and small businesses across Europe and Latin America. The results indicated that 68% of respondents were dissatisfied with their current payment options for cross-border transactions, citing high fees (average of 7% per transaction) and long processing times (2-5 business days). Additionally, 75% expressed interest in an escrow service that guarantees security and faster payments using blockchain technology.\n\n2) User Interviews and Feedback\n\nWe conducted over 30 in-depth interviews with freelancers, small business owners, and crypto users. These interviews highlighted a consistent demand for more transparent and secure transaction methods. Key pain points included fear of non-payment or service delivery failures in freelance agreements, particularly in emerging markets. Over 80% of interviewees mentioned that they would be willing to try a blockchain-based escrow service if it could address these issues. This feedback directly aligns with the core functionality that Eascrow offers, providing both sides of a transaction with increased security and trust.\n\n3) Initial Interest from Ecosystem Projects\n\nWe have also reached out to several projects within the Stellar ecosystem, including decentralized marketplaces and digital payment platforms. Two projects expressed interest in potentially integrating Eascrow’s services to enhance transaction security for their users. While these are preliminary discussions, they indicate a strong alignment between Eascrow’s offerings and the needs of other ecosystem players.\n\nThese early traction points demonstrate that there is significant market demand for a secure, blockchain-based escrow service, particularly for freelancers and businesses dealing with cross-border transactions. As we move towards the beta launch, we expect to solidify these initial interests and convert them into active platform users. Moreover, as soon as the Eascrow initial development is done, we will build our first Eascrow native product: Linqt, the first web3 freelance marketplace on Stellar.",
                        "stellar.goToMarketPlan": "Our go-to-market strategy for Eascrow on the Stellar blockchain focuses on driving adoption among freelancers, ecosystem applications, and daily crypto users. The strategy leverages Stellar’s fast and low-cost transactions to make escrow services more accessible and seamless for diverse user groups, from B2B freelancers to everyday crypto users. By creating a flexible and secure escrow system, we aim to simplify and streamline payment processes on the Stellar network.\n\n#### Freelancers - B2B\n\n**Target Audience:  \n**Freelancers, small agencies, and businesses operating in the crypto gig economy, particularly those offering remote services across borders, need a secure, trustless payment solution.\n\n**Partnership with Freelancing Platforms:  \n**We aim to partner with existing freelancing platforms and business service marketplaces to integrate Eascrow, allowing freelancers to receive payments in Stellar-based coins or other crypto assets. This enables fast and affordable cross-border payments, removing the friction associated with traditional banking methods.\n\nKey Initiatives:\n\n-   Integration Consulting: We will offer support for freelancing platforms to integrate Eascrow using Stellar’s APIs, providing technical assistance and guidance for smooth onboarding.\n    \n-   Escrow Automation for Gig Work: Sharing the dApp for freelancers to easily create escrow agreements for recurring tasks, allowing them to get paid securely.\n    \n\n#### Ecosystem Applications - B2B\n\n**Target Audience:  \n**Developers, startups, and enterprises within the Stellar ecosystem that seek to integrate secure and automated escrow services into their dApps or blockchain-based services.\n\n**Partnerships within Stellar Ecosystem:  \n**We will actively partner with Stellar-based applications that require escrow services, including decentralized marketplaces and DeFi projects. These platforms will benefit from a native escrow service that enhances trust between users during transactions, mitigating risks and ensuring fairness.\n\n**Custom Escrow Solutions for B2B:  \n**Offer customizable escrow services for enterprise applications such as customized dApp design. These businesses can leverage the security and automation features of Stellar smart contracts for more complex, multi-stage transactions.\n\nKey Initiatives:\n\n-   API Integration and Development Support: Provide detailed documentation, SDKs, and personalized technical support for Stellar ecosystem developers to easily integrate Eascrow services into their platforms.\n    \n-   Collaborative Use Cases and Marketing: Highlight successful use cases with ecosystem applications through co-branded marketing efforts, case studies to inspire other businesses to adopt Eascrow.\n    \n\n#### Daily Crypto Users - B2C\n\n**Target Audience:  \n**Individuals who regularly engage in crypto transactions, from those trading digital assets to users making cross-border payments or purchasing services with crypto.\n\n**User-Friendly Escrow for Peer-to-Peer Transactions:  \n**For everyday crypto users, we will offer a simple, easy-to-use escrow solution that protects both parties during peer-to-peer transactions, whether buying goods or transferring assets. By utilizing Stellar’s low-cost and fast transaction processing, Eascrow makes crypto-based transactions more secure without the need for a middleman.\n\n**Growth in Emerging Markets:  \n**With Stellar’s strong presence in emerging markets, we will target users in regions with high remittance volumes and limited access to traditional banking systems. By offering crypto users a secure way to transact through escrow, Eascrow will play a vital role in financial inclusion.\n\nKey Initiatives:\n\n-   **Integration with Stellar Popular Wallets and DApps:  \n    **We will integrate Eascrow with major wallets like Albedo, Freighter, Hana, making it easy for users to secure their P2P transactions directly within their preferred wallets.\n    \n-   **Escrow for Marketplaces and Social Platforms:  \n    **We will partner with decentralized marketplaces and social platforms, offering Eascrow as a secure payment option, ensuring funds are only released once goods or services are delivered to satisfaction.\n    \n\nMarketing and Branding\n\n**Social Media Presence:  \n**We will establish a strong social media presence on LinkedIn to engage with the freelancer, developer, and crypto communities. Our content will focus on how Eascrow can streamline transactions, enhance security, and reduce payment friction for businesses and individuals alike.\n\n**Educational Content and Webinars:  \n**Develop educational resources such as blog posts and tutorials to demonstrate how Eascrow works and its benefits for different use cases. We will create specific content tailored to freelancers, B2B applications, and individual crypto users.\n\nBy addressing the specific needs of freelancers, businesses, and everyday crypto users, Eascrow on Stellar aims to revolutionize escrow services with fast, secure, and low-cost blockchain solutions.",
                        "stellar.tranche1Deliverables": "I) Steps for our MVP : ✅\n\nDeliverables List\n\n1) Smart Contract Framework Development✅\n\n-   Description: Develop a comprehensive smart contract framework for Eascrow. This framework forms the backbone of the escrow service, handling transaction initiation, management, dispute resolution, and secure fund distribution.\n    \n-   Completion Measurement: A fully developed and documented smart contract framework, ready for deployment and integration.\n    \n\n2) Front-End Development of Eascrow Platform✅\n\n-   Description: Design and develop the front-end of the Eascrow platform. This includes creating a user-friendly interface that allows users to easily manage their escrow transactions, view transaction history, and access customer support.\n    \n-   Completion Measurement: A fully functional and tested front-end interface that delivers a seamless and intuitive user experience.\n    \n\n3) Integration of Smart Contracts with the Front-End✅\n\n-   Description: Seamlessly integrate the developed smart contract framework (backend) with the front-end platform. This milestone focuses on ensuring smooth interaction between the user interface and the underlying blockchain infrastructure.\n    \n-   Completion Measurement: A fully integrated system where front-end actions are effectively executed and recorded on the blockchain through the smart contracts.\n    \n    Eascrow dApp Presentation : https://www.youtube.com/watch?v=tSACsGed1SU",
                        "stellar.tranche2Testnet": "#### II) Steps for our TestNet : $50850\n\nDecember 2024 to March 2025\n\n  \n\nDeliverables List\n\n  \n\n1) Update our Graphic Chart \n\nCreate a professional-grade graphic charter for Eascrow to establish a cohesive and recognizable visual identity. This includes:\n\n-   Designing a new logo and branding elements.\n    \n-   Developing a consistent color palette and typography.\n    \n-   Transitioning from a light theme to a dark theme across all platform interfaces.\n    \n-   Updating all existing graphical assets to align with the new visual identity.\n    \n-   Documenting the graphic standards in a comprehensive guide for future reference.\n    \n\nCompletion Measurement:\n\n-   A complete graphic charter document finalized and approved by the team.\n    \n-   All platform interfaces updated with the new dark theme and visual elements.\n    \n-   Consistency checks confirming that all branding materials adhere to the new guidelines.\n    \n-   Positive feedback from a user focus group evaluating the new design.\n    \n\nEstimated Completion Date: January 2, 2025\n\nBudget: $9,900\n\n  \n\n2) Internal Smart Contract Testing and Debugging \n\n  \n\nDevelop the core functionalities of the Eascrow smart contracts and conduct thorough internal testing and debugging. This includes:\n\n-   Implementing all essential smart contract features for escrow services, such as fund holding, conditional fund release, and dispute resolution mechanisms.\n    \n-   Conducting unit tests for individual contract functions.\n    \n-   Performing integration tests to ensure contracts work seamlessly with each other.\n    \n-   Identifying and fixing bugs or vulnerabilities in the contract code.\n    \n-   Documenting the smart contract architecture and code for transparency and future maintenance.\n    \n\nCompletion Measurement:\n\n-   Smart contracts are fully functional with all core features implemented.\n    \n-   All unit and integration tests pass successfully with high code coverage.\n    \n-   A comprehensive test report documenting test cases, results, and bug fixes.\n    \n-   Internal security review completed with no critical vulnerabilities detected.\n    \n-   Smart contract code and documentation are finalized and ready for deployment.\n    \n\nEstimated Completion Date: February 15, 2025\n\nBudget: $20,950\n\n  \n\n3) Website Development and Debugging\n\nDesign and develop the Eascrow website to provide users with access to the decentralized application (dApp) and information about the platform. This includes:\n\n-   Creating engaging web content, including images, 3D elements, and informative text.\n    \n-   Developing the front-end interface with a focus on user experience and accessibility.\n    \n-   Ensuring responsive design for compatibility with various devices (desktop, tablet, mobile).\n    \n-   Implementing navigation flows for key functionalities like account creation, transaction management, and support.\n    \n-   Conducting thorough testing and debugging to optimize performance and eliminate issues.\n    \n\nCompletion Measurement:\n\n-   Website is fully operational with all planned pages and functionalities implemented.\n    \n-   Content is professionally crafted, accurate, and aligns with the new graphic charter.\n    \n-   Website passes usability testing with positive feedback from test users.\n    \n-   Performance metrics meet targets (e.g., fast load times, smooth interactions).\n    \n-   All identified bugs are fixed, and the website is ready for public access.\n    \n\nEstimated Completion Date: March 30, 2025\n\nBudget: $20,000",
                        "stellar.tranche3Mainnet": "#### III) Launch on MainNet : $48250\n\nApril 2025 to March 2025\n\nDeliverables List\n\n1) Website Deployment\n\nDeploy the final version of the Eascrow website to the live production environment. This includes:\n\n-   Setting up secure hosting solutions and configuring servers.\n    \n-   Configuring DNS settings to point domain names to the hosting servers.\n    \n-   Implementing SSL certificates to ensure encrypted connections.\n    \n-   Testing the live environment to ensure all functionalities are working as intended.\n    \n-   Establishing monitoring tools to track website performance and uptime.\n    \n\nCompletion Measurement:\n\n-   Website is live and accessible to the public at the official domain.\n    \n-   All front-end functionalities operate seamlessly without errors.\n    \n-   Security measures are in place, verified by SSL certification and security testing.\n    \n-   Monitoring systems are active, and baseline performance metrics are recorded.\n    \n-   Successful completion of a soft launch with initial users accessing the website.\n    \n\nEstimated Completion Date: April 14, 2025\n\nBudget: $16,500\n\n  \n\n2) dApp Deployment with Core Functions\n\nDescription:\n\nDeploy the Eascrow decentralized application (dApp) with all core functionalities to the Stellar MainNet. This phase includes:\n\n-   Ensuring smart contracts are audited (via the audit bank) and ready for MainNet deployment.\n    \n-   Configuring the dApp to interact with the MainNet smart contracts.\n    \n-   Implementing wallet integrations for user transactions (e.g., support for popular Stellar wallets).\n    \n-   Conducting final tests to ensure all features like transaction management and escrow creation work correctly in the live environment.\n    \n-   Preparing documentation and guides for users on how to use the dApp.\n    \n\nCompletion Measurement:\n\n-   The dApp is fully deployed and accessible through the Eascrow website.\n    \n-   Users can successfully create and manage escrow transactions on the Stellar MainNet.\n    \n-   All core functions perform reliably under real-world conditions.\n    \n-   User onboarding processes are smooth, and support materials are available.\n    \n-   Positive initial user feedback and successful completion of real transactions.\n    \n\nEstimated Completion Date: April 28, 2025\n\nBudget: $19,500\n\n  \n\n3) Final Debugging of Website and dApp\n\nConduct thorough testing and debugging of the live website and dApp to resolve any remaining issues and optimize performance. This includes:\n\n-   Monitoring for bugs or errors reported by users or detected through monitoring tools.\n    \n-   Addressing performance bottlenecks and optimizing code where necessary.\n    \n-   Ensuring cross-browser and cross-device compatibility.\n    \n-   Enhancing security measures based on any new threats or vulnerabilities identified.\n    \n-   Finalizing all user support systems, including FAQs, helpdesk, and feedback mechanisms.\n    \n\nCompletion Measurement:\n\n-   All critical and high-priority bugs are fixed.\n    \n-   Performance metrics meet or exceed predefined standards (e.g., transaction processing times, page load speeds).\n    \n-   Security audits confirm no outstanding vulnerabilities.\n    \n-   User support systems are fully operational and effective.\n    \n-   User satisfaction rates improve based on feedback surveys.\n    \n\nEstimated Completion Date: May 14, 2025\n\nBudget: $12,250",
                        "stellar.teamMembers": "Antoine Lieber, Antoine Lieber",
                        "stellar.urls": {
                            "website": "https://eascrow.xyz/",
                            "codeRepository": "https://github.com/Eascrow/Eascrow",
                            "videoURL": "https://www.youtube.com/watch?v=-xsAB5kt510&ab_channel=Matt%C3%A9oAntoni"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 66033.34,
                                "denomination": "USD"
                            },
                            {
                                "amount": 195641.18,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Financial Protocols"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-32:grantApplication:17",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-32",
                    "grantPoolName": "scf-32",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recLWYP6Y352hsjEb",
                    "projectId": "daoip5:stellar:project:hermes",
                    "projectName": "Hermes",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recLWYP6Y352hsjEb",
                    "status": "Awarded",
                    "description": "Hermes is a decentralized perpetual exchange allowing traders to engage in leverage trading on Stellar.",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://torpid-key-899.notion.site/Hermes-Technical-Architecture-1487113072db8077acd5dba15e2566c0",
                        "stellar.productsAndServices": "Hermes aims to revolutionize trading on Stellar by offering leverage trading, advanced derivatives, and liquidity provision. This initiative fills a critical gap in Stellar's ecosystem, which excels in payments and tokenized assets but lacks advanced trading infrastructure. Perpetual exchanges are among the fastest-growing DeFi sectors, with platforms like GMX and Hyperliquid achieving billions in trading volume, demonstrating high user demand. Hermes leverages Stellar’s fast, low-cost transactions to provide seamless trading experiences, attracting both institutional and retail users. Its roadmap includes multi-token pools, advanced trading features like stop-loss and take-profit orders, and decentralized governance through a DAO. By onboarding traders from other networks and incentivizing liquidity providers, Hermes is poised to drive transaction volume, enhance Stellar's competitive edge in DeFi, and expand its ecosystem beyond remittances to include sophisticated financial applications.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Hermes’ success depends on achieving high liquidity and trading volume. Large liquidity pools will ensure tight spreads and low slippage, attracting traders and market makers. High volume will drive platform revenue and create a cycle of increased adoption and liquidity. Community engagement will be critical, with active DAO participation for governance and decision-making. Financial success will be measured by metrics like total value locked (TVL) and trading volume, while a clean audit record and ongoing user feedback will ensure platform trust and growth.",
                        "stellar.tractionEvidence": "1. Industry Demand:  \n\n   Perpetual exchanges are one of the fastest-growing sectors in decentralized finance (DeFi), with leading platforms like Jupiter, Hyperliquid, and GMX achieving billions in trading volume. This validates the widespread demand for decentralized derivatives trading. By bringing perpetuals to Stellar, we can tap into an established market while addressing gaps in Stellar's current ecosystem.\n\n  \n\n2. User Interest:  \n\n   The popularity of perpetual exchanges lies in their ability to offer leverage trading, hedge risks, and access diverse assets—all of which attract a broad spectrum of traders. Integrating a perpetual exchange on Stellar provides an opportunity to onboard users from traditional perpetual platforms and expand Stellar's user base into a lucrative market segment.\n\n  \n\n3. On-Chain Metrics from Leading Platforms:  \n\n   - Platforms like Hyperliquid and Jupiter consistently process over $1 billion in daily trading volume.\n\n   - HyperLiquid and the top perpetual exchange have proven that decentralized perpetuals can achieve deep liquidity, attracting both institutional and retail users.  \n\n   - To see the stats more in depth check out: https://defillama.com/protocols/Derivatives\n\n  \n\n4. Current Gap on Stellar:  \n\n   Stellar currently excels in payments and tokenized assets but lacks advanced trading infrastructures for leverage trading and other advanced derivatives. Adding this feature could fill a key gap, increasing Stellar’s competitiveness and expanding its appeal beyond remittances to DeFi-native users.\n\n  \n\nJustification for Meeting SCF Build Award Criteria\n\n  \n\n- Traction in the Market: The proven success of perpetual exchanges in the broader DeFi market highlights their scalability and user appeal. Introducing this functionality to Stellar could open new doors for user acquisition and ecosystem growth.\n\n- Validation: The success of competitors validates the model, and bringing perpetual exchanges to Stellar offers a unique value proposition: leveraging Stellar's fast, low-cost transactions to make perpetuals more accessible and efficient.",
                        "stellar.goToMarketPlan": "The go-to-market strategy for Hermes focuses on targeting cryptocurrency traders from other network users seeking advanced trading features. Pre-launch efforts will include building anticipation through social media campaigns, blog posts, and Stellar-focused community engagement such as AMAs and webinars. Partnerships with Stellar-based projects, like OrbitCDP, will help expand visibility and reach.\n\n  \n\nThe launch strategy begins with an incentivized testnet trading competition to onboard early adopters and refine features based on real-world usage. The mainnet launch will be accompanied by press releases, partner announcements, and Stellar community events to maximize visibility. Post-launch, Hermes will focus on user acquisition through liquidity incentives, referral programs, and educational resources, making the platform accessible to both experienced traders and newcomers. Continuous engagement will be driven by regular updates, trading competitions, and governance activities to maintain user interest and participation.",
                        "stellar.tranche1Deliverables": "-   The current version of Hermes was initially developed during two hackathons, HackMeridian and Dev.to, as a proof of concept for the platform's vision. While it demonstrates the fundamental functionality, it lacks several critical features and remains relatively centralized due to the time constraints of hackathon development. The codebase is publicly available, providing a starting point for further iteration. To transition Hermes into a fully operational MVP, we plan to:\n    \n    -   Implement support for multiple positions to allow users more flexibility in their trading strategies.\n        \n    -   Add functionality to support multiple tokens within pools and the ability to create multiple pools, enhancing the platform's scalability and token interoperability.\n        \n    -   Refactor and fix specific function calls and parameters to ensure smooth execution of all key operations.\n        \n-   The MVP will be considered complete when the following milestones are achieved:\n    \n    -   Feature Validation: Successfully supporting multiple positions and multiple token types in pools across several live test cases. Multiple pools functioning concurrently without errors, with seamless interaction for users.\n        \n    -   Decentralization Progress: Demonstrable steps toward decentralization, such as integrating more Stellar-based smart contracts and reducing reliance on centralized elements.\n        \n    -   User Feedback: Positive feedback from early testers regarding usability and feature completeness, supported by specific indicators like transaction success rates and pool participation.\n        \n-   3 Months Competition Time\n    \n-   $80,000",
                        "stellar.tranche2Testnet": "'-   The testnet launch of Hermes will focus on ensuring robust functionality and user engagement. We will deploy the updated platform to the Stellar testnet, where users can participate in incentivized testing through events like a trading competition. This competition will encourage users to interact with key features such as multiple token pools, limit orders, take profit/stop loss (TP/SL), and liquidation functionalities. To facilitate advanced trading features, a dedicated bot powered by Mercury will handle liquidation processes and order execution. The trading competition will run for a set period (e.g., X days), with prizes awarded to top participants. This approach not only fosters user testing but also helps identify areas for improvement based on real-world usage.\n    \n-   The MVP will be considered complete when the following milestones are achieved:\n    \n    -   Deployment Validation: Successful deployment of the Hermes platform to the Stellar testnet with all planned features operational.\n        \n    -   Bot Functionality: Mercury-powered bots executing liquidation, TP/SL, and limit orders without errors during testnet operations.\n        \n    -   Feedback Collection: Gathering and analyzing user feedback to identify and address bugs or usability issues.\n        \n    -   Feature Stability: Stable performance of all core functionalities under varied test conditions, ensuring readiness for mainnet launch.\n        \n-   2 Months Completion TIme\n    \n-   $50,000",
                        "stellar.tranche3Mainnet": "'-   The mainnet launch of Hermes will represent a significant milestone, transitioning from testnet to a fully operational and audited platform. Prior to deployment, we will conduct a comprehensive audit to identify and resolve any vulnerabilities or inefficiencies in the codebase. Once the audited version is finalized and all identified issues are addressed, the platform will be deployed to the Stellar mainnet. A key addition for the mainnet version will be the implementation of a DAO (Decentralized Autonomous Organization) to manage pool governance, ensuring decentralized decision-making and community-driven growth.\n    \n-   The MVP will be considered complete when the following milestones are achieved:\n    \n    -   Audit Completion: A comprehensive third-party audit conducted, with all identified vulnerabilities resolved and the final report available for transparency.\n        \n    -   Successful Deployment: The Hermes platform deployed to the Stellar mainnet without critical errors or downtime.\n        \n    -   DAO Implementation: A functional DAO integrated to govern pool operations, with users actively participating in governance decisions.\n        \n    -   Performance Stability: Stable performance under mainnet conditions, with features like pool creation, token trading, and limit/TP/SL orders functioning seamlessly.\n        \n    -   User Adoption: Measurable user activity on the mainnet, including metrics like daily active users, transaction volumes, and pool participation rates.\n        \n    -   Community Feedback: Positive community feedback and engagement through governance and feature use, signaling readiness for scaling and further feature development.\n        \n-   1 Month Completion Time\n    \n-   $20,000",
                        "stellar.teamMembers": "Ishan Singh, Robin Olthuis",
                        "stellar.urls": {
                            "website": "https://github.com/orbit-cdp/hermes",
                            "codeRepository": "https://github.com/orbit-cdp/hermes",
                            "videoURL": "https://youtu.be/iwNZfpFsBT0"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/NotIshanSingh/status/1846615709465387199"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 120326.98,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-01-08T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                }
            ]
        }
    ]
}