{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar",
    "type": "Foundation",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf-27",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:1",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recBZAaKA8fjdstQa",
                    "projectId": "daoip5:stellar:project:kript",
                    "projectName": "Kript -Crypto checkouts",
                    "createdAt": "2024-06-06T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recBZAaKA8fjdstQa",
                    "fundsApproved": [
                        {
                            "amount": 328949.84,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 35000,
                    "description": "Kript is crypto payments API infrastructure for merchants and businesses",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Kript is a crypto infrastructure that allows merchants and businesses to accept payments using crypto checkouts, access crypto swaps, onramp, and offramps.\n\nProblems that Kript solves:\n\n1. Merchant Payments: Kript allows merchants to generate payment checkout links that enable customers to pay using Stellar USDC, XLM. When a customer makes a payment using the checkout link, Kript automatically converts the received cryptocurrency (e.g., BTC or non-stable coins) into Stellar USDC, ensuring price stability for the merchant. Merchants can also receive payment directly in Stellar USDC via payment links. The merchant can then choose to keep the funds in Stellar USDC or seamlessly offramp them directly to their local bank account, reducing the risk of volatility and enabling quick access to fiat currency. This use case simplifies the payment process for merchants, expands their customer base to include cryptocurrency users, and reduces the costs and delays associated with traditional payment methods.\n\n2. Remittances: Kript allows users to send cross-border payments using Stellar USDC or XLM, enabling fast and low-cost remittances. Senders can onramp their local fiat currency into Stellar USDC, specify the recipient's details, and initiate the remittance transaction. Kript handles the conversion of Stellar USDC to the recipient's local currency and offramps the funds directly to their bank account. By using Stellar's blockchain, Kript bypasses the intermediaries and high fees associated with traditional remittance services, making the process faster, cheaper, and more accessible to people. This use case is particularly beneficial for migrant workers, expatriates, and businesses with international operations, as it streamlines the remittance process and reduces costs.\n\nBenefits:\n1. Financial Inclusion: Kript promotes financial inclusion by enabling businesses to accept payments from customers who may not have access to traditional banking services.\n2. Lower Transaction Costs: Stellar's low transaction fees can help businesses save on costs associated with traditional payment methods, especially for cross-border transactions.\n3. Faster Settlement: Stellar's fast transaction speeds allow for quicker settlement of payments, benefiting both businesses and their customers.",
                        "stellar.teamMembers": "Ayomide Lasaki",
                        "stellar.urls": {
                            "website": "https://kriptup.io",
                            "videoURL": "https://youtu.be/Wl6DHQgxzYo?si=0vLKbAMCD5L7E4LH"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 35000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 328949.84,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-06T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:2",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recBM684vOLrr3TnL",
                    "projectId": "daoip5:stellar:project:plutope-merchant-app",
                    "projectName": "Plutope Merchant App",
                    "createdAt": "2024-06-06T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recBM684vOLrr3TnL",
                    "fundsApproved": [
                        {
                            "amount": 313912.14,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 33400,
                    "description": "Get paid for everything in crypto as easy as fiat",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "PlutoPe is a revolutionary merchant payment solution designed to bridge the gap between cryptocurrency and traditional fiat currency. It empowers merchants to seamlessly integrate crypto payments into everyday operations, unlocking a broader customer base. It's a comprehensive merchant solution designed to streamline crypto acceptance and empower businesses to thrive in the evolving digital landscape. Here's a breakdown of its key components:\n\nMulti-Chain Crypto Wallet: PlutoPe gives business owners a flexible wallet that supports many cryptocurrencies, thereby offering multiple payment options. PlutoPe also integrates multiple blockchains, allowing users to manage and access different digital assets across different blockchains within the PlutoPe wallet itself.\n\nInstant Fiat Settlements: Once a merchant gets paid in crypto, PlutoPe effortlessly converts cryptocurrency into the merchant's preferred fiat currency (such as USD, INR, EUR, etc.). As a result, the merchant receives instant access to revenue and simplified accounting, as these funds are put straight into their bank account.\n\nSEPA (Single Euro Payments Area) Integration (for European Merchants): PlutoPe leverages SEP-6, a standardized protocol within the Stellar ecosystem for European merchants. This enables smooth deposits and withdrawals between the merchant's PlutoPe account and their external bank accounts, streamlining financial operations.\n\nUser-Friendly Interface: PlutoPe prioritizes simplicity of use. A user-friendly interface allows merchants to manage their cryptocurrency wallet balances in many currencies. They can also check the complete transaction history for record-keeping and access current conversion rates to make informed choices.\n\nDapp (Decentralized Application) Integration: PlutoPe plans to include a Dapp (decentralized application) within its merchant app. Further features offered by this Dapp might include advanced analytics for a more in-depth understanding of consumer behavior and spending trends, and combining rewards programs with cryptocurrency to encourage usage.\n\nProblem Solving: Explain the problems your product addresses, how it resolves them, and the benefits for your target audience, including personas. The traditional payment landscape presents several challenges for merchants:\n\nTraditional payment systems are costly as they require payment infrastructure, such as POS machines and payment gateways, which all come at a charge or monthly fee that not everyone can afford.\n\nMerchants lose over 3-5% of revenue during the settlement of funds.\n\nThe setup of traditional payments is time-consuming and requires documentation and paperwork from banks.\n\nMerchants in traditional payment systems face many limitations. They cannot accept international payments, limiting them to a domestic customer base.\n\nMerging traditional payment gateways into crypto is challenging; hence, a new solution is required.\n\nTo accept international payments, merchants need to pay settlement fees.\n\nPlutoPe addresses these challenges by offering:\n\nReduced Operational Costs: Removing specialized crypto infrastructure requirements saves businesses time and money.\n\nMerchants save over 3-5% of the settlement fee banks charge.\n\nSetting up a crypto payments gateway with PlutoPe is neither time-consuming nor expensive. Merchants can accept a variety of cryptocurrencies through our user-friendly multi-chain wallet, eliminating the need for separate integrations for each blockchain.\n\nWith PlutoPe, there isn't any limitation in accepting international payments. Since cryptocurrencies are global, a user can pay in the crypto of their choice, and the merchant can settle that amount instantly in their preferred fiat currency. The amount will be deposited directly into their bank account. This eliminates the risk associated with crypto price fluctuations and simplifies accounting processes.\n\nPlutoPe Merchant app is the ground-breaking solution that will provide a gateway to bridge traditional finance and decentralized finance.\n\nWith the PlutoPe merchant app, the merchant does not need to pay any settlement fees on international payment settlements.\n\nOperational Mechanism: PlutoPe makes use of Stellar blockchain technology's innovative functions:\n\nFast and Scalable Transactions: Stellar's distributed ledger facilitates rapid and efficient processing of crypto payments, even during high transaction volumes.\n\nLow Transaction Fees: Stellar's network architecture enables minimal fees compared to traditional payment methods, benefiting merchants and customers.\n\nEnhanced Security: Stellar's robust security protocols ensure the safe and transparent transfer of crypto funds.\n\nIntegration with Anchor Protocol: Integrating PlutoPe with the Anchor protocol is essential to its operation. Anchor, which serves as a bridge between cryptocurrencies and fiat money, makes the fiat settlements fast, a fundamental component of PlutoPe's product.\n\nSeamless User Experience: PlutoPe provides merchants with a user-friendly interface for managing their crypto wallets, tracking transaction history, and accessing real-time conversion rates.",
                        "stellar.teamMembers": "Kumar Chetan Tyagi, kchetantyagi",
                        "stellar.urls": {
                            "website": "https://www.plutope.io/",
                            "videoURL": "https://www.loom.com/share/9697106ae34a45538435b2501ae5ce14?sid=c6906dcd-808b-4952-999b-3d475ff34075"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/plutope/",
                            "twitter": "https://x.com/Plutopeio"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 33400.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 313912.14,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-06T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:3",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recClpF9C92a0bLMd",
                    "projectId": "daoip5:stellar:project:nauta-land",
                    "projectName": "NAUTA (P2P) SECONDARY MARKET",
                    "createdAt": "2024-05-31T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recClpF9C92a0bLMd",
                    "fundsApproved": [
                        {
                            "amount": 378845.28,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 40000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:4",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recCLcdUOLt2AvNHe",
                    "projectId": "daoip5:stellar:project:orally-network",
                    "projectName": "Orally Network",
                    "createdAt": "2024-05-24T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recCLcdUOLt2AvNHe",
                    "fundsApproved": [
                        {
                            "amount": 437446.12,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 48000,
                    "description": "On-chainoracleswithcross-chaincapabilities.Pushandpullmodels withunlimited price feedsandcustom data feeds.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Orally Network is an on-chain oracle system with advanced cross-chain capabilities designed to serve as a reliable data conduit between blockchains and the external world. The system features a modular architecture that allows developers to customize it according to their specific needs, enhancing flexibility and functionality.\n\nOrally Network addresses key challenges in blockchain data accessibility, particularly the difficulty in securely and efficiently fetching external data for smart contracts. Our solution specifically targets blockchain developers and projects that require real-time data integration from various sources. By providing verified and secure data feeds, Orally Network facilitates enhanced decision-making processes, supports complex financial applications, and enables dynamic cross-chain interactions.\n\nSybil - Data Fetching Module:\nFunctionality: Sybil operates dynamically, fetching data as requested. It supports a range of data sources for price feeds, implementing filters and an aggregation mechanism to ensure data integrity and accuracy.\nCustomization: Developers can create and list custom data feeds, choosing sources and defining the parameters for data retrieval.\nSecurity and Verification: Utilizes DKG threshold cryptography for generating verifiable proofs, ensuring that data fetched and signed by our smart contract is authenticated across networks.\nExample Use Case: Fetching complex price feed pairs like BTC/DOT or DOGE/SHIB, and providing side chain data for cross-chain governance, swaps, and bridges.\nIntegration and Accessibility: Includes an HTTP Gateway for direct connection and verification, enhancing ease of use as a pull oracle model. Examples and documentation are available at Orally Network Solidity SDK.\n\nPythia - Automation Module:\nFunctionality: It enables developers to set up subscriptions that trigger transactions based on defined conditions, such as time intervals or price volatility, detected through Sybil. It could be utilized as a push oracle model.\nFlexibility: Allows for the specification of the destination chain, contract address, and method for the transaction, facilitating tailored automation workflows.\n\nApollo - Request-Based Data Delivery Module:\nFunctionality: Allows data requests directly from smart contracts on the destination chain, monitoring specific chain events and executing transactions with the requested data.\nIntegration: Tracks and responds to data requests, ensuring timely and accurate data delivery to requesting contracts.\n\nUtilization of Stellar and Soroban:\nIntegration Plans: As part of our commitment to expanding our network's compatibility and reach, we are planning to integrate Orally Network with Soroban. This will allow us to bring our established oracle mechanics to the Stellar ecosystem, providing Stellar users with access to external and cross-chain data feeds.\nBenefits for Stellar: This integration not only enhances the functionality available on the Stellar network but also opens up new possibilities for smart contract development and inter-chain communication within the Stellar ecosystem.",
                        "stellar.teamMembers": "Ihor Verkhohliad",
                        "stellar.urls": {
                            "website": "https://orally.network",
                            "codeRepository": "https://github.com/orally-network",
                            "videoURL": "https://youtu.be/1vyjpcNhw5k?si=nbK3SDet2XbhOggk / https://youtu.be/n8tmhYKRE74?si=Z3vgRlrWDD6W9vJD"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/orally_network"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 48000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 437446.12,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-24T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:5",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recCOibVGJQ9sVgan",
                    "projectId": "daoip5:stellar:project:js-worker-sdk",
                    "projectName": "JS Worker SDK",
                    "createdAt": "2024-06-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recCOibVGJQ9sVgan",
                    "fundsApproved": [
                        {
                            "amount": 348786.92,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 35000,
                    "description": "The JS Worker SDK is a modern simple JavaScript SDK with a light &lt;10kB footprint that gives easy access to all Stellar APIs.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "The existing Stellar Javascript SDK is powerful and complete, however it is also very NodeJS-centric, adds 291kB of download weight to a browser-based application, and lacks perfect compatibility with modern JavaScript backends such as Cloudflare Workers, Deno, and WinterJS.\n\nThe JS Worker SDK solves all three issues with a very lightweight SDK built on modern standards, with no dependencies for most usage. Its module lazy-loading design means that reading the Horizon API can be done with a 3.5kB browser download weight and the use of only pure browser standards allows for drop-in compatibility for Cloudflare Workers, Deno, and WinterJS (which runs on Wasmer Edge).\n\nSome quick examples of usage for the Horizon API module:\n\n// include the SDK with a connection to the test network\nimport { horizon } from './horizon.js?network=test'\n\n// grab a single page of 10 transaction records as an array\nconst setOfTenTransactions = await horizon.get.transactions()\n\n// start listing out all transactions with automatic pagination\nfor await (const t of horizon.stream.transactions()) console.log(t)\n\n// start an EventSource based listener to fire an event when new transactions are posted\nconst { listener: transactions } = await horizon.listen.transactions()\ntransactions.addEventListener('message', event => console.log(event.data))\n\n// submit a transaction\nconst secretKey = 'S...', transaction = { ... }\nconst { response } = await horizon.submit(transaction, secretKey)\n\nJavaScript is arguably the most important language to have a modern SDK available for, as it is uniquely able to address both front and back end integrations. Front-end integrations especially require the option of a lightweight SDK for simpler use cases, as well as having unavoidable performance concerns which can deeply inform the choice of SDKs and tools. The JS Worker SDK solves this problem, creating one lightweight, universally compatible, and performant SDK for JavaScript applications.\n\nThe JS Worker SDK is architected from first-principle with strict web standards compliance, and is optimized for maximum performance and minimum footprint. A companion SimpleXDR library has been created to power the XDR parsing and serialization aspects of submitting transactions to Stellar.",
                        "stellar.teamMembers": "drpitman, drpitman",
                        "stellar.urls": {
                            "website": "https://github.com/Cloudouble/stellar-js-worker-sdk",
                            "codeRepository": "https://github.com/Cloudouble/stellar-js-worker-sdk",
                            "videoURL": "https://www.youtube.com/watch?v=28_VTNMFL4Q"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 35000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 348786.92,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:6",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recE9g5g3dHHxuMjq",
                    "projectId": "daoip5:stellar:project:raumfi-dex-by-raum-network",
                    "projectName": "RaumFi DEX by Raum Network",
                    "createdAt": "2024-05-30T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recE9g5g3dHHxuMjq",
                    "fundsApproved": [
                        {
                            "amount": 469627.32,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "RaumFi DEXempowers seamless token swap through an AMM while offering insights and metrics via uniquely designed dashboard.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "RaumFi DEX will launch with essential features common to many decentralized exchanges (DEXs), including token swaps, liquidity provisioning, creation of xy=k pools, and liquidity provider rewards. This initial deployment marks \"Phase 1\" of RaumFi DEX. Our design is guided by the distinct needs of traders and liquidity providers. Traders prioritize low fees, minimal slippage, rapid execution, and a selection of popular assets, while liquidity providers seek stable returns, reduced impermanent loss, and ease of managing liquidity, including auto-compounding options. By leveraging Soroban’s rapid transaction finality and 150 TPS, our DEX offers users a seamless, high-speed experience. The architecture of our automated market maker (AMM) is adaptable and robust, supporting everything from simple token swaps to sophisticated trade routing. The Factory Contract enables the creation of new pools and their deregistration, allowing us to swiftly adjust to market changes. This architecture effectively addresses typical DeFi challenges and ensures scalability and interoperability with Soroban.\n\nFor users, RaumFi DEX provides several advantages: Efficient Token Swaps: Users can easily and securely exchange tokens without relying on intermediaries, reducing costs and enhancing liquidity. Tier System for RN and XLM Token Holders: Holders of RN and XLM Tokens gain access to perks such as lower trading fees, exclusive features, and governance participation, promoting long-term investment. Integrated Dashboard: This comprehensive tool offers users in-depth insights and metrics on DEX activity, as well as data on popular Stellar blockchain assets and their valuations. Access to a Holistic DeFi Ecosystem: RaumFi DEX offers a broad range of DeFi services within one platform, streamlining the user experience and encouraging adoption.\n\nIn sum, RaumFi DEX transforms the DeFi landscape with its all-encompassing approach, addressing users' key concerns while harnessing Soroban's advanced features.",
                        "stellar.teamMembers": "Zypher Shaw, toraraum",
                        "stellar.urls": {
                            "website": "https://stellar.dex.raumfi.tech",
                            "codeRepository": "https://github.com/Raum-Network",
                            "videoURL": "https://www.loom.com/share/7a73d18bc9094ca6b5c53dbcdab58580?sid=47963ecd-7684-4d87-a28a-8533d280eb46"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/RaumFi"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 469627.32,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-30T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:7",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recHJGfP4QX8paLWp",
                    "projectId": "daoip5:stellar:project:rehoboth-finance",
                    "projectName": "Rehoboth Finance",
                    "createdAt": "2024-05-24T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recHJGfP4QX8paLWp",
                    "fundsApproved": [
                        {
                            "amount": 212343.64,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 23300,
                    "description": "Crypto savings wallet for Africans",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Rehoboth is a crypto wallet that gives users the ability to earn yield in a secure, safe, and transparent manner. One of the biggest problems facing some African currency devaluation due to economic factors and crypto is one of the leading ways for people to hedge against the high rate of inflation. This is why Rehoboth is on a mission to curb economic waste and shield users against high inflation rates.\n\nOur shared goal with SDF is to provide people with equitable access to the global financial system through savings products that help them generate yield while they go about their daily business. Are we the only ones doing this? Of course not. That is why we believe we will be such a phenomenal success as others who have walked this path have. We have a very good founder-market fit and will prove that as we go in this application to show we have the data and skill set to solve this problem. Another major thing we have looked at is that people who hold crypto don’t actually like to spend it. Data has shown and proven that we are in fact in the heart of the biggest crypto mine in the world, Nigeria. Nigeria has beaten every country in high volumes of crypto trades and you can easily tell why. Everyone wants to invest. Most people really don’t care about buying stuff for clout right now as they can sense the urgent need to save. Finally, a major constraint comes around being able to use a crypto wallet seed phrase and not lose your money. There is an issue with writing down your private key and being able to operate a non-custodial wallet. This is why we’re opting for a 3-key Multi-sig wallet where users have their funds but we can help them sign transactions and in the case of losing their keys, we can recover their funds and move them to a new account.\n\nProblems Rehoboth Solves\n\n1. High Inflation and Economic Uncertainty: Problem: African currencies are prone to devaluation due to economic factors, leading to high inflation rates. This poses a significant challenge for individuals seeking financial stability. Solution: Rehoboth provides a crypto wallet that allows users to earn yield in a secure, safe, and transparent manner. By leveraging crypto assets, users can hedge against currency devaluation and inflation, thus safeguarding their wealth.\n\n2. Limited Access to Financial Services: Problem: Many people in Africa lack access to traditional financial services, limiting their ability to save and invest effectively. Solution: Rehoboth aims to provide equitable access to the global financial system through savings products that help users generate yield. By offering these services, Rehoboth empowers individuals to build wealth and achieve financial security.\n\n3. Hesitancy to Spend Crypto: Problem: Despite the growing popularity of crypto in Africa, many people are reluctant to spend it, preferring to hold onto their assets for investment purposes. Solution: Rehoboth addresses this issue by offering a platform that combines both payment and investment functionalities. By providing opportunities to earn yield on crypto holdings, Rehoboth incentivizes users to save and invest while still offering the ability to make payments when needed.\n\n4. Security Concerns with Non-Custodial Wallets: Problem: Users often face challenges in securely managing their crypto assets, particularly when it comes to safeguarding private keys and seed phrases. Solution: Rehoboth implements a three-key multi-signature wallet system, providing users with enhanced security and peace of mind. In the event of lost keys, Rehoboth can assist in recovering funds and ensuring uninterrupted access to assets. By addressing these problems, Rehoboth aims to provide a comprehensive solution that promotes financial inclusion, stability, and security for users in Africa and beyond.\n\nHow are we integrating with Stellar?\n\n1. Payment Processing and Asset Management: Rehoboth will leverage Stellar's blockchain technology to facilitate payment processing and asset management within its platform. This integration allows users to conduct transactions seamlessly and securely, benefiting from Stellar's fast and low-cost transaction capabilities. Rehoboth will interact directly with Stellar's blockchain to process payments between users, manage crypto assets such as yUSDC and yXLM, and ensure the integrity of transactions. This integration streamlines the payment process, enhances user experience, and ensures transparency and security in asset management.\n\n2. Yield Generation and Investment Opportunities: Rehoboth aims to utilize Stellar's blockchain for yield generation and investment opportunities, enabling users to earn passive income on their crypto holdings. Through integration with Stellar-based platforms like Ultra Capital, Rehoboth users can acquire crypto assets such as yUSDC and yXLM to generate yield. This integration provides users with additional earning potential while contributing to the overall growth and sustainability of the Rehoboth ecosystem. By integrating with Stellar in these ways, Rehoboth enhances its platform's functionality, offers users access to a wider range of financial services, and contributes to the development of a more inclusive and prosperous financial ecosystem in Africa and beyond.\n\nHow Stellar Works with Rehoboth\n\nBlockchain-based Transactions: Stellar serves as the underlying blockchain technology for processing transactions within the Rehoboth platform. Users can seamlessly send and receive payments, convert between different assets, and manage their digital wallets using Stellar's blockchain. Rehoboth leverages Stellar's fast and low-cost transaction capabilities to ensure quick and affordable transfers of value for its users. This integration enhances the efficiency and accessibility of financial transactions within the platform.\n\nAsset Issuance and Management: Rehoboth utilizes Stellar's asset issuance capabilities to create and manage digital assets within its ecosystem. This includes stablecoins like yUSDC and yXLM, which users can hold, transfer, and trade on the Stellar network. By issuing assets on Stellar, Rehoboth provides users with access to a diverse range of financial instruments, enabling them to diversify their portfolios and manage risk effectively.\n\nYield Generation: Rehoboth harnesses Stellar's robust ecosystem to empower users to generate their own yield by swapping their base tokens for Stellar yield assets offered by ultracapital.xyz. Through strategic integration with platforms like Ultra Capital, Rehoboth enables users to participate in staking activities on the Stellar network, earning rewards and additional income. By leveraging Stellar's blockchain technology, Rehoboth ensures secure, efficient, and inclusive financial services for users in Africa and beyond. This integration enhances the financial sustainability of the platform, incentivizing users to engage in staking activities and facilitating passive income generation on their crypto holdings. Overall, Stellar plays a pivotal role in driving financial inclusion and empowerment worldwide, as Rehoboth leverages its functionality, scalability, and accessibility to offer innovative investment opportunities and yield-generating services to users globally.\n\nHow are users getting access to Forex?\n\nStablecoins as Forex: Reasons and Benefits\n\nStablecoins are gaining traction as an alternative to traditional methods for forex transactions, offering several advantages: Reasons for using stablecoins in forex:\n\nUnlike traditional currencies, stablecoins are pegged to assets like fiat currencies or baskets of other currencies. This significantly reduces their price fluctuations, making them more predictable and less risky for forex transactions.\n\nStablecoins leverage blockchain technology, enabling faster and often cheaper cross-border transactions compared to traditional systems. This is due to the elimination of intermediaries and faster settlement times.\n\nUnlike traditional forex markets, stablecoin markets operate 24/7, allowing for greater flexibility and convenience for users.\n\nBlockchain technology provides transparent and secure transactions, reducing the risk of fraud and manipulation.\n\nStablecoins offer the potential for financial inclusion by providing access to financial services for individuals without traditional bank accounts.\n\nSteps involved in accessing stablecoins on Rehoboth:\n\nThe user creates an account and moves to verify their identity (KYC/AML) by making their first deposit.\n\nThe user chooses the desired “stablecoins” to purchase within the Rehoboth platform.\n\nRehoboth allows users to select their preferred payment method (e.g., bank transfer, mobile money).\n\nThe user initiates the purchase with the chosen payment method and the transaction is processed.\n\nRehoboth users can also convert deposited fiat currency to the selected stablecoin at competitive rates.\n\nPurchased “stablecoins” are credited to the user's Rehoboth account, ready for business transactions.\n\nWhat tokens do we support?\n\nFor now, we are only supporting tokens on Stellar Network but we hope to add new chains as we go. Here is the list:\n\nUSDC XLM BTC ETH\n\nHow will the savings feature work?\n\n1. User Enrollment: Users opt-in to the savings feature within the Rehoboth platform. They can choose to allocate a portion of their crypto holdings for savings, allowing Rehoboth to use these funds for yield generation activities.\n\n2. Asset Allocation: Once enrolled, users can specify the assets they want to allocate for savings. These assets may include stablecoins like yUSDC or yXLM, which are suitable for generating yield through staking or other investment mechanisms.\n\n3. Yield Generation Mechanisms: Rehoboth utilizes the staking of assets on Ultra Capital, participating in liquidity pools, or engaging in other yield-generating activities within the Stellar ecosystem. By leveraging these mechanisms, Rehoboth aims to maximize the yield potential of users' savings while minimizing associated risks.\n\n4. Accrual of Rewards: As Rehoboth earns rewards through yield generation activities, the accrued rewards are credited to users' savings accounts on a regular basis. Users can track the growth of their savings and monitor the rewards earned over time.\n\n5. Flexible Withdrawal Options: Users have the flexibility to withdraw their savings at any time, allowing them to access their funds whenever needed. Rehoboth ensures seamless withdrawal processes, enabling users to transfer their savings back to their primary wallets or use them for other purposes.\n\n6. Transparent Reporting and Monitoring: Rehoboth provides users with transparent reporting and monitoring tools to track the performance of their savings accounts. Users can view detailed transaction histories, track accrued rewards, and monitor the overall growth of their savings portfolio within the platform. Overall, the savings feature in Rehoboth offers users a convenient and secure way to earn passive income on their crypto holdings while maintaining control over their assets. By integrating with yield generation mechanisms and providing flexible withdrawal options, Rehoboth empowers users to achieve their financial goals and build wealth over time.\n\nHow will this improve the Stellar community?\n\nCommunities: Rehoboth is a community-serving product that places the power of savings in the hands of the community and will empower African communities who will in turn, empower Stellar with more adoption. We intend to host meet-ups which will help the users gain more events.\n\nCollaboration: Rehoboth will also help and connect with startups building interesting products and can be the number one place to get fintech help in Africa for Stellar communities as we hope to work with as many willing and promising ideas in the coming years as we know this multiplies the effect of what we’re doing than going alone. Of course, you know the popular saying that says something like “if you’re going far, go with people”.\n\nCommitment to education: Rehoboth will be committed to educating people generally on blockchain technology even through its platform through newsletters and is willing to partner with Stellar to organize hackathons.",
                        "stellar.teamMembers": "Lucky Nweke",
                        "stellar.urls": {
                            "website": "https://rehobothfinance.com",
                            "codeRepository": "https://github.com/Rehoboth-Finance",
                            "videoURL": "https://youtu.be/atOVIaD7vUk"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 23300.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 212343.64,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-24T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:8",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recb03CISF3JCSdeW",
                    "projectId": "daoip5:stellar:project:institutional-treasury-xlm",
                    "projectName": "Institutional Treasury - XLM",
                    "createdAt": "2024-07-09T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recb03CISF3JCSdeW",
                    "fundsApproved": [
                        {
                            "amount": 366438.79,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 32000,
                    "description": "Integration of Stellar blockchain into existing Digital Asset PLatform (DAPL)to reduce adoption barrier for institutional clients",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Please provide the content from \"xxx\" so I can assist you with streamlining the format.",
                        "stellar.teamMembers": "Nicholas Allen",
                        "stellar.urls": {
                            "website": "xxx",
                            "codeRepository": "xxx",
                            "pitchDeck": "https://docsend.com/view/5w7izijdcuc3m9fp"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/arrel-technology/"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 32000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 366438.79,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-09T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:9",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recd8I7PUKkkPIO6d",
                    "projectId": "daoip5:stellar:project:grantpicks-by-potlock",
                    "projectName": "GrantPicks by PotLock",
                    "createdAt": "2024-06-11T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recd8I7PUKkkPIO6d",
                    "fundsApproved": [
                        {
                            "amount": 514731.62,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "GrantPicks by Potlock is a Soroban-enabled funding platform using pairwise voting to easily allocate grants to Stellar projects.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "PotLock is an open-source public goods funding infrastructure. We build tools that enable anyone to fund anything and track impact across different blockchains. Our build on Stellar is GrantPicks, a mobile responsive application that uses pairwise voting to reduce the cognitive overload of allocating funding to projects. This enables grantmakers to allocate funding distributed across projects and community members to vote, allowing for a more decentralized funding program. We will integrate an on-chain project directory, and round factory contract to allow anyone to run their own permissionless budget boxing application.\n\nProblem: Growing an ecosystem is hard. Allocating capital and keeping track of project image is hard. There is no way to support projects on Stellar directly.\n\nOur goals: Bring more transparency and streamline project tracking on chain. Bring external capital into the Stellar ecosystem. Supplement community fund delegation. Reduce cognitive overload for grant and community members. Continue to build out new funding mechanisms on top of Sorbon.\n\nCurrently, there is no on-chain application for communities to support public goods on Stellar built on Soroban directly. We will change this with our vaulting mechanisms, which delegate funds via Pairwise + Budget Boxing algorithms. This enables anyone to create their own funding round. Projects to enlist in an on-chain project registry and apply to rounds. Anyone to fund ongoing rounds. Quick voting rounds to delegate and allocate funding.\n\nAs part of this ask: $50,000 for development. Cover audit costs for vaults (audit bank). $150,000 USD worth of XLM to put in vaults to run a series of 3 $50,000 rounds after the next SCF round. Marketing & onboarding of Stellar ecosystem onto GrantPicks (verified community voters and projects).\n\nMore details: https://potlock.org/grantpicks-stellar-architecture",
                        "stellar.teamMembers": "Shot Khan",
                        "stellar.urls": {
                            "website": "https://potlock.org -> soon https://stellar.grantpicks.com",
                            "codeRepository": "https://github.com/PotLock/grantpicks-stellar",
                            "videoURL": "https://potlock.org/stellar-pitch-video"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 514731.62,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-11T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:10",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recgndGyFwfROKd6B",
                    "projectId": "daoip5:stellar:project:soroban-polygon-interop",
                    "projectName": "Soroban  Polygon - Interop",
                    "createdAt": "2024-06-04T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recgndGyFwfROKd6B",
                    "fundsApproved": [
                        {
                            "amount": 405140.47,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 42755,
                    "description": "Crosschain asset transfers between Soroban and Polygon, leveraging the Enterprise Ethereum Alliance DLT Interoperability spec.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "The product: A solution designed for crosschain asset transfers, facilitating the exchange and management of digital assets between the Stellar and Polygon networks. It leverages the Soroban smart contracts and interoperability standards set by the Enterprise Ethereum Alliance to ensure seamless communication and transactions across different blockchain networks.\n\nWhat problems it solves, how it solves them, and what audience it solves them for (explain the benefits): Interoperability is a primary concern of financial institutions and regulators interested in DLT-based financial innovations. The Enterprise Ethereum Alliance (EEA) Distributed Ledger Technology Interoperability Specification is an open specification aiming to establish a secure and efficient framework for interoperability between different blockchain networks, focusing on enterprise applications. This specification addresses the need for various blockchain platforms to interact and transact seamlessly in regulated sectors like financial services. It is designed to support enterprise blockchain networks using diverse underlying technologies (for example EVM and non-EVM networks), facilitating complex multi-chain ecosystem deployments involving assets, payments, and securities transactions. Enhancing the interoperability of the Stellar network with other blockchain ecosystems, such as Polygon in a way that is compliant with the EEA specification, broadens the scope, utility and relevance of Stellar-based assets and applications for enterprises, financial institutions and regulators looking for and prioritizing standard-compliant implementations. Exploring EEA-compliant interoperability between Stellar and the Ethereum ecosystem can further enhance trust among various Stellar’ stakeholders including financial institutions, users, partners and regulators as well as demonstrating a commitment to address those stakeholders’ needs. It would also support collaboration between ecosystems.\n\nMost importantly, how it works and how it uses Stellar and/or Soroban: The solution will deliver a Stellar-Polygon Asset Bridge and a PoC for a Stellar Cross-Chain Atomic Swaps capabilities. It leverages Wanchain Message Bridge (WMB) framework and the EEA DLT Interoperability specification. Soroban is used for its advanced smart contract capabilities, providing the infrastructure for creating and executing contracts that manage and transfer digital assets securely. To know more about how it works and how it uses Stellar and Soroban, please refer to the technical architecture document for further details.",
                        "stellar.teamMembers": "Anais Ofranc",
                        "stellar.urls": {
                            "website": "https://entethalliance.github.io/crosschain-interoperability/draft_dlt-interop_techspec.html",
                            "codeRepository": "We will leverage Wanchain code for crosschain communication : https://github.com/wanchain/message-bridge-contracts",
                            "videoURL": "https://www.youtube.com/watch?v=iOJ0yjaIQus"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 42755.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 405140.47,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-04T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:11",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reckierHxbkwUbx3s",
                    "projectId": "daoip5:stellar:project:scout",
                    "projectName": "Scout - BugFighter for Soroban",
                    "createdAt": "2024-06-05T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reckierHxbkwUbx3s",
                    "fundsApproved": [
                        {
                            "amount": 843926.96,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 90000,
                    "description": "To enhance the usability of Scout and raise awareness about the product and the security issues it tackles, aiding Soroban devs.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "In November 2023, Scout started its journey in the Stellar ecosystem with the award of a grant from SCF. The goal was to start building Scout for Soroban, a static analysis tool, based on the existing Scout for ink!. Two months later, we delivered a prototype of the tool, which included a CLI, a set of detectors for common vulnerabilities and enhancements, and a VS Code extension to integrate Scout into the development workspace. In February 2024, we were awarded a second community award to continue developing Scout. In this opportunity, our main focus was testing the tool against actual Soroban projects to analyze its results, measure its accuracy and work on improvements. We worked along our senior auditors, who helped us fine-tune detectors to reduce false-positive and false-negative results, as well as in the identification of new detectors. Furthermore, we implemented new features, such as different output formats and a GitHub action to include Scout into the CI/CD pipeline and automatically run the tool on code commits. Scout is ready and available. Yet, it needs to be proven useful. Now we need to engage the Soroban developer community to learn about Scout’s capabilities, as well as making them key contributors of Scout continuous improvement. We want to showcase the tool, have it used, and incorporate the learnings into a version that meets the community's needs.",
                        "stellar.teamMembers": "Valeria Caracciolo",
                        "stellar.urls": {
                            "website": "https://coinfabrik.github.io/scout-soroban/docs/intro",
                            "codeRepository": "https://github.com/CoinFabrik/scout-soroban",
                            "videoURL": "https://drive.google.com/file/d/17jRIbeRQiLcoYiGXLiAT6E4Bti-8_zLi/view?usp=drive_link"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://ar.linkedin.com/company/coinfabrik",
                            "twitter": "https://twitter.com/coinfabrik"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 90000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 843926.96,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-05T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:12",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reclhILl81OAe3spU",
                    "projectId": "daoip5:stellar:project:soroban-timelock-contract",
                    "projectName": "Soroban Timelock Contract",
                    "createdAt": "2024-07-09T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reclhILl81OAe3spU",
                    "fundsApproved": [
                        {
                            "amount": 274829.09,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 24000,
                    "description": "Develop a standard timelock contract that can be leveraged by Soroban protocol developers to increase user trust",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "In a governance system, the TimelockController contract is in charge of introducing a delay between a proposal and its execution. It is a powerful tool for enabling secure and controlled transaction scheduling in the blockchain space. Protocols that have decentralized governance implement timelocks into their contract functions to prevent contract admins/owners from maliciously making contract changes without prior notice. Approved proposals also use a timelock so that users have sufficient time to prepare for contract changes.\n\nThe TimelockController is usually paired with role-based access controls (RBAC) such that only certain types of users may invoke specific functions within the contract. An AccessControl contract allows the specification and CRUD of one or more roles.\n\nOpenZeppelin has created the canonical timelock functionality for Solidity and EVM applications. We aim to do the same for Soroban applications. The main functions of the Soroban timelock contract are to enable the scheduling and execution of one or more transactions, specify a minimum time span (tdelay) between the initial scheduling (tschedule) and the execution of the function (texecution), as well as set the roles of proposer, executor, canceller. texecution - tschedule >= tdelay.\n\nIt's important to note here that we cannot simply translate the Solidity OpenZeppelin timelock contracts into Rust/Soroban. Because Soroban has a different set of logic governing the maximum size of a contract, we have found in our research and development that many complex functions will fail, as maximum contract sizes are limited and external contract calls look to be expensive relative to how things operate for EVM execution.\n\nOnce we have created this timelock contract, we will work with the Stellar foundation to help spread awareness and get adoption from developers so that this can be a core contract build block going forward.",
                        "stellar.teamMembers": "Kevin Wang",
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 24000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 274829.09,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-09T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:13",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recn8gHxphN9KtVXj",
                    "projectId": "daoip5:stellar:project:aquarius",
                    "projectName": "Aquarius Soroban Yield Bridge",
                    "createdAt": "2024-06-03T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recn8gHxphN9KtVXj",
                    "fundsApproved": [
                        {
                            "amount": 469905.38,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Aquarius yield assets: bridging Stellar and Ethereum with Soroban, to offer secure, and decentralized yield opportunities.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Aquarius is introducing a new suite of decentralized, yield-generating assets anchored to Ethereum-based tokens. These assets include ETH, stETH (anchored to Lido’s stETH) and AAVE’s aUSDC, aUSDT, and aWBTC, each designed to bridge Stellar with the Ethereum ecosystem.\n\nProblems Addressed & Solutions Provided:\n\nLimited Access to Yield-Generating Opportunities: Solution: By introducing assets like stETH and aUSDC, Aquarius offers Stellar users exposure to Ethereum's DeFi yields directly on the Stellar network. This expands financial opportunities for users who can now earn yields from Ethereum protocols without leaving the Stellar ecosystem.\n\nComplexity in Handling Crypto Assets Across Blockchains: Solution: The assets act as bridges, simplifying the complex process of moving funds between Stellar and Ethereum. Users can now interact with Ethereum-based yield protocols while enjoying the low fees and fast transaction speeds of Stellar.\n\nHigh Custodial Risks: Solution: Shifting from a classic custodial model on Stellar to decentralized assets on Soroban reduces the regulatory and security risks associated with handling user funds directly.\n\nReal-Time Yield Updates: Solution: Through the integration of a rebase mechanism and oracle updates, users will see their balances update in real-time directly within their wallets, mirroring the yield accruals seen on Ethereum.\n\nAudience & Benefits:\n\nCrypto Enthusiasts and DeFi Investors: Users seeking passive income through crypto assets can now access diverse yield options without managing multiple wallets or navigating complex cross-chain transfers.\n\nStellar Community: Enhancing the utility and appeal of the Stellar network by integrating it more deeply with the broader DeFi ecosystem, which may attract more users and developers to Stellar.\n\nFunctionality and Integration with Stellar/Soroban:\n\nMinting and Burning Mechanisms: Utilizing Soroban smart contracts, Aquarius will automate the minting and burning of anchored assets. For example, when users deposit native stETH for stETH on Stellar, the corresponding stETH tokens are minted through a smart contract and vice versa for burning.\n\nOracle Integration for Yield Updates and Rebase Mechanism: Integrate with Ethereum’s rebase mechanisms via an oracle (like Reflector) to monitor and verify updates in the yield generated on Ethereum-based assets like stETH and aUSDC. This ensures that Stellar assets are updated in real-time to reflect changes in their Ethereum counterparts. Oracle data is secured by a decentralized network of trusted nodes, ensuring that yield updates are both accurate and tamper-proof.\n\nDecentralized Financial Operations: The assets will participate in yield-generating activities by interacting with established Ethereum protocols like Lido for staking and Aave for lending. Soroban's capabilities allow these interactions to be programmed into the smart contracts, ensuring transparency and security.\n\nInteroperability Facilitation: By creating a seamless link between Stellar and Ethereum, these assets enable fluidity of capital across the ecosystems, reducing barriers for users who wish to leverage opportunities across both platforms.",
                        "stellar.teamMembers": "Jason Cudmore",
                        "stellar.urls": {
                            "website": "https://aqua.network/",
                            "codeRepository": "https://github.com/AquaToken",
                            "videoURL": "https://www.youtube.com/watch?v=RMtEKc106pw"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://twitter.com/aqua_token",
                            "discord": "https://discord.gg/sgzFscHp4C"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 469905.38,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-03T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:14",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recrYzhVM2zgQ76oy",
                    "projectId": "daoip5:stellar:project:alternun",
                    "projectName": "ALTERNUN",
                    "createdAt": "2024-06-04T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recrYzhVM2zgQ76oy",
                    "fundsApproved": [
                        {
                            "amount": 303227.57,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 32000,
                    "description": "we regenerate the environment Using unmined Gold reserves as collateral Increasing value production through digital exploitation.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "PRODUCTO 1 TOKEN QUE REPRESENTA ORO: este token representa un gramo de oro proveniente de las reservas mineras que fueron previamente exploradas y validadas por el informe NI 43-101 del Gobierno de Canadá. El informe indicará la oferta total de tokens a emitir y su valor estará vinculado al valor internacional del oro.\n\nPRODUCTO 2 TOKEN DE PROYECTO: este token representará una posición dentro del proyecto en la que el usuario decide mover el 50% de la liquidez que tiene del token #1. Le permitirá recibir recompensas por el desempeño del proyecto, tener poder de decisión sobre diversos asuntos relacionados con el proyecto, sin dejar de estar garantizado en oro.\n\nResolución de problemas: El oro es un activo deseable para proteger de la inflación, pero conlleva un gran coste medioambiental y tiene elevados gastos de almacenamiento y seguridad sin generar ningún beneficio para su propietario. La restauración del medio ambiente, incluso deseable, a menudo no se realiza, ya que se la considera un coste en lugar de un negocio. En Alternun creamos explotación digital, que consiste en la tokenización de reservas de oro no minadas (auditadas y medidas por el informe NI 43 101). Este token permitirá a los usuarios colateralizar en oro y también mover parte de su liquidez al desarrollo de proyectos regenerativos de los cuales podrán obtener recompensas económicas y al mismo tiempo contribuir a la regeneración del planeta, el desarrollo social y la creación de nuevas compensaciones.\n\nMecanismo operativo: Alternun allows users to mint gold-backed tokens using the unmined gold reserves as collateral. The liquidity created by minting the tokens will be kept in the mining project vault until it’s time to vote to develop regenerative projects (producing economic value while having a positive environmental impact) proposed by the holders, at which time the liquidity is released to finance the projects. Once the projects are functioning, a portion of the money generated by those projects will be distributed amongst token holders. The project aims to develop a decentralized blockchain protocol built on the Stellar network. This protocol will facilitate various financial and governance activities within a digital ecosystem, enabling users to transact, stake tokens, vote on proposals, and engage in community governance.\n\nKey Features:\n\nWallet Integration: Users can connect their wallets to the platform, allowing them to securely manage their digital assets and participate in platform activities.\n\nDecentralized Application (DApp): The platform offers a user-friendly DApp accessible via a web interface. This DApp provides functionalities such as viewing account positions, minting tokens, swapping assets within the ecosystem, voting on proposals, and staking tokens for projects.\n\nThird-Party KYC Integration: To ensure compliance and security, the platform integrates with third-party KYC services. Users must undergo KYC verification before accessing certain features like voting or staking.\n\nSmart Contract System: Leveraging the Stellar blockchain's smart contract capabilities, the protocol implements various smart contracts to execute token minting, swapping, voting, and staking operations securely and transparently.\n\nStaking Rewards Mechanism: Users can stake their tokens to support regenerative projects within the ecosystem. A global staking threshold is established, and if reached, new tokens are minted and distributed to stakers as rewards. The minimum amount to stake is controlled by the platform administrator.\n\nGovernance Mechanism: The platform enables community governance through voting on proposals. Users can submit proposals and vote on community initiatives, ensuring decentralized decision-making and participation.\n\nWe consider that Alternun is a great contribution to the Stellar blockchain, adding a project that integrates real-world assets, regeneration, DAO, and a disruptive and innovative idea that redefine the way in which gold mining has been done until today in the world.",
                        "stellar.teamMembers": "noachkettler.y , José Santiago Gómez",
                        "stellar.urls": {
                            "website": "https://alternun.io/",
                            "videoURL": "https://www.youtube.com/watch?v=bvbtFvBZ1sk",
                            "pitchDeck": "https://tinyurl.com/Alternunpitchdeck"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/alternun",
                            "twitter": "https://x.com/Alternun_io",
                            "discord": "https://discord.gg/zqgQNxZx8a"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 32000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 303227.57,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols,Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-04T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:15",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rectN6ErZmODHk69p",
                    "projectId": "daoip5:stellar:project:huma",
                    "projectName": "Huma Protocol Smart Contract",
                    "createdAt": "T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rectN6ErZmODHk69p",
                    "fundsApproved": [
                        {
                            "amount": 0,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 0,
                    "description": "Bring Huma, one of the most sophisticated business lending protocols, to Soroban; projected to drive $1B+ transaction in 12 mos",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Huma is an on-chain lending protocol that enables credit facilities to connect businesses with high-performing receivables to global capital. With the support of advanced features such as tranches, first loss cover, modular structured finance, fee manager, profit and loss manager, and 30/360 calendar, Huma V2 is one of the most sophisticated business lending protocols live today. Huma V2 contracts feature 6000+ lines of Solidity code. Besides the sophistication in its smart contracts, Huma also has advanced infrastructure for on-chain transparency and credit risk management. For different use cases, developers can build adapters for Decentralized Signal Portfolio and Evaluation Agent to leverage various on-chain and off-chain signals for credit underwriting and ongoing risk management. Our transparency layer allows businesses to present the life cycle of their receivables on-chain to give investors full visibility with the health of the underlying assets. (Note: the integration with Decentralized Signal Portfolio and Evaluation Agent will be covered in a separate award application in Phase 3.)\n\nArf is one of the most powerful use cases on the Huma platform. It provides on-demand liquidity to cross-border remittance financial institutions to free them from the heavy burden of pre-funding. Since loans originated by Arf have a very short duration of 1-6 days, Arf can turnover capital very quickly. With a facility of $16M, including capital support from SDF, Arf has achieved $1.3B+ on-chain transaction volume with zero default in the last 500 days and proved itself as one of the most exciting on-chain real world lending use cases (Dune dashboard). So far, Huma and Arf are live on EVM chains such as Polygon and Celo despite Stellar being a key liquidity provider to Arf. This project is to develop and launch Huma and Arf smart contracts on Stellar and Soroban. Since Arf can turnover capital 50 times a year, with borrowing and repayment transactions, the existing liquidity from Stellar and others will generate $1B transaction volume on Stellar and Soroban within 12 months after the project goes live. The project will not only massively improve Soroban's transaction volume, but also aligns with Stellar's vision extremely well.\n\nSince Huma is a complicated protocol, given that Soroban is relatively new, it is expected for us to encounter feature gaps and hit limitations of Soroban infrastructure. We view giving feedback to the Soroban core team as one of the best ways for us to contribute to Soroban and the broader ecosystem. We have been in close contact with Jake Urban from SDF to document these gaps, explore workarounds or figure out a plan to build the missing pieces.",
                        "stellar.teamMembers": "Richard Liu",
                        "stellar.urls": {
                            "website": "huma.finance",
                            "codeRepository": "Soroban source code is not open sourced yet. For your reference, here’s the URL for the Solidity version: https://github.com/00labs/huma-contracts-v2.",
                            "videoURL": "https://vimeo.com/manage/videos/945577455"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/huma-finance/",
                            "twitter": "https://x.com/humafinance"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 538781.49,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-10-02T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:16",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recwmnjnzr62St3sf",
                    "projectId": "daoip5:stellar:project:infrastructure-support-liquify",
                    "projectName": "Infrastructure Support Liquify",
                    "createdAt": "2024-06-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recwmnjnzr62St3sf",
                    "fundsApproved": [
                        {
                            "amount": 124566.76,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 12500,
                    "description": "Liquify wants to provide Stellar &amp; Soroban with long-term public RPC endpoints and archival support.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "What the product is and how we will set it up\n\nMainnet and Testnet free Public RPC endpoints\n\nUp to 40 million calls daily with geomeshing and load balancing; Mainnet: 3 Globally distributed RPC endpoints with 1 archival: US West, US East, Europe, Asia. With Shared nodes and Dedicated nodes for enterprise clients; 1 Futurenet and 1 Testnet RPC endpoints; Fallback infrastructure with 99.95% uptime guaranteed in the SLA up to 120 million RPC calls daily. Access to monitoring data; Testing period available.\n\nWhat problems it solves\n\nThe industry is still heavily cloud reliant and centralised across cloud infrastructure providers and major market players like Infura, Alchemy, QuickNode etc. Liquify is one of a few fully bare metal providers powering all decentralised RPC networks and rocking global set up and guaranteeing 99.95%. Our vision is to drive decentralisation with high quality of service and scalability. For the sake of decentralisation, geo-diversity, quality of service (up-time, speed, latency) our team strongly believes that onboarding a multiple different RPC providers is crucial to support the Stellar ecosystem. Liquify brings reliability, scalability, cost-efficiency, performance and guarantees it in the SLA which are key to grow the network.",
                        "stellar.teamMembers": "Zeb, zeb_dyor",
                        "stellar.urls": {
                            "website": "liquify.com",
                            "codeRepository": "https://github.com/liquify-validation",
                            "videoURL": "https://drive.google.com/file/d/1-_yQQ3AddUhfiXO8cG7Sb2zwxUUM6od-/view?usp=sharing"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 12500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 124566.76,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:17",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recwS9b2xRCHdnssZ",
                    "projectId": "daoip5:stellar:project:securx-medical-prescriptions",
                    "projectName": "SecuRx - Medical Prescriptions",
                    "createdAt": "2024-06-04T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recwS9b2xRCHdnssZ",
                    "fundsApproved": [
                        {
                            "amount": 401776.54,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 42400,
                    "description": "SecuRx makes medical prescriptions safer, easier and more reliable than any previous solution for all healthcare systems worldwide",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "SecuRx is an innovative web3 platform designed to revolutionize the way healthcare providers and patients manage prescriptions. By leveraging blockchain technology, SecuRx addresses the significant challenge of prescription fraud. The platform utilizes smart contracts along with QR codes to establish a robust and unforgeable verification system for prescriptions. Targeting the vast market of approximately 1 billion prescriptions processed annually in France alone, SecuRx stands out by enhancing security, transparency, and efficiency in medical prescription management.\n\nSecuRx tackles two significant issues in the healthcare sector:\n\nPrescription Fraud: In many countries, including France, the prescription process is predominantly paper-based, making it vulnerable to fraud, replication, and alterations. This results in significant financial losses—approximately €16 million annually to the French Health Insurance system—and raises serious concerns about medication errors and misuse. The conventional method for detecting forged prescriptions relies heavily on the subjective judgment of pharmacists, which can lead to inconsistencies in the authenticity verification of prescriptions.\n\nData Privacy Concerns in Digital Healthcare: One prominent concern in the digitalization of healthcare is the apprehension towards online personal health data security. A substantial 86% of French citizens view their health data as particularly sensitive, with 78% fearing its commercial use or the risk of hacking. SecuRx addresses these concerns by leveraging blockchain's inherent security properties to authenticate transactions without storing personal health information online or on the chain. This approach offers a unique solution that not only secures data but also restores trust in digital health systems, making SecuRx a transformative force in healthcare digitalization.\n\nSources:\nhttps://www.economie.gouv.fr/actualites/bilan-plan-lutte-fraudes#\nhttps://sante.gouv.fr/actualites/presse/communiques-de-presse/article/le-numerique-en-sante-ce-qu-en-pensent-les-francais",
                        "stellar.teamMembers": "Sébastien Rodillon",
                        "stellar.urls": {
                            "website": "https://securxtech.wixsite.com/securx",
                            "videoURL": "https://securxtech.wixsite.com/securx/video"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 42400.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 401776.54,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-04T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:18",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recP4mLvsBD60bfIv",
                    "projectId": "daoip5:stellar:project:chaincred",
                    "projectName": "ChainCred",
                    "createdAt": "2024-06-04T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recP4mLvsBD60bfIv",
                    "fundsApproved": [
                        {
                            "amount": 303227.57,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 32000,
                    "description": "Infra for Founders &amp; Investors to exchange &amp; fetch credible company finances on Soroban ensuring data transparency &amp; verification",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Our project addresses the challenge faced by startups and investors during the fundraising process, where sensitive financial data must be shared for due diligence while maintaining confidentiality and trust. We offer a secure and transparent platform that enables selective data visibility, streamlining the verification process without compromising data integrity through Soroban smart contracts.\n\nProduct Offerings:\n\nFinancial Data Verification Platform:\nWhat it is: A secure platform for startups and investors to verify financial data during fundraising.\nProblems it solves: Reduces the time and effort required for due diligence while ensuring data confidentiality and credibility without actually revealing the complete data.\nAudience & Benefits: Founders benefit from streamlined data verification and analysis, reducing manual efforts and ensuring data integrity. Investors benefit from efficient due diligence processes and real-time spend updates. Also, their team's bandwidth for verification and analysis of data will be reduced heavily.\nHow it works with Stellar and Soroban: Utilizes Stellar for supporting Stellar transaction tracking with Freigher integration for allowing startups to get automated finance tracking with it. We will also be utilizing Soroban for writing smart contracts for off-chain financial institutions & banks data verification and validation.\n\nERP for Finance:\nWhat it is: An ERP platform tailored for finance management in startups.\nProblems it solves: Provides comprehensive financial analysis and spend management.\nAudience & Benefits: Founders benefit from automated spend categorization and in-depth financial analysis. Investors gain insights into company finances without compromising data security.\nHow it works with Stellar and Soroban: Any incoming requests from investors to view a company's financial assets need to be signed and sent as a transaction to record it on a chain. The company founders have to approve this request using their keys and only then the finances are exchanged between the parties. For company employees and HR users, each employee will be added to the portal with their G/S keys and only if they exist in the company, will they have access to the data. We will have RBAC implemented to limit sharing of financial data as set by the company founders.\n\nKEY FEATURES\n\nPermission-Based Access Control: Enables granular control over data sharing between founders and investors.\n\nNatural Language Processing (NLP): Provides insightful answers without complex queries, enhancing user experience.\n\nDiscussion Module: Facilitates communication between investors and founders for data clarification.\n\nExpense Tagging: Allows founders to categorize expenses, aiding investors in fund allocation understanding.\n\nDue Diligence Checklist: Guides founders on required documents for investor scrutiny.\n\nFinancial Metrics Calculation: Generates key financial metrics like net profits, losses, and gross margins from uploaded bank statements.\n\nInteractive Data Visualization: Presents financial data through interactive charts and graphs for easy understanding.\n\nTimeline View: Tracks startup progress and growth over time using financial metrics.\n\nSecure Digital Vault: Safely stores and shares critical legal and financial documents.\n\nCost-Saving Recommendations: Offers personalized cost-saving strategies based on spending patterns using a third-party LLM with custom weights focusing on financial data & outlier detection using K-means clustering.\n\nAlert System: Enables founders to set alerts for specific financial indicators or thresholds.",
                        "stellar.teamMembers": "Parth Ajmera",
                        "stellar.urls": {
                            "website": "At ideation stage",
                            "videoURL": "https://drive.google.com/file/d/1_oFHdD44voiE8PQ_Fkg4TGxUIeXu-37D/view?usp=sharing"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 32000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 303227.57,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-04T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:19",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUleqROhGvokHEf",
                    "projectId": "daoip5:stellar:project:bitgifty",
                    "projectName": "BitGifty",
                    "createdAt": "2024-05-30T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUleqROhGvokHEf",
                    "fundsApproved": [
                        {
                            "amount": 330617.64,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 35200,
                    "description": "Enabling Crypto GIfting and Bill Payment in Africa",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Bitgifty offers a unique and innovative solution for individuals interested in sending cryptocurrency as gifts without the usual hassles associated with crypto transactions. Here’s how it streamlines the process:\n\nCreating Gift Cards: Individuals can easily create digital gift cards on Bitgifty’s platform. Users select the amount of cryptocurrency they want to gift and generate a corresponding gift card. This process eliminates the need to deal with complex and error-prone cryptocurrency wallet addresses.\n\nSending Gift Cards: Once the gift card is created, it can be sent digitally to the recipient through various means such as email or a direct message. This method ensures that the gift-giving process is straightforward, safe, and personal.\n\nRedeeming Gift Cards: The recipients receive a digital gift card which they can redeem on the Bitgifty platform. Upon redemption, the equivalent cryptocurrency amount is added to their Bitgifty wallet, from where they can transfer it to their personal cryptocurrency wallets or use it for other transactions within the platform.\n\nSecurity and Ease of Use: By using Bitgifty, both the giver and the recipient are spared the potential mistakes of entering the wrong wallet addresses, thus reducing the risk of lost funds. Additionally, the platform’s user-friendly interface makes it accessible even to those who are not tech-savvy.\n\nBitgifty extends its services to businesses, offering them a versatile tool for corporate gifting and incentives through crypto-based gift cards. This is particularly beneficial for engaging employees, clients, and partners in a modern and financially digital way.\n\nBrand Onboarding: Bitgifty collaborates with various brands, allowing these entities to become part of the gift card ecosystem. This onboarding process enables businesses to offer gift cards that are redeemable for goods or services at these brands’ stores.\n\nCreating Custom Gift Cards: Businesses can create gift cards for specific brands listed on Bitgifty. These gift cards can be tailored to business needs, whether it's for customer rewards, employee incentives, or corporate gifts.\n\nMass Gifting Capabilities: One of the standout features for businesses is the ability to create multiple gift cards simultaneously. This is particularly useful for mass gifting scenarios, such as during the holidays, corporate events, or as part of a rewards program.\n\nRedemption at Brand Stores: Recipients of these gift cards can use them to make purchases or part-payments at the respective brand’s physical or online stores. This flexibility enhances the utility of the gift cards and provides recipients with a wide range of shopping options.\n\nCorporate Management Tools: Bitgifty provides businesses with tools to manage their gift card distributions. This includes tracking who has redeemed the cards and integrating these efforts with broader corporate incentives or marketing programs.\n\nUsers on Bitgifty can use their cryptocurrency holdings to pay for essential services such as airtime, data, cable television, and electricity. This service is particularly beneficial for users who prefer to maintain most of their financial activities within the cryptocurrency ecosystem or for those looking to minimize exchanges between crypto and fiat currencies. The ability to redeem crypto gift cards for utility payments adds an additional layer of flexibility to the Bitgifty platform. Users who receive gift cards can convert their gifts directly into practical, everyday use by paying for services that are essential to their daily lives.",
                        "stellar.teamMembers": "Adedolapo Adeagbo",
                        "stellar.urls": {
                            "website": "bitgifty.com",
                            "videoURL": "https://youtu.be/BeEmWQ6-fcU"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 35200.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 330617.64,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-30T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:20",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUFeDBhzepKJ0JI",
                    "projectId": "daoip5:stellar:project:rise-in",
                    "projectName": "Rise In - Developer Education",
                    "createdAt": "2024-06-03T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUFeDBhzepKJ0JI",
                    "fundsApproved": [
                        {
                            "amount": 469905.38,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Rise In specialize in curating &amp; delivering high impact developer education courses, blending online learning with IRL workshops.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Rise In's Web3 Training Programs are comprehensive educational courses designed to transition developers from web2 to web3 technology. These programs blend theoretical learning with practical application, providing a foundational knowledge of blockchain technology. The primary problem addressed by these training programs is the skill gap in the rapidly evolving blockchain sector. They cater to developers with a web2 background who are looking to upskill and pivot to web3 technologies. The benefits of these programs are multi-faceted: they provide developers with the knowledge and skills necessary to thrive in the web3 domain, enhance employability, and contribute to the growing blockchain ecosystem. The training programs can integrate modules focused on Stellar and Soroban. For Stellar, this might include its unique consensus mechanism, asset creation and transfer methods, and the overall architecture of its decentralized financial network. Regarding Soroban, the training could dive into its smart contract capabilities, demonstrating how to develop efficient and effective decentralized applications. By covering these areas, the programs not only prepare developers for current market demands but also position them to contribute innovatively to the Stellar and Soroban ecosystems.\n\nRise In's Cohort-Based Bootcamps are intensive, immersive training sessions that focus on practical application and real-world project development in the web3 space. These bootcamps address the lack of hands-on, practical experience in web3 development. They are ideal for developers who have foundational knowledge of web3 but seek to deepen their expertise through real project development. The bootcamps offer a direct benefit of applying learned skills in practical scenarios, thereby enhancing the developers' portfolio and real-world problem-solving abilities. In these bootcamps, participants engage in projects using the Stellar network or developing smart contracts with Soroban. This hands-on approach allows them to apply their theoretical knowledge to build applications, understand the Stellar network's intricacies, and utilize Soroban’s advanced smart contract functionalities. Such practical experience is invaluable for comprehending the full potential and application of these technologies in real-world scenarios.\n\nCommunity Outreach Events are structured as in-person and virtual gatherings, including hackathons and meet-ups, designed to foster networking, collaboration, and practical engagement among the web3 community. These events tackle the issue of limited interaction and collaboration opportunities within the web3 developer community. They are ideal for developers, enthusiasts, and professionals in the blockchain space who seek to share ideas, collaborate on projects, and stay abreast of the latest developments. The benefits include fostering a strong community, spurring innovation, and providing valuable networking opportunities. Rise In’s events can focus on challenges and projects specifically designed for the Stellar and Soroban ecosystems. Hackathons can encourage developers to build Stellar-based applications or develop Soroban smart contracts, promoting practical problem-solving and innovation. Meet-ups can facilitate discussions and workshops on Stellar and Soroban, enhancing community knowledge and engagement with these platforms.",
                        "stellar.teamMembers": "Ankit Raj, Kaan Kaçar, Tim Hodgson",
                        "stellar.urls": {
                            "website": "risein.com",
                            "videoURL": "https://www.youtube.com/watch?v=NZmrbrkmE_Q"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/school/risein/",
                            "twitter": "https://x.com/riseinweb3",
                            "discord": "https://discord.com/invite/RQcmHrTJGc"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 469905.38,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Education & Community",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-03T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:21",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUJPxEC1NhY3hU8",
                    "projectId": "daoip5:stellar:project:b4b",
                    "projectName": "B4B - Influencer/KOLs protocol",
                    "createdAt": "2024-06-11T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUJPxEC1NhY3hU8",
                    "fundsApproved": [
                        {
                            "amount": 411785.3,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 40000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:22",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWlKfh0BaVkHuXD",
                    "projectId": "daoip5:stellar:project:formal-verso",
                    "projectName": "Formal VerSo - Phase 3",
                    "createdAt": "2024-05-31T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWlKfh0BaVkHuXD",
                    "fundsApproved": [
                        {
                            "amount": 945929.31,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 99875,
                    "description": "A semi-automated tool for Formal Verification of Soroban contracts using the Software Analysis Workbench (SAW)",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Our goal is to democratize formal verification—a technology trusted by industry leaders and governments for their most critical systems—for Soroban developers. This initiative is critical because security flaws in smart contracts have led to billion-dollar losses in recent years. Traditional methods like testing and code review are insufficient, as they cannot cover all inputs and often overlook issues. Instead, we propose an approach based on formal verification to ensure correctness and security of smart contracts. Formal verification leverages rigorous mathematical proofs to eliminate entire classes of bugs and vulnerabilities, beyond the capabilities of traditional testing. A verified contract will always behave as expected even in the presence of malicious actors, ensuring that it has no bugs or vulnerabilities that could cost millions or even billions of dollars.\n\nWe will leverage our decades of expertise in formal verification to improve security in Soroban contracts with Formal VerSo (Formal Verification of Soroban contracts). The project will develop formal verification tooling by extending Galois’s Software Analysis Workbench (SAW) with support specific for verifying smart contracts on the Soroban platform. This will allow users of the Soroban platform to ensure their contracts are correct and secure before deploying them. In the decades of developing SAW, Galois has verified critical pieces of software, including Amazon’s S2N cryptography library currently used by hundreds of millions of people. During the activation award, we demonstrated that SAW can be used to formally verify simple Soroban contracts that make straightforward use of just the Soroban storage API. This was done by using SAW’s Rust verification capability and a model of the storage API.\n\nIn the upcoming phase, we plan to continue increasing our coverage of the Soroban SDK in the contracts that SAW can verify. This involves incorporating specifications and reasoning principles for various features, including custom types, authentication and authorization and cross contract invocations. Also, since we are now more familiar with the verification process of Soroban contracts, we’ll start paving the way towards a more user-friendly tool with better error reports and better interaction.\n\nSubsequent stages of our work will focus on further expanding our support for the SDK to include more of its features. We also want to start exploring how to make the tool usable and useful for the community. Our overarching objective is to validate the effectiveness of our tool by verifying a real-world, intricate protocol such as the pool-factory of the Blend Protocol. We have engaged with Script3 to start the conversations and plan towards that goal.\n\nYou will find the entire roadmap in the technical Architecture document.",
                        "stellar.teamMembers": "Vanessa Aguilar",
                        "stellar.urls": {
                            "website": "https://github.com/GaloisInc/formal-verso",
                            "codeRepository": "https://github.com/GaloisInc/formal-verso",
                            "videoURL": "https://drive.google.com/file/d/1yN1xE2k4RmpmshKol4j9rwCr_yNGA3ZA/view?usp=drive_link"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 99875.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 945929.31,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-31T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:23",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWPirIc6IP4v27v",
                    "projectId": "daoip5:stellar:project:soroban-dappradar-integration",
                    "projectName": "Soroban DappRadar integration",
                    "createdAt": "2024-06-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWPirIc6IP4v27v",
                    "fundsApproved": [
                        {
                            "amount": 498267.03,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Integrating Soroban on DappRadar, tracking its dapps data and bringing crypto degens to the ecosystem.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "DappRadar functions as a dapp discovery portal, providing a gateway for blockchain users to explore and uncover the newest and most popular dapps. One of DappRadar's strengths lies in its dedication to educating visitors about multiple blockchains, including popular ones like ETH, BNB, and Polygon, among others. By providing comprehensive data and insights on dapps and the corresponding blockchain platforms, one of the main challenges dapp users can experience is discovering new applications, whether it be for work, play, or investment. They need to use a plethora of disparate tools to find what they are looking for. For example, browsing through X, going to various Discord channels or just simply searching on the web. Even then, surface level research often does not yield important information about dapps such as, for example, how active a dapp is. While activity is possible to denote through a block explorer, that requires technical knowledge, creating a barrier for many potential users. DappRadar is built with the pure intention of dapp discovery, allowing users to find new applications simply, understand how they perform, and use them. DappRadar does not focus on a specific vertical or category. If a user wants to learn about blockchain gaming, NFTs and DeFi, there is no need for them to use three different platforms. All their needs can be fulfilled by simply using DappRadar. Our product aims to enhance Soroban in the following ways: Attract new users and developers: by integrating on DappRadar, Soroban will be featured alongside 60 other chains, allowing DappRadar’s highly specialized audience, as well as its developer community, to discover Soroban and its dapps. Performance comparison: Soroban dapp users and developers can compare their performance with others in the industry using DappRadar's rankings. Increased traffic to dapps: on average DappRadar sends approximately one million users a month to dapps across all of its integrated chains. Media exposure: DappRadar's articles and reports highlighting positive protocol activity have been quoted by top blockchain media, providing additional exposure for Soroban and its ecosystem. Overall, integrating Soroban on DappRadar will bring new users, provide performance insights, drive traffic, engage experienced builders, offer gaming metrics, showcase activity, and generate media exposure, enhancing the Soroban and its dapp ecosystem. To complete the integration, the DappRadar team will use nodes or blockchain APIs to collect Soroban’s raw blockchain data. Afterwards, the data will be indexed and displayed on DappRadar’s rankings page. The goal of the integration is to track the main DappRadar metrics: UAW (unique active wallets), dapps incoming volume to smart contracts, number of transactions in smart contracts and token balances on smart contracts.",
                        "stellar.teamMembers": "Rimas Jonusauskas",
                        "stellar.urls": {
                            "website": "https://dappradar.com/",
                            "codeRepository": "-",
                            "videoURL": "https://www.youtube.com/watch?v=HSVvtpxWNWs"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/dappradar",
                            "discord": "https://discord.com/invite/4ybbssrHkm"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 498267.03,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:24",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recYidv6nP5tSv03Z",
                    "projectId": "daoip5:stellar:project:php-anchor-sdk",
                    "projectName": "PHP Anchor SDK",
                    "createdAt": "2024-06-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recYidv6nP5tSv03Z",
                    "fundsApproved": [
                        {
                            "amount": 577989.75,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 58000,
                    "description": "The PHP Anchor SDK abstracts Stellar-specific functionality for running an Anchor, allowing PHP devs to focus on business logic.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Stellar clients make requests to the endpoints of Anchor Servers using sets of standards called SEPs (Stellar Ecosystem Proposals). To offer standardized, compatible services, Anchors must implement a whole series of Stellar Ecosystem Proposals. As an anchor, the most important SEPs are SEP-10: Stellar Authentication, SEP-12: KYC API, SEP-38: Anchor RFQ API, SEP-6: Programmatic Deposit and Withdrawal, SEP-24: Hosted Deposit and Withdrawal, SEP-31: Cross Border Payments API, and SEP-08: Regulated Assets.\n\nThe open-source PHP Anchor SDK helps PHP developers to implement the Client - Anchor interaction by abstracting the Stellar-specific functionality defined in the SEPs. The SDK is composed of two components: a Service Layer Library implementing the Stellar specific functionality described in the corresponding SEPs, and an open-source Reference Server implementation that uses the library.\n\nThe library is published on Packagist, the main PHP Packages Repository, and can be freely used in any PHP project. The Reference Server implementation serves as an example project, demonstrating the interaction with the library but can also be easily extended to implement the real business logic.\n\nWe have already successfully implemented support for the most important SEPs. This includes support for SEP-01, SEP-06, SEP-09, SEP-10, SEP-12, SEP-24, SEP-31, and SEP-31. In the next phase, we would like to implement support for SEP-08 and then focus on important features like the implementation of callback mechanisms, transactions watcher, event handling, localization, and logging. This will allow us to offer similar functionality as the official Java Anchor Platform to PHP developers.",
                        "stellar.teamMembers": "Bence Nagy, Christian Rogobete",
                        "stellar.urls": {
                            "website": "https://github.com/Argo-Navis-Dev/php-anchor-sdk",
                            "codeRepository": "https://github.com/Argo-Navis-Dev/php-anchor-sdk",
                            "videoURL": "https://youtu.be/oZ04bL3wL-A"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 58000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 577989.75,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:25",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recZgZOpwThqNmkmm",
                    "projectId": "daoip5:stellar:project:kura-for-cross-border-payments",
                    "projectName": "Kura for cross-border payments",
                    "createdAt": "2024-06-05T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recZgZOpwThqNmkmm",
                    "fundsApproved": [
                        {
                            "amount": 255991.18,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 27300,
                    "description": "We create transparency and impact by reducing cash use and enabling merchants in LAC to get paid directly at their points of sale",
                    "status": "Awarded",
                    "completionPercentage": 67.0,
                    "extensions": {
                        "stellar.productsAndServices": "Kura participated in the Stellar Startup Camp from April 22 - April 25th 2024. Kura is also a Techstars portfolio company and is currently participating in the Techstars Payments powered by Stellar and Moneygram. US based Immigrant communities who send money to their relatives abroad are often financially distressed by recurring requests from relatives, but have no visibility on how the remittances sent are spent. They pay expensive fees on each transaction and are looking for a long term solution to reduce recurring requests and find a peace of mind. The platform serves millions of immigrants from Central America and the Caribbean sending more than $60B dollars back home each year. Kura provides instant spending for recipients of cross-border payments and Kura increases transparency by providing labeling on remittance usage using a closed-loop payment mechanism between immigrants (senders), the remittance (receiver), and local service providers (vendors), that enables senders to assign a specific purpose for the transfer. Kura is a digital remittance and payment platform leveraging a SAAS model that allows remittance receivers to use a QR code in a closed-loop payment at their local points of sale for the exchange of goods and services after receiving a transfer from senders. Using Stellar, we help merchants settle their payments instantly. In the longer term, we aim to leverage Stellar to power both online and offline payments for underserved markets where traditional payments rails are lacking significantly. A few use examples: incumbents who want to leverage digital/online payments, tech startups who want to accept digitally and serve customers in these local regions, and NGOS/Philanthropic organizations who need to serve beneficiaries in receiving countries. Problem: Inefficient cross-border payment systems lead to repetitive manual transactions for beneficiaries, limit sponsor choice in fund utilization across vendors and markets and lack transparency regarding expenditure within specific market segments or categories. Kura will leverage Stellar to facilitate the instant settlement of funds to SMB vendors and merchants onboarded to the platform.",
                        "stellar.teamMembers": "Stephanie",
                        "stellar.urls": {
                            "website": "https://www.kuratek.com/",
                            "videoURL": "https://youtu.be/wW2YnaG3Ft0"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/kura-fintech/?viewAsMember=true"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 27300.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 255991.18,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:26",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec0OaOoRwjfSdS58",
                    "projectId": "daoip5:stellar:project:metafyed",
                    "projectName": "Metafyed - RWA marketplace",
                    "createdAt": "2024-08-05T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec0OaOoRwjfSdS58",
                    "fundsApproved": [
                        {
                            "amount": 589162.7,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Revolutionizing access to Real World Assets in Asia through tokenization",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "The Metafyed ecosystem comprises two products aimed at simplifying capital raising through crypto liquidity, providing small businesses with tokenization as an alternative fundraising avenue alongside traditional options like series funding.\n\nMetafyed Marketplace/STO platform: This platform serves as a crowdfunding hub where approved investors can directly engage with offered investment projects. Investors can stake stablecoins in exchange for project security tokens, which may include SAFE agreements or interest/dividend-bearing tokens with encoded schedules.\n\nIssuer Management Dashboard: Designed for multi-chain compatibility, the dashboard enables issuers to easily manage project tokens across chains. Integrated KYC functionality ensures issuers can track the identities of their token holders effectively.\n\nFeature implementation for Grant Period: As a natively-multi chained platform, Metafyed is interested in integrating with the Stellar Ecosystem through extending asset token features while fully utilizing the existing regulated asset functionality that Stellar has to offer.\n\nExtending asset token features to support issuer projects on Metafyed platform.\n\nIntegration of approval server needed for regulated server with the existing identity registry that Metafyed already has to streamline KYC approval on asset transfer across Solana and Stellar.\n\nImplementation of dividend/interest schedule with integration of Stellar global payment rails to easily allow our regulated asset issuer to dispense dividend and interest payments to issue holders in fiat currency through stellar anchors.\n\nImplement on-chain STO through Soroban contract.\n\nImplementation of on-chain STO running through contracts enabled by Soroban. The collection of STO contracts will support hosting an STO in Stellar Ecosystem with integrated KYC support.\n\nImplement off-chain Stellar bridge to Solana.\n\nSince there’s no existing open-source implementation of on-chain bridge solution for issued assets, Metafyed will be implementing an off-chain bridge server that will leverage burn and mint mechanism to allow for cross-chain asset token transfer and management.\n\nCross-chain operations between Solana and Stellar will be enabled through Metafyed asset management dashboard.",
                        "stellar.teamMembers": "Mimi Vong, Nick Brons",
                        "stellar.urls": {
                            "website": "https://www.metafyed.com/",
                            "codeRepository": "Can provide up on request",
                            "videoURL": "https://vimeo.com/945594144?share=copy"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 589162.7,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-08-05T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:27",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec1ukEnQRTCfaoHw",
                    "projectId": "daoip5:stellar:project:bondhive-onchain-fixed-deposit",
                    "projectName": "BondHive:OnChain Fixed Deposit",
                    "createdAt": "2024-05-30T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec1ukEnQRTCfaoHw",
                    "fundsApproved": [
                        {
                            "amount": 375701.86,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 40000,
                    "description": "Bond Hive simplifies on-chain savings, offering fixed returns by tokenizing funding fees, making complex futures easy for everyone",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "What It Is: BondHive offers Crypto Yield Bonds that leverage the arbitrage opportunities available from funding fees in centralized exchanges. These bonds allow users to earn yields from the futures market without direct exposure to volatile trading.\n\nProblems It Solves: It addresses the complexity and inaccessibility of arbitrage opportunities in decentralized finance for casual investors and maximizes capital efficiency for seasoned traders.\n\nAudience: Designed for both 'crypto-adjacent' users seeking simple, stable investments and 'Degen' traders looking for optimal yield strategies.\n\nHow It Works: BondHive utilizes the Stellar network to issue and manage these bonds. By tapping into Stellar’s fast, low-cost transaction capabilities, we can offer a scalable and efficient service.\n\nUse of Stellar and/or Soroban: Our platform leverages Stellar’s ability to handle high transaction throughput and integrates with Soroban to implement advanced smart contract functionalities that manage the bonds’ lifecycle, from issuance to maturity.",
                        "stellar.teamMembers": "Jatin Bedi",
                        "stellar.urls": {
                            "website": "bondhive.xyz"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://twitter.com/bondhive"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 375701.86,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-30T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:28",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec2UJLCx1DBLgdm4",
                    "projectId": "daoip5:stellar:project:0xauth",
                    "projectName": "0xAuth",
                    "createdAt": "2024-05-30T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec2UJLCx1DBLgdm4",
                    "fundsApproved": [
                        {
                            "amount": 422664.59,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 45000,
                    "description": "0xAuth will enable seamless compliance andinteroperability for tokenised funds.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "The Problem\nTraditional finance is moving on-chain for efficiency. We’ve seen how Franklin Templeton launched its Franklin OnChain United States Government Money Fund with $BENJI on Stellar, and how KKR is tokenising a part of its private equity fund on Avalanche. Even BlackRock is launching its first tokenised fund on Ethereum. It’s not long before other institutions start following suit. The problem is, that the onboarding and verification processes (which include Know Your Customer (KYC) checks and accredited investor qualification) for new users are still based on the old Web2 approach: they’re repetitive, and manual. This is problematic to say the least, since 40% of potential users will abandon the onboarding process if it takes longer than ten minutes. This results in the loss of trillions of dollars (3.3 trillion in 2019 alone) of potential revenue. The need for a seamless, but compliant Web3 onboarding process with portable credentials is long overdue.\n\nWhat Problems Are Tokenised Fund Institutions Facing?\nInstitutions need to keep investor fees as low as possible to stay relevant in an increasingly competitive market. This explains why so many of them are choosing to move on-chain. However, this is merely one part of the equation. High compliance costs are still a major source of concern since investors are just as likely to be alienated by expensive verification processes as they are by a clunky onboarding experience. Bringing acquisition costs down would ultimately result in higher conversion rates. Additionally, tokenised funds are still operating in a gated and siloed fashion. This greatly reduces the number of potential investors that can be acquired. A cross-chain approach would significantly increase this number.\n\nWhat Are We Proposing?\n0xAuth proposes a frictionless onboarding and verification process along with portable investor credentials — while boasting minimal compliance costs. The key features of our solution include:\n\nA compliant, automated verification process: 0xAuth verifies accredited investors using trusted off-chain oracles in an automated fashion. This includes Know Your Customer (KYC) and Know Your Business (KYB) checks via Plaid. Plaid enables investors to verify their real-world assets, such as bank and brokerage accounts, and undergo Anti-Money Laundering (AML) compliance and Political Exposed Person (PEP) screening. Additionally, 0xAuth leverages Vezgo, which allows investors to verify their digital assets such as crypto holdings, centralised exchange (CEX) and decentralised exchange (DEX) accounts, and non-fungible token (NFT) holdings.\n\nPortable, verifiable credentials: 0xAuth deploys a digital identity contract (ERC-734) on-chain when a new user onboards for the first time. After the verification process is complete, the user is issued two verifiable credentials: off-chain, using the W3C VC standard, and on-chain, using the ERC-735 standard (which are linked to the user’s digital identity contract). We’ve explained the ERC-734 and ERC-735 standards in more detail in the next section.\n\nConditional wallet connectivity: If a platform (such as a private investment fund) wants to verify the user’s eligibility, it can simply integrate with 0xAuth and check their verifiable credentials to conditionally allow or block access.\n\nZero-knowledge proofs: If a platform needs to further verify a user’s personal information, it can utilise JSON-LD-based zero-knowledge proofs (ZKPs) to verify off-chain (W3C) credentials. This approach allows for selective disclosure, enabling users to share specific pieces of information without revealing their entire identity or related data. As an example, an institution can request that a user verify their country of residence in order to provide them access to a private staking pool that is restricted to European residents. In the future, we’d like to allow these off-chain (W3C) credentials to be verified on-chain as well. In this case, we would deploy a ZKP verifier contract on the Stellar network. This contract would support criteria selection (ZK predicates) and selective disclosure requests. Any institutional contracts on the Stellar chain can simply call our contract to verify ZK proofs on-chain.\n\nHow Does Stellar Fit into the Picture?\nWe envision 0xAuth as the single sign-on (SSO) for a seamless, yet fully compliant, Web3 ecosystem. Our solution eliminates the need for siloed and gated environments typical in tokenised funds. With an eye toward a multi-chain future, 0xAuth is designed to facilitate the effortless movement of eligible investors across different blockchain networks while enabling institutions to attract and engage users from these diverse ecosystems. Incorporating support for Stellar-based tokenised funds into 0xAuth is a strategic move. By doing so, we aim to significantly expand the pool of potential investors for institutions like Franklin Templeton and WisdomTree, which are already utilising Stellar. Our included illustrations depict the envisioned integration and the benefits it brings.\n\nHow Can Stellar Benefit From Our Solution?\nStellar stands out as a premier blockchain for institutions looking to tokenise their investment funds thanks to its speed, low cost, and energy efficiency. By integrating 0xAuth, Stellar can enhance its appeal further by serving as a central hub for cross-chain activities: Enhanced Interoperability: With 0xAuth, Stellar can facilitate seamless identity verification across blockchains, reinforcing its position as a bridge within the multi-chain ecosystem. Compliance as a Service: Leveraging 0xAuth’s compliance tools on Stellar not only simplifies the compliance challenges for tokenised funds, but also turns Stellar into a compliance hub for cross-chain RWA transactions. Stellar as a Market Expander: By reducing compliance friction in cross-chain transactions, Stellar can attract a broader range of institutional participants and eligible investors, boosting its overall ecosystem activity and liquidity. Exclusive Features for Stellar Users: We plan to develop custom features for Stellar on 0xAuth, which include institutional dashboards, audit trails, and enhanced security protocols specifically tailored to meet the needs of institutional users. By enabling these capabilities, 0xAuth will help solidify Stellar's role as a leading network for tokenised assets, broadening its user base and enhancing its operational ecosystem.\n\nHow Will We Implement the Required Standards on Stellar?\nAs mentioned above, we’ll use the ERC-734 and ERC-735 standards for our proposed solution. These are Ethereum standards proposed for managing on-chain identities. ERC734, or the \"identity\" standard, outlines how identities can be created, queried, and managed, allowing entities like individuals, organisations, and machines to have an on-chain presence through identity contracts. These contracts can hold claims and be controlled by one or more key managers. ERC735, on the other hand, complements this by defining how claims can be added, removed, or changed within these identity contracts. It specifies the methods for making claims about an identity, which claim issuers can validate. All ERC standards essentially propose a set of methods (or functions) that must be implemented. As such, we’ll implement the same methods and leverage custom types and data structures using the Rust language via Soroban. This way, we’ll be “porting over” the ERC standard to the Stellar chain. Additionally, we’ll use the Deployer feature for straightforward setup and initialisation of the required identity contracts, the Auth feature to secure operations and access (ensuring that only authorised actions are allowed), and the Events feature to track and announce changes in claims for transparency and ease of auditing. This approach will enable us to create a functional and secure identity verification system on Stellar.",
                        "stellar.teamMembers": "Rico van der Veen, Zohaib Adnan",
                        "stellar.urls": {
                            "website": "https://0xauth.co/",
                            "videoURL": "https://docsend.com/v/yrmz2/0xauth-tokenized-funds"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 45000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 422664.59,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-30T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:29",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec5XtNfCR7Fg86mE",
                    "projectId": "daoip5:stellar:project:dapp-world",
                    "projectName": "Comprehensive Stellar Track",
                    "createdAt": "2024-05-30T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec5XtNfCR7Fg86mE",
                    "fundsApproved": [
                        {
                            "amount": 131495.65,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 14000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:30",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec9df0gMcvT7weQ2",
                    "projectId": "daoip5:stellar:project:wadzzo-explore-collect-win",
                    "projectName": "Wadzzo - Explore, Collect, Win",
                    "createdAt": "2024-06-06T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec9df0gMcvT7weQ2",
                    "fundsApproved": [
                        {
                            "amount": 46992.83,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 5000,
                    "description": "An innovative geolocation rewards app driving action and adventure worldwide with digital incentives placed by organizations.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Wadzzo is an innovative geolocation-based rewards app designed to inspire action, foster adventure, and create meaningful connections worldwide. Our platform addresses the modern-day challenge of engaging and incentivizing an audience with organizations located around them by transforming everyday exploration into exciting treasure hunts and rewarding experiences. Wadzzo is a mobile application that allows organizations to place digital items, such as virtual tokens or prizes, at specific geo locations around the world. Users can collect these items in the Wadzzo app by physically visiting the designated pin location, collecting it through the app, then redeeming it for real rewards, information, and experiences. Users can look at the map within the Wadzzo app to see where prizes are placed around them, as well as what organization placed it and a pin description of what it is. Users can view what pins have been collected in their wallet in order to redeem their reward from it, and certain user activity within the app such as collecting any organizations digital pin earns users a Wadzzo token, a digital currency exclusive to Wadzzo that can be redeemed in our Marketplace for exclusive prizes from user’s favorite brands and organizations as an incentive for taking action, as well as where users can exchange digital assets with each other.\n\nWhen users sign up for Wadzzo, a digital wallet powered by Stellar is automatically created for them, providing a secure digital wallet for storing collected items and rewards from Wadzzo. The app works by placing digital items at specific geographical locations, which are then visible to users within the app. By leveraging the Stellar blockchain technology, Wadzzo ensures seamless and transparent transactions, enhances user security and privacy, and enables the seamless exchange of digital assets between users and organizations in the Marketplace.\n\nOur platform serves two primary customer segments: Organizations: Including cities, chambers of commerce, and festival organizers, who use Wadzzo as a dynamic tool to enhance city celebrations, cultural festivals, marketing campaigns, and tourism efforts. We offer a unique \"Pay Per Collect\" model, where organizations pay a subscription based on user engagement with their campaigns. This model provides a cost-effective solution to increase visibility, drive local traffic, and boost awareness through user interaction with digital collectibles tied to real-world locations. End Users: Individuals who opt for a premium subscription gain unlimited access to all brands and campaigns across the platform. This premium model is designed for users who seek a deeper, more extensive interaction with multiple campaigns and wish to take full advantage of the rewards and experiences offered by Wadzzo. The premium subscription enhances the user experience by providing unrestricted access to high-value campaigns and exclusive digital content, making it ideal for avid explorers and collectors.\n\nIn order to generate revenue, we plan on the following: Marketplace Transaction Fees: Charge a small fee for each transaction conducted within the Wadzzo Marketplace. This could include sales, trades, or purchases of digital assets. Implement a tiered fee structure based on the transaction size or asset type to accommodate both frequent small transactions and larger, more valuable exchanges. Premium Subscription Model: Offer a subscription-based model with monthly and yearly plans that provide access to exclusive brand campaigns, high-value digital collectibles, and additional features such as advanced user statistics or enhanced app customization. Develop multiple subscription tiers to cater to different user needs and budgets, potentially offering a trial period to entice sign-ups. Ad Revenue: Generate revenue through in-app advertisements. Partner with brands to promote campaigns directly within the app, driving user traffic to their locations or websites. Use targeted ads based on user activity and preferences to increase engagement and effectiveness, ensuring ads are non-intrusive to enhance user experience. White-Labeled Platform Solutions: Provide a premium service where brands can launch their own branded version of the Wadzzo app, allowing them to create a customized digital engagement platform that operates separately from the main Wadzzo ecosystem. We have secured two customers already with more in discussion. Offer a full-suite service that includes app customization, deployment, and ongoing support. Position this as an enterprise-level solution with a higher pricing model.\n\nAdditional Revenue Strategies: Data Insights and Analytics Services: Offer analytics services to brands, providing insights into user behaviors, campaign performance, and asset engagement within the app. Develop a dashboard for brands to access real-time analytics and insights, available through a subscription or as a one-time service fee. Sponsored Events or Challenges: Collaborate with brands to host sponsored events or challenges within the app, where users can participate in unique, time-limited activities to win prizes. Charge brands a fee for hosting and promoting these events, which can also serve to drive significant user engagement and new user acquisition.\n\nBy focusing on these strategic revenue streams and continuously enhancing our platform, Wadzzo is set to redefine engagement for organizations and end users alike, turning everyday locations into hubs of digital discovery and real-world adventure.",
                        "stellar.teamMembers": "Hannah Rosenbaum, Arnob Dey, Jose Urquiza",
                        "stellar.urls": {
                            "website": "www.wadzzo.com",
                            "videoURL": "https://youtu.be/5lg8GGZ5e8k"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 5000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 46992.83,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-06T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:31",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recuzSoiOe8Bm6FIV",
                    "projectId": "daoip5:stellar:project:study-stellar-sdk-soroban",
                    "projectName": "Study @stellar-sdk & Soroban",
                    "createdAt": "2024-05-31T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recuzSoiOe8Bm6FIV",
                    "fundsApproved": [
                        {
                            "amount": 142066.98,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 15000,
                    "description": "6 Stellar SDK &amp; Soroban Study Group sessions to teach Spanish-speaking students",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Within the WEB3DEV community, a robust network of over 15,000 registered Latin America developers, we propose to conduct a weekly TypeScript Stellar Study Group. Our goal is to attract an average of 25 to 30 participants per session of study, fostering engagement and community-based learning to facilitate developers' entry into the Stellar ecosystem. We will conduct the study group in Spanish.\n\nPrimary Goal: For 3 months we propose to conduct 13 weekly group studies led by an experienced leader in TypeScript Stellar, thereby increasing awareness and engagement for Stellar.\n\nBroader Impact: Facilitate the transition of Latam Web2 developers to Web3, empowering them to utilize Stellar.",
                        "stellar.teamMembers": "piadascripto, piadascripto",
                        "stellar.urls": {
                            "website": "https://github.com/w3b3d3v",
                            "videoURL": "https://github.com/w3b3d3v"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 15000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 142066.98,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Education & Community",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-31T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:32",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recLvmSw4cVbIKjHx",
                    "projectId": "daoip5:stellar:project:stellar-talent-platform",
                    "projectName": "Stellar Talent Platform",
                    "createdAt": "2024-05-30T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recLvmSw4cVbIKjHx",
                    "fundsApproved": [
                        {
                            "amount": 385094.4,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 41000,
                    "description": "Educate, validate, onboard and pay talent on Stellar via techfiesta.dev",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "At EkoLance, we're committed to upskilling and onboarding web3 talent into job opportunities through hackathons, workshops, bounties, and freelance projects. That's why we've pioneered a groundbreaking knowledge and talent platform, called techfiesta.dev, solely dedicated to blockchain expertise. Moreover, we provide a payment gateway that streamlines transactions between companies and talent using native tokens and stablecoins. Our platform, techFiesta.dev, has the following features: On-chain ID and credentials verification, facilitating connections to vetted and high-quality talent. On-chain reward payments (supporting Ethereum, Polygon, and Solana). On-chain distribution of credentials (Soulbound tokens) for each talent action, such as participation in workshops, hackathons, bounties, and challenges, thereby enabling the development of an on-chain CV and reputation. With over 9000 registered users, including 5000+ web3 developers proficient in 70% Solidity and 30% Rust, we've organized more than 30 online hackathons and developer challenges for leading chains like Gnosis Chain, Celo, Solana, and others. What Problem do we solve: With our platform we can easily onboard builders on blockchain protocols, as well as recruit talent for blockchain companies. Our clients (the protocols and companies hiring blockchain talent) can verify and recruit skilled web3 professionals as well as pay them through techfiesta.dev. Our grant objective is threefold: Collaborate with Stellar to onboard developers onto the Stellar Ecosystem through a series of developer challenges (bounties) and hackathons. Facilitate the distribution of on-chain certificates (Soulbound tokens or NFTs) for participation in developer challenges, hackathons, and workshops on the Stellar Blockchain, allowing professionals to authenticate their Stellar experience. Integrate a Stellar Wallet into techFiesta and make possible that professionals are paid in XLM for any work they do via techFiesta.dev.",
                        "stellar.teamMembers": "Maria Eneva-Olms",
                        "stellar.urls": {
                            "website": "https://techfiesta.dev/",
                            "codeRepository": "https://github.com/Ekolance-Official",
                            "videoURL": "https://youtu.be/baZtXu3sqT0"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 41000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 385094.4,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Education & Community",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-30T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:33",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recTRjymkbSHuOlXH",
                    "projectId": "daoip5:stellar:project:trustful",
                    "projectName": "Trustful",
                    "createdAt": "2024-06-21T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recTRjymkbSHuOlXH",
                    "fundsApproved": [
                        {
                            "amount": 538585.33,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "A reputation system using Stellar badges and on-chain data that prioritizes fair cross-community collaboration over wealth.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "What the product is:\n\nThe product consists of a reputation aggregator system that utilizes Stellar badges and on-chain data, prioritizing contribution over plutocracy in DAOs and digital organizations governance, fostering engagement, and encouraging fair collaboration across organizations. The current approach of relying on token ownership for voting and participation has led to decreased community engagement among members. Additionally, individuals are less motivated to join new communities, fearing the time and effort it would take to establish their reputation from the ground up. Trustful is a verifiable and interoperable reputation dApp that addresses these challenges by establishing a framework where contributions as a Stellar community member are acknowledged. This system empowers members to influence the community they are dedicated to, not based only on economic power or tokens they possess but on the level of their commitment and efforts towards the community's future (Valocracy). A pioneering use case in the realm of reputation narrative.\n\nWhat problems it solves, how it solves them, and what audience it solves them for (explain the benefits):\n\nProblems addressed and Solutions:\n\n1. Verifiable track record of past contributions and Valocracy\n1.1 Absence of a history: make your story count and enhance your on-chain reputation with all past collaborations\n1.2 Arbitrariness in role selection decisions: assign roles to those with more knowledge and building experience in specific areas, basing decisions on verifiable reputation – contribution-based role assignment\n1.3 Certain Stellar Badges from the quests are tradable, enabling the badge-earning effort to be bought or sold, essentially invalidating any reputation tracking. Since quests are individual and showcase efforts, the solution would be the “soulbinding” of these badges, preventing the splitting of these efforts and encouraging the community to view them as active participation in the ecosystem rather than assets for buying and selling.\n\n2. Coordination, Interoperability and Modularity\n2.1 Lack of interoperability between ecosystems: portability matters, so take your Stellar reputation forward, participate in other communities, and show them what you've built on Stellar\n2.2 Plutocracy and voting turnout: value valocracy, make your participation and contributions valuable and important; currently, governance tokens lead this front and are still based on monetary power and not always on contribution\n2.3 Bribery: when we have a non-transferable reputation based on our verifiable contributions, bribery becomes harder.\n2.4 Absence of an equitable community currency: a community coin can be created taking reputation into account; economic value may be considered, but reputation can be part of the governance equation\n2.5 Voting system based only on token holdings amount: reputational systems, combined with delegate and time-stamp systems, can lead to a better equitative model for voting systems in digital organizations, by weighting the voting power by who are fit by reputation in the ecosystem, not only the amount of holdings.\n\n3. High-quality community engagement and recognition\n3.1 Lack of engagement: the ease of tracking progress stimulates increased engagement and optimal decision-making based on a unit with high reputation in a specific area\n\nMost importantly, how it works and how it uses Stellar and/or Soroban:\n\nTrustful is divided into two main branches: the badge issuers and the reputation scorers. The Badge Issuer allows the user to attest the ownership of assets they have and activity they’ve done, giving them a second “non-tradable asset”, which carries the necessary standard information for validating the holder’s reputation. For its initial version, Trustful will operate with a limited set of assets to verify, looking only at assets from: Stellar Quests, Soroban Quests, RPCiege, FCA00C, dApp Quests, and Okashi Cakewalk. The Reputation Scorer allows users to determine a list of “badge:multiplier” pairs, where they can determine what matters for their communities and give it the needed weight. Once a Scorer is created, it becomes openly available for anyone to use for checking one or multiple addresses' Reputation Scores against it. For its first version, the Scorers will be limited to checking assets issued on Trustful, with the same scope used for the Badge Issuer.\n\nWhy Stellar?\n\nThe main goal of Stellar is to make “blockchain meets the real world”, unlocking human and economic power. Our product aligns with this by connecting economic power to human efforts, by creating a system that allows organizations to fairly reward community members. With this use case, we position Stellar (a ready ecosystem to implement this use case) as a leader in human coordination within the decentralized space, reinforcing its ecosystem's leadership in the emerging narrative of reputation. “The Stellar Community Fund (SCF) is taking a significant step forward with its collaboration with BlockScience to develop Neural Quorum Governance (NQG).” [Source: https://medium.com/stellar-community/scfs-implementation-of-nqg-on-mainnet-open-source-08ca1656cfc8] – Stellar is also at the forefront of development and advancement in governance, with part of this study and development also involving reputation. The Product Manager from Blockful's team participated in a Blockscience community call to discuss GML and the reputation product (Trustful). With the utilization of Soroban and Stellar Badges, we have a ready-to-go use case to showcase to the decentralized community how aggregated reputation with scores can function for community rewards, governance, participation in open-source projects, and even for DeFi usage (imagine if DeFi protocols, in the future, start requiring lower collateral for loans for those with high reputation?). Stellar offers robust governance tools, enhancing its appeal. Additionally, Soroban's documentation is accessible, and the Stellar community facilitated the efficient creation of this use case. Creating a reputation system will bring the ecosystem of DAOs and governance researches to the Stellar environment, enhancing the range of use cases for the GML – Objective: To bootstrap collaboration on governance modules within and beyond the Stellar ecosystem through an accessible and agnostic library, contributing to a sustainable and representative governance of our digital future. [Source: https://medium.com/stellar-community/the-road-ahead-scfs-implementation-of-neural-quorum-governance-4f44d22fa370] The emerging Stellar ecosystem serves as a hub for experimentation and mutual contributions, enabling us to create new and more innovative use cases with the products already deployed and in use within the Stellar ecosystem.",
                        "stellar.teamMembers": "Daniela  Zschaber",
                        "stellar.urls": {
                            "website": "https://www.figma.com/proto/i5QYp8ljphq5Zdv6BIt5op/Trustful?node-id=1-56&starting-point-node-id=1%3A56",
                            "videoURL": "https://www.youtube.com/watch?v=ng_B0oG9Fzw"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 538585.33,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-21T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:34",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWOr4dRl7ZqEThk",
                    "projectId": "daoip5:stellar:project:vottun-developer-platform",
                    "projectName": "Vottun developer platform",
                    "createdAt": "2024-06-17T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWOr4dRl7ZqEThk",
                    "fundsApproved": [
                        {
                            "amount": 509627.89,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "With the integration of Soroban into the Vottun developer platformWeb2 developers will be able to build Web3 solutions on Soroban",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "At Vottun, we offer a multi-blockchain platform that allows Web2 developers to create Web3 solutions easily and efficiently. We have identified that the fragmented landscape of blockchain networks, coupled with technological complexity, poses a barrier to the adoption of Web3. Therefore, we have developed RestAPIs that enable companies and developers to create Web3 applications without requiring deep knowledge of blockchain coding. Furthermore, at Vottun Ecosystem, users can find a wide range of blockchain templates for various use cases, such as NFTs, certificates, traceability, cryptocurrency payments, and sustainability that have been used by more than 150 big Web2 brands like Mediapro, ChupaChups, Naturgy, Borges, and Grupo Bimbo. We have been recognized with more than 45 international awards and mentions, including selections in Wired as one of the top 100 European startups, and mentions in Gartner reports on blockchain solutions development in 2020, 2021, and 2022, and we also hold the license from the Bank of Spain as providers of cryptoservices for the exchange of virtual currency for fiat currency and for the custody of electronic wallets. The Vottun platform aims to become a dynamic and decentralized online environment where users, developers, and Web3 service providers can collaborate and thrive within the Web3 space. That's why our platform offers various chains tailored to different use-cases. The platform allows developers to interact with the blockchain in an easy way. Developers can manage their smart contracts and blockchain transactions with RestAPIs. Track calls made, manage projects, and collaborate in web3 projects, among other functions are very simple in the platform. Within this environment, developers have the opportunity to upload their own Smart Contracts, which can then be utilized by other developers, generating commissions for their use. Besides the infra/tooling, Vottun’s platform offers an engaging gamified experience for developers so they can have fun and get socially connected with peers that are also new builders in the web3 space.",
                        "stellar.teamMembers": "Marta Valles, Luis Carbajo",
                        "stellar.urls": {
                            "website": "https://web3.vottun.io/"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 509627.89,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-17T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:35",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec72NpAO8hHB3zap",
                    "projectId": "daoip5:stellar:project:stellar-razor-and-blazor-suite",
                    "projectName": "Stellar DotNet Identity Tools",
                    "createdAt": "2024-06-03T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec72NpAO8hHB3zap",
                    "fundsApproved": [
                        {
                            "amount": 469905.38,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-27:grantApplication:36",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-27",
                    "grantPoolName": "scf-27",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec76fMEhXJsMmUWD",
                    "projectId": "daoip5:stellar:project:stellar-time-machine",
                    "projectName": "Stellar Time Machine",
                    "createdAt": "2024-05-24T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec76fMEhXJsMmUWD",
                    "fundsApproved": [
                        {
                            "amount": 436338.65,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 47000,
                    "description": "Elevate institutional treasury management with a time-machine explorer that delivers multi-wallet analytics and risk assessments.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Stellar Time Machine is a next-generation blockchain explorer designed for the Stellar network, offering sophisticated tools for comprehensive treasury analysis. This product includes:\n\nExplorer: Provides a real-time, granular view across multiple wallets, allowing users to drill down into risk drivers and attribution analyses to understand how different assets contribute to overall treasury risk.\n\nMulti-wallet Views: Unlike traditional explorers that focus on single wallets, Stellar Time Machine provides aggregated views across multiple wallets that are essential for users with holdings distributed across different accounts to assess consolidated performance and risk.\n\nRisk Management: Offers institutional-grade risk metrics such as volatility, liquidity, Value at Risk (VaR), Sharpe ratio, drawdowns, hedging, and correlations, enabling users to understand and manage performance and risks effectively.\n\nTraditional blockchain explorers lack depth in historical data analysis and risk management, primarily focusing on current wallet states. Stellar Time Machine addresses these limitations through:\n\nTime-machine View and Historical Balance Reconstruction: Enables users to navigate back in time to see their wallet's state at any given point, allowing for a thorough understanding of historical transactions and balance changes.\n\nMulti-Wallet View vs. Single Wallet View: Offers a comprehensive view across multiple wallets simultaneously, crucial for users managing complex treasuries with funds spread across several wallets.\n\nInstitutional-grade Performance and Risk Metrics: Provides advanced metrics for sophisticated risk management, helping users make informed decisions based on robust data.\n\nThese features make the Stellar Time Machine particularly beneficial for institutional users on the Stellar network, such as payment companies and treasury managers who require detailed analytics and risk assessment tools. Given their focus on institutional use and smart contracts, the Stellar network and Soroban smart-contracts platform are a natural ecosystem on which to build advanced explorer and risk analytics tools like the Stellar Time Machine.\n\nUser Experience and Interface: Stellar Time Machine is designed to provide an intuitive and powerful user experience, focusing on ease of access to comprehensive blockchain data analytics. Users can start by simply entering their Stellar wallet addresses (either Classic or Soroban) into the platform. Once a wallet address is inputted, the system aggregates data across potentially multiple wallets specified by the user, to present a unified view of their assets. This interface allows users to access a wide range of analytical tools. They can perform historical data analyses to view their wallet’s financial history, analyze holdings performance over different timeframes, and assess risk metrics tailored to their holdings. The platform's dashboard is designed for clarity, distilling complex data into digestible visualizations and reports that help users make informed decisions based on their historical and current treasury holdings.\n\nIntegration with Stellar Hubble: To power its extensive data analysis capabilities, Stellar Time Machine leverages Stellar Hubble, an advanced, open-source dataset that hosts a comprehensive historical record of Stellar Classic and Soroban. Hubble is integrated into the platform’s backend architecture and is crucial for processing large-scale analytical workloads and complex data aggregation requests. Unlike real-time transaction systems, Hubble is optimized for handling vast amounts of historical data stored on BigQuery. This setup allows Stellar Time Machine to execute complex queries that are difficult or impossible with other APIs like Horizon, which is optimized for real-time operations but not for historical depth due to its infrastructure constraints. Hubble updates in intraday batches and it compromises slightly real-time data, but it perfectly complements our need to provide deep historical insights without the necessity for immediate transaction data. The use of Hubble allows our application to bypass the storage and performance limitations encountered by traditional Stellar interfaces. It empowers our platform to deliver comprehensive analyses that would typically require pagination or might timeout in other systems. By submitting optimized queries to Hubble, we will retrieve extensive historical data in a responsive and efficient manner, ensuring that users have access to precise information to drive their decision-making processes.\n\nOur company’s track record building institutional-grade digital asset management tools speaks to our deep expertise and commitment to advancing blockchain technology. Our existing products, which integrate with multiple CeFi and DeFi platforms, have been adopted by a diverse range of financial institutions, demonstrating our ability to meet the sophisticated needs of institutional players. This success provides a strong foundation for our proposed Stellar Time Machine, which aims to bring similar capabilities to the Stellar ecosystem. Our team consists of seasoned professionals with extensive experience in blockchain technology, financial analytics, and risk management, particularly within the Stellar network. Our founders and key team members have profound insights into the technical and financial aspects of blockchain applications, positioning us uniquely to develop and adapt our technology for Stellar's institutional users. By leveraging our existing technology and expertise, we are poised to create a tailored solution that enhances the Stellar network's utility and broadens its appeal to a global audience of institutional users. This initiative represents an exciting opportunity to extend our proven solutions to a new platform, and we are eager to begin development upon grant approval. Our commitment to excellence and innovation makes us the ideal candidate to execute this project, ensuring that the Stellar community receives a valuable and strategic tool that enhances treasury management and decision-making processes within the blockchain ecosystem.",
                        "stellar.teamMembers": "Federico Mele",
                        "stellar.urls": {
                            "website": "https://www.genieai.tech/",
                            "videoURL": "https://www.loom.com/share/4e88172973a2453b86d2df83cb0b2a48?sid=bb4ba122-5cc5-44f9-9d8f-ec3d59e2f961"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 47000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 436338.65,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-05-24T00:00:00Z"
                    }
                }
            ]
        }
    ]
}