{
  "@context": "http://www.daostar.org/schemas",
  "name": "Stellar",
  "type": "Foundation",
  "grantPools": [
    {
      "type": "GrantPool",
      "name": "scf-35",
      "applications": [
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:1",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:coalapay-billy-wallet",
          "projectName": "Coalapay Billy Wallet",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Billy Wallet for Aid Assist",
          "status": "Awarded",
          "category": "Applications",
          "description": "Coala Pay will adapt the use of its own wallet, Billy, to facilitate last mile payments. Billy will be brought onto mainnet, and utilize a QR code reconciliation system and vendor network to facilitate payments to Stellar Aid Assist transactions.",
          "fundsApprovedInUSD": 60000.0,
          "fundsPaid": [
            {
              "amount": 20000.0,
              "denomination": "USD"
            },
            {
              "amount": 61845.12,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-12T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://github.com/dorahacker/Billy-Stellar-Wallet",
            "stellar.productsAndServices": "Coala Pay Billy Wallet: brought from Proof of Concept through mainnet to ensure offline capacity, QR code reconciliation system, and relayed with Stellar Aid Assist\n\nStellar Aid Assist: Ability to run offline cash payments that are recorded on chain, and a fully integrated end to end system with Billy",
            "stellar.successCriteria": "-   Coala Pay provides offline reconciliation of group transfers from Stellar’s disbursement platform of 2500-5000$. This offline reconciliation will be faster, less expensive and more efficient than utilizing regular bank transfers, or other forms of money transfers in these environments. This allows for greater financial inclusion in these locations, particularly those receiving humanitarian aid. Performance metrics will be detailed out in a report highlighting these gains.\n    \n-   Billy Wallet is utilized for last mile payments and fully functional end to end system with Stellar integration, and is able to be deployed in additional environments/locations with ease.",
            "stellar.tractionEvidence": "So far with Coala Pay, our clients/users are or will be enabled to do the following, with additional use cases developing regularly:\n\nFund Local Partners\n\nSend grants to local implementing organizations without the delays and costs of traditional banking. Track milestones, automate disbursements, and maintain transparent oversight.\n\nDeliver Cash to Households\n\nManage household cash transfer programs with reduced overhead. Simplify distribution, strengthen verification, and create tamper-proof records of delivery.\n\nHandle Vendor Payments\n\nPay suppliers and service providers without excessive fees or delays. Maintain value despite local currency fluctuations.\n\nCoala Pay in 2024 took on four large NGO clients across three countries, and is rapidly expanding to more countries each month. The payment volume has increased, month on month, since December of 2024.\n\nOffline payments is a logical next step at continued request of our clients/product users.",
            "stellar.goToMarketPlan": "Coala Pay is already working in some of the toughest aid environments. Through enabling Stellar Aid Assist for the last mile, the Billy Wallet (and Coala Pay) can continue to access a variety of different locations and securely and efficiently work in low internet settings across the world. Additionally, client requests for this type of product development will continue to penetrate in both depth and breadth with those clients, as well as introduce possible new markets.",
            "stellar.tranche1Deliverables": "1.  System Planning and Architecture Review\n    \n\nObjective: Define system architecture, development environment, and sprint goals.\n\n-   Design high-level architecture (Smart contracts, Web app, Mobile app).\n    \n-   Define user stories and acceptance criteria.\n    \n-   Define backend reutilization of Stellar Distribution Platform (SDP) for online payments to beneficiaries that own a phone.\n    \n-   Proof of Concept (POC) for setting up Stellar Testnet, Ethereum Testnet, APIs\n    \n-   Establish CI/CD pipeline for continuous testing, security audits and Cloud deployment.\n    \n\n2. Core Blockchain & Identity System\n\nObjective: Implement basic blockchain functionalities and beneficiary identity tracking.\n\n-   Develop Soroban smart contract for NFT-based beneficiary identity.\n    \n-   Implement QR Code generator (mapping NFT Token IDs to beneficiaries).\n    \n-   Develop web app for NFT minting & QR code management.\n    \n-   Integrate with and reutilize the backend of SDP for direct online payments to beneficiaries that own a phone.\n    \n-   Test smart contract minting & retrieval via Horizon API.\n    \n-   Perform unit tests for contract storage & ownership validation.\n    \n\nDeliverables: May 29th, 2025\n\n-   NFT-based beneficiary systems live on Stellar Testnet.\n    \n-   Web interface for minting/testing NFTs.\n    \n-   QR codes linked to blockchain identities.\n    \n\n$25,000",
            "stellar.tranche2Testnet": "1.  Payment & Disbursement System\n    \n\nObjective: Enable offline cash payments while recording transactions on chain. \n\n-   Develop a smart contract to register payments against beneficiary NFTs.\n    \n-   Customize offline Billy app for payment agencies to download list of hashed Ids, scan QR codes, register beneficiary security pin code and record offline payments.\n    \n-   Offline QR payments are encrypted and stored in Billy App (mobile device). When Billy App has internet connectivity, the QR payments are uploaded to the Web App database in batches. Each batch request from Billy App will include the total number of payments and the list of the QR codes. Web API will only respond successfully when the list of transactions received match the total number of transactions in the request. \n    \n-   After successfully receiving the offline payments and storing them in the Web App database, the Web App relayer will connect to the smart contract to register the payments.\n    \n-   Test integration with Stellar Horizon API for transaction verification.\n    \n-   Conduct functional tests for payment recording & reconciliation.\n    \n    Deliverables: June 30th, 2025\n    \n\n-   Payment tracking system deployed on Testnet.\n    \n-   Billy app can scan QR codes & register payments offline.\n    \n-   Web app shows payment history for each beneficiary.\n    \n\n$20,000",
            "stellar.tranche3Mainnet": "1.  Full System Integration & Deployment\n    \n\nObjective: Connect all components & run end-to-end system tests.\n\n-   Integrate mobile, web, and blockchain components.\n    \n-   Check for code quality and efficiency. \n    \n-   Implement security audits ensuring that dependencies are free of known vulnerabilities and use formal verification tools to check for no unauthorized access and that funds cannot be lost or misrouted.\n    \n-   Perform stress testing with high transaction loads.\n    \n-   Conduct UAT (User Acceptance Testing).\n    \n-   Deploy Soroban & Ethereum smart contracts to mainnet.\n    \n-   Deploy web & mobile apps to production.\n    \n-   Final security & performance review.\n    \n\nDeliverables: August 15th, 2025\n\n-   Fully functional end-to-end system on Stellar \n    \n-   Web dashboard, Billy app, and blockchain integrations tested.\n    \n-   Security & compliance checks completed.\n    \n-   Fully operational system deployed on Stellar.\n    \n-   Live tracking of aid disbursements using blockchain.\n    \n\n$15,000",
            "stellar.teamMembers": "KCoala",
            "stellar.urls": {
              "website": "https://coalapay.org/",
              "codeRepository": "https://github.com/dorahacker/Billy-Stellar-Wallet",
              "videoURL": "https://youtu.be/qP2NHA1d6B0"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:2",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:axal",
          "projectName": "Axal",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Stellar x Autopilot integration",
          "status": "Awarded",
          "category": "Applications",
          "description": "Allow users to create DeFi agents that can interact with Stellar ecosystem. These DeFi agents manage crypto across chains, wallets, and dApps.",
          "fundsApprovedInUSD": 60800.0,
          "fundsPaid": [
            {
              "amount": 20266.67,
              "denomination": "USD"
            },
            {
              "amount": 62669.73,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-12T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/document/d/18XfaoqOuvixrCB3qOZr9EaihZVJIAWvio92_SDmjLLo/edit?tab=t.0",
            "stellar.productsAndServices": "Axal Autopilot allows users to create their own DeFi agent to manage their crypto portfolio for them. It has built in chain-abstraction, cross-chain rebalancing, automated yield maximization, yield harvesting, stop losses, and exit parameters. It currently supports Base, Arbitrum, Optimism, Ethereum mainnet, and Solana. This would allow users to access the Stellar ecosystem. It would also include:\n\n-   Stellar-themed index for one click access to top Stellar projects.\n    \n-   Yield agents for the Stellar ecosystem.",
            "stellar.successCriteria": "Total Value Locked (TVL) – The total amount of assets managed by Autopilot. Higher TVL indicates trust, adoption, and strong capital inflows.  \nRevenue & Fee Generation – Income from management fees, yield-sharing, or transaction fees. Customer Acquisition Cost (CAC) – The cost of acquiring a new user, which should decrease over time as word-of-mouth and network effects improve. Customer Lifetime Value (LTV) – The projected revenue per user over their engagement period. Activation Rate – Percentage of users who complete onboarding and allocate assets after signing up.  \nChurn Rate – The percentage of users withdrawing funds and leaving the platform. Low churn signals high retention. Active Users (Daily Active Users – DAU) – The number of users interacting with Autopilot regularly.",
            "stellar.tractionEvidence": "'-   5,000 Autopilot testers during beta period.\n    \n-   $24,000 currently TVL (two weeks post launch; deposits are limited to $50 per person)\n    \n-   Features currently in use: cross-chain rebalancing, copy trading from leaderboard, chain-abstraction, yield maximization across Aave and Morpho, stop and limit orders, yield harvesting.\n    \n-   Hosted podcasts with ~10,000 viewers per episode. Notable guests include Paolo Ardoino: CEO of Tether; Illia Polosukhin: Founder of NEAR; Hart Lambur: Founder of UMA/Across; Jansen Teng: Founder of Virtuals.\n    \n-   10,200 followers on X.\n    \n-   Partnered with Virtuals to launch Gekko AI; $40M market cap reached.\n    \n-   Landed partnerships with Privy, Arbitrum, Coinbase, Movement Labs, Eigenlayer, CowSwap, Privy, Aerodrome, and Agora Finance.\n    \n-   Currently drafting intents-based research paper with Ethereum Foundation and dappRadar.\n    \n-   Accepted and completed SCF Kickstart program.\n    \n-   Currently working closely with Aquarius Finance and Blend for AI Agent integrations.",
            "stellar.goToMarketPlan": "Go-To-Market Plan for Axal Autopilot\n\n#### 1. Target Market\n\n##### Ideal Customer Profile (ICP)\n\nAxal Autopilot is targeting early adopters in the crypto space, specifically:\n\n-   Crypto Prosumer – Individuals who are highly engaged in the crypto ecosystem and actively manage their portfolios.\n    \n-   Crypto-Curious – Those who are interested in decentralized finance (DeFi) but find it complex and time-consuming to manage. These segments are the first movers who will benefit from Autopilot’s automation features and help drive broader adoption through their influence.\n    \n\n#### 2. Problem Statement\n\nOur target customers face two primary challenges:\n\n1.  Time Constraints – Managing multiple assets, blockchains, and decentralized applications (dApps) is cumbersome and requires continuous monitoring.\n    \n1.  Complexity of DeFi – Many potential users find DeFi intimidating and require a more user-friendly entry point. Axal Autopilot addresses these pain points by providing an automated, intuitive portfolio management solution.\n    \n\n#### 3. Distribution Strategy\n\nTo acquire and engage customers, we will employ a mix of high-touch, non-scalable outreach methods alongside scalable growth strategies.\n\nCustomer Acquisition Tactics:\n\n-   Referral Program with Rev-Share Payments – Incentivize early adopters and influencers to promote Autopilot through financial incentives.\n    \n-   B2B Partnerships – Establish integrations and co-marketing efforts with crypto exchanges, wallets, and DeFi platforms.\n    \n-   Sharable PnL Cards with Memes – Encourage users to share their profits and portfolio performance through social media-friendly visual formats.\n    \n-   Whale Program & Direct Whale Outreach – Personalized outreach to high-net-worth crypto traders and liquidity providers.\n    \n-   Institutional Outreach – Engage DAOs, treasuries, and liquid hedge funds interested in automated treasury management.\n    \n-   KOL (Key Opinion Leaders) Partnerships – Leverage crypto influencers and thought leaders to build credibility and drive adoption.\n    \n-   Community-Driven Content & BD – Encourage organic growth through educational content, testimonials, and user engagement campaigns.\n    \n\n#### 4. Offer & Messaging\n\nTo effectively communicate the value of Axal Autopilot, the messaging will focus on the benefits of automation, ease of use, and financial gains.\n\nCore Value Proposition:\n\n-   \"Create Your Own DeFi Agent\" – Empowers users to automate portfolio management with a customized agent.\n    \n-   \"Have an Agent Manage Your Treasury for You\" – Appeals to institutional users who want a hands-off approach to DeFi asset management.\n    \n\nCall-to-Action (CTA):\n\n-   Encourage users to sign up for early access.\n    \n-   Offer a limited-time incentive for first adopters (e.g., fee discounts, early feature access).\n    \n-   Drive engagement through a community-driven reward system (e.g., earning incentives for referring users or sharing performance metrics).\n    \n\n#### 5. Execution Timeline\n\nPhase 1: Pre-Launch (0-3 months)\n\n-   Develop educational content (guides, videos, blogs).\n    \n-   Conduct outreach to whales, DAOs, and institutional partners.\n    \n-   Recruit and onboard key influencers (KOLs) to promote the platform.\n    \n-   Launch referral program and incentivized waitlist signups. Phase 2: Beta Launch (3-6 months)\n    \n-   Open platform access to early adopters and key partners.\n    \n-   Collect user feedback and iterate on features.\n    \n-   Drive social media engagement with performance-sharing campaigns.\n    \n-   Expand B2B partnerships and institutional adoption efforts. Phase 3: Growth & Scale (6+ months)\n    \n-   Expand marketing efforts through broader paid acquisition.\n    \n-   Launch scalable integrations with exchanges and wallets.\n    \n-   Leverage user-generated content and case studies for credibility.\n    \n-   Optimize growth loops within the product to increase organic adoption",
            "stellar.tranche1Deliverables": "#### Deliverable 1: Testing Delegated Actions via Privy and EIP-7702 Integration\n\n-   Brief Description:  \n    Test delegated action support for Stellar intents using Privy and session-based authentication (inspired by EIP-7702), allowing agents to act on behalf of users autonomously after a one-time delegation.\n    \n-   How to Measure Completion:\n    \n    -   Users connect via Privy is working\n        \n    -   Agents can execute Stellar intents without per-transaction signatures\n        \n    -   Secure delegation sessions are established and revoked correctly\n        \n    -   Audit logs show delegated execution trace for verification\n        \n-   Estimated Date of Completion:  \n    1 week from kickoff\n    \n-   Budget:\n    \n    -   3 Engineers × 40 hrs x $90/hour = $10,800\n        \n    -   Ancillary/hosting costs (Privy, Vercel, AWS, RPC) = $4,000",
            "stellar.tranche2Testnet": "#### Deliverable 2: Stellar Yield Agent (Blend & Aquarius)\n\n-   Brief Description:  \n    Develop an autonomous agent that constantly monitors Blend and Aquarius for yield opportunities in XLM and stablecoins, deterministically reallocates to the highest APY pool, and reroutes on TVL drop, volatility, or depegging risk.\n    \n-   How to Measure Completion:\n    \n    -   Real-time data feeds for APY, TVL, and asset health from Blend/Aquarius are working\n        \n    -   Yield agent can make allocation decisions and rebalance\n        \n    -   Health thresholds trigger dynamic rerouting\n        \n    -   Logging dashboard tracks agent decisions\n        \n-   Estimated Date of Completion:  \n    Two weeks after Deliverable 1 (Week 2)\n    \n-   Budget:\n    \n    -   3 Engineers × 80 hrs × $90/hr = $21,600",
            "stellar.tranche3Mainnet": "#### Deliverable 3: Autopilot Integration + Stellar Index\n\n-   Brief Description:  \n    Incorporate Stellar yield agent into Axal Autopilot. Create an on-chain Stellar Index basket on the frontend that users can one-click purchase, abstracting away underlying execution and cross-chain complexity.\n    \n-   How to Measure Completion:\n    \n    -   Stellar yield agent is integrated and ranked alongside Aave, Morpho, Meteora\n        \n    -   Stellar Index appears on Autopilot homepage with basket allocation\n        \n    -   Users can invest in top Stellar projects in one click\n        \n    -   Execution engine supports cross-chain asset flow to Stellar\n        \n-   Estimated Date of Completion:  \n    1 week after Deliverable 2 (Week 4)\n    \n-   Budget:\n    \n    -   3 Engineers × 40 hrs × $90/hr = $14,400\n        \n    -   Security and penetration testing = $10,000",
            "stellar.teamMembers": "Ari Santos",
            "stellar.urls": {
              "website": "https://www.ax.al/autopilot",
              "codeRepository": "https://github.com/getaxal/",
              "videoURL": "https://www.youtube.com/watch?v=EqUEIc3DAEE"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/getaxal",
              "twitter": "https://x.com/getaxal"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:3",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:muwpay",
          "projectName": "MUWPAY",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "MUWP: Cross-Chain Liquidity SDK",
          "status": "Awarded",
          "category": "Applications",
          "description": "MUWP SDK empowers Stellar developers to build cross-chain dApps, handle multiple tokens with ease, and automatically convert them to XLM.",
          "fundsApprovedInUSD": 88850.0,
          "fundsPaid": [
            {
              "amount": 29616.67,
              "denomination": "USD"
            },
            {
              "amount": 111082.54,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-06-09T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://github.com/Muwpay-uniswapper/Muwp-Stellar/blob/main/MUWP-SDK-Stellar-Architecture.md",
            "stellar.productsAndServices": "MUWP is a cross-chain liquidity aggregator and bridging solution that simplifies token swaps and expands interoperability across multiple blockchains. By integrating with Stellar’s DEXes, MUWP enables near-instant conversions into XLM or other Stellar-based assets, creating a more accessible route for liquidity to flow into Stellar. In addition, its advanced swap features accommodate scenarios such as merging multiple tokens into a single token or splitting one token into many, ensuring a flexible experience for users managing diverse asset portfolios. \n\nYou can already try MUWP’s mainnet solution for Stellar via the MUWP DApp or watch our demo video.\n\nWhile building out these functionalities, we identified a broader need for user-friendly cross-chain integrations that can be embedded directly into DApps. Many projects want to attract more liquidity to Stellar and streamline asset swaps without forcing their users to leave the DApp environment.\n\nIntroducing the MUWP SDK\n\nTo address this, we’re developing the MUWP SDK, designed to empower any Stellar-based DApp with seamless cross-chain capabilities. By integrating the MUWP SDK, developers can tap into the multiple liquidity sources and bridging mechanisms we’ve built, turning any DApp into a cross-chain DApp.\n\nThis SCF Build Award is aimed at funding the development of that SDK. Below are the key components:\n\n1.  Multi-Token Swap Mechanism\n    \n    -   How Stellar is Used: Leverages Stellar’s DEX for automatic conversions of accepted tokens (e.g., ETH, USDT) into XLM.\n        \n    -   Impact: Expands payment options for developers, increases network liquidity, and drives additional transactions through Stellar.\n        \n1.  Wallet and Asset Management Tools\n    \n    -   How Stellar is Used: Provides APIs to create and manage Stellar wallets, as well as issue and administer Stellar-based assets.\n        \n    -   Impact: Makes it easier for new projects to join the Stellar ecosystem, helping developers incorporate wallet operations and asset functions right out of the box.\n        \n1.  Soroban Smart Contract Integration\n    \n    -   How Stellar is Used: Allows developers to deploy and interact with Soroban smart contracts for advanced dApp features and financial processes.\n        \n    -   Impact: Unlocks more sophisticated functionalities on Stellar, paving the way for innovative use cases that boost ecosystem growth.\n        \n1.  Cross-Chain Interoperability\n    \n    -   How Stellar is Used: Uses MUWP as a bridge between Stellar and other blockchains for token and data transfers.\n        \n    -   Impact: Positions Stellar as a multi-chain hub, giving developers a broader user base and more liquidity opportunities, ultimately strengthening Stellar’s presence in the decentralized ecosystem.\n        \n\nDeveloper Support & Documentation  \nTo ensure a smooth onboarding experience, we will provide:\n\n-   Comprehensive documentation and tutorials.\n    \n-   Example code snippets for quick implementation.\n    \n-   Ongoing community and technical support through Discord and GitHub.\n    \n\nWith MUWP’s existing cross-chain swap solution live on Stellar and the upcoming SDK, we aim to reduce barriers for developers, streamline cross-chain liquidity, and promote further adoption of the Stellar network.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "Below is an overview of the key points that define the success of the MUWP SDK. These criteria encompass adoption metrics, user satisfaction, and tangible impact on both developer workflows and business operations.\n\n1.  Broad Developer Adoption  \n    We aim to achieve 350 SDK downloads within the first six months of the mainnet launch. This level of uptake demonstrates immediate developer interest, while the long-term benefit lies in cultivating an expanded ecosystem of interoperable dApps that bring new liquidity and users onto Stellar.\n    \n1.  Business Integration & Financial Inclusion  \n    By offering a simplified cross-border payment framework and comprehensive token management features, we reduce operational costs for businesses and promote more accessible financial solutions in emerging markets. Successful integration of MUWP’s SDK in these regions will help underbanked communities tap into blockchain-based services, broadening financial inclusion.\n    \n1.  Time-to-Market Efficiency  \n    Our SDK streamlines development tasks, accelerating the creation of new dApps and simplifying complex technical workflows. This efficiency shortens product launch cycles, frees up resources for innovation, and encourages more teams—both established and emerging—to build on Stellar.\n    \n1.  Active Community Engagement  \n    A strong developer community is essential to sustained growth. We will foster dialogue and collaboration through forums, GitHub, and hackathons. This consistent exchange of ideas fuels new and creative solutions, helping to diversify the range of projects powered by Stellar and the MUWP SDK.\n    \n1.  Measurable Usage Growth  \n    We plan to reach 5,000 monthly API calls by the end of the first year, demonstrating steady, real-world usage. High interaction volumes reflect genuine traction and validate the utility of the SDK for subscription management, cross-chain swaps, and payment workflows.\n    \n1.  Customer Satisfaction  \n    Our target is an 80% or higher approval rating in bi-annual developer and business surveys. Positive feedback is a direct measure of SDK quality and user experience. Meeting or surpassing this threshold ensures that we continuously refine our product, remain responsive to user needs, and maintain strong retention rates.",
            "stellar.tractionEvidence": "We have built MUWP across non-EVM networks like Aptos, Partisia, Solana, and Stellar, as well as EVM-compatible blockchains such as Polygon, BSC, Avalanche, Base, Optimism, and Arbitrum. This cross-chain breadth demonstrates our capacity to develop scalable, innovative, and impactful products that capitalize on each ecosystem’s strengths, with particular expertise in interoperability and multi-token management.\n\nA recent survey in October 2024 involving 87 developers, blockchain professionals, and businesses from the USA, France, Luxembourg, and Turkey revealed that 75% faced challenges integrating non-Stellar tokens and 80% sought a more straightforward method for multi-token management and cross-chain transactions. These insights confirm the growing need for the MUWP-Stellar Multi-Token Cross-Chain SDK.\n\nOur existing MUWP DApp already runs on the Stellar mainnet, having garnered more than 2,100 page views in the past year and recording 37 swaps in November alone, underscoring early traction and user interest. Beyond Stellar, MUWP integrates 59 DEXs and 44 bridges, making cross-chain swaps more affordable and efficient for diverse blockchain users. This network of connections positions MUWP as a one-stop platform for streamlined transfers and enhanced liquidity.\n\nIndustry recognition further validates our approach. We were selected by 50 Partners, a French VC-led incubator offering high-level mentorship, and we also joined the Chainlink Build Program, which improves our infrastructure for decentralized oracles and cross-chain security. Within the Stellar ecosystem specifically, we have already incorporated Stellar’s DEX for optimizing liquidity flow, begun leveraging Soroban smart contracts for cross-chain transactions, and simplified token issuance and conversion for new Stellar projects.\n\nOur successful deployments on Solana and Aptos highlight our technical depth and ability to adapt to unique blockchain architectures. On Solana, we integrated high-performance liquidity pools to accelerate transaction speeds for cross-chain swaps, and on Aptos we created custom tools and modular SDK components to streamline multi-token swaps in a parallel execution environment. These achievements underscore our commitment to crafting efficient, developer-friendly infrastructure that can likewise benefit the Stellar ecosystem.\n\nBy securing the SCF Build Award, we can enhance our SDK, reduce integration hurdles for developers, accelerate multi-token adoption on Stellar, and significantly expand cross-chain liquidity entering the network. Our track record proves our ability to deliver on these promises with technical excellence, making MUWP an asset not just to Stellar, but to the broader blockchain landscape.",
            "stellar.goToMarketPlan": "1.  Month 1 (after mainnet) – Launch Campaign  \n    The initial focus is to build visibility and bring on early adopters. We will announce the SDK release via social media, Stellar forums, and targeted email campaigns, ensuring the news reaches both existing Stellar communities and broader blockchain circles. Detailed tutorials, documentation, and example code will be published on GitHub and Stellar’s developer portal to help teams get started quickly. A live launch webinar will walk participants through the SDK’s core features, providing an interactive forum for Q&A and early feedback.\n    \n1.  Months 2–3 (after mainnet) – Developer Engagement  \n    In this phase, the priority is to spark developer interest and gather real-world insights. We will host a hackathon with prizes for the most creative or impactful uses of the SDK, fueling experimentation and fresh ideas. Real-time support will be offered through Discord and GitHub issues to address developer questions and facilitate rapid troubleshooting. Additionally, a small grant program will reward teams that build meaningful dApps using MUWP, lowering barriers to entry and accelerating SDK adoption.\n    \n1.  Months 4–5 (after mainnet) – Partnership Building  \n    Next, we will cultivate partnerships throughout the Stellar ecosystem, engaging wallets, exchanges, and payment platforms to create seamless experiences that leverage MUWP’s multi-token swap and cross-chain features. We will also explore cross-chain collaborations outside Stellar to demonstrate how bridging liquidity and assets can boost project growth. By co-marketing solutions with early adopters, we will showcase tangible use cases and highlight the SDK’s potential to increase user satisfaction and unlock new revenue streams.\n    \n1.  Month 6 (after mainnet) – Adoption Scaling  \n    As the user base grows, the goal is to widen our reach, particularly in emerging markets where blockchain solutions can bring considerable value. We will approach SaaS and fintech providers to demonstrate how MUWP can streamline cross-border transactions and reduce operational costs. Case studies of successful integrations will be published to illustrate ROI and best practices. A referral program will provide financial or promotional incentives for developers and businesses to recommend the SDK, solidifying its position as a go-to cross-chain solution within and beyond the Stellar ecosystem.",
            "stellar.tranche1Deliverables": "#### Deliverable 1: Core SDK Development\n\n-   Description: Develop the foundational SDK, including wallet creation, asset management, and integration with Stellar's DEX.\n    \n-   How to Measure Completion:\n    \n    -   Functional APIs for wallet creation and asset issuance.\n        \n    -   Asset management workflows tested and documented.\n        \n    -   Integration example demonstrating Stellar DEX usage.\n        \n-   Estimated Completion Date: May 14th, 2025.\n    \n-   Budget Allocation: $17,504\n    \n\n#### Deliverable 2: Multi-Token Swap Prototype\n\n-   Description: Integrate Muwp’s multi-token swap functionality to enable acceptance of non-Stellar tokens and conversion to XLM.\n    \n-   How to Measure Completion:\n    \n    -   Prototype that supports swapping at least two non-Stellar tokens into XLM.\n        \n    -   Internal tests with performance reports shared.\n        \n-   Estimated Completion Date: June 15, 2025.\n    \n-   Budget Allocation: $16,072",
            "stellar.tranche2Testnet": "#### Deliverable 3: Soroban Smart Contract Integration\n\n-   Description: Extend the SDK with Soroban-based smart contract functionality for managing recurring payments and custom logic.\n    \n-   How to Measure Completion:\n    \n    -   Functional APIs for subscription workflows using Soroban contracts.\n        \n    -   Comprehensive documentation and example integrations.\n        \n-   Estimated Completion Date: July 18th, 2025.\n    \n-   Budget Allocation: $19,671\n    \n\n#### Deliverable 4: Cross-Chain Interoperability Testing\n\n-   Description: Test cross-chain functionalities using Muwp, enabling seamless token transfers between Stellar and Ethereum (or Solana).\n    \n-   How to Measure Completion:\n    \n    -   Successful test transactions on testnet with cross-chain bridges.\n        \n    -   Testing reports and stress-testing documentation.\n        \n-   Estimated Completion Date: August 20, 2025.\n    \n-   Budget Allocation: $17,790",
            "stellar.tranche3Mainnet": "#### Deliverable 5: SDK Launch on Mainnet\n\n-   Description: Deploy the final SDK version on Stellar’s mainnet, including all features from MVP and Testnet.\n    \n-   How to Measure Completion:\n    \n    -   Public SDK release on GitHub with comprehensive documentation.\n        \n    -   Live demonstration of a functional project using the SDK.\n        \n-   Estimated Completion Date: September 20, 2025.\n    \n-   Budget Allocation: $17,813",
            "stellar.teamMembers": "Gaël BOKONGO, Abongi-Gael Bokongo",
            "stellar.urls": {
              "website": "https://www.muwpay.com/",
              "codeRepository": "https://github.com/Muwpay-uniswapper/Muwp-Stellar/tree/main",
              "videoURL": "https://drive.google.com/file/d/1AWN90_liwCLBtnbZRb-jGE4OIh-FhPHA/view"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/muwpay/",
              "twitter": "https://twitter.com/muwpay",
              "discord": "https://discord.gg/wmZUxJtuad"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:4",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:abroad",
          "projectName": "Abroad",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Instant payments on Pix with USDC",
          "status": "Awarded",
          "category": "Applications",
          "description": "Infrastructure for payments interoperability between USDC on stellar and Pix in Brazil. Any Stellar wallet will be able to make payments in any Pix QR code across the country.",
          "fundsApprovedInUSD": 93700.0,
          "fundsPaid": [
            {
              "amount": 31233.33,
              "denomination": "USD"
            },
            {
              "amount": 121226.13,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-06-13T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://drive.google.com/file/d/1qmO-d3SWF14JpgLatddjHMNsTT5Gx9t6/view",
            "stellar.productsAndServices": "Products:\n\n-   Open-Source Payment infrastructure for any wallet to interact with USDC on Brazilian RTP system PIX. Wallet's users will be able to On/Off ramp USDC to BRL seamlessly by scanning QR Pix Codes anywhere in Brazil.\n    \n-   Dashboard for seamlessly treasury management in which users can make transactions without technical knowledge and with a few clicks. OTC operators will be able to disperse money from USDC to BRL and COP (Previously Developed)\n    \n\nServices:\n\n-   Collaborative sessions with Wallets for a better UX with an improved flow of funds.\n    \n-   Consultancy for technical integration to reach global money movement.",
            "stellar.successCriteria": "By orchestrating payments between USDC and BRL, we will open new alternatives for money movement and wallets will offer a better experience for transferring money. Our main success criteria for this stage will be to be able to integrate with at least 5 wallets and allow everyone at Meridian 2025 to Pay anywhere in Brazil with its favorite Stellar wallet. By launching our infrastructure, any wallet will be able to be ready and offer in-person payments anywhere in Brazil, and to start getting transactional movement is one of the most important traction validation we can get, which demonstrate success for our project and the real capacity and utility of Stellar as the Blockchain for Payments.",
            "stellar.tractionEvidence": "https://docs.google.com/document/d/1H1uUqM0q1qDK7teh4sDa0q8Et2eGOmwlg50UIRZ_4OM/edit?usp=sharing",
            "stellar.goToMarketPlan": "Our strategy aligns with Stellar plans to strength its presence in Emerging countries. Therefore, our GTM focuses on strategic partnerships and developer-centric adoption. We first integrate with high-impact wallets (Decaf, Beans, Vibrant, LOBSTR, Meru, Zypto, Cinko, Peer, AirTM), fintechs, and neobanks in target markets like Colombia and Brazil, leveraging existing payment rails (Nequi, PIX) to demonstrate instant stablecoin-to-fiat capabilities. This approach ensures rapid integration, builds credibility, and accelerates network growth without extensive merchant onboarding.  \n  \nOur most important strategy on this stage will be to deploy a marketing campaign during Meridian 2025. In which, Stellar wallets with Abroad Technology integrated will be featured on ads that will activate new users and will make them to make payments through our cardless infrastructure.",
            "stellar.tranche1Deliverables": "Deliverable #1: We need to keep developing our payment infrastructure with support for more fiat currencies.  \nDescription: Connect with Payment providers in order to interact with the PIX network in Brazil.\n\nHow to mesure completion:  \n- Developing the business with payment providers in Brazil.  \n- Defining the flow of the money.  \n- Defining the technical integration roadmap for the solution to work in Brazil.  \n- Agreeing the technical integration with partner wallets to deploy in Brazil.  \n- Integrating USDC>BRL currency conversion into Abroad System.  \n- Updating the API services with the new BRL currency.  \n- Integrating SEP-24 compatibility (Requested by Beans Wallet)\n\nEstimated date of completion: August, 2025.  \nBudget: $47.900\n\nDeliverable #2:  \nNow that infrastructure is developed and operational, we can start creating products to easily manage funds and make transactions.\n\nDescription: Treasury software management for clients looking to use the system capabilities manually, without technical integration or development.\n\nHow to mesure completion:  \n- Software development of a Dashboard in which an user can register its business and use transaction capabilities from USDC to different currencies.  \n- KYB API integration for automated compliance when onboarding an entity.  \n- KYB onboarding interface for automated compliance.  \n- External Wallet read functionality for easy interaction and money movement.  \n- Dashboard for self-managed API & Integration processes.\n\nEstimated date of completion: August, 2025.  \nBudget: $27.100",
            "stellar.tranche2Testnet": "Deliverable #1: Test the development for payment orchestration.  \n  \nHow to measure completion:  \n- Testing a transfer from USDC to BRL via PIX.  \n- Fixing bugs and errors.  \n  \nDeliverable #2: Testing for management tool.  \n  \nHow to measure completion:  \n- Allowing invited users to test the dashboard to find errors or bugs.  \n- Fixing bugs and errors.  \n  \nEstimated date of completion for both deliverables: End of August, 2025.  \nBudget: $9.250",
            "stellar.tranche3Mainnet": "Deliverable #1 : Launch payments from USDC on Stellar to PIX on Stellar Mainnet.  \n  \nHow to measure completion:  \n- Launching the solution on Stellar Mainnet.  \n- Successfully orchestrating payments between stellar wallets and Pix in Brazil.  \n- Integration with Stellar Wallets.  \n  \nDeliverable #2 : Launch the platform dashboard for non-technical management.  \n  \nHow to measure completion:  \n- Launching the treasury dashboard for non-technical users, allowing them to seamlessly connect their wallet and move money between Stablecoins and fiat currencies with a few clicks.  \n  \nEstimated date of completion: Beginning of September 2025, before Meridian 2025.  \nBudget: $9.450",
            "stellar.teamMembers": "Esteban Quintero, Hollwann Leon",
            "stellar.urls": {
              "website": "https://abroad.finance",
              "codeRepository": "https://github.com/abroad-finance/abroad",
              "videoURL": "https://youtu.be/eEW-55md2yE"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/getabroad/",
              "discord": "https://discord.gg/aSw3QN95"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:5",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:utoken-upesa",
          "projectName": "Utoken (Upesa)",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Utoken [Phase 2]",
          "status": "Awarded",
          "category": "Applications",
          "description": "Self-custody digital wallet that leverage local stablecoin to foster secure, low-cost, instant payment for individuals and businesses.",
          "fundsApprovedInUSD": 31600.0,
          "fundsPaid": [
            {
              "amount": 21066.67,
              "denomination": "USD"
            },
            {
              "amount": 74296.99,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #1 - MVP",
          "mostRecentPaymentDate": "2025-07-08T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://workdrive.zohopublic.com/writer/open/oye8u82f7842b922d4bbeb549e45fde7f9269",
            "stellar.productsAndServices": "Utoken is a self-custody digital wallet powered by local stablecoins on Stellar, like USDC and EURC, integrated with traditional payment rails like mobile money and bank transfers to offer seamless payment for individuals and businesses.\n\nThrough SCF, we will be supporting:\n\n1.  Direct payment with USDC & EURC into local banks in EU countries and the USA\n    \n1.  Escrow payment for freelancers and businesses offering digital services\n    \n1.  Support for more local stablecoins e.g eKsh in Kenya\n    \n1.  EURC & USDC deposits from other blockchains",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "1.  The total number of users onboarded and the equivalent number of wallets created. We are targeting 50k to 100k+ users before the end of the year 2025.\n    \n1.  Volume of transactions processed daily, weekly, and monthly. We are targeting over $1M in transaction volume monthly by Q4 2025.",
            "stellar.tractionEvidence": "1.  Participated in Stellar Startup Camp 2024\n    \n1.  We have built an MVP (a mobile app) that supports secure bill payment, direct payment with USDC and EURC (iOS: https://apps.apple.com/us/app/utoken-app/id6480348587, Android: https://play.google.com/store/apps/details?id=network.utoken.app&hl=en)\n    \n1.  We have implemented direct payment into traditional banks in Nigeria\n    \n1.  We have implemented top-ups and withdrawals with our crypto-funded debit card and bank transfers (currently available in Nigeria)",
            "stellar.goToMarketPlan": "Referral program: We will start with the referral program, which has been built into the app to allow people to earn by onboarding new users on the platform. This feature is important to explore the P2P transfer available on the app. This is our first line of action on distribution.\n\nInfluencer Marketing: The influencer marketing approach will leverage the referral program in place to onboard more users by working with content creators and influencers on platforms like Instagram to onboard users through referral and live streams to showcase the functionalities available on the app.\n\nTalent Accelerators: Our collaboration with talent accelerators like the 3MTT program in Nigeria and AyaHQ will expose us to thousands of technical talents who are currently upskilling to offer digital services across the globe. Our goal is to support these developers at the early stage to create the connection to use the platform as part of the requirement to get technical support like data subscriptions, etc.\n\nIn-app reward: This will be targeted at the users to foster continuous use of the app for peer-to-peer payment, payment into local banks, card payment, and use of the marketplace.",
            "stellar.tranche1Deliverables": "Our MVP deliverables will focus on the integration of stablecoin to fiat currency features and handling stablecoin deposits or withdrawals from other blockchains.\n\nDeliverable 1: Enabling crypto to local bank transfer\n\n1.  Description: We will be integrating with existing traditional switching providers to provide seamless settlement of transactions between local stablecoins and traditional payment rails in Europe and the USA\n    \n1.  Measuring completion: Users will be able to top up, withdraw, and make payments with local bank transfers on the mobile app on Android and iOS.\n    \n1.  ToC: The application will be available 3 weeks from first funding\n    \n1.  Budget: $10,000\n    \n\nDeliverable 2: Integration with Circle CCTP\n\n1.  Description: We will be developing a cross-chain deposit feature that will allow a user with a supported stablecoin like USDC on a different blockchain to access the functionalities we provide on Stellar.\n    \n1.  Measuring completion: Users will be able to deposit USDC and EURC from chains like Arbitrum, Aptos, Arbitrum, Avalanche, Base, OP Mainnet, Polygon PoS, and Solana.\n    \n1.  ToC: The feature will be available 2 weeks after deliverable 1\n    \n1.  Budget: $4,800",
            "stellar.tranche2Testnet": "Deliverable 3: Developing mini-service marketplace and integrating escrow\n\n1.  Description: We will be working with the Trustlesswork (https://www.trustlesswork.com/) escrow platform and developing our mini-service marketplace so users can access secure payment with escrow on the embedded service marketplace.\n    \n1.  Measuring completion: The escrow functionality will be available to users on our app for testing in Apple Testflight and Android Store\n    \n1.  ToC: The functionality will be available 3 weeks after deliverable 2\n    \n1.  Budget: $7,200",
            "stellar.tranche3Mainnet": "Following Trustlesswork's launch in May we will switch to mainnet and completion of previous deliverables\n\nDeliverable 4: Final integration and beta testing\n\n1.  Description: We will be testing all the functionalities developed by working with a small number of users to test the app and give their feedback\n    \n1.  Measuring completion: The mobile app with top-up and withdrawal with local bank transfers in the USA and EU, service link sharing, contract management, service listing, etc., will be available publicly for download on Google and Apple app stores\n    \n1.  ToC: The fully functional app will be available in production mode 4 weeks after deliverable 3\n    \n\nBudget: $9,600",
            "stellar.teamMembers": "Boyejo Oluwafemi, jomoflash, rayking1.",
            "stellar.urls": {
              "website": "https://www.utoken.network/",
              "codeRepository": "https://writer.zoho.com/writer/open/33tfib168cca0f0204ffb87a877307d4ca729",
              "videoURL": "https://youtu.be/brDR5sfOFLo"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/utoken-app",
              "twitter": "https://x.com/UtokenApp"
            }
          },
          "completionPercentage": 33.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:6",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:airgap",
          "projectName": "AirGap",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "AirGap x Stellar : Secure Self Custody",
          "status": "Awarded",
          "category": "Applications",
          "description": "Integrate Stellar into AirGap to help users securely store and transact XLM with airgapped security &amp; advanced self-custody features.",
          "fundsApprovedInUSD": 60000.0,
          "fundsPaid": [
            {
              "amount": 20000.0,
              "denomination": "USD"
            },
            {
              "amount": 68592.8,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-21T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://vintage-collarbone-cd8.notion.site/Technical-Architecture-1a5e7d273f4080cb884ad48e2ca19f24?pvs=4",
            "stellar.productsAndServices": "AirGap will integrate Stellar into its self-custody wallet, enabling users to securely manage XLM and Stellar-based assets with offline signing. \n\n-   AirGap Vault: Allows users to generate and store Stellar private keys in an air gapped environment, ensuring maximum security. \n    \n\n-   AirGap Wallet: Enables Stellar transactions with offline signing, preventing online exposure of private keys. \n    \n\n-   airgap-coin-lib Support: Stellar integration in our open-source library will empower developers to build on Stellar with secure, offline-first tooling.",
            "stellar.successCriteria": "All Stellar users will be able to create a cold wallet setup at home using any spare device. Apart from this, we expect -\n\n-   5,000+ new Stellar wallets created in AirGap - Expands self-custody adoption on Stellar. \n    \n\n-   Increased Stellar transactions via AirGap - Enhances network activity and user engagement. \n    \n\n-   Secure storage for Stellar and Stellar tokens - Users can safely store, send, and receive assets with full self-custody. \n    \n\n-   Advanced security features - Users benefit from Social Recovery, BIP-85 deterministic seed derivation, BIP-39 passphrase protection, and verifiable randomness via coin flip and dice roll. \n    \n\n-   High retention rate of new users - This ensures long-term adoption beyond initial onboarding.",
            "stellar.tractionEvidence": "AirGap has established itself as a trusted self-custody solution with over 200,000+ downloads across AirGap Wallet and AirGap Vault. Our growing community includes 23,000+ members, actively engaging with our open-source ecosystem. \n\nWe have secured grants from Polkadot, ICP, Optimism, Tezos, and Cosmos, reflecting strong recognition and support from major blockchain ecosystems. This traction highlights AirGap’s reliability, security, and adoption as a go-to solution for decentralized asset management.",
            "stellar.goToMarketPlan": "#### Guides & Educational Content \n\n-   Publish in-depth guides and blog posts explaining using AirGap for Stellar transactions and self-custody. \n    \n-   Create video tutorials demonstrating Stellar integration, secure signing, and staking. \n    \n\n#### Social Media Marketing \n\n• Organize AMAs (Ask Me Anything) sessions with the AirGap and Stellar communities to answer questions and showcase benefits. \n\n• Run giveaways and engagement campaigns to incentivize users to try the integration. \n\n#### Launch Announcements \n\n• Official announcements across AirGap’s and Stellar’s social channels (Twitter, Discord, Telegram). \n\n• Press releases and blog posts highlighting the security and usability advantages of AirGap for Stellar users.",
            "stellar.tranche1Deliverables": "Stellar Integration in AirGap CoinLib & AirGap Vault\n\nDeliverable 1: AirGap CoinLib ($15,000)\n\nAirGap follows a modular architecture, with airgap-coin-lib serving as the foundational layer for integrating new blockchains. It handles the core transaction logic—constructing raw transactions (including inputs, outputs, fees, and memos), defining how transactions are cryptographically signed using private keys, and implementing the network communication needed to broadcast signed transactions to the blockchain.\n\n-   Addition of Stellar in AirGap Coinlib library\n    \n-   Anyone can integrate Stellar in their wallet using AirGap coinlib\n    \n-   AirGap will use this to integrate Stellar to Vault \n    \n\nDeliverable 2: AirGap Vault: ($15,000)\n\nUse airgap coin-lib to integrate stellar to AirGap Vault\n\n-   Enable air-gapped signing for Stellar transactions in AirGap Vault. \n    \n-   Allow users to securely generate and store Stellar private keys. \n    \n-   Provide offline verification and signing of XLM transactions before broadcasting.\n    \n-   Enable Stellar account creation using additional device entropy(Gyro, camera, microphone and touch) , dice roll and coin flip entropy.\n    \n\nTotal Tranche Budget - $30,000",
            "stellar.tranche2Testnet": "Stellar Integration in AirGap Wallet\n\nDescription: \n\n-   Implement support for creating and broadcasting Stellar transactions from AirGap Wallet. \n    \n\n-   Provide a seamless experience for users to manage their XLM holdings. \n    \n-   Users can securely store, send, and receive Stellar assets in AirGap Vault & Wallet.\n    \n\nEstimated Completion: 10 weeks from grant approval \n\nTotal Tranche Budget - $20,000",
            "stellar.tranche3Mainnet": "Token additions, enabling WalletConnect for Stellar on AirGap Wallet \n\nDescription:\n\n-   Addition of top 5 Stellar tokens by market cap. USDC, EURC, VELO, SHX, AQUA. \n    \n\n-   Users will also be able to connect AirGap Wallet to Stellar Dapps using Wallet Connect.\n    \n-   Additional Bug Fixes\n    \n-   Launching the final product on Apple App store, Google Play store and GitHub\n    \n\nEstimated Completion: 6 weeks after MVP milestone \n\nTotal Tranche Budget: $10,000",
            "stellar.teamMembers": "Ashish Kumar",
            "stellar.urls": {
              "website": "https://airgap.it",
              "codeRepository": "https://github.com/airgap-it",
              "videoURL": "https://www.youtube.com/watch?v=OaYiXsD2sQ8&t=19s",
              "pitchDeck": "https://www.canva.com/design/DAFMNqTAPpM/yLi2EK6xExKdb6OJJ6gXDA/view?utm_content=DAFMNqTAPpM&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=hf590c061b6"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/airgap/",
              "twitter": "https://x.com/AirGap_it",
              "discord": "https://discord.gg/4Senj3xZ5s"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:7",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:reyts---stablecoin-powered-p2p-fiat-dex",
          "projectName": "Reyts - Stablecoin-Powered P2P Fiat DEX",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Building a P2P Fiat DEX on Stellar",
          "status": "Awarded",
          "category": "Applications",
          "description": "Developing a Stellar-based P2P fiat DEX to remove accessibility barriers for underserved currencies and offer best-in-market fees.",
          "fundsApprovedInUSD": 75000.0,
          "fundsPaid": [
            {
              "amount": 25000.0,
              "denomination": "USD"
            },
            {
              "amount": 83135.89,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #1 - MVP",
          "extensions": {
            "stellar.technicalArchitecture": "https://shimmer-process-0ba.notion.site/Reyts-Stellar-Block-Chain-Upgrades-Technical-Architecture-1c79b7253112800ea2cfc5401d5ec683",
            "stellar.productsAndServices": "🔄 Enhanced Currency Swaps\n\nReyts will use Stellar’s Path Payment Strict Send to automatically complete currency swaps when no peer match is found within a set time window (e.g., 30 minutes). This ensures users can still exchange at their chosen rate using Stellar's built-in liquidity.\n\nStellar in action:  \nA user places a CAD→NGN swap. If no match is found, Reyts routes the transaction through Stellar’s decentralized exchange using Path Payment, fulfilling the swap at the requested rate with available liquidity.\n\nA Soroban smart contract will monitor pending swap listings, and if a listing goes unmatched for a set period (e.g., 30 minutes), it triggers the fallback logic. The contract checks price conditions, validates rate limits, and initiates the Path Payment if criteria are met — all without human intervention.\n\nImpact:  \nThis reduces wait times from hours to minutes, giving users a more reliable, seamless swap experience without changing how they use the app.\n\n-  \n\n💧 Decentralized Liquidity Pools\n\nReyts will leverage Soroban smart contracts to introduce automated liquidity pools, allowing vetted liquidity providers to contribute CAD and NGNC for swaps. These pools will follow AMM logic, automatically determining prices and executing trades.\n\nStellar in action:  \nWhen a user initiates a swap, the system checks for peer matches. If none exist, it draws from Soroban-powered liquidity pools. Liquidity providers earn fees from every transaction they help fulfill.\n\nImpact:  \nMore liquidity means fewer failed swaps, faster transactions, and greater user confidence — especially for less common exchange pairs like CAD↔NGN.\n\n-  \n\n✅ Compliance Automation\n\nReyts already enforces strict KYC/AML checks off-chain. As users begin to interact more directly with wallets, Stellar’s built-in compliance tools and Soroban will help enforce rules on-chain.\n\nStellar in action:  \nSoroban smart contracts can restrict access to Reyts-issued assets unless a wallet meets verified compliance conditions (e.g., KYC flags or allowlists).\n\nImpact:  \nThis ensures that even as Reyts moves toward decentralization, it remains fully compliant — with less manual overhead and more automation, supporting growth into new regulated markets.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "1. Seamless Stellar Integration  \n– Real-time fiat swaps executed using Path Payment Strict Send, Soroban, and Horizon, fully abstracted from users.  \n– Users continue transacting in fiat — no wallets, no stablecoin handling required.  \n📍 Milestone: 100% of eligible swaps processed via Stellar within 90 days of mainnet.  \n🕓 Performance Shift: Wait times drop from hours to under 5 minutes via automatic fallback.  \n🟢 Impact: Faster, more reliable swaps with zero user learning curve — essential for trust in underserved markets.\n\n-  \n\n2. Mainnet Stablecoin Swap Launch  \n– Integrate ReytsCAD/QCAD, USDC, and cNGN with at least 1,000 successful CAD→NGN swaps on Stellar by end of Q4.  \n📍 Milestone: Stablecoin activity live on Stellar Expert with 3+ trading pairs.  \n🟢 Impact: Expands liquidity for underserved currencies and reduces remittance dependency.\n\n-  \n\n3. Improved Speed & Cost  \n– Reduce swap fees from $3–$6 or 0.5% to $3 flat or 0.1%.  \n– Cut transaction time from minutes to <5 seconds.  \n📍 Milestone: 80% of swaps settle in under 5 seconds within the first quarter post-launch.  \n🟢 Impact: Enables fast, affordable micro and macro transactions — lowering barriers to access for everyday users.",
            "stellar.tractionEvidence": "Kindly follow the link below to review our traction evidence with live stats.\n\nReyts Traction Evidence\n\nShould the link above fail, kindly follow the link below\n\nBack Up Link To Reyts Traction Evidence",
            "stellar.goToMarketPlan": "✅ Go-To-Market Plan\n\nFor context:  \nReyts is already live, processing thousands of dollars in P2P swaps each week, with over ₦450M+ exchanged since launch. Completing our planned upgrade with the Stellar Network will unlock a major leap in efficiency, liquidity access, and transaction speed — resulting in a seamless and dramatically improved user experience.\n\nOur go-to-market strategy builds directly on our active user base and community-first model. Here's how we’ll roll it out:\n\n-  \n\n📍 Phase 1: Backend Upgrade (Weeks 1–4)\n\nGoal: Seamlessly integrate Stellar infrastructure (Path Payment, Horizon, Soroban) without disrupting the user experience.\n\n-   Launch swap engine upgrade behind the scenes\n    \n-   Users continue swapping CAD and NGN with no visible change\n    \n-   Backend gains instant fallback capability and blockchain transparency\n    \n\n🟢 Impact: Immediate performance upgrade, no learning curve\n\n-  \n\n📍 Phase 2: User Messaging + Stablecoin Incentives (Weeks 5–6)\n\nGoal: Let users know things are faster, cheaper — and offer perks for early adopters of stablecoins.\n\n-   In-app popups and WhatsApp messaging:  \n    “Swaps are now 90% cheaper and nearly instant — powered by Stellar. You don’t have to change a thing.”\n    \n-   Launch rewards for users who opt to send/receive in ReytsCAD, USDC, or cNGN\n    \n\n🟢 Impact: Gradual user-led stablecoin adoption without confusion\n\n-  \n\n📍 Phase 3: Anchor Activation & Ecosystem Alignment (Weeks 7–10)\n\nGoal: Enable real fiat on/off ramps and drive awareness within Stellar’s ecosystem.\n\n-   Go live with Busha (cNGN) and Stablecorp (QCAD) integrations\n    \n-   Circle (USDC) integration follows\n    \n-   Coordinate ecosystem announcements, SCF updates, Discord AMAs, and social proof\n    \n\n🟢 Impact: Expands Reyts’ utility and trust within Stellar’s global community\n\n-  \n\n📍 Phase 4: Liquidity & Growth Loops (Ongoing)\n\nGoal: Ensure swaps always execute — and empower the community to spread adoption.\n\n-   Seed liquidity pools across key corridors (CAD↔USDC, USDC↔cNGN, ReytsCAD↔cNGN)\n    \n-   Onboard vetted LPs and automate market making logic\n    \n-   Scale our WhatsApp referral engine: reward users who bring others into Stellar-powered swaps\n    \n\n🟢 Impact: Sustainable liquidity and organic growth at scale\n\n-  \n\n🧠 Channels & Leverage Points\n\n-   WhatsApp: Our most engaged users are here — messages see 70–90% open rates\n    \n-   In-App Messaging: For timely updates and reward notifications\n    \n-   Telegram + Discord: For reaching crypto-savvy users and community advocates\n    \n-   SCF & Ecosystem Events: Partner AMAs, newsletter features, community demos\n    \n\n-  \n\n🚀 Expected Results (First 6–12 Months)\n\n-   2× increase in average monthly swap volume\n    \n-   Over 20,000 swaps processed via Stellar\n    \n-   Over $50,000+ in user savings due to reduced transaction costs\n    \n-   Active usage of ReytsCAD/QCAD, cNGN, and USDC stablecoins in swaps\n    \n-   Fully integrated anchors for fiat access in Canada and Nigeria",
            "stellar.tranche1Deliverables": "#### ✅ Tranche 1 – MVP: Stellar Integration & Swap Engine Prototype\n\nBrief Description:\n\nBuild a backend prototype that connects Reyts to the Stellar testnet, sets up issuer and distribution accounts, and enables simulated swaps between QCAD, USDC, and cNGN using Path Payment Strict Send.\n\nThis milestone includes the first version of the Stellar-aware swap engine — a backend service that integrates Reyts’ existing P2P logic with Stellar’s infrastructure.\n\nIt will determine when to execute swaps directly between users and when to route via Stellar’s on-chain liquidity (e.g., after a timeout or lack of takers), ensuring reliable and transparent settlement across QCAD ↔ cNGN.\n\nNote: The earlier ReytsCAD test asset has been deprecated in favor of working directly with QCAD issued by Stablecorp.\n\n-  \n\nHow to Measure Completion:\n\n-   Stellar issuer/distribution accounts funded on testnet\n    \n-   QCAD, USDC, and cNGN test assets issued or imported on testnet\n    \n-   Path Payment Strict Send working across QCAD → USDC, USDC → cNGN, and QCAD → cNGN\n    \n-   Swap engine functional with logic to detect peer match, fallback to Stellar, and log execution\n    \n-   Internal dashboard/log showing swap flows and fallback activity\n    \n-   GitHub repo with documented code\n    \n-   Short video demo or screenshots of the MVP in action\n    \n\nEstimated Completion Date:  \n8–10 weeks from grant approval\n\nBudget:  \n$50,000 in XLM equivalent\n\nBreakdown:\n\n-   Backend Engineering + SDK Integration: $30,000\n    \n-   Soroban Dev Environment & Initial Compliance Logic: $10,000\n    \n-   Infrastructure & CI/CD: $5,000\n    \n-   PM, QA & Testing: $5,000",
            "stellar.tranche2Testnet": "#### ✅ Tranche 2 – Testnet: Anchor Integrations + P2P Fallback Flow\n\nBrief Description:\n\nDeploy and test the complete Reyts swap pipeline on the Stellar testnet. This includes:\n\n-   Full swap execution via P2P match or fallback through Path Payment Strict Send\n    \n-   Mock integrations for SEP-24 anchors simulating Busha (cNGN), Stablecorp (QCAD), and Circle (USDC)\n    \n-   KYC gating and compliance flow\n    \n-   Public testing interface for reviewers\n    \n\n-  \n\nHow to Measure Completion:\n\n-   Backend deployed on Stellar testnet\n    \n-   Testnet assets (QCAD, USDC, cNGN) supported\n    \n-   Path Payment Strict Send fallback working across QCAD → cNGN via USDC\n    \n-   SEP-24 flows mocked for QCAD, USDC, and cNGN\n    \n-   KYC gating active\n    \n-   Public demo/test access provided\n    \n-   Updated technical documentation ready\n    \n-   Team ready for Stellar LaunchKit audit\n    \n\nEstimated Completion Date:\n\n  \n6–8 weeks after MVP",
            "stellar.tranche3Mainnet": "#### ✅ Tranche 3 – Mainnet: Live Fiat Swaps via Anchors\n\nBrief Description:\n\nLaunch Reyts on Stellar Mainnet, enabling live fiat swaps powered by QCAD, USDC, and cNGN through integrated anchors and a production-ready swap engine. This includes:\n\n-   Direct integrations with Busha (cNGN), Stablecorp (QCAD), and Circle (USDC)\n    \n-   On-chain compliance logging via externally triggered Soroban contracts\n    \n-   Liquidity-aware fallback logic\n    \n-   End-to-end fiat-to-fiat flows, abstracting Stellar from the user experience\n    \n\n-  \n\nHow to Measure Completion:\n\n-   Platform live on Stellar Mainnet\n    \n-   QCAD, USDC, and cNGN active and swappable\n    \n-   Path Payment Strict Send functional for QCAD ↔ USDC ↔ cNGN\n    \n-   At least two anchors integrated and operational\n    \n-   Soroban compliance contract deployed and invoked\n    \n-   Transactions traceable via Stellar Expert\n    \n-   Internal monitoring active for swap performance\n    \n\nEstimated Completion Date:\n\n  \n6–8 weeks after Testnet milestone\n\nBudget:\n\n  \n$25,000 in XLM equivalent\n\nBreakdown:\n\n-   Backend deployment, monitoring, and scalability: $20,000\n    \n-   Post-launch maintenance & hotfixes: $5,000",
            "stellar.teamMembers": "Ayobami Macaulay, Abimbola Adegbite, Oluwasegun Matthew",
            "stellar.urls": {
              "codeRepository": "https://docs.google.com/document/d/1p73wW74AGJj4Ab475DxfmiS2D2f4AH8oHBpD-s5it6w/edit?tab=t.0#heading=h.mmg6wzfkhi",
              "videoURL": "https://youtu.be/FjLR98gGFhA"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://ca.linkedin.com/company/reytas-fintech-inc",
              "twitter": "https://x.com/Reytsapp"
            }
          },
          "completionPercentage": 33.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:8",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:cobo-custody-integration-for-institution",
          "projectName": "Cobo Custody Integration for Institution",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Integrating into Cobo MPC and Bridge app",
          "status": "Awarded",
          "category": "Applications",
          "description": "Enabling institutional-grade custody, cross-border payment and PayFi solutions for Stellar Network through Cobo&#x27;s Multi-Party Computation (MPC) wallet technology and Bridge app, serving immediate demand from institutional clients.",
          "fundsApprovedInUSD": 150000.0,
          "fundsPaid": [
            {
              "amount": 50000.0,
              "denomination": "USD"
            },
            {
              "amount": 176962.96,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-06-11T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/document/d/1q_068AbTLzrg6meG67ZlOKEQX4Hm7RMAMa3J9VEYcHA/edit?usp=sharing",
            "stellar.productsAndServices": "Cobo is a trusted leader in digital asset custody and wallet infrastructure solutions. Founded in 2017, Cobo safeguards billions of dollars in assets for 500+ organizations worldwide with a zero-incident security track record. Our unified platform integrates all four wallet technologies - Custodial, MPC, Smart Contract, and Exchange Wallets - empowering institutions to securely scale their blockchain operations.  \n  \nCobo will integrate Stellar Network into two critical infrastructure components serving institutional clients:\n\n1. MPC Wallet Solution: Implementing Stellar Network support in our enterprise-grade MPC wallet system, enabling secure shared custody of XLM and Stellar-based assets with institutional-level controls. This includes support for the ED25519 signature scheme, comprehensive transaction policy management, and governance structures required by institutional clients.\n\n2. Bridge Application: Enhancing our Bridge service to support cross-chain transfers between Stellar and other major networks (currently supporting BTC↔️WBTC, TRON_USDT↔️BSC_USDT↔️ETH_USDT), enabling seamless liquidity management for payment providers and institutional clients.\n\nThese services will directly address the $1.5M+ in asset demand from our existing institutional client base while enabling cross-border payment infrastructure for payment companies, exchanges, and financial institutions. The institutional MPC capability for Stellar will be the first of its kind, delivering enterprise-grade security features including threshold signing (2-of-3), comprehensive risk policies, and regulatory compliance mechanisms.",
            "stellar.successCriteria": "We'll measure success through these key metrics:\n\n1. Assets Under Custody: $1.5M+ in Stellar assets secured in MPC wallets by end of first quarter post-launch.\n\n2. Client Adoption: 10+ institutional clients utilizing our Stellar MPC solution, including at least 3 payment providers, 2 exchanges, and 3 investment firms.\n\n5. API Integration: 5+ third-party applications integrating with our Stellar API endpoints.\n\n6. Security Performance: Maintaining zero security incidents while scaling Stellar custody operations.\n\n7. Compliance Standard: Successfully handling regulatory requirements across jurisdictions for institutional clients.\n\nThe project will be considered fully successful when we've achieved the assets under custody target, onboarded the target number of institutional clients, and established Stellar as a core component of our cross-border payment infrastructure.",
            "stellar.tractionEvidence": "1. Existing XLM Integration: Cobo has already successfully integrated XLM in our HSM-based custodial wallet solution, demonstrating technical proficiency with Stellar.\n\n2. Client Demand: We have $1.5M+ in verified client demand for XLM in our MPC wallet, and payment companies or PayFi projects looking into Stellar Network cross-border payment solution.\n\n3. Institutional Client Base: Cobo serves 500+ institutions safeguarding billions in digital assets with zero security incidents since 2017, including major exchanges, asset managers, and payment providers.\n\n4. Cross-Border Payment Volume: Our payment infrastructure currently processes millions in monthly transaction volume, with clients like Dogpay handling $2M+/month in cross-border transactions.\n\n5. Technical Track Record: Successfully integrated 80+ blockchain networks including complex non-EVM chains, demonstrating proven capability to implement Stellar's unique architecture.\n\n6. Security Certifications: Our platform maintains SOC 2 Type II and ISO 27001 compliance, meeting the rigorous security requirements of institutional clients.",
            "stellar.goToMarketPlan": "Our go-to-market strategy leverages Cobo's existing client base and industry position:\n\n1. Immediate Client Migration: We'll start by onboarding the $1.5M+ in waiting assets from current clients who have expressed interest in Stellar support.\n\n2. Payment Provider Integration: We'll work closely with our payment provider clients to implement Stellar as a settlement layer for cross-border transactions, leveraging Stellar's speed and cost advantages.\n\n3. Exchange Support: We'll partner with cryptocurrency exchanges to offer secure custody for their Stellar assets with features like automated sweeping and bulk withdrawals.\n\n4. Financial Institution Outreach: We'll engage regulated financial institutions seeking compliant infrastructure for Stellar-based assets and stablecoins.\n\n5. Developer Ecosystem: We'll share related documentation, SDKs, and implementation guides to encourage broader adoption by both Cobo and Stellar Network developer community similar to Fireblocks (https://developers.stellar.org/platforms/anchor-platform/admin-guide/custody-services/fireblocks)\n\n6. Partnership Expansion: We'll collaborate with existing ecosystem partners including payment processors, OTC providers, and financial service companies to expand Stellar adoption.\n\nOur target is to secure $1.5M in assets under custody within the first quarter of mainnet launch.",
            "stellar.tranche1Deliverables": "Deliverables:\n\n1.  Basic Stellar Support in MPC: Enable XLM transactions in our MPC architecture\n    \n\nMeasure: Successful sending and receiving of XLM in development environment\n\n1.  Documentation Updates: Add basic Stellar guidance to existing materials\n    \n\nMeasure: Updated reference documentation\n\n1.  Security Configuration: Set up initial security policies for Stellar asset\n    \n\nMeasure: Functioning permission controls  \n“Requested budget: $75K",
            "stellar.tranche2Testnet": "Deliverables:\n\n1.  Testnet Validation: Basic testing of Stellar functionality\n    \n\nMeasure: Successful operation on Stellar testnet\n\n1.  Security Verification: Internal review of implementation\n    \n\nMeasure: Completion of security checklist\n\n1.  Preliminary Bridge Testing: Initial testing of Stellar asset bridging\n    \n\nMeasure: Proof-of-concept transfers on testnet\n\n“Requested budget: $30K",
            "stellar.tranche3Mainnet": "Deliverables:\n\n1.  Production Deployment: Enable Stellar support in live environment\n    \n\nMeasure: Functioning XLM support for client accounts\n\n1.  Stellar USDC/USDT in Bridge App: Add Stellar stablecoin support to Bridge\n    \n\nMeasure: Ability to transfer stablecoins between Stellar and other networks\n\n1.  Client Resources: Basic guidance for institutional users\n    \n\nMeasure: Client reference materials for Stellar features\n\n“Requested budget: $45K",
            "stellar.teamMembers": "0xEzreal",
            "stellar.urls": {
              "website": "https://www.cobo.com",
              "codeRepository": "https://github.com/CoboGlobal",
              "videoURL": "https://youtu.be/cDsaEapQ1_E"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/cobo-global",
              "twitter": "https://x.com/Cobo_Global"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:9",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:swiftex",
          "projectName": "SwiftEx",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Powering Stellar Liquidity",
          "status": "Awarded",
          "category": "Applications",
          "description": "SwiftEx offers a multi-chain DEX with fiat support, giving global traders a secure way to bridge and trade assets via SDEX and Stellar Anchors.",
          "fundsApprovedInUSD": 65000.0,
          "fundsPaid": [
            {
              "amount": 21666.67,
              "denomination": "USD"
            },
            {
              "amount": 72051.11,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-22T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://drive.google.com/file/d/1Y3giLWBG8OaRZfleFubvgR6SpkEHtKdo/view",
            "stellar.productsAndServices": "The Problem:\n----------------\n\nTraditional centralized exchanges often come with lack of user control over assets, high fees, and limited access to multi-chain trading. Centralized exchanges can be vulnerable to security breaches, while fiat-to-crypto conversions remain difficult due to local country regulations and operability.\n\nHowever, DEXs also have challenges, such as complex bridging processes, lack of in-app fiat on/off-ramps, and incapability for high-frequency trading.Many DEXs rely solely on AMM swaps, limiting trading strategies and often leading to high slippage and poor price execution.\n\n#### Stellar’s Untapped Potential:\n\n-   SDEX’s orderbook model enables high-frequency, low-fee trading, but lacks:\n    \n    -   Multi-chain asset access (e.g., ETH, SOL → XLM).\n        \n    -   Seamless fiat integration (despite Stellar’s anchor network).\n        \n\nSwiftEx Solution:\n---------------------\n\n#### A. Stellar-Centric Liquidity Aggregation for Spot Traders\n\n-   Aggregates Stellar AMM / SDEX orderbooks with major chains and AMMs (e.g., Uniswap, PancakeSwap)\n    \n-   Enables 1-click, cross-chain trades with best-price execution (more details mentioned in Mainnet deliverables)\n    \n\n#### B. Fiat On/Off-Ramp via Stellar Anchors & API Partners\n\n-   Supports API-based and SEP-6 / SEP-24 integration for seamless fiat deposits and withdrawals (USD, EUR, etc.)\n    \n-   Already partnered with:\n    \n    -   Alchemy Pay\n        \n    -   MyKobo\n        \n    -   OnRamper\n        \n    -   Onramp.money\n        \n\n#### C. Cross-Chain Swaps\n\n-   Integrated with Allbridge to enable 1-tap cross-chain swaps with seamless execution and a smooth, intuitive UI\n    \n-   Users can swap assets like ETH → USDC → XLM in a single flow — no manual bridging required\n    \n-   In the next phase, we’re expanding cross-chain capabilities through integration with our official partner, Changelly, to support a broader range of assets and networks\n    \n    #### SwiftEx is pioneering on-chain multi-chain high-frequency trading, bringing fast and efficient trading to Stellar. It offers centralized exchange Spot trade Users a seamless, secure, and decentralized alternative.",
            "stellar.successCriteria": "User & Ecosystem Growth\n\n-   New Stellar-Connected Users: Targeting 50,000+ users in the first 12 months — each interacting with Stellar via on/off-ramps, swaps, or SDEX trades.\n    \n-   Market Penetration: Focused growth in the US, Europe, and UAE, driving 20–30% MoM user growth, expanding Stellar’s real-world usage.\n    \n-   Retention & Activity: Aim for 70%+ activation rate within 90 days, promoting sustained Stellar asset use across chains.\n    \n\nRevenue & Stellar Network Utility\n\n-   Protocol-Aligned Revenue: Projecting $200,000+ in revenue through on/off-ramp and bridging fees — all anchored around Stellar-based transfers.\n    \n-   Growth Curve: Targeting 15–20% MoM revenue growth, reflecting increased Stellar-based swaps, liquidity movement, and SDEX / AMM trading.\n    \n-   Impact: Every transaction strengthens Stellar’s role as a liquidity and settlement layer across ecosystems.",
            "stellar.tractionEvidence": "Strategic Official Partnerships\n\n#### Fiat On/Off-Ramps & Stellar Anchors\n\nEnabling seamless fiat access through API and SEP-6/24 integrations:\n\n-   Alchemy Pay – Global crypto ↔ fiat gateway\n    \n-   MyKobo – Regional payments & stablecoin infrastructure\n    \n-   OnRamper – Aggregated fiat onramp solution\n    \n-   Onramp.money – Fast, compliant crypto purchases across markets\n    \n\n#### Cross-Chain Bridge Partner\n\nPowering secure, user-friendly asset swaps across ecosystems:\n\nChangelly (Official Partner) – Multi-chain bridge for upcoming native asset integration\n\nAnalytics Summary:\n\nOur Google Analytics data shows a high volume of direct traffic—which helped us gather 1000+ users on our waiting list. These early supporters will be the first beta testers, providing valuable feedback to refine SwiftEx before a full public release.\n\nHere is the current waitlist of users:  \nhttps://docs.google.com/spreadsheets/d/18getgwcSwODmyF_D9DtHJ3zXm40nHuSRaq7R9WBtVGg/edit?usp=sharing\n\nKey Metrics:\n\nGoogle Analytics Snapshot (High Organic and Direct traffic):  \nhttps://drive.google.com/file/d/1RRouQbpnQ-SwPLCF5s9HhWfyAEz3Y3o9/view?usp=sharing\n\nDevice User Testing:\n\nWe successfully conducted closed tests with 47 users, gathering valuable feedback and ensuring compatibility across various Android and iOS devices. The testing validated user experience and functionality, paving the way for further refinements.\n\nTest User Data List: https://docs.google.com/spreadsheets/d/13z8ZtHeg3mIsUap3hZXSaQSgPqgcBC5X/edit?usp=drive_link&ouid=118237566460509396868&rtpof=true&sd=true\n\nApp Download available on our landing page:  \n(Testnet: .apk for android and TestFlight form for iOS): https://swiftexchange.io/\n\nBusiness Validation:\n\nSecured a $15,000 award During SCF Kickstart-October, highlighting strong validation of SwiftEx’s technical feasibility, market fit, and potential to redefine secure, cross-chain crypto trading.\n\nSuccessfully completed key functionalities, including:\n\nApp Demo Link: https://www.youtube.com/watch?v=BZie-z79BGQ\n\nWallet Management (ETH & BNB) – Multi-chain seamless asset control  \n+BNB support has been added  \nStatus: Done\n\nBiometric Setup – Fingerprint/Face ID for enhanced security  \nStatus: Done\n\nMulti-Chain Wallet (Send/Receive/Swap Crypto) – Smooth asset movement across chains  \nStatus: Done\n\nStellar DEX and AMM Swaps (Send/Receive/Trust Assets) – Trustline support & Stellar asset management  \nStatus: Done\n\nOther Foundational Features  \n– Market stats, user authentication, offer & transaction history  \nStatus: Done",
            "stellar.goToMarketPlan": "#### Funding Beyond SCF\n\nWhile the Stellar Community Fund provides an excellent foundation, SwiftEx has outlined additional funding strategies to ensure long-term growth and sustainability:\n\n1.  Venture Capital (VC) Funding:\n    \n    -   Target crypto-focused VCs and angel investors with a compelling pitch for SwiftEx’s unique value proposition: merging the ease of use of CEX with the security of DEX.\n        \n    -   Highlight SwiftEx's innovative approach, particularly the need for SwiftEx Bridge to enable one-tap fiat-to-crypto trades or purchases.\n        \n    -   Emphasize current challenges with alternatives like AllBridge, which offers minimal liquidity for wrapped assets and limited stablecoin conversions, requiring extra swaps at high fees.\n        \n    -   Showcase the urgency to partner with other bridges on favorable terms to provide liquidity and asset support.\n        \n\n#### Target Market Segmentation\n\n-   Spot Crypto Traders: Transitioning from CEX to DEX for enhanced security and asset control.\n    \n-   Fiat Users: Individuals needing seamless on/off-ramp services with fiat liquidity access.\n    \n-   Cost-Conscious Traders: Users looking for low-fee platforms for trading and asset management.\n    \n-   Crypto Enthusiasts: Seeking a superior decentralized exchange experience with multi-chain capabilities.\n    \n\n#### Community Building and Outreach\n\n-   Blockchain Ecosystem Engagement: Actively participate in communities within Stellar, BNB, and Ethereum ecosystems to drive awareness.\n    \n-   Educational Content: Produce tutorials, webinars, and guides to simplify the transition from CEX to DEX for users.\n    \n-   Influencer Collaborations: Partner with crypto influencers and educators to amplify SwiftEx’s reach.\n    \n\n#### Partnerships\n\n-   Strategic Collaborations: Forge partnerships with Stellar Anchors, blockchain networks, and financial service providers to drive adoption.\n    \n-   Wallet Integrations: Collaborate with wallets and blockchain tools to acquire new users and expand the platform’s ecosystem.\n    \n\n#### User Growth Strategy\n\n1.  Paid Advertising:\n    \n    -   Deploy targeted campaigns on Google, Facebook, Twitter, and Instagram, showcasing SwiftEx’s features.\n        \n    -   Target users dissatisfied with CEX platforms or seeking multi-chain trading.\n        \n1.  Beta Launch & Feedback Loop:\n    \n    -   Launch a closed beta program with select early adopters.\n        \n    -   Collect detailed feedback through user surveys and analytics to refine the platform.\n        \n1.  User Education & Support:\n    \n    -   Provide a comprehensive knowledge base, video tutorials, and community support on Discord and Telegram.\n        \n1.  Content & SEO Strategy:\n    \n    -   Develop content highlighting SwiftEx’s benefits and the importance of decentralization.\n        \n    -   Optimize for keywords such as “multi-chain DEX”, “crypto on/off-ramp”, and “decentralized asset management” to improve visibility in crypto forums and blogs such as this one - https://swiftexchange.io/blog/671a38df073e85a9fc095763",
            "stellar.tranche1Deliverables": "Summary of Functionalities completed :\n------------------------------------------\n\nSecurity\n\n-   Enable 2FA – Supports Fingerprint & Face ID authentication\n    \n-   Login Passcode – Additional security layer for account access.\n    \n-   Budget: $0\n    \n-   Status: DONE\n    \n\n#### Multi-Chain Asset Management\n\n-   Send & Receive Crypto – Fast, secure transactions across supported chains.\n    \n-   Swap Crypto (Uniswap) – Instant token swaps within the ETH ecosystem.\n    \n-   Budget: $0\n    \n-   Status: DONE\n    \n\n#### Account Management\n\n-   Login & Signup – Easy access to SDEX trading features.\n    \n-   Forgot Password – Secure recovery process for account access.\n    \n-   Budget: $0\n    \n-   Status: DONE\n    \n\n#### Trade Wallet (SDEX and AMM Swaps)\n\n-   Create Buy & Sell Offers – Seamless order creation on SDEX.\n    \n-   Send & Receive Assets – Direct asset transfers within the Stellar ecosystem.\n    \n-   Overview, Orderbook and Insights – Show various Stats for SDEX and Stellar AMM Swaps\n    \n-   Budget: $0\n    \n-   Status: DONE\n    \n\n#### Wallet Management\n\n-   Create Multi-Chain Wallet (ETH & BNB)\n    \n-   Import Wallet – Supports private key and mnemonic-based ETH wallet imports.\n    \n-   Choose/Change Active Wallet – Seamless wallet switching for better user control.\n    \n-   Budget: $0\n    \n-   Status: DONE\n    \n\n#### Other Features\n\n-   Market Insights – Real-time asset tracking and analysis.\n    \n-   Theme Settings – Customizable interface for user preferences.\n    \n-   Transaction History – Comprehensive record of past transactions.\n    \n-   Budget: $0\n    \n-   Status: DONE\n    \n\n_____________________________________________________________________________\n\nDeliverable 1: Backend Triggered Notifications\n\nDescription: Trigger Info Notifications after one-tap Swaps (Transaction Chaining) or Notifications when the user Send/Receives Assets, user or System updates.\n\n-   How to measure completion: Successful deployment of fully operational Functionality via APK / TestFlight.\n    \n-   Estimated date of completion: 4 weeks post-award distribution (Parallel Execution with deliverable 2).\n    \n-   Budget: $12000\n    \n\nDeliverable 2: In-app Anchor experience (Alchemy Pay API Integration)\n\nDescription: Integrate Alchemy Pay API’s for KYC, On-Ramp, and Off-Ramp Trades (deposits and withdrawals).\n\n-   How to measure completion: Successful deployment of fully operational Functionality via APK / TestFlight.\n    \n-   Estimated date of completion: 4 weeks post-award distribution.\n    \n-   Budget: $10,000",
            "stellar.tranche2Testnet": "Deliverable 1: Upgrade Backend Infrastructure\n\nDescription: Upgrade Backed Infrastructure with AWS EKS, LB, and Other Services mentioned in the Architecture diagram.  \nArchitecture diagram: [[SwiftEx] - Technical Architecture_V1.docx.pdf](https://drive.google.com/file/d/1Y3giLWBG8OaRZfleFubvgR6SpkEHtKdo/view?usp=sharing)\n\n-   How to measure completion: Successful deployment detailed Video of different deployed Services and their completion.\n    \n-   Estimated date of completion: 4 weeks after MVP completion.\n    \n-   Budget: $11,000\n    \n\nDeliverable 2: Automation Testing\n\nDescription: To create an automation framework using Appium, TestNG, and Cucumber that supports parallel execution of tests on both Android and iOS devices.\n\n#### Key Modules to Automate\n\n-   App Launch and Password Setup\n    \n    -   Validate the app's launch and password setup functionality.\n        \n    -   Test edge cases, such as weak passwords and incorrect confirmations.\n        \n-   Wallet Creation\n    \n    -   Automate the flow for creating a new wallet.\n        \n    -   Validate mandatory fields, wallet security, and success confirmations.\n        \n-   Wallet Import\n    \n    -   Test wallet import using seed phrases or private keys.\n        \n    -   Validate error messages for incorrect inputs.\n        \n-   Wallet Selection\n    \n    -   Ensure the correct wallet is selectable when multiple wallets are present.\n        \n    -   Verify seamless navigation to the selected wallet.\n        \n-   Homepage Buttons and Navigation\n    \n    -   Test all buttons on the homepage for proper functionality and responsiveness.\n        \n    -   Validate redirections to corresponding screens or features.\n        \n-   Exchange Signup and Login\n    \n    -   Automate the signup and login process.\n        \n    -   Test for invalid credentials, edge cases, and success paths.\n        \n-   Transactions and Swapping\n    \n    -   Validate sending transactions, including recipient and amount verification.\n        \n    -   Test the swapping of cryptocurrencies for accuracy and stability.\n        \n-   How to measure completion: Successful test cases pushed on github\n    \n-   Estimated date of completion: 6 weeks post-award MVP completion (Parallel Implementation by QA Team).\n    \n-   Budget: $12000",
            "stellar.tranche3Mainnet": "Deliverable 1: One Tap Bridge-Swap-Trade Assets (Bidirectional)\n\nDescription: SwiftEx will enable users to seamlessly bridge, swap, and trade assets in a single streamlined process. Users can input all necessary details upfront (Amount, tolerance and Asset details), and the system will handle multi-step operations like bridging and trading (via SDEX) through a backend proxy server. Once one step completes, signed transactions will automatically execute the next step on the Stellar blockchain, ensuring a smooth and efficient user experience.\n\nAdditionally, users will have the ability to bridge Stellar assets back to their multi-chain wallets effortlessly. This process may involve automated multi-step swaps (e.g., converting Stellar assets into USDT via SDEX before bridging to another blockchain) to simplify complex workflows.\n\nExample Use Case: A user imports ETH or BNB from their multi-chain wallet, swaps it for BTC on SDEX, and receives BTC in their wallet—all in one operation. Demo : - https://vimeo.com/1075076753?share=copy  \n[  \n](https://drive.google.com/file/d/1hPsI5msHS8PkI5TSGcogjW9SboXFisBa/view%EF%BF%BCSimilarly)Similarly, user can bridge a Stellar asset to USDT and transfer it to their desired blockchain seamlessly.\n\nBackend Setup: Proxy Server with a 3rd Party Node for Stellar connectivity.\n\n-   How to measure completion: Successful deployment of fully operational Functionality on Play/App Store Live.\n    \n-   Estimated date of completion: 6 weeks post-testnet Completion.\n    \n-   Budget: $20,000",
            "stellar.teamMembers": "Rohan Sethi, karan, Ram Krishan Sharma, Isha, Manish[SwiftEx], Hunny",
            "stellar.urls": {
              "website": "https://swiftexchange.io/",
              "codeRepository": "https://github.com/hunnykumar/SwiftEx/tree/feature/TestNetWallet",
              "videoURL": "https://www.youtube.com/watch?v=BZie-z79BGQ"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/swiftex-wallet/",
              "twitter": "https://x.com/SwiftExwallet/"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:10",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:wirex-pay",
          "projectName": "Wirex Pay",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Wirex Pay - self-custodial banking",
          "status": "Awarded",
          "category": "Applications",
          "description": "Wirex Pay is a self-custodial card and bank account payment solution powered by smart accounts. Supported by Visa, Wirex Pay aligns closely with Visa&amp;amp;#x27;s vision for the future of payments, emphasizing collaboration in driving fintech innovation.",
          "fundsApprovedInUSD": 150000.0,
          "fundsPaid": [
            {
              "amount": 50000.0,
              "denomination": "USD"
            },
            {
              "amount": 200942.42,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-06-20T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/document/d/1Fg08HosUagXj1K57Vt4-d6UNQZ_omqGVx53gwnPmOsA/edit?tab=t.0#heading=h.fz485x95jx2g",
            "stellar.productsAndServices": "Stellar token holders (primarily USDC and EURC) will be able to use their assets in card and bank payments maintaining full self-custody and ease of use.\n\nUnlocked use cases:\n\n- Retail card payments, spend USDT at 80m merchants in 200+ countries\n\n- Corporate card payments\n\n- Single ACH and SEPA transfers from Stellar accounts\n\n- Mass payouts from Stellar accounts\n\n- Standing orders (scheduled payments) from Stellar accounts \n\n- Stellar branded cards and community-branded cards for Stellar ecosystem projects\n\n- Wirex Pay is not just a dApp, it’s infrastructure so other Stellar dApps can integrate with Wirex Pay banking and card infra",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "Wirex Pay aims to cater to three distinct types of audiences: B2C (Retail), B2B (Corporate), and B2B2C (Corporate with Retail Clients). The product offerings and marketing strategy for each audience will be designed to ensure tailored, effective engagement, increased adoption, and seamless integration with the Stellar ecosystem. Below is a detailed go-to-market plan for each of these key segments.\n\n⸻\n\n1. B2C (Retail) Users – Personal Spending & Cashback Functionality\n\nKey Features:\n\n• Stablecoin Payments: Wirex Pay will offer a decentralized application (dApp) allowing retail users to spend USDC in over 80 million merchants globally.\n\n• Cashback Mechanism: Cashback will be provided for every transaction, with users earning rewards for spending. This feature will be a key marketing hook to encourage engagement and transaction volume.\n\n• Yield Generation: Wirex Pay will integrate yield-generating functionality, allowing retail users to earn rewards while keeping funds in their wallet.\n\nMarketing Strategy:\n\n• Target Audience: Crypto-savvy individuals and those seeking to spend stablecoins easily at merchants globally.\n\n• Campaigns:\n\n• Cashback Promotion: Launch campaigns to drive user engagement by highlighting the cashback offer. For example, “Get 3% Cashback on your first 5 purchases using Wirex Pay”.\n\n• Referral Program: Create a referral system where existing users can earn additional cashback or benefits for bringing new users onboard.\n\n• Partnership with Retailers: Collaborate with top brands in the retail industry to offer exclusive deals for users spending USDC with Wirex Pay.\n\n• Content Marketing: Use blogs, YouTube, and social media to create educational content around the benefits of using USDC for everyday purchases, cashback rewards, and yield generation.\n\n• Loyalty Programs: Promote Wirex Pay as a solution to increase customer loyalty with cashback offers and partnerships.\n\n• In-App Notifications: Engage users with real-time notifications about cashback offers, yield boosts, and spending incentives.\n\n⸻\n\n2. B2B (Corporate) Users – Corporate Treasury, Bank Accounts, and Expense Cards\n\nKey Features:\n\n• Corporate Treasury: Provide businesses with the ability to manage their treasury operations using stablecoins, reducing reliance on traditional banks and improving efficiency.\n\n• Corporate Bank Accounts: Wirex Pay will offer businesses access to corporate bank accounts in USD/EUR and allow smooth conversions between fiat and stablecoins for operational needs.\n\n• Corporate Expense Cards: Businesses will be able to issue expense cards for employees, allowing them to spend stablecoins for business expenses across global merchants.\n\nMarketing Strategy:\n\n• Target Audience: Mid-to-large-sized businesses, especially those in industries such as crypto, fintech, and e-commerce.\n\n• Partnership with Stellar BD Team: Work with the Stellar business development team to integrate Wirex Pay’s offering into the Stellar ecosystem, positioning Wirex Pay as a leading provider for corporate treasury and stablecoin payments.\n\n• Thought Leadership: Conduct webinars and produce whitepapers detailing how Wirex Pay simplifies cross-border payments, minimizes FX risk, and enhances liquidity management for businesses.\n\n• Tailored Solutions: Work with businesses to develop customized solutions for their specific treasury needs, positioning Wirex Pay as an enabler of global expansion.\n\n• Dedicated Support: Offer high-touch customer support and dedicated relationship managers to corporate clients to help them integrate and scale with Wirex Pay’s features.\n\n⸻\n\n3. B2B2C (Corporate with Retail Clients) – Co-Branded Cards & IBANs\n\nKey Features:\n\n• Co-Branded Cards: Wirex Pay will offer non-custodial and custodial wallets the ability to issue co-branded cards that allow end-users to spend stablecoins at any merchant supporting Visa or Mastercard.\n\nPavel Matveev, [30/03/2025 4:05 PM]\n\nSuccess Criteria for Wirex Pay Expansion\n\nTo effectively measure the success of the Wirex Pay launch and its adoption across B2C, B2B, and B2B2C segments, the following stablecoin volume thresholds will serve as the key success criteria. These thresholds are based on the volume of stablecoins (USDC) processed via the Wirex Pay infrastructure, providing a clear measure of both transaction growth and market acceptance.\n\n1. Stablecoin Volume Processed via Wirex Pay (USDC)\n\n1.1. Success Level 1: $1M USDC Processed\n\n• Key Milestones:\n\n• Initial adoption by retail users and a few corporate partners.\n\n• Early usage by B2C users, including cashback-driven spending.\n\n• Onboarding of initial B2B clients who use stablecoin payments for corporate treasury.\n\n• First B2B2C partnerships with crypto wallets or DeFi platforms offering co-branded cards.\n\n• Indicators of Success:\n\n• Strong initial user feedback and product validation.\n\n• Initial transactions in USDC processed.\n\n• Establishment of a foundational user base.\n\n1.2. Success Level 2: $10M USDC Processed\n\n• Key Milestones:\n\n• Increased transaction volume from both retail (B2C) and corporate (B2B) users.\n\n• Expansion of partner integrations, including more DeFi platforms and wallets.\n\n• Expanded corporate treasury usage for large enterprise clients, managing funds with stablecoins.\n\n• Growth in the number of cards issued to retail customers and corporate clients.\n\n• Indicators of Success:\n\n• Significant transaction growth on Wirex Pay platform.\n\n• Established cross-border payment channels with improved FX and liquidity solutions.\n\n• Expansion into additional regional markets, with global presence of Wirex Pay card usage.\n\n1.3. Success Level 3: $50M USDC Processed\n\n• Key Milestones:\n\n• Market leadership in stablecoin payments, with Wirex Pay driving adoption in the U.S. and other international markets.\n\n• Widespread use of Wirex Pay for daily spending, corporate expenses, and payroll management.\n\n• Increased adoption of Wirex Pay within the Stellar ecosystem, with significant partnership integrations.\n\n• Major B2B2C partnerships, offering co-branded cards and IBANs to millions of retail users.\n\n• Indicators of Success:\n\n• Network effects are evident, with increased volume of stablecoin transactions across multiple regions.\n\n• Wirex Pay becomes the default payment solution for stablecoin-based transactions.\n\n• A significant portion of the market uses Wirex Pay’s features, with notable adoption within the Web3 and traditional finance sectors.\n\n• Key partnerships contributing to the growth of the ecosystem, with notable brands and financial institutions actively using the Wirex Pay network.\n\n⸻\n\nSummary\n\nThe success of Wirex Pay will be measured through the volume of USDC processed across its network. Achieving key milestones at the $1M, $10M, and $50M USDC thresholds will not only signify the growth of the Wirex Pay ecosystem but also solidify its position as a leading infrastructure provider for stablecoin payments across retail, business, and B2B2C sectors. The progress through these stages will demonstrate Wirex Pay’s ability to expand its user base, onboard partners, and scale the technology to meet growing demand for decentralized payment solutions.",
            "stellar.tractionEvidence": "-   Wirex is award winning platform with 6m users. Awards: https://wirexapp.com/blog/post/a-snapshot-of-our-awards-0751\n    \n-   Wirex Pay is a composable non-custodial payment infrastructure powered by Wirex  \n    \n    Visa collaboration proof:\n    \n-   https://www.prnewswire.com/news-releases/wirex-and-visa-expand-partnership-to-drive-web3-payment-adoption-302196622.html\n    \n-   https://www.prnewswire.co.uk/news-releases/wirex-expands-uk-card-offering-with-the-launch-of-visa-platinum-card-302330020.html\n    \n-   https://www.prnewswire.com/news-releases/wirex-and-visa-expand-partnership-to-drive-web3-payment-adoption-302196622.html\n    \n-   https://seamlessxtra.com/visa-partners-with-wirex-to-drive-web3-payment-adoption/\n    \n-   https://en.cryptonomist.ch/2024/07/16/super-partnership-between-visa-and-wirex-revolution-for-the-digital-payments-sector-in-crypto-cards-with-wirex-pay/\n    \n-   https://paymentexpert.com/2020/12/29/wirex-confirmed-as-principal-member-of-visa-in-europe/",
            "stellar.goToMarketPlan": "Wirex Pay aims to cater to three distinct types of audiences: B2C (Retail), B2B (Corporate), and B2B2C (Corporate with Retail Clients). The product offerings and marketing strategy for each audience will be designed to ensure tailored, effective engagement, increased adoption, and seamless integration with the Stellar ecosystem. Below is a detailed go-to-market plan for each of these key segments.\n\n⸻\n\n1. B2C (Retail) Users – Personal Spending & Cashback Functionality\n\nKey Features:\n\n• Stablecoin Payments: Wirex Pay will offer a decentralized application (dApp) allowing retail users to spend USDC in over 80 million merchants globally.\n\n• Cashback Mechanism: Cashback will be provided for every transaction, with users earning rewards for spending. This feature will be a key marketing hook to encourage engagement and transaction volume.\n\n• Yield Generation: Wirex Pay will integrate yield-generating functionality, allowing retail users to earn rewards while keeping funds in their wallet.\n\nMarketing Strategy:\n\n• Target Audience: Crypto-savvy individuals and those seeking to spend stablecoins easily at merchants globally.\n\n• Campaigns:\n\n• Cashback Promotion: Launch campaigns to drive user engagement by highlighting the cashback offer. For example, “Get 3% Cashback on your first 5 purchases using Wirex Pay”.\n\n• Referral Program: Create a referral system where existing users can earn additional cashback or benefits for bringing new users onboard.\n\n• Partnership with Retailers: Collaborate with top brands in the retail industry to offer exclusive deals for users spending USDC with Wirex Pay.\n\n• Content Marketing: Use blogs, YouTube, and social media to create educational content around the benefits of using USDC for everyday purchases, cashback rewards, and yield generation.\n\n• Loyalty Programs: Promote Wirex Pay as a solution to increase customer loyalty with cashback offers and partnerships.\n\n• In-App Notifications: Engage users with real-time notifications about cashback offers, yield boosts, and spending incentives.\n\n⸻\n\n2. B2B (Corporate) Users – Corporate Treasury, Bank Accounts, and Expense Cards\n\nKey Features:\n\n• Corporate Treasury: Provide businesses with the ability to manage their treasury operations using stablecoins, reducing reliance on traditional banks and improving efficiency.\n\n• Corporate Bank Accounts: Wirex Pay will offer businesses access to corporate bank accounts in USD/EUR and allow smooth conversions between fiat and stablecoins for operational needs.\n\n• Corporate Expense Cards: Businesses will be able to issue expense cards for employees, allowing them to spend stablecoins for business expenses across global merchants.\n\nMarketing Strategy:\n\n• Target Audience: Mid-to-large-sized businesses, especially those in industries such as crypto, fintech, and e-commerce.\n\n• Partnership with Stellar BD Team: Work with the Stellar business development team to integrate Wirex Pay’s offering into the Stellar ecosystem, positioning Wirex Pay as a leading provider for corporate treasury and stablecoin payments.\n\n• Thought Leadership: Conduct webinars and produce whitepapers detailing how Wirex Pay simplifies cross-border payments, minimizes FX risk, and enhances liquidity management for businesses.\n\n• Tailored Solutions: Work with businesses to develop customized solutions for their specific treasury needs, positioning Wirex Pay as an enabler of global expansion.\n\n• Dedicated Support: Offer high-touch customer support and dedicated relationship managers to corporate clients to help them integrate and scale with Wirex Pay’s features.\n\n⸻\n\n3. B2B2C (Corporate with Retail Clients) – Co-Branded Cards & IBANs\n\nKey Features:\n\n• Co-Branded Cards: Wirex Pay will offer non-custodial and custodial wallets the ability to issue co-branded cards that allow end-users to spend stablecoins at any merchant supporting Visa or Mastercard.\n\nPavel Matveev, [30/03/2025 4:00 PM]\n\n• IBAN Integration: Enable businesses to offer their customers IBANs, supporting easy fund transfers and enabling businesses to operate as stablecoin banks for their retail users.\n\nMarketing Strategy:\n\n• Target Audience: Crypto wallets, DeFi platforms, and other B2B platforms with large retail customer bases.\n\n• Integration with Crypto Wallets: Integrate with existing non-custodial wallets such as Lobster, providing their users with access to co-branded cards that work seamlessly with the Wirex Pay infrastructure.\n\n• Use Case Promotion: Educate the market on how B2B2C partners can provide financial solutions to their retail users, expanding their value proposition without becoming a bank themselves.\n\n• Custom Solutions for Partners: Offer tailored packages for crypto wallets, DeFi projects, and other companies to integrate stablecoin cards, IBANs, and payments into their existing platforms.\n\n• Cross-Platform Marketing: Leverage the partner’s user base to cross-promote the co-branded cards and IBAN solutions, including integrating them into existing user interfaces and applications.",
            "stellar.tranche1Deliverables": "• Working Prototype: Our MVP integrates key Stellar components, including C-accounts, Timelock, and role-based access for card processing accounts.\n\n• Core Features: The MVP also supports creation via passkeys and gasless transactions facilitated by Launchtube, demonstrating seamless interaction with the Stellar ecosystem.\n\n• Validation: The MVP is fully functional and has passed internal validation, with ongoing user feedback from early testing participants. We’ve also gathered on-chain transaction data, which shows positive engagement with the system.\n\nBudget: $50,000",
            "stellar.tranche2Testnet": "• Enhanced Functionality: The Testnet prototype adds the ability to create signer wallets using both passkeys and social accounts via Web3Auth. This feature is designed to improve user onboarding and security.\n\n• Batched Transactions: We have successfully implemented and tested the execution of batched transactions from C-accounts, demonstrating the scalability and efficiency of the solution.\n\n• Validation: The testnet has been deployed to a select group of beta users who have provided positive feedback, and the transaction history is available on-chain.\n\nBudget: $50,000",
            "stellar.tranche3Mainnet": "• Production-Ready Integration: Our mainnet solution integrates with VISA for payment requests and is fully operational within the banking interface, ensuring readiness for real-world usage.\n\n• Continuous Improvement: Bug fixes, refactoring, and addressing issues found during an independent security audit ensure that the mainnet release is robust and secure.\n\n• Validation: We are currently preparing for user sign-ups for the full production launch, with a waiting list available for businesses and users interested in early access.\n\nBudget: $50,000",
            "stellar.teamMembers": "0xAntti",
            "stellar.urls": {
              "website": "https://www.wirexpaychain.com/",
              "videoURL": "https://youtu.be/I0Jmy-quoWU"
            },
            "stellar.socialMedia": {
              "twitter": "https://x.com/wirexpaychain"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:11",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:digibank-|-sdp",
          "projectName": "Digibank | SDP",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Scaling SDP for Mass Payments in MENA",
          "status": "Awarded",
          "category": "Applications",
          "description": "DigiBank integrates SDP to deliver instant, low-cost mass payments for NGOs in unbanked MENA regions, leveraging Stellar’s blockchain for transparency and efficiency.",
          "fundsApprovedInUSD": 99000.0,
          "fundsPaid": [
            {
              "amount": 33000.0,
              "denomination": "USD"
            },
            {
              "amount": 109739.37,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-22T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://www.canva.com/design/DAGkm9thMPM/wZ3Wk6yie8dWWmehEiai3w/view?utm_content=DAGkm9thMPM&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=hfa0a6a91f4",
            "stellar.productsAndServices": "DigiBank will scale SDP as a core service, enabling NGOs in unbanked MENA regions to execute mass payments seamlessly. Built on Stellar’s blockchain, SDP offers (1) batch payment processing for thousands of recipients using Stellar’s low-cost transactions (<$0.01 each); (2) real-time tracking via Stellar’s public ledger for full auditability; and (3) crypto-to-cash conversion through DigiBank’s regional off-ramp network, ensuring accessibility in cash-based economies. Planned enhancements include increased scalability for larger NGO cohorts and integration with legacy financial systems, driving adoption. These upgrades leverage Stellar’s fast settlement (<5 seconds), reducing NGO operational cost by up to 50% and enabling focus on aid delivery.",
            "stellar.successCriteria": "Success includes onboarding at least 10 NGOs as permanent clients, processing 300,000 transactions for 50,000 recipients by Q2 2026, and reducing their payment costs by 50% and timelines to <1 day. Impact: expanded financial access for unbanked communities, enabling NGOs to focus on aid delivery. Transparency via Stellar’s ledger builds trust, attracting more NGOs and strengthening MENA’s humanitarian finance ecosystem.",
            "stellar.tractionEvidence": "DigiBank’s SDP pilot with GIZ Germany and UOSSM disbursed $1M in salaries to 1,000 medical staff across six hospitals, serving thousands daily. It reduced payment timelines from 90 days to 1 day, saved 500 hours monthly for finance/HR teams, and cut transfer costs by 50% versus traditional methods. On-chain transactions are verifiable at https://stellar.expert/explorer/public/account/GCBXTWMTIOZ2JLQ6DVRB2OECHGGZGIEFOOJHGUY4S2EOLJ2XHYDEJSVQ. GIZ and UOSSM feedback shows 95% satisfaction.",
            "stellar.goToMarketPlan": "DigiBank will target MENA-based NGOs via partnerships with development agencies like GIZ, leveraging the pilot’s success to secure 10 new clients by Q2 2026. We’ll host workshops with Stellar community support to demonstrate SDP’s impact and build the capacity of NGO teams to handle crypto payments. Integration with local cash-out networks ensures accessibility, driving adoption among unbanked recipients. A dedicated support team will onboard NGOs, ensuring seamless setup. No marketing costs are included; outreach relies on organic channels, word of mouth, and Stellar’s ecosystem network.",
            "stellar.tranche1Deliverables": "'-   Deliverable 1: Multi-Tenant SDP Instance\n    \n    -   Description: Deploy a multi-tenant SDP instance to provide free mass payment services for NGOs, hosted on secure cloud infrastructure.\n        \n    -   Completion Metric: Onboard 1 NGO tenant, processing 1,000 transactions with 100% accuracy, verified via Stellar mainnet.\n        \n    -   Estimated Date: July 15, 2025\n        \n    -   Budget: $10,000 (1 developer x 1 month @ $5,000; 1 cloud engineer x 1 month @ $3,000; cloud hosting @ $2,000)\n        \n    \n    Deliverable 2: SDP App Integration\n    \n    -   Description: Enable SDP onboarding via unique invitation links in the DigiBank app, auto-generating Stellar wallets for users to streamline registration.\n        \n    -   Completion Metric: 1K users onboarded using links, with wallets registered in SDP, confirmed by internal QA.\n        \n    -   Estimated Date: July 15, 2025\n        \n    -   Budget: $5,000 (1 developer x 1 month @ $5,000)",
            "stellar.tranche2Testnet": "Deliverable 1: Crypto-to-Cash Integration\n\n-   Description: Integrate SDP with DigiBank’s off-ramp network, enabling payments to convert to cash at 50 MENA liquidity points.\n    \n-   Completion Metric: Complete 1,000 test conversions, with partner API uptime >99%, verified by Stellar Expert.\n    \n-   Estimated Date: August 15, 2025\n    \n-   Budget: $0\n    \n\nDeliverable 2: Scalability Testing\n\n-   Description: Stress-test SDP on Stellar testnet to handle 10,000 simultaneous transactions, optimizing for low latency and reliability.\n    \n-   Completion Metric: Process 10,000 transactions in <2 minutes with <0.1% error rate, validated by testnet reports.\n    \n-   Estimated Date: August 15, 2025\n    \n-   Budget: $0",
            "stellar.tranche3Mainnet": "'-   Deliverable 1: Hosting a multi-tenant instance of SDP\n    \n    -   Description: Digibank will host a multi-tenant instance of SDP to service NGOs for free.\n        \n    -   Completion Metric: Onboarding at least 9 tenants and onboarding 50K users verified via Stellar Explorer.\n        \n    -   Budget: $54,000 (1 technical support x 12 months @ $2,500/month, cloud hosting x 12 months @ $2,000/month)\n        \n    -   Estimated Date: May 30, 2026\n        \n\n-   Deliverable 2: Crypto-to-Cash Integration\n    \n    -   Description: Integrate SDP with DigiBank’s off-ramp, enabling payments to convert to cash at 2000 MENA liquidity points.\n        \n    -   Completion Metric: 300k conversions completed across the MENA region tracked on mainnet, with partner API uptime >99%.\n        \n    -   Estimated Date: May 30, 2026\n        \n    -   Budget: $30,000 (1 customer support x 12 months @ $2,500/month)",
            "stellar.teamMembers": "Digibank",
            "stellar.urls": {
              "website": "https://digibankar.com/app",
              "videoURL": "https://www.canva.com/design/DAGkmqS6gbc/l8410iM7OPq9BDPi5Varcw/watch?utm_content=DAGkmqS6gbc&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h21cc792c36"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:12",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:lumen-loop",
          "projectName": "Lumen Loop",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Lumen Loop Launch",
          "status": "Awarded",
          "category": "Applications",
          "description": "Lumen Loop exists to inform, engage and empower the Stellar community through automated gathering of all Stellar ecosystem content that is categorized and made easily viewable on our web-based platform and shared through our various social integrations.",
          "fundsApprovedInUSD": 113400.0,
          "fundsPaid": [
            {
              "amount": 37800.0,
              "denomination": "USD"
            },
            {
              "amount": 133181.92,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-29T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/document/d/16b9Ik9PvntTOrU5FfRLfTd6wlEknhccTelU_EJp1nDo/edit?usp=sharing",
            "stellar.productsAndServices": "To keep up-to-date on Stellar ecosystem news and developments, you'd have to follow websites and social accounts for numerous outlets such as Coindesk, The Block, Blockworks, Cointelegraph, Ledger Insights, CNBC, and Forbes, just to name a few. You'd also need to follow official blogs and social channels from existing ecosystem participants such as Cheesecake Labs and Soroban Domains, and everything in between. And video? Hopefully, you're an avid user of various video platforms because you'll also need to subscribe to updates from platforms like YouTube and Twitch. Adding to this complexity, navigating SDF-specific sources adds another layer of difficulty, requiring a meticulous approach to stay informed about Stellar's protocol updates and announcements through the official Stellar website, SDF blog entries, Developer Discord, and official social media channels like StellarOrg and BuildOnStellar. Additionally, tracking progress and updates for the incredibly diverse ecosystem projects presents a unique challenge. From official blogs to GitHub repositories and Twitter announcements, it is incredibly hard to see who is actively building on Stellar and where to find more information about them. Being unable to efficiently find and view this information leads to the perception of lack of innovation on the network. This fragmentation not only makes it challenging to stay informed but also creates barriers to entry for those new to Stellar. Vital events and discussions are often missed due to the lack of centralized notifications and the diverse rules of engagement across platforms.\n\n  \n\nExperience the convenience of navigating the Stellar network's dynamic landscape through one centralized web hub - Lumen Loop. Lumen Loop is designed to streamline the Stellar blockchain network's vast information ecosystem into an organized, accessible format. Lumen Loop automatically scrapes the web for the latest Stellar ecosystem news, updates, and developments. The scraper then uses AI to categorize and tag the content, as well as provide shortened, or \"TLDR\", excerpts for searchability and ease of access. For example, want to see just educational content? We’ve got you covered! Looking for protocol updates? No problem! We’ve got a category for that! Spanish content? Check! Lumen Loop also includes a project tracker where each Stellar project has a detail page with summaries, development activity, social metrics and news, making it easy for the community to follow developments. Let’s say you are a SCF reviewer or voter and you want to know if a project has been active in the ecosystem. Head to the project page, and we’ll have a breakdown on their social and dev activity! Lumen Loop’s project tracker increases project transparency and accountability. Beyond news discovery, Lumen Loop offers a centralized events calendar that details Stellar-related live events, meetups, and conferences from a variety of sources with essential information for easy community participation. Subscribe to our calendar and you won’t miss out! This ecosystem-wide calendar will keep people informed and boost engagement within the ecosystem. Finally, once Lumen Loop finds new information about projects or a new event it automatically posts summaries to various communities on platforms like Discord, Reddit and X/Twitter. This helps promote projects and grow the ecosystem - by keeping everyone in the loop.\n\n  \n\nWe create scrape rules to monitor Stellar project activity on different platforms. We normalize the discovered data from an enormous list of sources into one database. We use AI to give tags and categorize. This includes a manual review process. We push discovered content to our web platform where it's easily browsed by category, tag, project, etc. and also update the events page and the individual project tracker pages if applicable. We automatically push summaries of the discovered content to different social platforms.\n\n  \n\nThe basic idea of Lumen Loop is as follows: Centralized Information Hub: Aggregates Stellar ecosystem news, updates, and project developments into one platform. AI-Categorized Streams: Uses AI to organize content into searchable streams, such as educational content or developer updates, or even SCF project news. Comprehensive Event Calendar: Offers a centralized calendar detailing Stellar-related events for easy community participation. Detailed Project Tracker: Features individual pages for Stellar projects with summaries, development activity, social metrics, and a project news feed. Automated Social Media Sharing: Promotes ecosystem projects and updates by automatically posting discovered content to platforms like Discord, Reddit, and Twitter. Enhances Ecosystem Transparency: Increases project transparency and accountability through detailed activity breakdowns. Community Growth and Engagement: Aims to support community growth and project visibility within the Stellar ecosystem.  \n  \nYou can find a copy of our pitch deck here.",
            "stellar.successCriteria": "1.  User Engagement: Reach 2,000 monthly active users with at least 30% returning monthly, within 3 months of launch.\n    \n\n1.  Content Coverage: Track and categorize over 90% of active Stellar projects with automated updates to news, dev activity, and events.\n    \n\n1.  Community Integration: Maintain daily automated posts across 5+ channels with consistent engagement growth.\n    \n\n1.  Newsletter Reach: Grow the newsletter to 500+ subscribers within 2 months, maintaining a 35%+ open rate.\n    \n\n1.  Ecosystem Impact: Improve ecosystem visibility and transparency by becoming the default resource hub for Stellar community members, developers, and SCF participants.\n    \n\n1.  Sustainable Monetization: Begin generating revenue by securing at least 3 referral link or sponsored content partnerships with ecosystem projects or service providers, helping offset hosting, scraping, and AI processing costs.",
            "stellar.tractionEvidence": "'-   We've hosted multiple live events featuring Stellar ecosystem projects on YouTube and Twitter, and recently launched a monthly news recap series in collaboration with the BuildOnStellar and StellarOrg accounts.\n    \n-   Our YouTube channel has grown to over 1,500 followers: youtube.com/@lumen_loop\n    \n\n-   On X/Twitter (@lumenloop), we’ve achieved 1.5M impressions, 75k engagements, and grown to 2,800 followers in the past year: x.com/lumenloop\n    \n\n-   We've posted 400+ Stellar news summaries on Reddit since May: reddit.com/user/lumen_loop\n    \n\n-   Our secondary account, @StellarDataFeed, now has 8,800+ followers, sharing daily network stats on both X and Discord. https://x.com/StellarDataFeed\n    \n\n-   We’ve deployed bots in the Stellar Dev Discord and Stellar Global to automatically post news, videos, and event updates—fully automating this content pipeline.\n    \n\n-   Lumen Loop content is also distributed through our dedicated Telegram news channel. t.me/lumenloop\n    \n\n-   We've provided on-the-ground coverage from major in-person events including Meridian, Prague, and ETHDenver, sharing video and content snippets with the community.\n    \n\n-   Working with SDF Developer Marketing to improve ecosystem coverage and partnering with developers and ambassadors to highlight their work and events.",
            "stellar.goToMarketPlan": "Our GTM strategy focuses on activating the existing Stellar community while reaching new audiences through high-visibility content, partnerships, and platform integrations.  \n\n1.   Community Activation & Awareness\n    \n\n-   Collaborate with Stellar-based projects to promote their content via Lumen Loop, positioning us as their official news channel.\n    \n-   Continue our cross-platform content campaign (Reddit, X, Discord, YouTube, Telegram) to highlight ecosystem momentum.\n    \n-   Drive adoption by integrating into the official Stellar Discord and partner communities \n    \n-   Become a one stop shop for all things Stellar.\n    \n\n  \n\n1.  Content & Newsletter Strategy\n    \n\n-   Launch an automated weekly newsletter that curates top Stellar news and upcoming events.\n    \n-   Feature exclusive interviews and ecosystem insights to increase returning users.\n    \n-   Continue to produce content with the foundation on a recurring basis. ex Monthly Recaps\n    \n\n1.  Social Automation & Growth\n    \n\n-   Continue growing @StellarDataFeed and @lumenloop with curated and automated content.\n    \n-   Reach new audiences by expanding automated distribution to other social networks.\n    \n-   Optimize all indexed content for SEO to capture organic searches like “latest Stellar updates”, “top Stellar projects”, “Stellar defi projects”, etc.",
            "stellar.tranche1Deliverables": "We completed our MVP from our SCF #26 activation deliverables as follows\n\n[completed] Database Schema Rework for Production\n\n-   Rework the existing MongoDB database schema to ensure efficient data normalization and storage for a production environment. This involves optimizing the schema to handle a diverse array of content types including blogs, posts, tweets, and videos, as well as projects and events within the Stellar ecosystem.\n    \n-   Migrate the database to a trusted hosted solution and ensure reliable storage, backup, and accessibility for future scrapes.\n    \n-   How to measure completion: Published database samples for each content type can be found here.\n    \n\n[completed] Scrape Rules Development\n\n-   Research and define a list of relevant sources for projects, including websites, GitHub repositories, Youtube channels and Twitter profiles.\n    \n-   Based on the findings, create new scraping rules to accurately collect data ensuring adherence to the terms of each source.\n    \n-   How to measure completion: repo of projects with relevant information and scrape feeds. See here.\n    \n\n[completed] Website Front End\n\n-   Prove out the integration and functionality with a barebones front end\n    \n-   Alpha front end will include news from a limited set of sources, project tracker for at least 3 projects, and a limited source event calendar\n    \n-   Ability to easily view articles by date, category or related Project\n    \n-   Full analytics implementation to track user interactions and inform future enhancements\n    \n-   Stand up a suitable hosting environment for medium scale traffic\n    \n-   How to measure completion: website",
            "stellar.tranche2Testnet": "1. Enhance and Sync Project Metadata with Ecosystem DB\n\n-   Standardize and enrich project entries in the ecosystem database by researching and assigning missing attributes (e.g., tags, regions, tokens, images) in coordination with SCF and working group. Simultaneously, develop sync mechanism between the Lumen Loop admin dashboard and the ecosystem DB, allowing for efficient editing and live updates across platforms.\n    \n-   How to measure completion: video of sync from within the admin dashboard and updated project attributes in db.\n    \n-   Estimate: 4 weeks, 14.4k (40 hrs x 4 x 90)\n    \n\n2. Develop a dynamic scraping method that handles new sources and changes for ecosystem db\n\n-   Automate finding relevant data for new projects from public data sources and updating the ecosystem db.  ex. New SCF round recipients.\n    \n-   Automate monitoring sites for changes in relevant info and updating the ecosystem db without being reliant on website structure.\n    \n-   How to measure completion: video\n    \n-   Estimate: 3 weeks, 10.8k (40 hrs x 3 x 90)\n    \n\n3. Automate Content and Event Detection on Social with Calendar Integration\n\n-   Streamline event tracking by automating the discovery and categorization of Stellar-related events from Discord, SCF deadlines, ambassador programs, and Twitter activity. This includes developing standard descriptions for recurring event types, detecting duplicates, and automatically adding qualifying events to the ecosystem calendar without manual curation. \n    \n-   Twitter integration will parse posts from ecosystem project accounts to identify announcements, events, or resources and auto-post to the platform and relevant community channels. Will use twitter accounts from the ecosystem db. Ex. Aquarius announces new swap features on Twitter and we are able to auto add and parse it as a news item within our platform.\n    \n-   How to measure completion: Events are visible on the ecosystem calendar. Demo video.\n    \n-   Estimate: 5 weeks, 18k (40 hrs x 5 x 90)\n    \n\n4. Web Platform Development\n\n-   Design and Implementation of responsive front-end UI (desktop & mobile)\n    \n-   Development of visual design elements, including branding, icons, and graphic assets\n    \n-   Enhance AI-driven content categorization and summarization capabilities\n    \n-   Implement advanced content filtering options (date, category, tags, associated projects, search term)\n    \n-   How to measure completion: Implementation on website\n    \n-   Estimate: 9 weeks, 32.4k (40 hrs x 9 x 90)\n    \n\n5. Project Tracker Expansion\n\n-   Expand tracked projects to include the entire Stellar ecosystem\n    \n-   Add ability for projects to easily update their Project information\n    \n-   Add sync functionality to keep Stellar Ecosystem Database up-to-date with website data\n    \n-   How to measure completion: Implementation on website\n    \n-   Estimate: 4 weeks, 14.4k (40 hrs x 4 x 90)\n    \n\n6. Comprehensive Ecosystem Events Calendar\n\n-   Expand calendar into an advanced events calendar system with functionality for subscribing, filtering, and event notifications\n    \n-   How to measure completion: Implementation visible on website\n    \n-   Estimated time: 1.5 weeks, 5.4k (40 hrs x 5 x 90)",
            "stellar.tranche3Mainnet": "7. Add new social network integration to post automation pipeline\n\n-   Support new social networks in the automation pipeline for sharing of ecosystem updates. Ex. bluesky/farcaster\n    \n-   How to measure completion: links to accounts on other platforms with posted content.\n    \n-   Estimated time: 1 week, 3.6k (40 hrs x 1 x 90)\n    \n\n8. Automated weekly newsletters of news and upcoming events\n\n-   Automate the process of aggregating content and events from our platform and outputting an organized/easy to read weekly digest.\n    \n-   How to measure completion: newsletter is posted on social/website\n    \n-   Estimated time: 1 week, 3.6k (40 hrs x 1 x 90)\n    \n\n9. Performance Optimization and Scalability\n\n-   Optimization of front-end and backend code for performance and load handling\n    \n-   Deployment of advanced caching and CDN solutions\n    \n-   How to measure completion: Quick loading of assets on website\n    \n-   Estimated time: 1 week, 3.6k (40 hrs x 1 x 90)\n    \n\n10. Launch and Operational Readiness\n\n-   Complete QA testing across browsers and devices\n    \n-   Pre-launch beta testing phase with community engagement\n    \n-   Development and implementation of backup and disaster recovery procedures\n    \n-   How to measure completion:  website easily digestible in various browsers/devices\n    \n-   Estimated time: 2 weeks, 7.2k (40 hrs x 2 x 90)",
            "stellar.teamMembers": "Raphael Fortin, Jeremy Lockhart",
            "stellar.urls": {
              "website": "https://www.lumenloop.xyz",
              "codeRepository": "https://github.com/lumenloop",
              "videoURL": "https://youtu.be/pBZBeiqlK7U",
              "pitchDeck": "https://docs.google.com/presentation/d/1ig1TsstN8x4NpUGWO49Wjn_1baPu950BlDUyIu8zD7w/edit?usp=sharing"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://linkedin.com/company/lumenloop",
              "twitter": "https://x.com/lumenloop"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:13",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:kindfi",
          "projectName": "KindFi",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Social Impact Crowdfunding",
          "status": "Awarded",
          "category": "Applications",
          "description": "Crowdfunding platform connecting donors with verified LATAM causes via milestone-based fund releases to prevent misuse of funds",
          "fundsApprovedInUSD": 79998.0,
          "fundsPaid": [
            {
              "amount": 26666.0,
              "denomination": "USD"
            },
            {
              "amount": 88676.06,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-22T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://www.notion.so/KindFi-Architecture-Version-1-1-1d18754a4a4b8011b374dd993e370064",
            "stellar.productsAndServices": "1.  Milestone-Based Fund Release Model: KindFi uses a milestone-based fund release model inspired by SCF, where each project receives funds in 2–3 tranches. Funds are held in smart contract escrows and only released when specific, verifiable milestones such as impact evidence, photos, or reports are met. Approval requires consensus from 3 of 4 platform admins. If milestones are not met, the smart contract automatically blocks further releases. In case of non-reimbursable donations, unused funds are redirected to a community fund; otherwise, they are returned to the donor.\n    \n1.  KYC & Passkey-Based Authentication: KindFi integrates an advanced user authentication system built on the Stellar Passkey Kit, enhanced for seamless onboarding and security. Users can register and sign in using biometric passkey eliminating passwords while ensuring strong, Web3-native identity verification. In parallel, our AI-assisted KYC flow ensures fast, compliant, and secure verification. Identity checks are optimized to prevent duplication and fraud, with on-chain attestations recorded through Soroban smart contracts for transparency and traceability.\n    \n1.  Community Fund & Governance: Once a year, locked funds from failed projects are redistributed through a community voting process powered by Soroban. Only users holding a Kinders NFT—earned through meaningful contributions—can vote to decide which eligible projects will receive the funds. This mechanism reinforces transparent, community-driven governance and gives real utility to the reputation-based NFTs\n    \n1.  Kinders NFT as Governance Key: The Kinders NFT, built on Soroban, serves as a dynamic governance and participation tool. It evolves visually and functionally based on each user's on-chain reputation and activity. As users contribute to causes, their Kinders NFT gains reputation points, unlocking greater decision-making power in community votes. This incentivizes continued engagement while reinforcing trust and transparency in the ecosystem.\n    \n1.  Reputation & Tiered Voting System: KindFi introduces evolving Kinders NFTs with progressive tiers—Bronze, Silver, Gold, and Diamond—based on each user’s on-chain reputation. Higher tiers grant more voting power (1 to 10 votes per round), early access to campaigns, and exclusive rewards. Reputation grows through impact-driven actions like donation streaks, referrals, category diversity, completing quests, and successfully supporting projects. All actions and NFT progression are tracked and powered by Soroban smart contracts.\n    \n1.  On-Chain Referral Program: KindFi’s referral program lets users invite others to join and support causes using a unique referral code. When a referred user completes KYC and donates, both parties earn on-chain rewards powered by Soroban smart contracts. Rewards include reputation points and visual upgrades to their Kinders NFT. Soroban automates referral tracking, reputation updates, and tiered rewards, unlocking higher benefits as users grow their referral impact.\n    \n1.  Streak System: KindFi’s streak system rewards consistent donor activity through Soroban smart contracts. Streaks are built by donating frequently, in volume, or across diverse causes. Active streaks enhance a user’s Kinders NFT with dynamic visual effects and unlock benefits like increased voting power, reputation growth, early campaign access, and exclusive badges. Soroban tracks activity and enforces a grace period; if the streak is broken, progress resets automatically.\n    \n1.  Visibility & Recognition System: KindFi highlights top donors, projects, and organizations to foster community prestige and sustained engagement. Using Soroban smart contracts, the platform tracks real-time metrics like donation volume, campaign diversity, milestone success, and NFT level. Rankings dynamically update on-chain, powering the \"Feature Kinder\" section with titles like \"Top Donor\" or \"Best Regional Contributor.\" Highlighted users and projects earn exclusive NFTs, increased voting power, early access, and visual platform badges. High-impact projects are automatically promoted, AI-recommended to new donors, and prioritized for matching fund campaigns, all managed transparently via Soroban contracts.\n    \n1.  On-Chain Community Rankings & Rewards: KindFi’s community ranking system incentivizes sustained participation through automated, transparent rewards. Soroban smart contracts manage real-time leaderboards and prize distribution based on user reputation and platform activity.\n    \n1.  Dynamic Contribution Challenges System: KindFi’s Quest System introduces gamified challenges that motivate users to donate consistently and across diverse campaigns. Quests encourage actions like supporting new categories, maintaining streaks, or completing non-refundable donations. This system promotes ongoing engagement, fuels user reputation growth, and sustains the flow of funds to the Impact and Community Funds, creating a more interconnected and resilient ecosystem.\n    \n1.  Matching Funds (Impact Fund & Community Fund): KindFi amplifies individual donations through a matching model powered by two key sources: the Impact Fund (fed by success fees and direct donations) and the Community Fund (filled with unused funds from failed campaigns, redistributed via annual community vote). Soroban smart contracts and AI assess project history and projected impact to assign dynamic matching levels: Basic: +20% Intermediate: +50% Premium: +100%\n    \n    This model incentivizes early contributions, enhances campaign momentum, and recycles unused funds to boost ecosystem resilience. Matching funds are fueled by retained campaign balances, fractional success fees (0.3–1%), quest completions, direct donations, and external sponsors seeking platform visibility.  \n    \n\nThis is our next-generation crowdfunding platform leveraging Soroban smart contracts, Stellar infrastructure, and AI to create a secure, transparent ecosystem building a global movement of trust, transparency, and lasting impact",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "Success for KindFi means reshaping how social impact is funded by proving that our stellar based milestone, transparent crowdfunding can outperform traditional models and unlock real trust at scale. Post-mainnet, our core success targets include:\n\n-   50+ verified social impact projects launched across LATAM\n    \n-   3,000+ unique contributors onboarded through passkey + KYC flow\n    \n-   $250K+ in tracked donations processed via Stellar Network\n    \n-   At least 1 community-led governance cycles completed using NFT-based voting  \n    \n\nBut metrics alone aren’t enough. True success means:  \n\n-   NGOs and grassroots causes choosing KindFi over legacy platforms because they trust our blockchain milestone and escrow base model\n    \n-   Contributors returning not just to donate, but to participate in governance, complete quests, and grow their Kinders reputation NFTs\n    \n-   Developers and creators using KindFi not just as a product, but as a platform they can contribute to, and evolve  \n    \n\nWe will know we’ve succeeded when a campaign’s credibility is defined not by who runs it, but by how it runs openly, transparently, and on-chain.  \n\nUltimately, KindFi aims to prove that blockchain isn’t just viable for real-world impact, it’s superior. Success is not just launch. It’s adoption, accountability, and communities becoming their own stewards of change",
            "stellar.tractionEvidence": "-   Pitched to Key Stakeholders: Successfully presented KindFi to representatives from USAID and other government programs, generating strong interest in its ability to ensure transparency and accountability in funding, as well as its potential to bring on-chain accountability to processes that are often handled off-chain.\n    \n-   NGO and Foundation Outreach: Initiated discussions with foundations and NGOs in Costa Rica to understand their funding challenges and demonstrate how KindFi’s blockchain-powered solution can effectively address these pain points\n    \n-   Developer Community Engagement: KindFi is connected to a global network of over 6,000 Web3 developers, actively raising awareness and visibility for the platform. Our current developer-focused channel includes more than 141 members from Argentina, Costa Rica, India, Nigeria, Colombia, and Chile.\n    \n-   LATAM Community Engagement: KindFi is deeply integrated with the Dojo Coding community, which brings together over 186 Web3 developers from across Latin America who are actively contributing to the platform’s growth and innovation.\n    \n-   Partnership: We have successfully established partnerships with several organizations working with highly vulnerable communities in the region, particularly in Costa Rica. One example is ACJ-YMCA, an organization present in over 170 countries and reaching more than 68 million people worldwide. Their mission to bring social justice and peace to youth and their communities will be supported through donation campaigns on KindFi once we go live on mainnet\n    \n-   Partnership: We have also formalized a partnership with the project and foundation Asociación Deportiva E.G Goicoechea to relaunch their efforts through fundraising campaigns on KindFi. This initiative began on March 5, 2011, in Costa Rica in collaboration with the international ISSOP foundation, under the name Escuela de Fútbol Holanda Purral. The project was designed to use sports as a way to reach vulnerable children and youth, offering them holistic development, improved living conditions, education in various non-sport areas, essential tools, and even access to meals. It successfully operated for 12 years and was sponsored by the Instituto Costarricense del Deporte y la Recreación, having supported over 1,500 children in extreme need. Unfortunately, the lack of funding led to its closure on March 3, 2023. Today, many of the children who were once uplifted through sports are left without hope or support.\n    \n-   Partnership: We have also secured agreements with animal rescue organizations in the region, including Auxilio Animal Cartago, SOS Rescates Felinos, Fundación Tierra de Animales, and Casas Cuna Puntarenas. These organizations operate in areas with significant needs, and their initiatives will be featured under the Animal Rescue category on KindFi once we launch on mainnet.\n    \n\nLinks:\n\n-   https://app.onlydust.com/p/kindfi\n    \n-   https://x.com/KindFi_W3\n    \n-   https://acjymcacostarica.blogspot.com/\n    \n-   https://www.facebook.com/E.F.HolandaPurral\n    \n-   https://www.instagram.com/auxilioanimalcartago/?igsh=MTVxN3E2cjFqdXQwMQ%3D%3D#\n    \n-   https://www.instagram.com/sos_rescates_felinos/?igsh=NHZxbjVuaDQ5MDZo#\n    \n-   https://www.instagram.com/fundaciontierradeanimales/?igsh=MTBtM25jcmNmNnJvNg%3D%3D#\n    \n-   https://www.instagram.com/casas_cuna_puntarenas/?igsh=bDJtMW12MDc5cGl0#",
            "stellar.goToMarketPlan": "Our go-to-market strategy is grounded in real-world need, regional expertise, and a community-first approach, designed to scale KindFi from a LATAM-based pilot into a global, trust-driven crowdfunding platform. We are launching initially in Costa Rica, where our team is based and where we have already engaged local foundations and NGOs for early campaign onboarding. From there, we will expand across key LATAM regions where Stellar already has ambassador programs (e.g., Colombia, Mexico, Argentina, Chile), aiming to co-create with those communities, identify trusted local projects, and onboard regional ambassadors into KindFi’s ecosystem. Our goal is to establish KindFi nodes in multiple countries, creating a real grassroots movement around verifiable social impact on Stellar.  \n\nAs LATAM founders, we understand firsthand the systemic challenges in our region access to funds, transparency gaps, and donor mistrust. That’s why we prioritize partnering with other LATAM-based projects, builders, and communities, because no one understands the region’s needs better than those who live them. KindFi is not designed in abstraction; it’s built in context.\n\n  \nWe will strengthen go-to-market through partnerships with other Stellar-based solutions like Meru, Palta Labs Team, and other ecosystem tools that support onboarding, identity, and create impact. Together, we create a more unified experience for users entering Web3 for the first time without needing to understand its complexity at once.\n\n  \nOn the marketing and PR front, we will:  \n\n-   Launch public demo sessions featuring verified campaigns and live on-chain milestone releases\n    \n-   Publish impact stories of early KindFi projects through newsletters, social channels, and ecosystem blogs\n    \n-   Engage Web3 and social impact podcasts, LATAM blockchain communities, and Stellar’s own media channels\n    \n-   Engage alternative media and podcasters as \"No pasa nada\" and \"Delfino\" (Costa Rican Alternative News Source) to introduce the new way of changing things in LATAM using Stellar and KindFi together.\n    \n-   Build a contributor reward system that can be uses through the Only Dust program, incentivizing open-source participation, user-generated content, and social sharing enhanced with KindFi’s NFT badges and on-chain contributor recognition.\n    \n-   Participate in key regional events and hackathons to activate both developers and cause creators  \n    \n\nDigital marketing will focus on multilingual content (ES, EN, PT) across platforms like Twitter/X, LinkedIn, and Instagram—anchored by a strong visual identity and messaging centered on “trustless transparency” and “real-world change powered by crypto and Stellar, the only blockchain truly impacting real-world causes.\"  \n\nUltimately, KindFi’s adoption strategy is not just about reach it’s about depth. We are building a long-term presence in each region we serve, with local validators, community members, and project owners acting as stewards of impact. Our platform grows through trust, transparency, and local relevance not just paid promotion and dreams.",
            "stellar.tranche1Deliverables": "Estimated completion: August 2025  \nBudget: $45,000 in XLM  \n\nBrief description:  \nThe MVP represents the foundation of KindFi’s platform establishing a secure, decentralized, and transparent crowdfunding flow that validates both user and project authenticity from the first interaction. This phase includes the deployment of our end-to-end authentication and identity verification system, campaign creation interface, escrow-based fund custody, and contribution flows tied to milestone releases.  \n\nOur architecture leverages the Stellar blockchain to handle secure fund management, real-time indexing, and on-chain verification of campaign data. Contributors can register, verify their identity through an AI-assisted KYC process that complies with SEP-0012, and securely log in using device-native Passkey authentication (biometric WebAuthn). This guarantees phishing-resistant access and links every user to a verified Stellar address through Soroban smart contracts.  \n\nProject creators (Kindlers) will be able to create a campaign with clearly defined milestones. These milestones are recorded on-chain, and donations are held in escrow until completion is verified. An internal reviewer dashboard will allow milestone approvals to trigger on-chain releases of funds. While AI will eventually support verification flows, human administrators will validate them manually at this stage, with auditability ensured via SubQuery-based ledger indexing.  \n\nThe MVP also includes:\n\n-   Initial onboarding integration using test mode to simulate real-world access\n    \n-   A multilingual frontend experience built with Next.js 15, React 19, Tailwind, and shadcn/ui\n    \n-   Contributor and project creator dashboards for basic account and project management\n    \n-   Early implementation of NFT-based contributor identity and badge placeholders (non-dynamic at this stage)  \n    \n\nAll smart contracts deployed in this phase (authentication and escrow) will operate on Stellar testnet, and all user flows will be fully testable with dev data and mock user verification.  \n\nHow to measure completion:  \n\n-   Fully working flow from Passkey-based registration to first testnet donation\n    \n-   Admin dashboard triggers milestone-based fund release logic on testnet\n    \n-   SEP-0012-compatible KYC verification pipeline functional and connected to blockchain addresses\n    \n-   Campaigns are stored with milestone definitions and locked under escrow\n    \n-   Users can simulate donations using testnet wallets\n    \n-   Project creation, updates, basic search, and language toggle implemented in frontend  \n    \n\nThis MVP unlocks not only our internal dogfooding and testing, but also external testing by contributors and community reviewers, who will be invited to audit and validate the core infrastructure",
            "stellar.tranche2Testnet": "Estimated completion: November 2025  \nBudget: $0 (Access to Stellar LaunchKit for audits and infra support)  \n\nBrief description:  \nThe Testnet milestone focuses on expanding core functionality into a fully feature-complete product, operating on Stellar testnet and integrating Soroban-based smart contracts, gamification layers, and advanced contribution logic. This phase introduces the first version of our dynamic NFT-based reputation system, milestone automation, and AI-assisted moderation and onboarding tools. All flows will be testable end-to-end and structured for external audit and simulation.  \n\nKey developments during this phase include:  \n  \nDynamic NFT Reputation System (Kinders)\n\nThe Kinders NFT system, deployed on Soroban, evolves based on user impact. During Testnet, contributors will begin earning NFTs that grow in visual complexity and functionality based on their behavior (e.g., donation frequency, diversity of causes, completed quests, and referral performance). NFTs will be tied on-chain to each user’s account and updated via Soroban logic and contribution triggers. We will implement four progressive NFT tiers (Bronze, Silver, Gold, Diamond), each conferring a different number of governance votes and early-access privileges. This system establishes the basis for future DAO-style community engagement and voting on fund redistribution  \n  \nAI-Powered Project Review & KYC Enhancement\n\nWe will introduce our first live implementation of KindFi's AI layer, focused on assisting in:\n\n-   Project legitimacy checks using Multimodal RAG for evaluating images, documents, and impact descriptions\n    \n-   AI moderation agents that detect fraudulent campaign signals or inconsistencies\n    \n-   Enhanced KYC confidence scoring and auto-flagging of suspicious submissions\n    \n-   An AI assistant that helps project creators write better campaign narratives, verify milestone documentation, and simulate expected impact\n    \n\nWhile human validation remains critical, AI tooling will accelerate throughput, help prioritize reviews, and maintain consistent standards  \n  \nQuest, Streak, and Referral Systems\n\nWe will deploy the first logic for KindFi’s gamified contributor experience, including:\n\n-   Quest Engine: Smart contract and UI for goal-based participation (e.g., support a campaign in 3 different regions; donate 3 weeks in a row)\n    \n-   Streak Tracker: Reputation boost for consistent behavior over time (e.g., weekly/monthly donation consistency)\n    \n-   Referral Engine: On-chain Soroban logic to track referred users, update Kinders NFTs, and issue rewards automatically for verified onboarding and donation activity\n    \n\nThis phase builds the incentive structures that transform passive donations into long-term, identity-linked participation  \n  \nCommunity Fund Governance (Simulation)\n\nThe Testnet phase will also include a simulated governance flow to redistribute unused or retained funds from unfulfilled campaigns. KindFi will introduce:\n\n-   A voting UI accessible to Kinders with valid NFTs\n    \n-   Vote weighting by NFT tier (e.g., Bronze = 1 vote, Diamond = 10 votes)\n    \n-   Smart contract logic to simulate redistribution scenarios and visualize impact\n    \n-   Community fund balance tracker (read from escrow contract logs)\n    \n\nThis lays the groundwork for decentralized platform governance and collective decision-making around resource allocation.  \n  \nOther Key Deliverables\n\n-   Escrow automation enhancements: Funds released automatically upon off-chain verification status and milestone signals\n    \n-   SubQuery indexing for donation history, referral trees, and NFT evolution\n    \n-   Event-driven notification system: Email/webhook-based milestone alerts, project updates, and vote calls\n    \n\nHow to measure completion:\n\n-   Dynamic NFT issuance and evolution functional on testnet\n    \n-   Smart contract-based referral tracking operational\n    \n-   AI moderation agents reviewing real project drafts\n    \n-   Simulated fund redistribution flow fully functional\n    \n-   Quest completion recorded and reflected in NFT metadata\n    \n-   All campaign types, user types, and contribution actions recorded on SubQuery and queryable from dashboard\n    \n\n  \nThis phase ends with a fully operational product on Stellar testnet, with all user types (donors, creators, admins) having access to a decentralized, data-driven, gamified environment for validating social causes.",
            "stellar.tranche3Mainnet": "Estimated completion: February 2026  \nBudget: $35,000 in XLM  \n\nBrief description:  \nThe Mainnet milestone marks the public launch of KindFi’s platform on the Stellar blockchain. By this phase, all Soroban smart contracts, identity systems, gamification logic, and governance tooling will be battle-tested and production-ready. The entire platform will transition from Stellar testnet to mainnet, with full end-to-end flows for donors, project creators, and governance participants activated in a live environment.  \n\nThis phase also represents the integration of transparency, security, and long-term engagement incentives into a cohesive experience designed for scale, enabling both grassroots organizations and global contributors to interact with complete confidence.  \n  \nProduction Deployment of All Smart Contracts\n\nAll core contracts will be deployed to Stellar mainnet, including:\n\n-   Escrow smart contract with milestone release logic\n    \n-   AuthController + AccountFactory for biometric passkey-based decentralized login\n    \n-   Kinders NFT logic with level-based voting power and reward tiering\n    \n-   Community fund and governance contract, supporting annual redistribution with on-chain voting\n    \n-   Quest and referral smart contracts to maintain reputation state and trigger NFT mutations  \n    \n\nAll contracts will include upgrade safeguards, permission controls, and verification support  \n  \nMainnet Project Onboarding\n\nAt least 7 real-world causes will be onboarded and funded in this phase. These will be verified nonprofits or grassroots initiatives that pass full KYC and milestone pre-validation. This will demonstrate:\n\n-   Working fiat onramp (via OnRamper or Circle)\n    \n-   Real user donations flowing into mainnet escrow\n    \n-   Verified milestone completion triggering fund release\n    \n-   Publicly visible impact reporting, uploaded to IPFS or off-chain sources, and linked to on-chain proof  \n    \n\nEach project will also support project updates, multilingual descriptions, and post-completion feedback collection.  \n  \nAI Moderation & Recommendation System\n\nAI agents will be expanded to include:\n\n-   Project matching engine that recommends causes to users based on their past behavior, donation history, and region/category preferences\n    \n-   AI-assistants in the campaign creation flow to help Kindlers optimize content for funding success\n    \n-   Real-time fraud detection alerts and project scoring using multimodal AI inputs  \n    \n\nThis AI layer will make platform operations more scalable, user-friendly, and transparent for both creators and contributors.  \n  \nFull Gamification & Impact Engine\n\nThe NFT-based reputation system will be fully activated, with Kinders NFTs now:\n\n-   Visually evolving based on user behavior\n    \n-   Granting access to exclusive campaigns or private funding rounds\n    \n-   Unlocking advanced governance rights\n    \n-   Displayed as public identity and social proof across the platform  \n    \n\nUsers will earn achievements for consistency, diversity, and social sharing, and can track their progress through a personal impact dashboard. Leaderboards and featured Kinders/Kindlers will be promoted based on on-chain metrics  \n  \nCommunity Governance Activation\n\n-   The first community voting cycle for fund redistribution will take place\n    \n-   All verified Kinders with voting rights via their NFTs will be able to participate\n    \n-   Voting logic will be executed on-chain using the mainnet Community Fund contract\n    \n-   Redistribution logic will include options to support promising upcoming campaigns or reward top contributors with NFT-based incentives  \n    \n\nThis cycle will set a precedent for transparent, decentralized governance powered by real user reputation and project impact.  \n  \nPlatform-wide Readiness\n\n-   All onboarding, KYC, and recovery flows will support mobile and desktop\n    \n-   Localization (ES, EN,) completed for user-facing content and onboarding\n    \n-   Legal disclaimers, T&C, and data protection policies audited for LATAM\n    \n-   Real-time indexer tracking donations, project milestones, referral trees, and NFT state.\n    \n\nHow to measure completion:\n\n-   All users interact with production-grade biometric Passkey login linked to blockchain\n    \n-   Kinders NFTs are minted and evolve based on live user actions\n    \n-   Campaigns are created, funded, and milestone-verified using real funds\n    \n-   Escrow logic performs correctly, with no premature release or contract errors\n    \n-   Community Fund executes first governance cycle, with verifiable voting and fund reallocation\n    \n-   On-chain and off-chain data are continuously indexed and exposed via dashboards\n    \n-   Feedback collected from early real-world users and featured projects\n    \n\n  \nThis milestone represents a full product release that integrates decentralized identity, reputation, and funding—all operating transparently on Stellar mainnet. With strong gamification and governance mechanics in place, KindFi will now serve as live proof of concept for how Web3 can power trust, transparency, and global impact",
            "stellar.teamMembers": "Brandon Andrey Fernandez Fernandez, Andler, Caro Fdez",
            "stellar.urls": {
              "website": "https://www.kindfi.org/",
              "codeRepository": "https://github.com/kindfi-org/kindfi",
              "videoURL": "https://youtu.be/Hlh4R8u-lWU"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/kindfi/",
              "twitter": "https://x.com/KindFi_W3"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:14",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:spinach",
          "projectName": "Spinach",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Liquid retrofunding that grows DEX TVL",
          "status": "Information Collection",
          "category": "Applications",
          "description": "Grow DEX TVL by running spinach competitions that rally builders to orchestrate liquidity",
          "fundsApprovedInUSD": 70000.0,
          "fundsPaid": [
            {
              "amount": 0.0,
              "denomination": "USD"
            },
            {
              "amount": 0.0,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/presentation/d/1A42nICmMg6ngu-3eBSMzBdqZ_TR9KQSoZ5eT5jFHTN0/edit?slide=id.g3474fccb94d_0_0#slide=id.g3474fccb94d_0_0",
            "stellar.productsAndServices": "This submission is to create a first MVP for Spinach that enables:\n\n1.  Anyone to request the creation of a new Spinach competition\n    \n1.  An admin to manually add a new Spinach competition for a given token to the system\n    \n1.  A backend to track liquidity orchestrated for a token per participating project\n    \n1.  Visitors to view a leaderboard of liquidity orchestrated per participating project and paid out rewards so far\n    \n1.  Projects to receive daily payments for the liquidity they orchestrated the day before\n    \n\n  \n\nOnce live, Spinach will be the first liquidity incentive platform to go live on Stellar.\n\n  \n\nNote: for this MVP we do not yet leverage Soroban. If the MVP is successful, we will start creating Sorobon smart contracts for depositing funds to be distributed as well as automated distribution of the funds on a daily basis.",
            "stellar.successCriteria": "-   3 Spinach Competitions at launch\n    \n-   10 Spinach Competitions simultaneously running 3 months after launch, distributing $10k+ per month\n    \n-   $20k DeFi TVL on Stellar created for every $1k in rewards distributed through Spinach\n    \n-   5 participating projects per Spinach Competition\n    \n-   Participating projects start creating programs with incentives for end users so they can orchestrate more liquidity on Stellar\n    \n-   Reaching 250+ end users through these end-user incentive programs",
            "stellar.goToMarketPlan": "On mainnet launch date we’ll partner with Glo Dollar to run a Spinach liquidity competition for Glo Dollar at $2k / month.\n\n  \n\nIn the period leading up to the launch, we’ll be speaking with projects on Stellar that have their own token to discuss having them launch a Spinach competition for their tokens. \n\n  \n\nIn addition, we’d like to partner with SDF to incentivize liquidity orchestration by/for new projects participating in SCF rounds. This encourages new projects to optimize for growing TVL and liquidity, which is good for the entire ecosystem. Simultaneously this helps with funding for nascent projects that are gaining some traction.\n\n  \n\nWith this three-pronged approach, we intend to establish Spinach as a default ecosystem growth tactic on Stellar.",
            "stellar.tractionEvidence": "The Glo Dollar team has been running an excel-based alpha v0.01 of Spinach in the Celo ecosystem and noticed it has been working well within the Glo Dollar context. Through distributing just $2k in builder grants per month we managed to orchestrate $66k in liquidity on Celo, activating 8 projects to participate who rallied over 150 community users to provide liquidity.\n\n  \n\nFor evidence of the positive feedback:  \n1. Response to announcement https://x.com/glodollar/status/1843638466648985986\n\n2. $19k USDGLO liquidity added in the first month: https://x.com/glodollar/status/1859232965202722860 \n\n3. $36k USDGLO liquidity added in the second month: https://x.com/glodollar/status/1859925522345873609/photo/1 (note there’s also $36k in liquidity added by the other tokens, for a total of $72k)\n\n4. Ubeswap launched a farm to orchestrate more USDGLO liquidity on their platform: https://app.ubeswap.org/#/farmv3/0x28ade0134b9d0bc7041f4e5ea74fecb58504720b\n\n5. Commons Protocol made an internal proposal to launch a staking program based on Glo Dollar’s Spinach rewards\n\n  \n\nThis prompted us to start exploring Spinach as a stand alone product. During the Eth Denver conference in February we spoke with half a dozen projects and chains which we believe might benefit from using Spinach. The response has been positive and encouraging us to build it. We’re now looking to get funding to start building an MVP so that anyone can launch Spinach liquidity competitions for builders on Stellar. \n\n  \n\nEvidence of positive feedback:\n\n1.  https://x.com/EthereumDenver/status/1895899113298018422 talk at Eth Denver positive responses\n    \n1.  https://x.com/search?q=%40spinachfi&src=typed_query&f=live Organic responses to the first tweets\n    \n1.  Spoke with Anke during Schelling Point who gave positive feedback and encouraged us to apply to this program!\n    \n\n  \n\nThree example projects that could leverage Spinach:\n\n1.  Blend: incentivize builders to incorporate Blend pools in their apps\n    \n1.  Ultra Capital: incentivize builders to incorporate yETH and yXLM in their apps, ultimately leading to higher revenue for all stakeholders\n    \n1.  USF Microbond Issuance: drive liquidity once the token is available to trade, while encouraging builders to incorporate its issuance in their apps",
            "stellar.tranche1Deliverables": "Spinach tech MVP:\n\n1.  Core infrastructure to manually add new Spinach competitions for a given token\n    \n1.  Data gathering modules that tracks liquidity added per participating project\n    \n1.  Payout module that streams rewards to participating projects on a daily basis\n    \n1.  Leaderboard on https://spinach.fi that shows current liquidity added per participating project, and their earnings so far in this month\n    \n\nMeasure completion by submitting a new Spinach competition for a Stellar token, and seeing it added to the spinach.fi platform with mocked data.\n\nCompleted by: May 30, 2025\n\nBudget: $50k",
            "stellar.tranche2Testnet": "Spinach testnet run: \n\n1.  Track liquidity orchestrated on testnet for 2 weeks\n    \n1.  Run payout module for a Stellar token on testnet\n    \n\nMeasure completion by validating that testnet payments have been made to mock participating projects, and that tracked liquidity as reported in the leaderboard is accurate.\n\nCompleted by: June 17, 2025 \n\nBudget: $10k",
            "stellar.tranche3Mainnet": "Spinach mainnet launch:\n\n1.  Launch a first Spinach campaign for a to-be-selected Stellar token\n    \n1.  Track liquidity orchestrated on mainnet for 2 weeks\n    \n1.  Run payout module for the Stellar token on mainnet for 2 weeks\n    \n\nMeasure completion by validating that payments are made to actual participating projects.\n\nCompleted by: July 1, 2025\n\nBudget: $10k",
            "stellar.teamMembers": "Garm Lucassen, Rad, Christine_USDGLO",
            "stellar.urls": {
              "website": "http://spinach.fi/",
              "codeRepository": "https://github.com/SpinachFi/spinach",
              "videoURL": "https://youtu.be/BKSBmDIdQMw"
            },
            "stellar.socialMedia": {
              "twitter": "https://x.com/spinachfi"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:15",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:flow",
          "projectName": "Flow",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Modular Data Pipelines for Stellar",
          "status": "Awarded",
          "category": "Infrastructure & Services",
          "description": "Offers programmable data pipelines to help Stellar&amp;#x2F;Soroban developers automate real-time workflows by unifying classic ledger and smart contract event streaming.",
          "fundsApprovedInUSD": 120000.0,
          "fundsPaid": [
            {
              "amount": 40000.0,
              "denomination": "USD"
            },
            {
              "amount": 137185.6,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-21T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://drive.google.com/file/d/1l_7yjAfWR3asErRd7c-6U0sIQUiEnIjc/view?usp=sharing",
            "stellar.productsAndServices": "Obsrvr Flow provides modular, event-driven data pipelines purpose-built for the Stellar ecosystem, enabling developers to automate real-time workflows. It ingests full classic and Soroban data via Galexie or Stellar RPC, overcoming Horizon's limitations, particularly for complex Soroban event access which is currently difficult for many builders. Developers define Directed Acyclic Graphs (DAGs) using our CLI or SDK to chain together stateless, reusable processors (microservices) that apply custom logic – like filtering, enrichment (e.g., with AI), or state calculations. Processed data streams reliably to databases, APIs, alerting systems, or even triggers Soroban contract calls. While core tooling like the CLI and processor templates will be available, developers will primarily deploy and operate these pipelines via a managed Obsrvr Flow platform, simplifying setup and maintenance.\n\nKey features leveraging Stellar/Soroban:\n\n-   Unified Ingestion: Direct access to raw classic ledger data and Soroban events/effects via Galexie or native Stellar RPC.\n    \n-   Programmable Processors: Build custom logic using reusable, Protobuf-enforced microservices reacting to Stellar operations or Soroban events. Chain, replay, and test processors independently.\n    \n-   Multi-Sink Routing: Stream processed data reliably to diverse destinations (Postgres, webhooks, Discord, triggering Soroban RPC calls).\n    \n-   Developer Tooling: CLI and Control Plane SDK (interfacing with the managed platform) for declarative pipeline management, schema registry, real-time observability, and retry queues.\n    \n-   Public Data Source: We will provide a publicly accessible, Galexie-powered data lake of Stellar ledger data (Mainnet/Testnet) via Google Cloud Storage (Requester Pays) to accelerate ecosystem development.\n    \n\nThis unified infrastructure is vital for wallet/dApp builders (who currently often build custom indexers), analytics platforms, and custody solutions needing timely, granular, and programmable access to both classic and Soroban activity.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "We will measure success through a combination of adoption, functionality, and ecosystem impact:\n\n-   Adoption: 20+ distinct developer teams actively using the Flow CLI, SDK or processors in development or production environments by the end of Q1 2026.\n    \n-   Deployment: 10+ unique, custom pipelines deployed by external teams on the Flow platform, demonstrating real-world application.\n    \n-   Efficiency: Demonstrate measurable reduction (e.g., target >50% reduction in boilerplate code/development time) in building specific real-time automation tasks compared to traditional Horizon polling methods, showcased via at least 2 public case studies.\n    \n-   Value Proposition Validation: At least 3 distinct production use cases publicly highlighted (e.g., via blog posts, demos) demonstrating the value of unified classic and Soroban data streaming through Flow.\n    \n-   Ecosystem Impact: Obsrvr Flow becomes a recognized and recommended infrastructure component for real-time data processing within the Stellar ecosystem, with evidence of replacing custom-built internal indexers for several key teams.",
            "stellar.tractionEvidence": "'-   Validated core need for programmable, real-time data access through interviews with multiple Stellar infrastructure builders and application teams.\n    \n-   Unified solution that has both classic and Soroban data is a missing component from most indexing solutions in the ecosystem\n    \n-   Direct feedback from SDF teams that highlighted the need for streaming data, reinforcing the need for a unified streaming solution like Flow. (They confirmed having to build their own indexer due to these limitations).",
            "stellar.goToMarketPlan": "Our go-to-market strategy focuses on developer adoption within the Stellar ecosystem:\n\n1.  Target Key Builders: Prioritize outreach to Stellar developers, particularly wallet/dApp builders, infrastructure providers, custody solutions, and analytics teams who face challenges with existing data access methods (especially for Soroban).\n    \n1.  Leverage Public Data Source: Promote the publicly accessible Galexie data lake on GCS as a low-friction entry point for developers to experiment with raw ledger data and prototype Flow pipelines.\n    \n1.  Developer Resources & Community: Provide comprehensive documentation, SDKs, CLI tooling, and reusable processor templates. Engage actively via Stellar developer Discord, run workshops, and create onboarding guides (potentially aligning with Stellar LaunchKit).\n    \n1.  Ecosystem Partnerships: Collaborate closely with wallet teams, custody providers, analytics platforms, and SDF ecosystem partners for integration feedback, early adoption, and joint case studies.\n    \n1.  Content & Use Cases: Publish blog posts, tutorials, and demos showcasing specific, high-value use cases enabled by Flow (e.g., real-time compliance monitoring, unified classic/Soroban analytics, automated Soroban interactions).",
            "stellar.tranche1Deliverables": "'-   [Deliverable 1] Core Pipeline Engine & Control Plane API\n    \n    -   Brief description: Develop the fundamental backend service that manages pipeline state, orchestrates data flow between processors, handles errors/retries, and exposes a gRPC API for configuration and monitoring.\n        \n    -   How to measure completion: Internal tests confirm engine can process data streams, manage basic DAGs, and handle restarts; gRPC API endpoints for defining pipelines, registering schemas, and querying status are functional and documented internally.\n        \n    -   Estimated date of completion: June 2025\n        \n    -   Budget: $15,000\n        \n    \n    [Deliverable 2] Flow CLI Tool\n    \n    -   Brief description: Create the command-line interface for developers to interact with the Flow control plane. This includes commands to define, deploy, update, and inspect pipelines.\n        \n    -   How to measure completion: CLI allows users to successfully connect to the control plane API, submit a pipeline definition (YAML), list deployed pipelines, and retrieve basic status/logs. CLI packaged for basic distribution (e.g., docker container).\n        \n    -   Estimated date of completion: June 2025\n        \n    -   Budget: $10,000\n        \n    \n    [Deliverable 3] Galexie Ingestion & Public Data Source (Classic)\n    \n    -   Brief description: Implement the ingestion module to read classic Stellar ledger data (Ledgers, Transactions, Operations, Meta) from Galexie-captured files stored in Google Cloud Storage. Establish and populate the public GCS buckets (Requester Pays) for Mainnet, Testnet and Futurenet data (Following possible sep for Ledger Metadata Storage - https://github.com/stellar/stellar-protocol/discussions/1678).\n        \n    -   How to measure completion: Ingestion module successfully parses Galexie data formats and pushes structured events (e.g., Protobuf) into the pipeline engine's input queue; Public GCS buckets are created, configured for Requester Pays, and contain recent Mainnet/Testnet/Futurenet ledger data accessible via standard GCS tools. Documentation on accessing the public data is available.\n        \n    -   Estimated date of completion: July 2025\n        \n    -   Budget: $5,000\n        \n    \n    [Deliverable 4] Initial Processors & Basic Pipeline Demo\n    \n    -   Brief description: Develop and test three initial stateless processors (e.g., Account - filtering ops by account, LatestLedger - latest ledger info, TokenTransferProcessor - extracting unified asset events). Deploy a simple pipeline using these processors and create an internal demo endpoint (e.g., serving basic /latestledger data).\n        \n    -   How to measure completion: Three processors are implemented, unit-tested, and integrated with the engine; A pipeline successfully chains these processors using the CLI; Internal endpoint returns expected data derived from the pipeline processing live or replayed classic ledger data.\n        \n    -   Estimated date of completion: July 2025\n        \n    -   Budget: $15,000",
            "stellar.tranche2Testnet": "'-   [Deliverable 5] Testnet Deployment & Stability Validation\n    \n    -   Brief description: Deploy the MVP version of the Obsrvr Flow infrastructure configured to ingest and process data from the Stellar Testnet. Conduct internal testing to validate stability, DAG execution logic, error handling, and consumer routing under simulated load.\n        \n    -   How to measure completion: A stable instance of Flow is running and processing Stellar Testnet data continuously for at least 1 week; Internal test reports confirm successful execution of multi-step DAGs, correct error logging/recovery for simulated processor failures, and reliable delivery of processed data to test sinks. Public access endpoint available for community testing.\n        \n    -   Estimated date of completion: August 2025\n        \n    -   Budget: $5000\n        \n    \n    [Deliverable 6] Open Source Resources (Schemas, Templates) & Public Registry\n    \n    -   Brief description: Publish the core Protobuf schemas used for data interchange within Flow to a public repository. Release templates or examples for building custom processors (e.g., in Go/Rust) and basic pipeline configuration examples. Create basic registry for community developed processors and Protobuf schema definitions\n        \n    -   How to measure completion: Public GitHub repository created containing Protobuf schema definitions (.proto files) with clear documentation; Public registry available with all processors and Protobuf schemas created so far; Example processor code (at least one language) demonstrating subscription and processing logic is available; Sample pipeline configuration files (YAML) are published.\n        \n    -   Estimated date of completion: September 2025\n        \n    -   Budget: $20000\n        \n    \n    [Deliverable 7] Developer Portal & Feedback Channel\n    \n    -   Brief description: Launch a basic developer portal (e.g., using static site generator) with initial documentation covering architecture overview, CLI usage, public data access, and how to build a simple processor. Use Stellar Developer discord project channel as a dedicated public channel for community feedback and support. Establish other support channel options outside of discord.\n        \n    -   How to measure completion: Developer portal website is live with core documentation sections published; Public Discord channel (or similar forum) is created, announced, and monitored for feedback and questions.\n        \n    -   Estimated date of completion: September 2025\n        \n    -   Budget: $5,000",
            "stellar.tranche3Mainnet": "'-   [Deliverable 8] Mainnet Production Deployment & Monitoring\n    \n    -   Brief description: Deploy the Obsrvr Flow infrastructure in a production-ready configuration to handle Stellar Mainnet data streams. Implement necessary monitoring, alerting, and scaling mechanisms for reliable operation.\n        \n    -   How to measure completion: Production instance of Flow successfully ingesting and processing live Stellar Mainnet data; Monitoring dashboards (e.g., Grafana) are configured showing key system metrics (throughput, latency, error rates); Basic alerting rules are in place for critical failures. Infrastructure meets defined availability targets (e.g., 99.9% uptime) during the initial launch period.\n        \n    -   Estimated date of completion: October 2025\n        \n    -   Budget: $20,000\n        \n    \n    [Deliverable 9] Soroban Event Ingestion & Processing\n    \n    -   Brief description: Enhance the ingestion module and pipeline engine to parse and process key Soroban events (e.g., contract deployments, function invocations, diagnostic events, standard contract events). Update relevant Protobuf schemas. Develop at least one processor specifically handling Soroban data.\n        \n    -   How to measure completion: Flow can ingest Soroban events streamed via RPC or parsed from Galexie data; Protobuf schemas are updated to include Soroban event structures; At least one processor demonstrating filtering or aggregation of Soroban events (e.g., tracking specific contract interactions) is functional. Successful processing demonstrated on Mainnet/Testnet Soroban data.\n        \n    -   Estimated date of completion: November 2025\n        \n    -   Budget: $5,000\n        \n    \n    [Deliverable 10] Multi-Sink Consumer Implementation & Examples\n    \n    -   Brief description: Implement and test support for multiple downstream consumers (sinks). Provide working examples for routing processed pipeline data to at least three distinct types of sinks (e.g., a Postgres database, a webhook endpoint, a Text/Email alert, triggering a Soroban contract call via RPC).\n        \n    -   How to measure completion: Consumer framework supports routing data to different sink types based on pipeline configuration; Example code and configurations demonstrating data delivery to Postgres, a webhook receiver, and Text/Email (or similar alert mechanism) are documented and functional; Example demonstrating triggering a Stellar RPC call based on pipeline output is functional.\n        \n    -   Estimated date of completion: November 2025\n        \n    -   Budget: $15,000\n        \n    \n    [Deliverable 11] Latest Ledger Endpoint (/latestledger) & AI Example\n    \n    -   Brief description: Deploy a public API endpoint /latestledger powered entirely by an Obsrvr Flow pipeline that provides up to date ledger information on the latest ledgers available on each network. Develop and showcase one example processor using basic AI/ML for data enrichment (e.g., transaction classification).\n        \n    -   How to measure completion: Public /latestledger endpoint is live.; An example processor demonstrating AI/ML enrichment is implemented and included in documentation/examples.\n        \n    -   Estimated date of completion: November 2025\n        \n    -   Budget: $5,000",
            "stellar.teamMembers": "Tillman Mosley",
            "stellar.urls": {
              "website": "https://www.withobsrvr.com",
              "codeRepository": "https://github.com/withObsrvr/Flow",
              "videoURL": "https://www.canva.com/design/DAGiu70vWSk/jt_Ym86U88GxywKnXZC0fw/watch?utm_content=DAGiu70vWSk&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=hb940aca194"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/obsrvr"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:16",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:via-labs",
          "projectName": "VIA Labs",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Cross-Chain Interop: Oracles to Tokens",
          "status": "Awarded",
          "category": "Infrastructure & Services",
          "description": "VIA Labs will deliver cross-chain interoperability to empower dapp developers by seamlessly linking Stellar with 140+ blockchains.",
          "fundsApprovedInUSD": 95000.0,
          "fundsPaid": [
            {
              "amount": 31666.67,
              "denomination": "USD"
            },
            {
              "amount": 105305.47,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-22T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://github.com/VIALabs-io",
            "stellar.productsAndServices": "The VIA Network is an omni-chain infrastructure that enables developers to create cross-chain products between Stellar and 140+ other blockchains (including both EVM and non-EVM chains).\n\nThis interconnectivity opens the door for dapp developers to send messages, data and value between all supported chains.\n\n-   Unified Liquidity: Access liquidity across many blockchains.\n    \n-   Unified Features: Unique features easily accessible across networks.\n    \n-   Unified Developer Experience: Ease of integration and maintenance.\n    \n-   Unified User Base: Users previously scattered across various networks now united.\n    \n\n  \nThis will enable the expansion and/or migration of existing dapps from other networks to easily onboard into the Stellar ecosystem.  \n  \nThis submission will expand interoperability on Stellar by:\n\n-   Robust Bridging Protocols: Enable seamless token, NFT, and data transfers between Stellar and over 140 blockchains.\n    \n-   Enhanced Developer Tools: Provide unified APIs and SDKs to simplify cross-chain dapp integration, along with real-time transaction monitoring.\n    \n-   User-Focused Solutions: Offer a dedicated front-end for Stellar-compatible wallets and streamlined migration paths for existing dapps, fostering a unified liquidity pool and user base.\n    \n-   Workshops & Technical Support: Host developer workshops and offer expert consulting to accelerate cross-chain adoption and integration on Stellar.\n    \n\nFurther, VIA Labs leverages a non-conventional, time-efficient approach to cross-chain expansion. To replicate the VIA Network on Stellar, we are partnering with Cheesecake Labs—renowned experts in Stellar’s Soroban smart contract ecosystem. Cheesecake Labs brings specialized expertise in building secure, high-performance Soroban contracts, while VIA Labs adapts our proven cross-chain architecture for Stellar.\n\nOur integration strategy centers on a dual-chain bridging mechanism that portably translates our core protocols onto Stellar’s network. Specifically, we are porting our cross-chain messaging, asset transfer, and data synchronization protocols into modular Soroban smart contracts. This setup leverages Stellar’s fast, low-cost transactions and deterministic execution, ensuring atomic swaps, asynchronous message passing, and unified liquidity management with minimal latency.\n\nThroughout this process, VIA Labs leads the strategic planning and technical integration, working in lockstep with Cheesecake Labs to validate every integration point. This close collaboration guarantees that all critical components are accurately translated and optimized for immediate deployment, delivering a robust, scalable, and secure network expansion on Stellar.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "Success Criteria for the Stellar infrastructure launch encompass both technical performance and go-to-market impact:\n\n-   Technical Metrics:\n    \n    -   Successful deployment and interaction of VIA Labs’ cross-chain modules on Stellar—demonstrated by a stable, audited set of Soroban-based smart contracts capable of seamless communication with EVM networks.\n        \n    -   Metrics such as transaction speed, low latency, high throughput, and minimal downtime, alongside efficient gas usage and resolution of any critical bug reports.\n        \n    -   Comprehensive and user-friendly documentation, robust APIs, and SDKs that lead to high adoption rates and positive developer feedback in early testnet interactions.\n        \n-   Go-to-Market Metrics:\n    \n    -   Measurable growth in developer participation through hackathons, workshops, and online events—tracked by new developer sign-ups, active project submissions, and social media engagement on platforms like X (Twitter).\n        \n    -   Strategic Partnerships & Integrations - Formation of key partnerships (e.g., stablecoin providers, wallet providers, and Stellar DeFi projects) that result in visible “lighthouse” integrations, driving real-world usage such as increased cross-chain transaction volumes and liquidity flows.\n        \n    -   Enhanced financial access and ecosystem expansion as developers build innovative applications leveraging cross-chain capabilities, evidenced by increased asset transfers and broader adoption of Stellar-based dApps.\n        \n\nThese criteria ensure that the technical robustness of the infrastructure translates into meaningful market adoption—expanding financial access and creating a more interconnected, efficient blockchain ecosystem for both EVM and native Stellar builders.",
            "stellar.tractionEvidence": "'-   Deployed on 140+ blockchains -> https://github.com/VIALabs-io/npm-registry/tree/master/src/chains\n    \n-   ~$1 million in bridged TVL -> https://dappradar.com/dapp/via-labs/?range-ha=all&range-ds=30d\n    \n-   400k successful cross-chain messages -> https://scan.vialabs.io/\n    \n-   20+ client growing ecosystem -> https://vialabs.io/ecosystem\n    \n-   Proud grantee of both Circle and Avalanche to build a cross-chain stable-coin transfer protocol. -> https://x.com/AvalancheFDN/status/1877045675604471861\n    \n\nMini Case Study #1\n\nProto-USD\n\nThe VIA Network has been used to build advanced cross-chain stablecoin dapps. Proto-USD combines primitives from both Circle and Avalanche to provide emerging blockchains with a seamless stablecoin transfer experience. Proto-USD has earned grant awards from both Circle and Avalanche. \n\nSee the website here\n\n  \n\nMini Case Study #2\n\nCross-Chain Tokens\n\nThe VIA Network has been used to add cross-chain functionality to both new and existing tokens. \n\n-   MERY - Memecoin - Cronos <-> Cronos zkEVM. Link\n    \n-   Ebisus Bay - DEX token - Cronos <-> Cronos zkEVM. Link \n    \n-   Vitruveo - Native token transfer - Multiple Chains <-> Vitruveo. Link\n    \n\n  \n\nMini Case Study #3\n\nToken Migration\n\nThe VIA Network has been used for token migrations to new and emerging blockchains. Two examples here include:\n\n-   Gravity Finance migration -  a token migration from Polygon -> Sonic (two EVM chains). Link\n    \n-   Reef migration - a one way bridge / token migration from ETH/BSC -> REEF (EVM to Non-EVM). Link",
            "stellar.goToMarketPlan": "VIA Labs will drive adoption of our Stellar infrastructure by leveraging proven cross-chain tactics that have worked for protocols like LayerZero and Axelar. Our plan focuses on engaging both EVM and Stellar-native developers through sponsoring prominent hackathons, organizing hands-on developer workshops, and hosting pop-up hacker houses at key events. We’ll offer targeted bounties for projects such as cross-chain messaging, asset bridging, and innovative LLM integrations, while partnering with Cheesecake Labs to co-host technical webinars and deep-dive sessions on Soroban integration.\n\nOur tactical approach centers on robust event-driven and online community engagement. Key actionable steps include:\n\n-   Hackathons & Bounties: Sponsor events (e.g., ETH Conventions, Stellar hackathons) and launch multi-category bounty challenges.\n    \n-   Workshops & Tutorials: Host in-person and virtual workshops with live code demos, publish comprehensive guides, and share sample projects on GitHub.\n    \n-   Social Media Outreach: Use Twitter Spaces, targeted posts on X, and active participation on Discord to disseminate updates and gather real-time feedback.\n    \n\nOn the business development front, we will secure strategic integrations by partnering with key players such as Circle for USDC bridging, leading Stellar DeFi projects, and popular wallets (e.g., Lobstr, Freighter). By demonstrating early “lighthouse” integrations and publicizing success stories, we aim to create a strong narrative around our cross-chain interoperability, positioning VIA Labs as the default bridge for Stellar’s expanding smart contract ecosystem. Metrics like cross-chain transaction volume, developer engagement, and integration case studies will be monitored to continuously refine our approach.",
            "stellar.tranche1Deliverables": "1.  Infrastructure duplication of the VIA Network from EVM to Stellar \n    \n    -   KPI: Successful contract interaction between Ethereum Sepolia and Stellar Testnet. Contract interaction shown on blockchain explorers.\n        \n    -   Estimated date of completion: July 7, 2025\n        \n    -   Budget: $60k",
            "stellar.tranche2Testnet": "1.  Custom bridging front-end for projects for Stellar compatible wallets and full developer documentation.\n    \n\n-   KPI: Non-developers can connect their wallets and transfer funds on testnet.\n    \n-   Estimated date of completion: July 28, 2025\n    \n-   Budget: $25k",
            "stellar.tranche3Mainnet": "Mainnet deployment of VIA Network between EVM and Stellar\n\n-   KPI: Value or data transfers measured by interaction with blockchain explorers, custom bridging front end.\n    \n-   Estimated date of completion: Aug 11, 2025\n    \n-   Budget: $10k",
            "stellar.teamMembers": "Robert Pilat",
            "stellar.urls": {
              "website": "https://vialabs.io/",
              "codeRepository": "https://github.com/VIALabs-io",
              "videoURL": "https://www.canva.com/design/DAGjie6lmOI/LP6Pkp206NB8nBHBF_B03w/watch?utm_content=DAGjie6lmOI&utm_campaign=designshare&utm_medium=link2&utm_source=uniquelinks&utlId=h02a644c173"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://linkedin.com/company/via-labs-llc",
              "twitter": "https://x.com/VIA_Labs",
              "discord": "https://discord.gg/vialabs"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:17",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:volta-circuit",
          "projectName": "Volta Circuit",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "A Cross-Chain Defi Control Panel",
          "status": "Awarded",
          "category": "Infrastructure & Services",
          "description": "Volta Circuit is a decentralized control panel that enables users and institutions to customize and automate their risk management, governance, and treasury operations across any blockchain, creating a secure standard for digital asset custody.",
          "fundsApprovedInUSD": 150000.0,
          "fundsPaid": [
            {
              "amount": 50000.0,
              "denomination": "USD"
            },
            {
              "amount": 201332.34,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-06-24T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/document/d/1Xfi-hssQB_ff0gwojhkD8349AmZNN5hSMhIJ5Doh-Jk",
            "stellar.productsAndServices": "Volta Circuit: Product & Services\n\nA Proven Security Model for Self-Custody\n\nVolta Circuit delivers a self-managed, multi-signature wallet designed for technical professionals and organizations in the blockchain ecosystem. Built on robust smart contract technology, our platform empowers developers, builders, and investors to securely manage their assets and engage seamlessly with multiple blockchain networks.\n\nKey Features:\n\n-   Decentralized Control Panel:  \n    A unified interface leveraging Soroban smart contracts to offer secure, customizable risk management and policy enforcement on Stellar and beyond.\n    \n-   Built with Account Abstraction:  \n    Enhance security and usability with programmable, gasless transactions, flexible spend approvals, and multi-factor authentication.\n    \n-   Account Abstraction:  \n    Only user-activated devices can access Volta Circuit accounts, ensuring sensitive operations are protected by unique user keys.\n    \n-   Customizable Policies:  \n    Define whitelists for contracts, addresses, rules, and policies tailored to your vault(s) to meet strict compliance and risk management needs.\n    \n-   Omnichain & Multiple Vaults:  \n    Manage assets across different blockchain networks—including Cosmos and EVM chains—while maintaining a unified security and custody infrastructure.\n    \n-   Rekeying:  \n    An innovative security mechanism that allows multisig owners to keep static public addresses while dynamically rotating private spending credentials.\n    \n-   Transaction Builder:  \n    Simplify complex blockchain transactions with an intuitive tool that compiles multi-step operations into a single, streamlined transaction.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "-   Transaction Volume: Aim for 100,000+ transactions processed per month by end of year\n    \n-   User Adoption: Target 10,000+ active users within first 6 months post-launch\n    \n-   Developer Engagement: Attract 500+ developers to the platform within first year\n    \n-   Stellar Growth: $10M+ in assets secured in Stellar Ecosystem\n    \n-   Customer Retention: Maintain 90%+ customer retention rate\n    \n-   Network Performance: Ensure 99.9% uptime and <500ms average transaction time\n    \n-   Security Incidents: Zero critical security breaches",
            "stellar.tractionEvidence": "We are currently live on SEI and EVM chains. In the past 6 months we have:\n\n1.  secured over $1.5B in transaction volume\n    \n1.  reached over $20m in TVL\n    \n1.  1100 active vaults\n    \n\nhttps://docs.google.com/spreadsheets/d/1zjDqXnHzbhFbpDXZYqCAd5uG8bmSeUmoWsWMLp-2D5I/edit?usp=sharing",
            "stellar.goToMarketPlan": "Initial Launch (Months 1-3)\n-------------------------------\n\n#### Partner with 3-5 ecosystem projects for beta testing\n\n-   Identify and reach out to potential beta partners within the Stellar ecosystem\n    \n-   Conduct technical integration workshops with partners\n    \n-   Set up feedback channels for continuous improvement\n    \n-   KPI: Successful integration with at least 2 partners\n    \n\n#### Develop documentation and integration guides\n\n-   Create comprehensive API documentation\n    \n-   Develop step-by-step integration tutorials\n    \n-   Produce video walkthroughs for common use cases\n    \n-   KPI: 100% documentation coverage of all features\n    \n\n#### Build community presence in Stellar ecosystem\n\n-   Participate in Stellar community forums and discussions\n    \n-   Host virtual meetups or webinars to introduce Volta Circuit\n    \n-   Contribute to open-source Stellar projects\n    \n-   KPI: Achieve 10k+ followers on social media platforms\n    \n\nMarket Expansion (Months 4-6)\n---------------------------------\n\n#### Launch educational content for developers\n\n-   Create a blog with regular technical posts\n    \n-   Develop a series of tutorial videos\n    \n-   Host live coding sessions and Q&As\n    \n-   KPI: Publish 20+ pieces of content, achieve 5000+ views\n    \n\n#### Establish partnerships with key Stellar projects\n\n-   Identify top 10 Stellar projects for potential partnerships (RWA platforms and projects, Global Payments and Stablecoins, Humanitarian Projects, DeFi projects)\n    \n-   Develop customized partnership proposals\n    \n-   Negotiate and finalize partnership agreements\n    \n-   KPI: Secure partnerships with at least 5 key Stellar projects\n    \n\n#### Create case studies with initial partners\n\n-   Collect data on partner integrations and outcomes\n    \n-   Develop detailed case studies highlighting success stories\n    \n-   Promote case studies through various channels\n    \n-   KPI: Publish 3+ case studies, each generating 1000+ views\n    \n\nGrowth Phase (Post-Launch)\n------------------------------\n\n#### Expand to traditional financial Institutions\n\n-   Develop tailored pitch for traditional finance sector\n    \n-   Attend fintech conferences and events\n    \n-   Conduct pilot programs with interested institutions\n    \n-   KPI: Onboard 2+ traditional financial institutions within 6 months\n    \n\n#### Build out partner ecosystem\n\n-   Launch partner program with tiered benefits\n    \n-   Develop partner portal for resources and support\n    \n-   Implement partner relationship management (PRM) system\n    \n-   KPI: Grow partner ecosystem to 50+ active partners within 12 months\n    \n\n#### Develop additional features based on user feedback\n\n-   Implement system for collecting and prioritizing user feedback\n    \n-   Conduct regular user surveys and interviews\n    \n-   Develop and release new features on a consistent schedule\n    \n-   KPI: Release 2+ major features per quarter, achieve 80%+ user satisfaction",
            "stellar.tranche1Deliverables": "Technical Deliverables:\n\n• Core Development:\n\n– Build the foundational risk management protocol using Soroban's secure Rust framework.\n\n– Develop the smart contract–based policy engine to automate risk controls.\n\n• Passkey Integration:\n\n– Simplify wallet creation using Passkeys.\n\n– Integrate passkeys with multi-sig operations.\n\n• Stellar Integration:\n\n– Integrate with the Stellar Asset Contract to enable precise asset-level controls.\n\n• User Interface:\n\n– Create a basic control panel for vault creation and management.\n\n• Internal Testing & Documentation:\n\n– Demonstrate end-to-end risk management functionality through rigorous internal QA.\n\n– Produce comprehensive API documentation, integration guides, and video walkthroughs covering key features.\n\nTimeline & Milestones:\n\n– Month 1: Develop and integrate MVP features, and begin early testing.\n\n– Month 2: Finalize MVP build, complete internal testing, and release supporting documentation.\n\nBudget Requested: $70K",
            "stellar.tranche2Testnet": "(Leveraging existing testnet resources and internal processes)\n\nTechnical Deliverables:\n\n• Security Audit:\n\n– Prepare smart contract code for extensive an security audit.\n\n– Address any findings from the audit.\n\n• Integration Testing:\n\n– Test integrations with major custodians on the Stellar testnet.\n\n– Execute comprehensive test cases to prepare for a full security audit.\n\n• Documentation Updates:\n\n– Update technical documentation and API guides based on testnet feedback.\n\nTimeline & Milestones:\n\n– Month 3: Conduct detailed testing and resolve any issues. Finalize testnet deployment and document outcomes for use in the mainnet phase.\n\n- Month 3-4: Complete mainnet-ready code, security audits, and performance optimizations.\n\nBudget Requested: $50k",
            "stellar.tranche3Mainnet": "Technical Deliverables:\n\n• Production-Grade Deployment:\n\n– Deploy the fully audited and optimized platform on the Stellar mainnet.\n\n– Finalize full API coverage and developer integrations.\n\n• Security & Performance Optimization:\n\n– Engage third-party auditors for comprehensive security reviews and penetration testing.\n\n– Optimize the platform for high-volume, real-time transactions.\n\n• Final Documentation & Support:\n\n– Publish complete production documentation, tutorials, and troubleshooting guides for end-users and partners.\n\nTimeline & Milestones:\n\n��� Months 4-5: Execute phased public rollout with initial partner integrations.\n\nBudget Requested: $30K",
            "stellar.teamMembers": "George Melika, Matt Rasband, Daniel Kim",
            "stellar.urls": {
              "website": "https://voltacircuit.com",
              "videoURL": "https://youtu.be/-cAnOCDeBwE"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/volta-wallet",
              "twitter": "http://x.com/voltacircuit"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:18",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:estrela",
          "projectName": "Estrela",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Finalizing Stablecoin AMM Build",
          "status": "Awarded",
          "category": "Infrastructure & Services",
          "description": "Estrela offers a stablecoin AMM on Soroban to help Stellar community swap stablecoin assets efficiently",
          "fundsApprovedInUSD": 102000.0,
          "fundsPaid": [
            {
              "amount": 34000.0,
              "denomination": "USD"
            },
            {
              "amount": 116607.76,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "mostRecentPaymentDate": "2025-05-21T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://drive.google.com/file/d/1CQrzF4zeevv5tbFl_0PnPoTUnJu2VWWB/view?usp=sharing",
            "stellar.productsAndServices": "Estrela is a decentralized platform for efficient low-slippage stablecoin swaps. The platform enables users to trade stablecoins directly on Stellar while liquidity providers can deposit assets into swap pools to earn fees, enhancing on-chain liquidity and utility.  \nThis submission adds the final components required for Estrela’s production deployment on Soroban. The implementation aimes to deliver mainnet-ready stablecoin swap pools built on Soroban. Additionally the platform will feature an SDK to simplify integration for future DeFi applications built on Soroban, expanding developer access and protocol interoperability.\n\nEstrela’s UI components for liquidity provision and swapping further reduce barriers to entry, delivering a smooth user experience for interacting with Stellar-based stablecoins.\n\nThrough this development, Estrela strengthens the Stellar DeFi landscape by improving capital efficiency and offering an accessible, stablecoin trading solution built natively on Soroban.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "The success of Estrela will be assessed based on its continued evolution as a core stablecoin swapping platform within the Stellar ecosystem. Our goal is to deliver a functional, production-ready application that enables efficient, low-slippage stablecoin swaps and supports liquidity provision through a seamless and intuitive interface.\n\nKey success indicators will include user adoption, swap volume, and TVL growth within the Stellar ecosystem. The impact of this activity will be reflected in improved access to stablecoin liquidity, enhanced capital efficiency, and broader utility for Stellar-native assets. Estrela aims to contribute to the development of DeFi infrastructure on Soroban, supporting the long-term growth and resilience of the network.\n\nWe also aim to foster collaboration across the Stellar ecosystem by supporting future integrations and project adoption. By maintaining and continuously improving Estrela post-launch, we strive to contribute long-term value to the network’s stablecoin and DeFi landscape.",
            "stellar.tractionEvidence": "Estrela is a stablecoin AMM built on Soroban. Development is being finalized, the smart contracts have been tested, and an external audit has been successfully completed.\n\nThis submission builds on our proven track record of delivering finalized products within the Stellar ecosystem. Our two existing bridging products — Allbridge Core and Allbridge Classic — have facilitated over $4.5+ million in bridged volume across 3200+ transactions, directly contributing to Stellar’s liquidity growth and ecosystem usage.\n\nOur team has hands-on experience building on Soroban, gained through previous product's deployments and our work on Estrela itself. Our experience with Soroban and the development of Estrela enable us to bring it to mainnet and support its growth within Stellar’s DeFi ecosystem.",
            "stellar.goToMarketPlan": "Upon submission approval, we will be preparing to launch Estrela on mainnet, supported by coordinated communication and ecosystem engagement. Our go-to-market strategy emphasizes collaboration within the Stellar ecosystem, leveraging the existing Allbridge user base and community presence.\n\nWe will work closely with Stellar-based projects to support the launch and adoption of their stablecoins on Estrela, highlighting its low-slippage swap functionality as a vital component of Stellar’s growing DeFi infrastructure.\n\nThe launch will be supported through coordinated announcements, community engagement, and strategic communication across Allbridge and Stellar channels—helping to position Estrela as a foundational tool for stablecoin liquidity and activity on Stellar.",
            "stellar.tranche1Deliverables": "[Deliverable 1]  \nBrief description: 2-Pool contracts and logic implementation  \nHow to measure completion: Public code repository  \nEstimated date of completion: 05.02.2025  \nBudget: $12,000  \n[Deliverable 2]  \nBrief description: LP web UI  \nHow to measure completion: Public code repository  \nEstimated date of completion: 05.02.2025  \nBudget: $16,000\n\n[Deliverable 3]  \nBrief description: Swap web UI  \nHow to measure completion: Public code repository  \nEstimated date of completion: 05.02.2025  \nBudget: $18,000",
            "stellar.tranche2Testnet": "[Deliverable 1]  \nBrief description: 3-Pool contracts and logic implementation  \nHow to measure completion: Public code repository  \nEstimated date of completion: 05.23.2025  \nBudget: $14,000  \n[Deliverable 2]  \nBrief description: SDK implementation  \nHow to measure completion: Documentation review  \nEstimated date of completion: 05.23.2025  \nBudget: $12,000",
            "stellar.tranche3Mainnet": "[Deliverable 1]  \nBrief description: Deployment on production with 2- and 3-Pool contracts  \nHow to measure completion: Initiate stablecoin swap/liquidity provision on Estrela  \nEstimated date of completion: 06.13.2025  \nBudget: $18,000\n\n[Deliverable 2]  \nBrief description: Yearly maintenance and support  \nHow to measure completion: Estrela live on mainnet  \nEstimated date of completion: Ongoing over 12 months  \nBudget: $12,000",
            "stellar.teamMembers": "Pavlo Velykyi",
            "stellar.urls": {
              "codeRepository": "https://github.com/allbridge-io/dex-soroban-contracts/",
              "videoURL": "https://youtu.be/Cq390OwL8Pc"
            },
            "stellar.socialMedia": {
              "discord": "https://discord.com/invite/ASuPY8d3E6"
            }
          },
          "completionPercentage": 0.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:19",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:ledgerstax",
          "projectName": "LedgersTax",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "LedgersTax | Takeoff",
          "status": "Awarded",
          "category": "Infrastructure & Services",
          "description": "LedgersTax exports your Stellar transactions history for tax reporting. Comprehensive taxable events data in a few clicks – saving time, alleviating headache. Even on the moon, you still have to file taxes.",
          "fundsApprovedInUSD": 96000.0,
          "fundsPaid": [
            {
              "amount": 64000.0,
              "denomination": "USD"
            },
            {
              "amount": 235440.33,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #1 - MVP",
          "mostRecentPaymentDate": "2025-06-27T00:00:00Z",
          "extensions": {
            "stellar.technicalArchitecture": "https://github.com/stellar-expert/ledgers-tax",
            "stellar.productsAndServices": "New redesigned from scratch version of the tax reporting tool for Stellar. Without Horizon dependency, with Soroban and multiple export formats support.\n\nIt can load transactions information from Stellar history for any point in time, going back to 2015.\n\nWe plan to provide tax reports in formats compatible with Koinly, BitcoinTax, Recap, Cryptotax, Awaken, CoinLedger, CoinPanda, KoinX, TurboTax, and other tax filing services.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "Our team aims to provide an affordable and comprehensive service for all users, eventually becoming a de-facto standard for the tax-reporting on Stellar.",
            "stellar.tractionEvidence": "Our previous free version of the tax reporting software (hosted at StellarExpert) was quite popular in the ecosystem, as for years it was the only option to extract the most comprehensive and correct dump of taxable events for Stellar, including DEX trading and other operation types. We never used cookies or any other methods to measure the traction, because privacy was always at the top of our priority list, but a lot of people from SDF relied on it, as well as many users from the ecosystem. Now, when our previous software version became unusable due to changes in Horizon retention policy and rise of new Soroban protocols, we received dozens of emails from people requesting to revive this service.",
            "stellar.goToMarketPlan": "The service will be available for all Stellar users for a fee depending on the export file size -- it will be quite cheap for users with fewer transactions while very active accounts will be paying larger fees.\n\nSince at this point we provide the best quality output with the most exhaustive coverage of all Stellar operation types, we are also planning to offer B2B integration to all online services that provide tax reporting capabilities.",
            "stellar.tranche1Deliverables": "Website and API\n\n-   Website provides a form for data export in CSV format; the exported file is generated on the backend accessible via REST API\n    \n-   ETA 2025-04-20\n    \n-   6,000 USD\n    \n\nExport of all relevant Classic Stellar operations and DEX trades\n\n-   Users can request tax export for any account, selecting a tax year 2015-2025\n    \n-   ETA 2025-04-20\n    \n-   18,000 USD\n    \n\nKoinly and BitcoinTax format support\n\n-   Exported CSV file is compatible with Koinly and BitcoinTax platforms\n    \n-   ETA 2025-04-20\n    \n-   8,000 USD",
            "stellar.tranche2Testnet": "Additional tax reporting platforms support\n\n-   LedgersTax allows exporting CSV data in formats compatible with Recap, Cryptotax, Awaken, CoinLedger, CoinPanda, KoinX, TurboTax\n    \n-   ETA 2025-05-12\n    \n-   $9,000\n    \n\nSoroban transactions data\n\n-   Report data contains debit/credit balance changes produced by Soroban operations\n    \n-   ETA 2025-05-12\n    \n-   $18,000\n    \n\nXLSX format\n\n-   The data can be exported in XLSX format in addition to CSV\n    \n-   ETA 2025-05-12\n    \n-   $3,000\n    \n\nExport size estimates\n\n-   Before the export, the website displays the estimated number of transactions that will be analyzed in the process and estimated export time\n    \n-   ETA 2025-05-12\n    \n-   $2,000",
            "stellar.tranche3Mainnet": "Protocol-specific export details\n\n-   Transaction history data contains additional protocol-specific information and type of the invoked contract (Liquidity Pool, Lending platform, DAO, etc.) for well-known ecosystem protocols\n    \n-   ETA 2025-06-16\n    \n-   $14,000\n    \n\nB2B partner integration capabilities\n\n-   API access for our service integration by third-party platforms + API documentation\n    \n-   ETA 2025-06-16\n    \n-   $6,000\n    \n\nBilling\n\n-   Free basic service for accounts with few transactions; paid service for active accounts with substantial transactions activity and enterprise customers\n    \n-   ETA 2025-06-16\n    \n-   $12,000",
            "stellar.teamMembers": "OrbitLens",
            "stellar.urls": {
              "website": "https://ledgers.tax",
              "videoURL": "https://youtu.be/W3XEngsYshc"
            }
          },
          "completionPercentage": 33.0
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:20",
          "grantPoolId": "daoip5:stellar:grantPool:scf-35",
          "grantPoolName": "scf-35",
          "projectsURI": "",
          "projectId": "daoip5:stellar:project:normal",
          "projectName": "Normal",
          "createdAt": "2024-12-01T00:00:00Z",
          "contentURI": "",
          "title": "Normal - Wrapped Assets",
          "status": "Awarded",
          "category": "Infrastructure & Services",
          "description": "Normal Tokens - wrapped assets of each Top 100 crypto helping Stellar users get easy exposure to any asset without using bridges, CEXs, or multiple exchanges.",
          "fundsApprovedInUSD": 80000.0,
          "fundsPaid": [
            {
              "amount": 8333.33,
              "denomination": "USD"
            },
            {
              "amount": 27711.95,
              "denomination": "XLM"
            }
          ],
          "awardType": "Build",
          "latestTranche": "Pre-Launch #0 - Awarded",
          "extensions": {
            "stellar.technicalArchitecture": "https://docs.google.com/document/d/1fr9qA5cXs-AAwlur5zNvQgsRGw8-FVw21qy-6UyaN6w/edit?usp=sharing",
            "stellar.productsAndServices": "Check our video here!  \nProblem we are solving:  \nCurrently, most DeFi stats on Stellar come from project-provided reports, which are not always transparent or easy to verify. Platforms like DeFi Llama and DappRadar often rely on these reports instead of pulling data directly from the blockchain.\n\nOn the other hand, there are many ecosystem stats very useful that can only be calculated using an external tool like Dune Dashboards, like Percentage of Swaps being aggregated, average slippage of swaps and more.  \n\nHow DeFi Dune Dashboards Solves this:  \nThe Stellar DeFi Dune Dashboards will change this by providing fully verifiable, on-chain data from smart contract activity from all DeFi protocols on the ecosystem. These dashboards will track important stats like Weekly and Monthly Active Users, Average Slippage on Trades, Volume Analisis, Percentage of Aggregated Trades, and Liquidity Provider Activity.\n\nFor AMMs and aggregators, we will show key insights, including trade volume, slippage, price impact, and how often trades go through aggregators instead of single AMMs. We will also track arbitrage profits and how many trades are related to arbitrage.\n\nThis project will make Stellar DeFi data more transparent and accessible for everyone, helping users, developers, and investors understand how healthy and active the ecosystem really is. We will also maintain and update the dashboards for one year to ensure they stay reliable.\n\n  \nExtra Comments:\n\nIt's important to understand that Dune dashboards need regular maintenance. Over time, some queries can become too large because they are analyzing more and more data. When this happens, we need to export the results into Materialized Views to keep the dashboards fast and reliable.\n\nMost importantly, this submission includes the ongoing maintenance of all queries and dashboards, so they stay up-to-date and useful over time.",
            "stellar.usesSoroban": true,
            "stellar.successCriteria": "​At least 10 new stars every month on our Dashboards\n\nSupport of the community  \nOur dashboards will be shared more than 1,000 times on tweeter after 6 months",
            "stellar.tractionEvidence": "At PaltaLabs we have been supporting the “Soroban AMMs on Stellar” dashboard, which means that we have coded new queries to get info from protocols (Soroswap AMM and Aggregator, Blend Backstop, Phoenix Pools, Aquarius AMM), and also we are paying the dashboards to be updated 4 times a day: https://dune.com/paltalabs/soroban-amms-on-stellar  \n\nThe other Dashboard that we have written and we have been supporting is the Soroswap Dashboard available here:  \nhttps://dune.com/paltalabs/soroswap  \n\nYou can see all more queries here:  \nhttps://dune.com/discover/content/relevant?q=author:paltalabs&resource-type=queries\n\nIn total we have 26 stats (people following our dashboard or queries. Source: https://dune.com/paltalabs  \n\nNote to the reviewer: The reviewer might find out dated dashboards and queries. Some dashboards have been updated some days ago due lack of payment for Dune Credits. Also, some other queries need to be transformed to a materialized view due to the amount of information. All these things we can fix and support with this submission",
            "stellar.goToMarketPlan": "Engage with projects in the community to share our dashboards on social media, specifically the projects that we are tracking. They will be interested in sharing insight information.\n\nProvide information to SDF and SCF teams for better decision making.\n\n​",
            "stellar.tranche1Deliverables": "For all deliverables, how to measure completion:The query will be available and verifiable on our dashboard and will run every 6 hours.  \n**  \nTranche 1:**  Weekly & Monthly Active User. 1 month of development. Total Tranche Budget: USD 8,333\n\nDeliverable 1: Weekly & Monthly Active Users\n\n-   Brief description: Tracks how many unique users interact with selected DeFi protocol on Soroban. We will include:\n    \n    a.  Unique wallets per time period\n        \n    a.  Per-protocol breakdown\n        \n    a.  Action-based segmentation (Swappers, LPs, Aggregators, Lender, Borrowers, Liquidators, etc…)\n        \n    a.  New vs. returning users\n        \n    a.  Weekly/monthly growth rate\n        \n-   Protocols: Blend, FxDAO, Soroswap, Aquarius, Phoenix, Etherfuse.\n    \n-   Estimated date of completion: 1 month after acceptance\n    \n-   Budget: USD 8,333",
            "stellar.tranche2Testnet": "Tranche 2: User overlap & LP Acticity. 1 month of development. Total Tranche Budget: USD 8,333\n\nDeliverable 2: Protocol Overlap in Users\n\n-   Brief description: Tracks unique users and their overlaps between different selected protocols.  How many users interact with more than one protocol.\n    \n-   Objective: Identify what protocols are bringing new addresses into the ecosystem, revealing user journeys and protocol synergies\n    \n-   Protocols: Blend, FxDAO, Soroswap, Aquarius, Phoenix, Etherfuse.\n    \n-   Estimated date of completion: 1.5 month after acceptance\n    \n-   Budget: USD 3,333\n    \n\nDeliverable 3: Liquidity Provider Activity\n\n-   Brief description: Shows how LPs are moving capital between protocols, including:\n    \n    a.  Query to calculate the value per transaction, considering price of tokens on SDEX and Soroban DEXEs\n        \n    a.  Active LP wallets (unique addresses interacting as LPs)\n        \n    a.  Top LPs (addresses providing the most liquidity)\n        \n-   Protocols: Blend, FxDAO, Soroswap, Aquarius, Phoenix, Etherfuse.\n    \n-   Estimated date of completion: 2 month after acceptance\n    \n-   Budget: USD 5,000",
            "stellar.tranche3Mainnet": "Tranche 3: Liquidity Flows and Migrations. 1 month of development. Total Tranche Budget: USD 8,333  \n  \nDeliverable 4: Liquidity Flows and Migrations\n\n-   Brief description: Shows how LPs are moving capital including:\n    \n    a.  Liquidity inflows and outflows per protocol or pool\n        \n    a.  Liquidity migration (how liquidity is added or removed)\n        \n-   Protocols: Blend, FxDAO, Soroswap, Aquarius, Phoenix, Etherfuse.\n    \n-   Estimated date of completion: 3 month after acceptance\n    \n-   Budget: USD 8,333",
            "stellar.teamMembers": "Esteban Felipe Iglesias Manríquez, Francisco, Joaquin Soza Guerra",
            "stellar.urls": {
              "website": "https://dune.com/paltalabs/soroban-amms-on-stellar",
              "codeRepository": "https://dune.com/discover/content/relevant?q=author:paltalabs&resource-type=queries",
              "videoURL": "https://www.loom.com/share/031da6ea85ee421887f6b10c2f05a721?sid=30a48172-80bb-43c7-8f22-8615fd2f6159"
            },
            "stellar.socialMedia": {
              "twitter": "https://x.com/PaltaLabs"
            }
          },
          "completionPercentage": 0.0,
          "mostRecentPaymentDate": "2025-05-22T00:00:00Z"
        }
      ]
    }
  ]
}