{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar",
    "type": "Foundation",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf-31",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:1",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recon7Vnw25iu3Faw",
                    "projectId": "daoip5:stellar:project:kulipa-debit-card",
                    "projectName": "Kulipa Debit Card",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recon7Vnw25iu3Faw",
                    "status": "Awarded",
                    "description": "Integrate our card issuing platform to the Stellar echosystem with appropriate SEPs (SEP 6, SEP 9, SEP 10 and SEP 12)",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1FtzflT6nK1Q_LGP1XZbpCiQZRtLh1Iwh/view?usp=sharing",
                        "stellar.productsAndServices": "We will adapt our debit card issuing plateform to the Stellar echosystem by integrating with the Anchor patform and the appropriate SEPs:\n\n-   SEP-6 for topup and withdrawals\n    \n-   SEP-9 for standardized data fields\n    \n-   SEP-10 for user authentication\n    \n-   SEP-12 for KYC\n    \n\nThis will be done with Beans wallet and Paypolitan as design partners.",
                        "stellar.successCriteria": "Issue the first cards with the first wallet and process transactions in production.",
                        "stellar.tractionEvidence": "We are launching the Argent wallet in 2 weeks on Starknet. We are building for Celo, Polygon, Solana and more for other wallets. Beans and Paypolitan are co-designing with us. We are also in discussion with other Stellar wallets.",
                        "stellar.goToMarketPlan": "We will launch as a white label solution to existing wallet users, with a CTA in the app.",
                        "stellar.tranche1Deliverables": "Integration for KYC and card issuance\n\n-   Adapt our plateform to reuse KYC data and integrate card issuance API with Beans\n    \n-   User can be KYCed and virtual card can be issued\n    \n-   Estimated 30/11/2024\n    \n-   $100k",
                        "stellar.tranche2Testnet": "Integration for transaction (funding SEP)\n\n-   Adapt our platform to the off-ramp SEP for card funding\n    \n-   Card can be funded to transact and transaction can be processed\n    \n-   Estimated 31/12/2024\n    \n-   $50k",
                        "stellar.tranche3Mainnet": "Nothing on mainet at that stage",
                        "stellar.teamMembers": "Axel Cateland",
                        "stellar.urls": {
                            "website": "https://www.kulipa.xyz",
                            "videoURL": "https://drive.google.com/file/d/1Q2HeHWc6pv4gUK3PPv1q8Ymm9ukFe1xr/view?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "twitter": "http://www.X.com/kulipaxyz"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 100000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 281290.98,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-06T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:2",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recQjC4JOmJ9hfjD9",
                    "projectId": "daoip5:stellar:project:payqin",
                    "projectName": "PayQin",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recQjC4JOmJ9hfjD9",
                    "status": "Awarded",
                    "description": "PayQin offers a USDC wallet powered by Stellar for seamless cross-border payments, enabling users in emerging markets to access global financial services.",
                    "fundsApprovedInUSD": 100000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1CPzdyXgvSMB1AqX2AvL3T4hL2CjwX-vD/view?usp=sharing",
                        "stellar.productsAndServices": "We have successfully integrated the Flutter SDK for Stellar, enabling non-custodial wallet creation for our users. This integration ensures that users have full control of their funds, with a focus on security and transparency. We’ve also implemented SEP 10 authentication to provide secure user authentication and SEP 24 to enable seamless cash-in and cash-out functionality through our strategic partnership with MoneyGram. This was the first crucial step in our journey to bridge cash-based economies with digital finance solutions. With this submission, we aim to take the next step by implementing SEP 30, which will allow for seamless onboarding without the need for a passphrase, significantly improving the user experience and simplifying wallet access for new users. This will remove one of the key barriers to adoption, making our platform more accessible to a broader audience. Additionally, we have recently partnered with Stripe to enable seamless USDC account funding on the Stellar network across the US and European markets, further expanding our reach and providing more funding options for users. However, we are facing challenges with real-time USDC funding for Mobile Money top-ups in emerging markets such as West and Central Africa. While we are integrated with major Mobile Money providers, maintaining sufficient liquidity in our USDC pool is a critical bottleneck. This liquidity is essential to ensure smooth, real-time account funding and to fully leverage our partnerships with Stellar and MoneyGram. Given the strategic importance of these markets and their potential to drive significant transaction volumes on the Stellar network, we propose setting up a USDC liquidity pool. This pool will allow users to fund their wallets using local payment methods, ensuring real-time processing and further empowering users in underserved regions.",
                        "stellar.successCriteria": "1\\. User Growth and Engagement: * 50 000 active users within 12 months of launching the MVP, with a focus on key markets in West and Central Africa. * Fully integrate Mobile Money providers in West and Central Africa, enabling real-time wallet funding for users. * Ensure that the USDC liquidity pool operates smoothly, providing adequate liquidity to meet user demand for Mobile Money top-ups, with a goal of maintaining 99% uptime for real-time funding. * Achieve 100% seamless onboarding for new users through SEP 30, removing the need for passphrases. * Reduce user onboarding time to under 2 minutes with a simplified non-custodial wallet creation process.",
                        "stellar.tractionEvidence": "User Base Growth: PayQin counts over 100,000 app downloads with our presence across seven countries, our primary markets being Côte d'Ivoire, Senegal, Cameroon, and others in Africa. With the recent MoneyGram partnership, we expect significant user growth as we expand our services to a global scale. Key Partnerships: We have secured a strategic partnership with Visa, committing to support PayQin's expansion across Africa. Additionally, our integration with MoneyGram allows users to fund their USDC wallets in 183 countries, providing a critical link between cash-based and digital economies. Community and Ecosystem Involvement: PayQin actively participates in the Stellar ecosystem and has already secured a $50K grant from the Stellar Development Foundation for our work on the MoneyGram integration which is now live, up and running on the Mainnet.",
                        "stellar.goToMarketPlan": "Go-To-Market Plan 1\\. Target Audience: * Our primary audience consists of unbanked and underbanked users in emerging markets, particularly in West and Central Africa (Côte d'Ivoire, Senegal, Cameroon, etc.), where access to digital financial services is limited. * Secondary markets include users in diaspora communities in Europe and the US, who send remittances to Africa, and digital-savvy users seeking efficient cross-border transactions. 2\\. Strategic Partnerships: * MoneyGram Integration: We will promote the ability for users to cash-in and cash-out USDC via 183,000 MoneyGram locations globally, emphasizing convenience and low costs for remittance senders and receivers. * Stripe Integration: In the US and European markets, we’ll highlight our Stripe partnership, allowing seamless funding of USDC wallets on Stellar, targeting users who need a stable and affordable cross-border payment solution. * Mobile Money Providers: By integrating major Mobile Money platforms, we aim to attract users familiar with these systems for real-time wallet funding, particularly in West and Central Africa. 3\\. Key Launch Strategies: * Influencer and Community Marketing: Partner with key regional influencers and financial advocates to promote PayQin’s ease of use, particularly targeting diaspora communities and local users who frequently use Mobile Money services. * Localized Content and Education: Develop localized marketing materials and user education campaigns that explain how to use USDC wallets, the benefits of digital finance, and how users can benefit from cash-in/cash-out services with PayQin and MoneyGram. * Referral Programs: Implement a referral incentive program to encourage existing users to invite friends and family, leveraging word-of-mouth and community networks in target regions.",
                        "stellar.tranche1Deliverables": "Milestone 1: Minimum Viable Product (MVP) * Deliverable 1: USDC Liquidity Pool Setup * Brief Description: Establish a USDC liquidity pool to enable real-time Mobile Money top-ups for users in West and Central Africa. * How to Measure Completion: The liquidity pool will be operational and integrated with major Mobile Money providers, allowing real-time account funding for users in these regions. * Estimated Date of Completion: 2 months from project approval. * Budget: $40K * Deliverable 2: SEP 30 Implementation * Brief Description: Implement SEP 30 for seamless onboarding, removing the need for passphrases and simplifying user access to PayQin’s wallet. * How to Measure Completion: Users will be able to create non-custodial wallets and onboard without a passphrase. Successful completion will be verified by the ability of users to seamlessly onboard through this feature. * Estimated Date of Completion: 2 months from project approval. * Budget: $30K",
                        "stellar.tranche2Testnet": "Milestone 2: Testnet * Deliverable 1: Testing SEP 30 and USDC Pool on Stellar Testnet * Brief Description: Test the SEP 30 implementation and USDC liquidity pool on the Stellar Testnet to ensure functionality, security, and scalability. * How to Measure Completion: SEP 30 and the liquidity pool will pass functionality tests on Stellar Testnet with no major issues, validated through a successful series of test transactions. * Estimated Date of Completion: 2 months after MVP completion. * Budget: No funds unlocked (access to Stellar LaunchKit for infrastructure and audit credits).",
                        "stellar.tranche3Mainnet": "Milestone 3: Mainnet Launch * Deliverable 1: SEP 30 and USDC Pool Deployment on Mainnet * Brief Description: Fully deploy SEP 30 onboarding and the USDC liquidity pool on Stellar Mainnet, enabling real-time Mobile Money funding for West and Central African users. * How to Measure Completion: Users will be able to onboard without a passphrase and fund their wallets with Mobile Money top-ups via the USDC pool, verified through real-world use cases. * Estimated Date of Completion: 2 months after Testnet completion. * Budget: $30K",
                        "stellar.teamMembers": "Fabrice Amalaman, Patrick Ouraga",
                        "stellar.urls": {
                            "website": "https://payqin.com",
                            "codeRepository": "https://drive.google.com/file/d/1V0NJX6I7vJL7WLHMJJ_bSi7rklOBLTKI/view?usp=sharing",
                            "videoURL": "https://www.youtube.com/watch?v=-O-Hr9jqh0U"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/payqin/",
                            "twitter": "https://twitter.com/PayQinn"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 100000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 335794.29,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-21T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:3",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recDvnkHMNhQh0F0t",
                    "projectId": "daoip5:stellar:project:kura",
                    "projectName": "Kura",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recDvnkHMNhQh0F0t",
                    "status": "Awarded",
                    "description": "Kura is making cross-border payments seamless for merchants",
                    "fundsApprovedInUSD": 120000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/11-SkDIfZWP2nsgRyeNKCZxH9dy8CWTTTajemF1lsRNU/edit?usp=sharing",
                        "stellar.productsAndServices": "'-   Kura is a blockchain-based, all-digital payments acceptance platform that helps merchants that lack point of sale terminals in emerging markets capture cross-border payments directly at their points of sale and settle instantly using a QR code or an OTP code. The platform is currently being deployed in our beachhead market, with a few merchants and we have a backlog of 500 additional merchants with signed LOIs through large networks of merchants and associations.\n    \n-   Our double-sided platform serves both large institutions and consumers who send billions annually to beneficiaries in Central America and the Caribbean. Kura is the smartest alternative to traditional P2P cash remittances and international cash disbursement.\n    \n\nService #1: B2B2C - Cross-border solution for merchants to enable them to accept cross-border payments with USDC at their points of sale. Kura uses Stellar Wallets to facilitate transfer of value between sponsors (US-based) and merchants (emerging markets).\n\nService #2: Disbursement Aid Solutions for NGOS/Large Donor organizations in the Caribbean/Central America regions using Stellar's SDP.\n\nService #3: Connect to online merchants via API enabling merchants to accept online payments via the Kura Platform at Checkout. (Future development)\n\n  \nFuture Development*\n\n-   Kura Merchants (counterparties) are able to trade crypto to access local currency (gourdes) at any Moneygram location with the MoneyGram Access API. We have already kickstarted the process with Miguel Garza on this.\n    \n-   Kura merchants (counterparties) are able to get paid in the local currency in a bank account (We are working with a local bank at the moment to enable this)\n    \n-   Kura Merchants can accept crypto payments from verified and KYC'ed Stellar wallet in all the markets that Kura operates in, starting with Haiti. This will expand the amount of USDC in circulation in our beachhead market and reduce cash use.  \n    Rinse, repeat, scale in other neighboring countries in the Caribbean regions where traditional banking system have failed the majority of the population.\n    \n\n  \nKura’s mission is to power both offline, online payments with crypto to ease the burden of both individuals and larger organizations sending money to their relatives abroad and reduce cash use.",
                        "stellar.successCriteria": "'-   Success looks like at least 200,000 in GTV/Transaction from our B2B2B segment (first use case) by January 2025\n    \n-   Achieve high NPS and satisfaction from our merchants using our wallets in Haiti\n    \n-   Successfully finalize a contract 2 large donor organizations to process at least $10M in transaction via the Kura platform by Q3 2025\n    \n-   Successfully launch the Food/Groceries Vertical by Q1 2025 (Peak season)\n    \n-   Scale our team to support demand across marketing, operations, and engineering\n    \n-   Close our pre-seed round by end of the year. We already have participation from a few investors including Allston Venture fund, SBIX, DRF Fund, Techstars, and a new significant commitment from a multi-stage institutional investor. This will enable us to scale even more rapidly.",
                        "stellar.tractionEvidence": "Since our last submission, Kura has integrated Cybrid, a technology partner and on/off ramp partner that enable Kura to offer regulated MSB services in the United State under both a Money Transmitter and Money Service Business License. The funds awarded ($27K) covered platform licensing fees, a Kura reserve account through our on/off -ramp partner, and development fees.  \nWe are leveraging Bigger (our amazing development partner based in Latam) to accelerate product development and augment our tech team. Additionally, we have short-listed a few candidates from Northeastern, Waterloo, and MIT to join Kura in-house as we continue to scale our product vision.  \nWe experienced some delays for our closed beta primarily due to some regulatory roadblocks related to New York State Crypto Regulations. We overcame this roadblock by partnering with amazing partner that allow us to offer regulated services for New York based Kura users. For context, New York State represents a significant hub for the immigrant population from the Central America and the Caribbean regions. This is a huge win for us!\n\n-   Regulatory and Tech Integrations: Since our last submission, Kura has integrated Cybrid, a technology partner and on/off ramp partner that enable Kura to offer regulated MSB services in the United States under a Money Transmitter and Money Service Business License. Access our compliance letter here: https://drive.google.com/file/d/1yxwpG7DCoep42_clRtqn08evLyO5KVlD/view?usp=sharing\n    \n-   Additionally, Through Cybrid, we are integrating with Plaid to connect Kura’s US-based customers' financial accounts and Persona to support KYC and Identity Verification to send funds compliantly. \n    \n-   Live pilot: Competed successful pilot with 30 merchants in first beachhead market (Haiti). The management team traveled to Haiti in June to work directly with our local agent network and merchants and gather user feedback that we incorporated in our latest developments. We updated the merchant dashboard/login based on user feedback. We are also launching the Food/Groceries in our beachhead.\n    \n-   Active Pipeline of Sponsors: Engagement with 2 Large Donor Organization Philanthropic organizations with Avg Transaction Value of $1M/month\n    \n-   Active Merchant/Provider Pipeline: 500 additional merchants in pipeline (Signed LOIs) \n    \n-   Active Pipeline (U-based sponsors): LOI with the largest association of the Haitian Immigrant Professional in the US giving us access to more than 100K single users + 400 US based-customers sign ups\n    \n-   Active Pipeline (Additional off-ramp provider): In discussion with one of the largest local banks in Haiti to discuss additional Off-ramping options for local merchants in the region \n    \n-   Active Pipeline: Engaging with digital health platforms and aggregators operating in Haiti (LOIS signed); Nicaragua, Panama, and El Salvador to add Kura through API as a check-out option for customers who depend on remittances from abroad. We are actively assessing the opportunity to soft launch in additional Central American markets with low-overhead costs. \n    \n-   Access all of the LOIs in this folder: https://drive.google.com/drive/folders/1i9Fj9ON30Xyhj71DN4oUEW7kmnUArxuW?usp=sharing",
                        "stellar.goToMarketPlan": "'-   New Partnership/ Go-to-Market: signed a MOU with the National Alliance of Haitian Professionals (NAAHP) which is the largest US-Based Haitian American organization with more than 200,000 members. Kura is partnering with NAAHP to offer its services to members including professionals, businesses within the Diaspora communities.\n    \n-   Philanthropic Partnerships: We expect to solidify partnerships with 2 significant donor organizations enabling large-scale aid disbursements through Kura for ongoing projects and disaster relief efforts in Haiti and other subsequent markets.\n    \n-   Expansion: Following successful pilot programs with healthcare service providers in Haiti, we are soft launching with Food and Groceries providers(AVANI) (Woohooo!) - LOI is linked : https://drive.google.com/drive/folders/1i9Fj9ON30Xyhj71DN4oUEW7kmnUArxuW?usp=sharing\n    \n-   We onboarded a digital marketing superstar who will continue to spearhead Kura’s digital marketing efforts and SEO comprehensively, particularly for US- based senders\n    \n-   We're attending diaspora community-based events in Massachusetts and New York to further engage and acquire our users. Specifically, Clifford is invited to speak and promote Kura at the National Alliance of Haitian Professionals (NAAHP) in Atlanta in November where we expect additional customer sign ups.",
                        "stellar.tranche1Deliverables": "Delivery 1 - User authentication \n\nIntegrate AWS Cognito to allow users to perform register and login operations on the platform. \n\nCompleted when the users are available to authenticate on the platform with their phone number, email address, and password. \n\nEstimated completion: 2 weeks of development. \n\nDelivery 2 - Cybrid and Plaid Integration  \n\nIntegrate Cybrid and Plaid to allow FIAT USD deposits into the platform and withdraw that money to an external Stellar wallet.   \nDelivery 4 - SDP integration\n\nIntegrate Kura and SDP to allow large donor organizations/ nonprofits to enable their beneficiaries to spend their digital aid/ funds at pre-vetted onboarded Kura merchants.  \nEstimated completion: 3 weeks of development\n\nCompleted when: \n\n● The platform is able to identify their users by performing a KYC check via the Cybrid’s Persona integration.\n\n● The users are able to connect their bank accounts via Plaid and deposit FIAT USD into their Cybrid’s FIAT account. \n\n● The platform exchanges FIAT USD to Stellar USDC. \n\n● The users are able to send their Stellar USDC from Cybrid to an external merchant Stellar wallet. \n\nKura merchants (counterparties) are able to access their USDC in their wallet\n\nEstimated completion: 4 weeks of development. \n\nDelivery 3 - Admin Panel \n\nDevelop an admin panel to grant admin access to control permissions, roles, and registration. \n\nCompleted when: \n\n● Settings are able to be toggled by a test admin account. \n\nEstimated completion: 2 weeks of development.  \nThe budget includes platform licensing fee, product testing, and development fee  \nWe have 2 full-stack engineers and 1 program manager from Bigger, including Kura's internal product and payment expert working arduously to deliver on this.",
                        "stellar.tranche2Testnet": "Testnet Launch \n\nWe expect the Testnet launch to be done once deliverables 1 and 2 are completed. This will allow us to test the end-to-end flow and catch any unexpected behavior. \n\nEstimated completion: After 6 weeks of development.",
                        "stellar.tranche3Mainnet": "We expect the Mainnet launch to be done once the Testnet launch is fully tested and working as expected. Regarding delivery 2, an approval of the Cybrid’s team is needed before switching the Cybrid environment to production. \n\nEstimated completion: 2-4 weeks post Testnet launch.  \nCompleted when:  \n● The platform is able to identify their users by performing a KYC check via the Cybrid’s Persona integration.\n\n● The users are able to connect their bank accounts via Plaid and deposit FIAT USD into their Cybrid’s FIAT account. \n\n● The platform exchanges FIAT USD to Stellar USDC. \n\n● The users are able to send their Stellar USDC from Cybrid to an external merchant Stellar wallet. \n\n-   The Kura merchants (counterparties) are able to seamlessly access their USDC in their wallet\n    \n\nEstimated completion: 4 weeks of development.",
                        "stellar.teamMembers": "Stephanie",
                        "stellar.urls": {
                            "website": "https://www.kuratek.com/",
                            "codeRepository": "https://github.com/KuraApp/kura-core-api-stellar",
                            "videoURL": "https://youtu.be/4uf6JGeitdI"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/kura-fintech/?viewAsMember=true"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 120000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 376802.04,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-06T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:4",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recFPqlkdvLeOs6WU",
                    "projectId": "daoip5:stellar:project:spydra-low-code-rwa-tokenization-engine",
                    "projectName": "Spydra-Low code RWA Tokenization engine",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recFPqlkdvLeOs6WU",
                    "status": "Awarded",
                    "description": "Spydra is a low code Real world asset tokenization platform for Enterprises",
                    "fundsApprovedInUSD": 132000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1EBa4_hm6G6h7cK5YzILB87dZEv5Lvncx/view?usp=sharing",
                        "stellar.productsAndServices": "1.  Open-Source release of OnChainId, a blockchain based standardized identity system on Stellar Blockchain: This will allow users to create decentralized identities for themselves on chain and third-party trusted providers to issue claims related to users. These identities can then be used by asset owners to perform onchain identity verification checks like KYC/AML compliance while token issuance.\n    \n1.  Open-Source release of ERC 3643 compatible Soroban Smart Contract on Stellar Blockchain: This will allow real world asset owners to easily create tokens on chain that adheres to various regulatory compliances in a standardized manner.\n    \n1.  Integration of the OnChainId and ERC 3643 Stellar contracts with Spydra platform to tokenize RWAs: This will provide a no-code platform for RWA owners to easily tokenize their assets with configurable compliance rules built in.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "-   Ease of Tokenization Process:\n    \n    Simplified Token Launch: Spydra’s low-code environment allows asset owners, regardless of technical expertise, to issue tokens for assets like real estate, private debt, and collectibles.\n    \n    Seamless Identity and Compliance Integration:Configurable Identity Verification and Compliance Checks: Leveraging Stellar’s OnchainId and ERC 3643 capabilities, Spydra incorporates a straightforward way for asset owners to verify investors and ensure regulatory compliance. Asset owners can apply identity checks, investor qualification standards, and transfer restrictions in a no-code manner, providing confidence that their assets are compliant with local and international regulations.\n    \n    Automated Compliance Validation During Transactions: With built-in, modular compliance settings, the platform ensures that all token transactions automatically adhere to the configured compliance rules, reducing the burden on asset owners to manually enforce these rules.\n    \n-   Rapid Deployment on Stellar:\n    \n    Stellar Testnet Availability: To ease onboarding, Spydra will first launch its platform on the Stellar Testnet, allowing asset owners to experiment, test, and refine their tokenization strategies before going live. This reduces risk and ensures readiness for a smooth mainnet launch.\n    \n    Single-Click Migration to Mainnet: Once tested, asset owners can migrate tokens from Testnet to Mainnet with a single click. Spydra handles the technical back-end, allowing owners to focus on asset management without worrying about technical hurdles.\n    \n    Open-Source Smart Contracts for Transparent and Secure Usage:\n    \n    By sharing smart contracts openly, Spydra encourages community collaboration, enabling developers and asset owners to adapt and expand functionalities based on emerging compliance or sector needs.\n    \n-   Measurable Success in Simplification:\n    \n    A successful outcome includes at least 10 distinct asset owners on Stellar utilizing Spydra’s platform for tokenization within the first year with a combined value of $100 million assets held by 10k investors. Each of these tokens will use Spydra’s pre-configured compliance and identity solutions, demonstrating the ease and accessibility of RWA tokenization on Stellar.",
                        "stellar.tractionEvidence": "Spydra's Current Engagements and Achievements\n\nClient Partnerships:\n\n1.  Raymonds - As one of the largest textile manufacturers, Raymonds leverages Spydra’s asset tokenization to combat counterfeit products within their supply chain. We’ve successfully tokenized over 16 million assets, processing 1.3 million transactions. See network stats\n    \n1.  Myntra - India’s largest fashion e-commerce platform, Myntra, uses Spydra’s technology to ensure transparency for its entire organic fashion line, building consumer trust. Over 44 million assets have been tokenized with more than 150 million transactions. See network stats\n    \n1.  Maahi and GS1 - Partnering with Maahi, a leading dairy brand in Gujarat, and GS1, Spydra supports product provenance for premium milk products. This project has tokenized over 800,000 assets and processed 600,000 transactions. See network stats\n    \n1.  Autoverse - In collaboration with Autoverse, a B2B automotive parts startup, Spydra enables full supply chain transparency. Within two months, we’ve tokenized 23,000 assets. See network stats\n    \n1.  Bajaj Finserv - Working with India’s largest lending company, Spydra is helping Bajaj Finserv tokenize their insurance products on-chain. MSA Document\n    \n1.  National Payments Corporation of India (NPCI) - Spydra is engaged with NPCI to advance India’s CBDC initiatives, focusing on products like offline money, programmable money, and decentralized fixed deposits.\n    \n1.  Dygnify - In collaboration with Dygnify, a fintech startup, Spydra has facilitated the tokenization of green bonds on a private blockchain.\n    \n\nOpen Source Contributions:\n\nOur Hyperledger Fabric tool for Visual Studio has gained significant traction globally, with over 50,000 downloads across more than 150 countries. Visual Studio Marketplace | Download Stats | Country Stats\n\nAwards & Recognition:\n\n-   APIARY Blockchain COE - Among over 1,000 participants, Spydra was shortlisted for the Idea Challenge Program (ICP) 3.0 in 2023. Read More\n    \n-   Karnataka Elevate Program 2024 - Recognized as a top startup by the Karnataka state government, Spydra received a grant of $28,000 for innovation.",
                        "stellar.goToMarketPlan": "-   Leverage the benefits of Stellar's fast transaction speeds, low fees, and global reach and promote to end customers.\n    \n-   Highlight specific applications & product capabilities for tokenizing Real Estate, Private Credit and Carbon Credit market\n    \n-   Partner with fintech companies, Asset Management Firms, Banks to expand reach.\n    \n-   Position Spydra as an innovative leader in RWA Tokenization combining its expertise with Stellar's blockchain to deliver cutting-edge solutions.\n    \n-   Employ a dedicated sales team to approach high-value clients.\n    \n-   Utilize SEO, content marketing, and social media campaigns to generate leads.",
                        "stellar.tranche1Deliverables": "Tranche 1:\n\n1.  Development of the OnchainId related smart contracts on the Stellar blockchain and additional resources to enable rapid adoption of it.\n    \n1.  Development of ERC 734 equivalent contracts on Soroban to facilitate key management of identities and trusted issuers in the Stellar ecosystem.\n    \n1.  Development of ERC 735 equivalent contracts on Soroban for managing claims on decentralized identities issued by a variety of trusted third parties.\n    \n1.  Development of Claims issuer and verification contracts that can be used by any identity issuer or verifier to do onchain issuance and verification of identity attributes.\n    \n1.  Completion of this activity can be measured by:\n    \n    a.  Availability of the OnchainId contracts on the Spydra opensource github repository.\n        \n    a.  Samples demonstrating the usage of the contracts to issue and verify decentralized identity claims.\n        \n1.  Estimated date of completion: 31 Dec 2024\n    \n1.  Budget: 42K USD",
                        "stellar.tranche2Testnet": "Tranche 2:\n\n1.  Development of Smart contracts required for supporting the various ERC 3643 rules in Soroban. Also, an implementation of compliant token will be created based on the SEP-41 token interface with additional functionality added to support the KYC/AML checks and other compliance validations. The following smart contracts will be created:\n    \n    a.  Trusted Issuers Registry: This smart contract serves as a storage system for contract addresses (OnChainIDs) of all trusted claim issuers specific to a given security token.\n        \n    a.  Claim Topics Registry: This smart contract houses all the claim topics necessary for holding the security token.\n        \n    a.  Identity Registry: This contract establishes connections with the Trusted Issuers Registry and Claim Topics Registry to stipulate identity requirements and executes the “isVerified” function.\n        \n    a.  Permissioned Token: An implementation conforming to the SEP-41 token interface, but enriched with additional functions to ensure full regulatory compliance in security token transactions.\n        \n    a.  Modular Compliance: The Compliance smart contract is a dynamic tool used to establish the rules of the token offering. Multiple compliance related settings can be developed in a modular fashion and integrated with the token.\n        \n1.  Completion of this activity can be measured by:\n    \n    a.  Availability of the Trusted Issuers Registry, Claim Topics Registry, Identity Registry, Permissioned Token and Modular Compliance contract in the Spydra opensource github repository.\n        \n    a.  One sample of a compliance module which validates that an investor is from a white-listed list of countries will also be created.\n        \n    a.  Samples demonstrating creation of a SEP-41 token with end to end issuance and verification of compliance rules during token issuance and transfers.\n        \n1.  Estimated date of completion: 28 Feb 2025\n    \n1.  Budget: 50K USD",
                        "stellar.tranche3Mainnet": "Tranche 3:\n\nDeliverable 1:\n\n1.  Incorporating the Stellar OnchainId and ERC 3643 related tokens with the Spydra platform for issuing and managing RWAs. Release of the platform in Stellar Testnet.\n    \n    a.  Modify the Spydra platform to enable asset owners to easily create SEP-41 tokens on Stellar and incorporate identity verification and compliance checks into it via configuration.\n        \n    a.  Incorporate the ability to configure the following compliance checks in a no-code manner:\n        \n        i.  Investor Country Whitelist\n            \n        i.  Investor Country Blacklist\n            \n        i.  Asset owner Approval based issuance and transfer\n            \n        i.  Enforce maximum token holding by an investor\n            \n        i.  Enforce minimum time limit of holding by an investor before allowing transfer\n            \n        i.  Wallet Address Whitelist\n            \n        i.  Wallet Address Whitelist\n            \n    a.  Availability of the Spydra platform in Stellar Testnet.\n        \n1.  Completion of this activity can be measured by verifying the availability of the Spydra platform on Stellar Testnet. Asset owners can issue RWAs with configurable compliance rules on the Testnet.\n    \n1.  Estimated date of completion: 15 April 2025\n    \n\nDeliverable 2:\n\n1.  Promoting the Spydra platform to Stellar mainnet and making it production ready.\n    \n    a.  Comprehensive testing and validation of the smart contracts and the platform in the Testnet.\n        \n    a.  Adding Stellar Mainnet as an option in the Spydra platform.\n        \n1.  Completion of this activity can be measured by verifying the availability of the Spydra platform on Stellar Mainnet. Asset owners can issue RWAs with configurable compliance rules on the Mainnet.\n    \n1.  Estimated date of completion: 30 April 2025\n    \n1.  Budget: 40K USD",
                        "stellar.teamMembers": "Manish Tewari",
                        "stellar.urls": {
                            "website": "https://www.spydra.app",
                            "codeRepository": "https://github.com/spydra-tech/onchainid",
                            "videoURL": "https://www.youtube.com/watch?v=r5j-jkSb_io",
                            "pitchDeck": "https://drive.google.com/file/d/1XIlHig_3tl36GArLHURLmhHQOQQxqdUW/view?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/spydra",
                            "twitter": "https://x.com/spydra_io",
                            "discord": "https://discord.com/invite/sNEqjP2KBs"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 88000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 266690.18,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-02T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:5",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recLm7MyA4VW2b4IX",
                    "projectId": "daoip5:stellar:project:amero-exchange",
                    "projectName": "Amero Exchange",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recLm7MyA4VW2b4IX",
                    "status": "Awarded",
                    "description": "Offers a Soroban-powered collective savings app to help Latin American communities access decentralized finance via smart contracts.",
                    "fundsApprovedInUSD": 102000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://ameroexchangelimited-my.sharepoint.com/:w:/g/personal/orodriguez_amero_exchange/EQYOHbMvQZJGhe2bjcTrj58BNOQhIc8Cll-uLefPI01AhA?e=MPwvM8",
                        "stellar.productsAndServices": "With the SCF Build Award, we aim to further develop and enhance our Collective Savings product, which is currently in beta and integrated into our platform with active users in Mexico and the Dominican Republic (https://youtube.com/shorts/VpnYbPCnSgo). The funding will enable us to expand its features, improve scalability, and deepen Stellar integration to deliver a more robust and accessible financial solution for communities across Latin America.\nProducts and Services to Develop:\n1. Advanced Soroban-Powered Smart Contracts\n    - Description: Develop and implement advanced smart contracts using Soroban, Stellar's smart contract platform, to manage collective savings groups. Our current contracts automate processes such as deposits, interest calculations, loan distributions, repayment schedules, and governance mechanisms but with this funds we are going to implement and improve advanced functionalities.\n    - How Stellar is Used: Soroban will enable secure, transparent, and efficient execution of smart contracts on the Stellar network. By leveraging Soroban, we ensure that all transactions within the collective savings groups are immutable and verifiable on-chain.\n    - Impact on Project: Enhances trust and transparency among users, reduces operational overhead by automating complex financial processes, and allows for seamless scalability as the number of users and groups grows.\n1. Cross-Border Transaction Capabilities\n    - Description: Integrate Stellar's cross-border payment features and stellar wallet handled to allow users from different countries to participate in collective savings groups seamlessly. This includes supporting multiple currencies and enabling low-cost, real-time transactions integrated with our Circle Wallet Integration.\n    - How Stellar is Used: Utilize Stellar's multi-currency support and fast settlement times to facilitate instant cross-border transfers and currency conversions when necessary.\n    - Impact on Project: Expands the reach of our collective savings product beyond national borders, fostering financial inclusion for diaspora communities and enabling them to support their families and friends back home.\n1. User Interface and Experience Enhancements\n    - Description: Improve the user interface (UI) and user experience (UX) of the collective savings platform to make it more intuitive and accessible, especially for users with limited technical expertise.\n    - How Stellar is Used: Integrate Stellar's SDKs and tools to streamline interactions with the blockchain, providing features like transaction tracking, balance updates, and notifications within the app.\n    - Impact on Project: Increases user adoption and satisfaction by making blockchain interactions seamless and user-friendly, thereby lowering the barrier to entry for new users.\n1. Security and Compliance Features\n    - Description: Implement advanced security protocols and ensure compliance with financial regulations across the countries we operate in. This includes identity verification, fraud detection, and secure data handling.\n    - How Stellar is Used: Leverage Stellar's built-in features like Account Authorization and KYC/AML compliance tools integrated with our actual KYC/AML partner (SUMSUB) to enhance platform security and adhere to regulatory standards of credit score and more functionalities.\n    - Impact on Project: Builds user trust by ensuring their funds and data are secure, and positions Amero for expansion into new markets by meeting international compliance requirements.\n1. Integration with Stellar Ecosystem Partners\n    - Description: Collaborate with other Stellar-based services such as wallets, exchanges, and financial applications to create a more interconnected ecosystem.\n    - How Stellar is Used: Use Stellar's interoperability to integrate with ecosystem partners, allowing users to seamlessly move assets between platforms and access a wider range of financial services.\n    - Impact on Project: Adds value for users by providing more functionality and flexibility, enhances the overall utility of the Amero platform, and strengthens the Stellar network through increased activity and collaboration.\n1. Educational Resources and Community Support\n    - Description: Develop educational materials and support channels to help users understand how to use the collective savings platform and the benefits of decentralized finance.\n    - How Stellar is Used: Provide tutorials and guides on how Stellar's technology underpins our services, highlighting features like transparency, low fees, and fast transactions.\n    - Impact on Project: Empowers users with knowledge, leading to higher engagement and retention rates, and fosters a community around the platform that can drive word-of-mouth growth.\nOverall Impact on the Project:\nThe SCF Build Award will enable us to transform our beta collective savings product into a fully-fledged, scalable solution that leverages the full potential of the Stellar network. By enhancing our use of Soroban smart contracts and integrating more deeply with Stellar's features, we will:\n- Increase Financial Inclusion: Offer accessible financial services to underserved communities, allowing them to save collectively, access loans, and build financial security.\n- Enhance User Trust and Transparency: Utilize blockchain technology to provide transparent operations, fostering trust among users.\n- Expand Market Reach: Enable cross-border participation, attracting users from various countries and expanding our user base.\n- Drive Innovation in DeFi: Set a precedent for how decentralized finance solutions can be tailored to meet the specific needs of emerging markets.\nBy focusing on these developments, we aim to make a meaningful impact on financial empowerment in Latin America, aligning with Stellar's mission to create equitable access to the global financial system.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success for the Amero Collective Savings project is measured through both quantitative outputs and the qualitative impact these outputs have on communities across Latin America.\nQuantitative Outputs:\n- User Growth: Onboard over 20,000 new users to the Collective Savings platform within the first six months post-launch, expanding our active user base significantly.\n- Transaction Volume: Facilitate more than 50,000 collective savings transactions, amounting to over $5 million USD saved or loaned within communities during the initial six-month period.\n- Geographical Expansion: Extend our services to at least five additional countries, increasing our presence to a total of twelve countries in Latin America.\n- Community Groups Formed: Establish over 2,000 new collective savings groups, enabling thousands of individuals to collaborate financially.\n- Partnerships Established: Integrate with three additional Stellar ecosystem partners, enhancing functionality and providing more options for users.\nImpact of Outputs:\n- Expanding Financial Access: By providing decentralized financial services accessible via mobile devices, we empower underserved and unbanked populations to participate in saving and lending activities without the need for traditional banking infrastructure.\n- Financial Inclusion: Enable individuals who previously lacked access to financial services to save securely, access loans, and earn interest, thereby promoting economic equality and reducing poverty levels.\n- Community Empowerment: Foster stronger community bonds through collective financial action, allowing groups to fund education, start small businesses, or invest in community projects that drive local development.\n- Economic Resilience: Increase the financial stability of users by providing tools to manage funds effectively, leading to improved household incomes and the ability to withstand economic shocks.\n- Technological Advancement: Promote the adoption of blockchain technology and decentralized finance (DeFi) solutions in everyday life, enhancing trust and transparency in financial transactions.\nLong-Term Vision:\nSuccess also involves setting a precedent for how blockchain-based financial solutions can be scaled effectively in emerging markets. By demonstrating the viability and benefits of our platform, we aim to influence industry practices, encouraging other institutions to adopt similar approaches that prioritize accessibility and user empowerment.\nMeasuring Impact:\nWe will track key performance indicators (KPIs) such as user retention rates, average savings per user, loan repayment rates, and user satisfaction scores. Additionally, we will collect qualitative data through user testimonials and case studies illustrating how access to our platform has positively affected individuals and communities.\nUltimate Goal:\nOur ultimate measure of success is the tangible improvement in the quality of life for our users. This includes increased financial literacy, greater economic opportunities, and enhanced social cohesion within communities. By enabling individuals to take control of their financial futures, we contribute to building a more inclusive and equitable financial landscape in Latin America.\nBy focusing on both the numbers and the human stories behind them, we believe that the success of the Amero Collective Savings project will not only be reflected in our growth metrics but, more importantly, in the lasting positive impact on the lives of the people and communities we serve.",
                        "stellar.tractionEvidence": "We have achieved significant traction and validation for Amero and our Collective Savings product through the following:\n1. Active User Base and Growth:\n- Amero Platform Users: Amero currently serves over 5,000 active users across seven countries: Mexico, Brazil, Colombia, Dominican Republic, Chile, El Salvador, and the United States. This growing user base reflects the trust and reliance users place on our platform for their financial needs.\n- Collective Savings Beta Users: Since launching the beta version of our Collective Savings product, we have onboarded over 50 users in Mexico and the Dominican Republic. These users are actively participating in collective savings groups, validating the demand and functionality of our solution.\n2. Transaction Volume:\n- Monthly Transactions on Amero Platform: We facilitate over 10,000 transactions monthly, including remittances, savings contributions, loans, and payments. This consistent activity demonstrates the platform's efficiency and user engagement.\n- Collective Savings Transactions: Within the beta program, we've processed over 200 transactions related to collective savings activities, totaling more than $1,000 USD in value. This indicates strong adoption and active use of the product.\n3. On-Chain Transaction History:\n- Stellar Network Activity: All transactions within the Collective Savings product are recorded on the Stellar blockchain, ensuring transparency and immutability. We can provide transaction hashes and links to the Stellar Expert explorer to verify on-chain activity upon request.\n4. User Testimonials and Feedback:\n- User Discovery Interviews: We have conducted over 50 user interviews with participants in the beta program. Feedback has been overwhelmingly positive, highlighting the ease of use, transparency, and community benefits.\n- Testimonials:\n    - Maria G., a beta user from Mexico City, shared: \"The Collective Savings feature has enabled my family and friends to save together effortlessly. It's transparent and gives us control over our finances like never before.\"\n5. Beta Program Sign-ups and Waitlist:\n- Waitlist Registrations: Over 300 users from various Latin American countries have signed up for the Collective Savings program's full launch. This strong interest showcases the market demand and potential for scaling.\n6. Strategic Partnerships and Integrations:\n- MoneyGram Integration: Active for over six months, this partnership facilitates seamless cash in and cash out operations, enhancing user accessibility and convenience.\n- Stellar Development Foundation Support: Our alignment with Stellar's mission has garnered support and guidance from the Stellar Development Foundation, reinforcing our project's credibility.\n7. Recognition and Awards:\n- Fintech Americas Awards:\n    - 2023: Received the Bronze Award in the category of DeFi, Blockchain, and Future.\n    - 2024: Elevated to the Silver Award in the same category.\n- These accolades affirm our innovation and impact within the fintech industry.\n8. Media Coverage and Industry Validation:\n- Press Features: Amero and the Collective Savings product have been featured in several reputable industry publications and media outlets, highlighting our innovative approach to financial inclusion. [Links can be provided upon request.]\n9. Compliance and Regulatory Approvals:\n- Licensed Operations: We have secured necessary licenses and adhere to financial regulations in all operating countries, demonstrating our commitment to compliance and ethical standards.\nConclusion:\nThe traction and validation of Amero and our Collective Savings product are evidenced by our growing user base, active transaction volumes, and positive user feedback. The beta program's success in Mexico and the Dominican Republic (https://youtube.com/shorts/VpnYbPCnSgo), coupled with a substantial waitlist, indicates strong market demand. Our strategic partnerships, industry recognition through awards, and compliance with regulatory standards further solidify our position and readiness to scale.\nBy meeting and exceeding the criteria for project traction and validation of the SCF Build Award, we are confident that with additional support, we can expand our impact, promote financial inclusion, and bring the benefits of decentralized finance to more communities across Latin America.",
                        "stellar.goToMarketPlan": "1. Accelerated Development and Deployment (Months 1-4):\n- Rapid Enhancement: Utilize the funding to expedite the development of key features, including optimized smart contracts, payment middleware, native Stellar wallet integration, and UI/UX improvements.\n- Testing and Quality Assurance: Conduct thorough testing on the Stellar testnet to ensure security, scalability, and user-friendliness before the mainnet launch.\n- Regulatory Compliance: Finalize compliance checks and obtain necessary approvals in all operating countries to ensure a smooth rollout.\n2. Strategic Marketing Campaigns:\n- Pre-Launch Buzz (Months 2-3):\n    - Teaser Campaigns: Begin creating excitement through social media teasers, blog posts, and email newsletters highlighting upcoming features and benefits.\n    - Influencer Partnerships: Collaborate with trusted influencers and community leaders in our target markets to build credibility and reach.\n- Official Launch Announcement (Month 3):\n    - Press Releases: Distribute press releases to major media outlets and industry publications announcing the mainnet launch.\n    - Launch Events: Host virtual launch events and webinars to demonstrate the product features and engage with potential users.\n- Post-Launch Marketing (Months 3-6):\n    - Targeted Advertising: Implement digital marketing campaigns targeting specific demographics in our key markets (Mexico, Brazil, Colombia, Dominican Republic, Chile, El Salvador, and the United States).\n    - Content Marketing: Produce educational content, tutorials, and success stories to showcase the value of the Collective Savings product.\n3. User Acquisition and Growth Strategies:\n- Referral Programs:\n    - Implement referral incentives to encourage existing users to invite friends and family, leveraging network effects to grow our user base rapidly.\n- Partnerships with Local Organizations:\n    - Collaborate with community organizations, cooperatives, and financial institutions to promote the product and onboard groups interested in collective savings.\n- Localized Outreach:\n    - Tailor marketing materials and support services to local languages and cultural nuances to enhance engagement and adoption.\n4. Customer Support and Education:\n- Enhanced Support Channels:\n    - Provide multilingual customer support via chat, email, and phone to assist users during onboarding and usage.\n- Educational Resources:\n    - Develop comprehensive guides, FAQs, and video tutorials to help users understand how to use the platform effectively.\n- Community Building:\n    - Foster online communities and forums where users can share experiences, ask questions, and provide feedback.\n5. Monitoring and Iteration:\n- User Feedback Loop:\n    - Collect and analyze user feedback to identify areas for improvement and quickly implement necessary changes.\n- Performance Analytics:\n    - Monitor key performance indicators (KPIs) such as user growth, engagement rates, transaction volumes, and retention rates to assess the effectiveness of our strategies.\n6. Expansion and Scaling (Months 6+):\n- Market Expansion:\n    - Based on initial success, plan to enter additional Latin American markets and explore opportunities in other regions with similar needs.\n- Product Diversification:\n    - Introduce new features and financial products based on user demand, such as micro-loans, insurance services, or investment opportunities.\n- Continuous Partnership Development:\n    - Seek additional partnerships within the Stellar ecosystem and with external organizations to enhance service offerings and reach.",
                        "stellar.tranche1Deliverables": "Deliverable 1: Optimization of Smart Contracts for Collective Savings\n- Brief Description:\n    - Enhance and optimize the existing smart contracts for the Collective Savings product using Soroban, Stellar's smart contract platform. This includes refining contract logic, improving security, ensuring scalability, and adding new features to support more complex savings models.\n- How to Measure Completion:\n    - Completion of smart contract development and optimization.\n    - Successful internal audits and security testing.\n    - Deployment of contracts on a development environment.\n    - Documentation of smart contract functionalities and APIs.\n- Estimated Date of Completion:\n    - 1 month from funding approval\n- Budget:\n    - $25,000 USD\nDeliverable 2: Development of Payment Middleware\n- Brief Description:\n    - Develop a robust payment middleware to facilitate seamless transactions between users, smart contracts, and external payment systems. This middleware will handle transaction routing, currency conversions, fee calculations, and ensure compliance with payment protocols.\n- How to Measure Completion:\n    - Middleware developed and integrated with the platform.\n    - Successful end-to-end testing of transaction flows.\n    - Middleware supports interactions between the platform, smart contracts, and external payment gateways.\n    - Documentation of middleware architecture and APIs.\n- Estimated Date of Completion:\n    - 1.5 months from funding approval\n- Budget:\n    - $25,000 USD",
                        "stellar.tranche2Testnet": "Deliverable 3: Integration of Native Stellar Wallet Management and Testnet Deployment\n- Brief Description:\n    - Integrate native Stellar wallet management into the Amero platform, allowing users to create, manage, and transact with Stellar wallets directly. Deploy the enhanced Collective Savings product, including optimized smart contracts and payment middleware, on the Stellar testnet for thorough testing.\n- How to Measure Completion:\n    - Successful integration of Stellar wallet functionality on the testnet.\n    - Users can create and manage Stellar wallets within test accounts.\n    - Deployment of smart contracts and middleware on the testnet.\n    - Completion of comprehensive testing, including functional, security, and performance testing.\n    - User Acceptance Testing (UAT) conducted with beta users.\n- Estimated Date of Completion:\n    - 2.5 months from funding approval\n- Budget:\n    - N/A (Access to Stellar LaunchKit for audits and infrastructure)",
                        "stellar.tranche3Mainnet": "Deliverable 4: Deployment on Stellar Mainnet and Go-Live\n- Brief Description:\n    - Deploy the fully tested and optimized Collective Savings product, including smart contracts, payment middleware, and wallet management, on the Stellar mainnet. This makes the enhanced product available to all users.\n- How to Measure Completion:\n    - Successful deployment on the Stellar mainnet.\n    - Users can access and utilize all new features on the live platform.\n    - Monitoring of initial transactions to ensure stability and performance.\n    - Public announcement and marketing campaigns launched.\n- Estimated Date of Completion:\n    - 3 months from funding approval\n- Budget:\n    - $10,000 USD\nDeliverable 5: Development of Transaction Monitoring and Risk Management Systems\n- Brief Description:\n    - Build systems for transaction monitoring, fraud detection, and risk management to ensure compliance with regulatory standards and enhance platform security.\n- How to Measure Completion:\n    - Implementation of real-time monitoring tools and dashboards.\n    - Ability to detect, flag, and alert on suspicious activities.\n    - Compliance reports can be generated as required.\n    - Integration with administrative portal for oversight.\n- Estimated Date of Completion:\n    - 3.5 months from funding approval\n- Budget:\n    - $10,000 USD\nDeliverable 6: UI/UX Enhancements and Integration with Additional Partners\n- Brief Description:\n    - Implement significant UI/UX improvements to enhance the overall user experience and accessibility of the platform. Integrate with additional Stellar ecosystem partners to expand functionalities and offer users more options.\n- How to Measure Completion:\n    - Deployment of updated UI/UX on the mainnet platform.\n    - Positive feedback collected from user surveys and increased user engagement metrics.\n    - Successful technical integration with at least two new partners.\n    - Live transactions processed through new integrations.\n    - User adoption metrics show increased usage of integrated services.\n- Estimated Date of Completion:\n    - 4 months from funding approval\n- Budget:\n    - $20,000 USD\nDeliverable 7: Development of Administrative and Risk Score Review System\n- Brief Description:\n    - Create an administrative portal for managing collective savings groups, including tools for risk assessment, user management, and governance features to ensure platform integrity and compliance.\n- How to Measure Completion:\n    - Deployment of the administrative system on the mainnet platform.\n    - Functionality tested and operational.\n    - Administrators can assign risk scores, manage permissions, and oversee group activities.\n    - Compliance and audit reports generated successfully.\n- Estimated Date of Completion:\n    - 4 months from funding approval\n- Budget:\n    - $12,000 USD",
                        "stellar.teamMembers": "Osiris Rodriguez",
                        "stellar.urls": {
                            "website": "https://amero.exchange",
                            "codeRepository": "https://ameroexchangelimited-my.sharepoint.com/:w:/g/personal/nelsonp_amero_exchange/EbhtuzaRN_dDkHlJgUGkXVQBDiKAH4Bf-mJFsCjvUy0uSw?e=WTolLw",
                            "videoURL": "https://youtu.be/aFhGhRTPevY"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://do.linkedin.com/company/ameroexchange",
                            "twitter": "https://twitter.com/amero_exchange"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 34000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 67779.71,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-11-27T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:6",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recFctBzb2Zo3VO4z",
                    "projectId": "daoip5:stellar:project:identity-operating-system-idos",
                    "projectName": "Identity Operating System (idOS)",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recFctBzb2Zo3VO4z",
                    "status": "Awarded",
                    "description": "Implement the idOS on Stellar to unlock KYC-reusability even for obligated entities and user-owned data management",
                    "fundsApprovedInUSD": 125000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.idos.network/idos-docs/how-it-works/system-architecture",
                        "stellar.productsAndServices": "The idOS is a decentralized identity and storage layer. It gives users the ability to be in control of their own data and dApps to make even KYC onboarding as smooth as signing a transaction.  \n  \nThe idOS is a network of nodes that stores user-encrypted data and uses a proof-of-state consensus to enforce user request. Unlike P2P decentralized storage providers, it allows for data privacy ( e.g. GDPR) compliance.  \n  \nIn a world that finally sees self-custodial rails being used in the real world, especially for finance application, the idOS bridges identity user information over from one dApp and use case to another.  \n  \nImagine investing on a RWA platform and later wanting to offer this stake on an institutional DEX pool. Usually both cases would require a full KYC process. The idOS allows both entities to exchange this information with the consent of the user. Imagine, having a wallet that acts both as a bank account as well as a hub for various financial dApps: These use cases need an identity orchestration layer that the idOS provides.  \n  \nThe integration can be separated in three steps that finish with an implementation of the idOS into Stellar:\n\n1.  General implementation and system operability, specifically PPKP interoperability and message-signing recognition\n    \n1.  SEP-10 support and native wallet support\n    \n1.  SEP-12 integration to allow wallet --> Anchor or wallet --> dApp flows\n    \n\n  \nThe integration would allow a native and user-self-custodial passing of KYC information. It would e.g. allow Vibrant to connect to the idOS to securely store KYC information and enable user data management as well as KYC passing. It does not enable an attestation system for smart contract native identity gating use cases.",
                        "stellar.successCriteria": "1.  Technical implementation and readiness (the product is implemented and can be used)\n    \n1.  Number of data consumers (we have at least 3 dApps that actively use the idOS)\n    \n1.  Number of users (undefined)",
                        "stellar.tractionEvidence": "The idOS is the first identity protocol to gather significant support for creating a joint standard to store, manage and exchange user data: The idOS is a consortium that Arbitrum Foundation, Circle (through its affiliate Circle Ventures), Ripple, NEAR Foundation, Gnosis, Aleph Zero Foundation, Radix and the Tezos Foundation (Etherlink) joined.  \nThe idOS is specifically relevant for real world financial use cases as it unlocks KYC-reusability and self-custodial data management that is data privacy compliant. The idOS is currently live on Ethereum mainnet and Arbitrum having processed over 2.500 users. We are currently working on bringing the idOS live with obligated entities providing services via our consortium partners and potentially Stellar.",
                        "stellar.goToMarketPlan": "We are identifying use collaboration use cases that require an orchestration layer for decentralized identity: That could e.g. be a Vibrant integration to unlock the use case in general, but would ideally be in combination with other obligated entities that are used in the same frontend.  \n  \nThis could be  \n\n1.  Consumer focused applications like e.g. Vibrant implementing self-custodial debit card providers like Kulipa, crypto-to-fiat remittance companies and bank account features like e.g. Monerium offers in one dApp.\n    \n1.  RWA value chain cases like the Tokenization provider that is auctioning off an asset passing on the KYC information to a permissioned DEX that allows institutional investors to provide liquidity and a lending marketplace using the asset as collateral for a crypto-to-fiat payout. These providers could implement the idOS to avoid having to each KYC the user.\n    \n1.  Compliant financial transaction privacy: Having a clean pool of KYCed users allows data privacy in a compliant way as transactions can be obfuscated without violating AML laws.\n    \n\nWe place special attention to making sure that we only deploy in ecosystems where we see a good path towards adoption. The idOS only works when people and dApps sign up for it which is why it is important to us to ensure adoption and usage.",
                        "stellar.tranche1Deliverables": "Tranche 1: basic Stellar support\n[ Allocation: $50k | Delivery: Q2 2025 ]\n\nThe first tranche focuses on establishing the core functionality of the idOS within Stellar’s ecosystem. This will involve the general implementation of the idOS protocol to ensure system operability on Stellar.\n\nMilestone 1.1: cryptographic compatibility\n[ Allocation: $20k | Delivery: Q1 2025 ]\n\n- Support Stellar primitives within the idOS nodes\n    - PPKP Interoperability: Develop the necessary interoperability for Public-Private Key Pair (PPKP) cryptography, allowing secure and verifiable credential storage and management from Stellar.\n    - Message-Signing Recognition: Implement message-signing features that enable the idOS to verify user data signatures from Stellar wallets and authorize transactions with enhanced data security.\n- Enhance our SDKs for compatibility with Stellar primitives\n    - Update our Frontend SDK, Issuer SDK, and Data Consumer SDK to make Stellar integration and support possible end-to-end.\nMilestone 1.2: abstracted account support\n[ Allocation: $20k | Delivery: Q2 2025 ]\n- Natively support Stellar’s account abstraction mechanisms for idOS authentication.\n\nMilestone 1.3: idOS ecosystem rollout\n[ Allocation: $10k | Delivery: Q1 2025 ]\n- Update out User Dashboard for Stellar compatibility\n    - Enable Stellar users to add Stellar wallets to their idOS profile\n    - Allow Stellar wallets to authenticate with the idOS via the User Dashboard\n- Update all idOS reference implementations for Stellar compatibility\n- Update our documentation with Stellar specific examples",
                        "stellar.tranche2Testnet": "Tranche 2: Stakeholder experience\n[ Allocation: $45k | Delivery: Q3 2025 ]\nThis tranche focuses on the delivery of the idOS data dashboards for issuers and consumers on Stellar and enables users to recover and access their encryption key\n\nMilestone 2.1: Issuer and Data consumer dashboards\n[ Allocation: $35k | Delivery: Q2 2025 ]\n\n- Develop a dashboard for credential issuers where they can review their work, revoke credentials where needed, and inspect user profiles in detail\n- Develop a dashboard where Stellar data consumers such as dapps can explore their userbase, understand the status of their access grants, and inspect user profiles in detail\n\nMilestone 2.2: MPC encryption key recovery\n[ Allocation: $10k | Delivery: Q3 2025 ]\n\n- Extend our MPC encryption key recovery system to support Stellar users\n- Enable Stellar users to securely back up and recover their encryption keys",
                        "stellar.tranche3Mainnet": "Tranche 3: full Stellar integration\n[ Allocation: $30k | Delivery: Q3 2025 ]\nThis tranche focuses on Stellar as a first-class idOS citizen. It professionalizes issuance and data consumer tooling and provides Stellar with mechanisms for transaction authorization.\n\nMilestone 3.1: Attestation registry smart contract\n[ Allocation: $20k | Delivery: Q3 2025 ]\n\n- Create an on-chain attestation registry in Stellar, using Soroban\n- Enable dapps to use registry lookups for transaction authorization\n- Enable users to prove on-chain that they hold a certain credential\nMilestone 3.2: end-to-end readiness\n[ Allocation: $10k | Delivery: Q3 2025 ]\n- Testing and Validation\n    - Conduct thorough tests to validate system performance, security, and scalability, ensuring that all components are fully operable before advancing to the next phase.\n- Demo: record explainer videos\n    - How the idOS works for Stellar Users, Issuers and Data Consumers\n    - How integration works for Stellar developers",
                        "stellar.teamMembers": "idOS Team",
                        "stellar.urls": {
                            "website": "https://idos.network",
                            "codeRepository": "https://github.com/idos-network",
                            "videoURL": "https://www.youtube.com/watch?app=desktop&v=ZtdDg0N7n4Q"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/idos-network/",
                            "twitter": "https://x.com/idOS_network"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 41666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 100272.49,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:7",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec4Ae95oRI0kTbVL",
                    "projectId": "daoip5:stellar:project:bebop",
                    "projectName": "Bebop",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec4Ae95oRI0kTbVL",
                    "status": "Awarded",
                    "description": "Bebop is focused on changing the Africans Pay, Save and Invest",
                    "fundsApprovedInUSD": 112970.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1PMyo8MgFFQWspq1-G2n1rr1_hUsc4mMo/view?usp=sharing",
                        "stellar.productsAndServices": "Consumer Application, The Bebop App, A Non Custodial Neo-Bank built on Stellar Blockchain targetting\n\n1.  USD Balance, using Stellar Blockchain and SDF for USDC stable coins and Anchor system for (On and Off Ramps)\n    \n1.  Save and earn yield, protect against inflation (Using Soroban smart contracts, and our Intergration to the Blend Protocol)\n    \n1.  Send money anywhere for free, both locally and across border, (Using Stellar Path Payment API)\n    \n1.  Ease of signing up, All that is required is a smartphone and internet access\n    \n1.  virtual and physical cards (online and offline payments)\n    \n1.  Built In P2P On/Off Ramp marketplace (Similar to Binance P2P but focussed on Africa and its youthful population)\n    \n1.  send to bank or mobile money",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success For us is Simple\n\n1.  Onboard 10,000 African Youth\n    \n1.  Find Product Market Fit\n    \n1.  Raise Pre-Seed Funds",
                        "stellar.tractionEvidence": "200 Users in Test: https://drive.google.com/file/d/1YRWFNuZTZ2RjqGf0eXs7mkdBmso8SusC/view?usp=sharing  \nMoney Service Business: https://drive.google.com/file/d/1laU8tWaHP07He1wLyA-kfe3Ja93P4qDs/view?usp=share_link\n\nEvidence of MVP Features:\n\nhttps://drive.google.com/file/d/1nZLZcOhD8uChC_MDr2kgxKZ5MFww1vDt/view?usp=sharing\n\nhttps://drive.google.com/file/d/1j1hAtLwI0KuPETQO4Sj4fpTBj9HQFvlh/view?usp=sharing\n\nhttps://drive.google.com/file/d/1XXW-sH8nxPYNRYmhYuhNM0P2XsGh6ASE/view?usp=sharing",
                        "stellar.goToMarketPlan": "Unique Value Proposition\n\n-   Highlight Benefits: Emphasize low transaction fees, ease of access, security, and the ability to conduct transactions without the need for a traditional bank account.\n    \n-   Educate Users: Create informative content that explains how blockchain technology works and its benefits for everyday transactions.\n    \n\nUser Acquisition Strategy\n\n-   Referral Programs: Implement incentives for users who refer friends and family to the app, creating a viral growth effect.\n    \n-   Community Engagement: Host workshops at University campuses and local events to demonstrate the app’s features and benefits directly to potential users.\n    \n\nStrategic Partnerships\n\n-   Collaborate with Local NGOs and Community Organizations: Leverage their networks to reach unbanked populations and build trust within communities.\n    \n-   Engage with Mobile Network Operators (MNOs): Partner to leverage their distribution channels and increase app visibility.\n    \n\nDigital Marketing Campaigns\n\n-   Social Media: Utilize platforms popular in target regions (e.g., Facebook, WhatsApp) for targeted advertising campaigns and user testimonials.\n    \n-   Influencer Marketing: Collaborate with local influencers who can authentically promote the app and its benefits to their followers.\n    \n\nOnboarding and Customer Support\n\n-   Simplified Onboarding Process: Ensure that signing up and using the app is intuitive and accessible, with multilingual support.\n    \n-   Robust Customer Support: Offer customer service via in-app chat, phone, and social media to assist users with any issues they encounter.\n    \n\nFeedback and Iteration\n\n-   User Feedback Loops: Regularly gather user feedback to improve app features and address any pain points.\n    \n-   Continuous Improvement: Use analytics to track user behavior and refine marketing strategies based on what works best.\n    \n\nScaling Strategy\n\n-   Pilot Launch: Start in Nairobi, Kenya region to test the market and refine the product based on user feedback.\n    \n-   Gradual Expansion: Plan for phased rollouts to additional regions based on success metrics and user demand.\n    \n\nRegulatory Compliance\n\n-   Understand Local Regulations: Work closely with legal experts to ensure compliance with financial regulations in each country of operation.\n    \n-   Build Trust: Transparently communicate your compliance efforts to users, reinforcing the app's credibility.",
                        "stellar.tranche1Deliverables": "1.  P2P Exchange\n    \n    -   Brief description: Developing a marketplace within the Bebop app that enables users to buy and sell Stellar USDC, facilitating seamless on/off ramps.\n        \n    -   How to measure completion: Successful deployment of the initial MVP via TestFlight.\n        \n    -   Estimated date of completion: 2 months post-award distribution.\n        \n    -   Budget: $37,000\n        \n1.  SEP-24 Integration\n    \n    -   Brief description: Integrating ClickPesa to facilitate on/off ramps in Tanzania and Nairobi.\n        \n    -   How to measure completion: Successful deployment and testing of the TestFlight build.\n        \n    -   Estimated date of completion: 1 week post-award distribution.\n        \n    -   Budget: $7000\n        \n1.  Improved Blend Smart Contract Integration\n    \n    a.  Brief description: Enhancing our existing infrastructure to allow users to create custom liquidity pools and improve interface usability.\n        \n    a.  How to measure completion: Successful deployment and testing of the TestFlight build\n        \n    a.  Estimated date of completion: 2 weeks post-award distribution\n        \n    a.  Budget: $4,000",
                        "stellar.tranche2Testnet": "1.  P2P Exchange\n    \n    -   Brief description: Conducting testing of the P2P Exchange with verified sellers and open market buyers\n        \n    -   How to measure completion: Launch on the App Store, making it publicly accessible.\n        \n    -   Estimated date of completion: 1 week after MVP completion (including testing).\n        \n    -   Budget: $5,000\n        \n1.  Move Existing Features to mainnet\n    \n    a.  Brief description:Performing QA testing for all core app features: Account Creation, Swap, Sending USDC, and Bebop User Directory\n        \n    a.  How to measure completion: QA testing logs published on GitHub Pages and shared with relevant stakeholders.\n        \n    a.  Estimated date of completion: 2 weeks after MVP completion.\n        \n    a.  Budget: $3,400\n        \n1.  SEP-24 Integration\n    \n    a.  Brief description: Testing On/Off Ramp integration with Credits.\n        \n    a.  How to measure completion: QA testing logs published on GitHub Pages and distributed to necessary parties.\n        \n    a.  Estimated date of completion: 1 week after MVP completion.\n        \n    a.  Budget: $5,200\n        \n1.  Improved Blend Smart Contract Integration\n    \n    a.  Brief description: Creating a more intuitive interface that allows users to establish their own liquidity pools with contacts.\n        \n    a.  How to measure completion: Launch on the App Store, making it publicly accessible.\n        \n    a.  Estimated date of completion: 3 weeks after MVP completion.\n        \n    a.  Budget: $3,470",
                        "stellar.tranche3Mainnet": "1.  P2P Exchange\n    \n    -   Brief description: Developing a marketplace within the Bebop app that enables users to buy and sell Stellar USDC, facilitating seamless on/off ramps.\n        \n    -   How to measure completion: Successful launch on the App Store, making it publicly accessible.\n        \n    -   Estimated date of completion: 2 weeks after testing is completed\n        \n    -   Budget: 19000\n        \n1.  Move Existing Features to mainnet\n    \n    a.  Brief description: Successful launch on the App Store, ensuring public access to these integrations.\n        \n    a.  How to measure completion: Successful launch on the App Store, making these features publicly available.\n        \n    a.  Estimated date of completion: 3 weeks after testing is completed.\n        \n    a.  Budget: $16,500\n        \n1.  SEP-24 Integration\n    \n    a.  Brief description: Integrating all Anchor features with the mainnet.\n        \n    a.  How to measure completion: Successful launch on the App Store, making this functionality publicly available.\n        \n    a.  Estimated date of completion: 3 weeks after Testing Completed\n        \n    a.  Budget: $8,400\n        \n1.  Improved Blend Smart Contract Integration\n    \n    a.  Brief description: Creating a more intuitive interface that allows users to establish their own liquidity pools with their contacts.\n        \n    a.  How to measure completion: Successful launch on the App Store, making this functionality publicly available.\n        \n    a.  Estimated date of completion: 3 weeks after Testing Completed\n        \n    a.  Budget: $4,000",
                        "stellar.teamMembers": "Christopher Karani",
                        "stellar.urls": {
                            "website": "https://bebop.cash",
                            "codeRepository": "https://github.com/christopherkarani/Tuma",
                            "videoURL": "https://youtu.be/f6_byrD9DCU",
                            "pitchDeck": "https://drive.google.com/file/d/1SLpnWkHRX3bxkPEIKqUh48M5LDnl0kx4/view?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/bebopcash/posts/?feedView=all",
                            "twitter": "https://x.com/bebopcash"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 75313.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 247131.69,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-09T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:8",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recCKZxVBYc2jgue4",
                    "projectId": "daoip5:stellar:project:b4b.app",
                    "projectName": "B4B.app",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recCKZxVBYc2jgue4",
                    "status": "Awarded",
                    "description": "Our plan is to build an MVP for a newly approved use case: advertisers creating campaigns with set deliverables and prices for targeted influencers, all managed through a Soroban smart contract. Following this, we'll launch a full platform testnet and partner with ecosystem players for off-ramp exchanges. The final step involves launching on the mainnet and migrating our user base, with seamless onboarding from Telegram using Passkey login on Stellar.",
                    "fundsApprovedInUSD": 90000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1jEJBpgiwG_6YRG2wg16afPjSlg6_rom4/edit#heading=h.gjdgxs",
                        "stellar.productsAndServices": "1.  Advertisers can make deposits on Soroban smart contracts and set up deliverables with prices (content creation, post, repost).\n    \n1.  Influencers with verified social metrics and sufficient criteria can view available proposals from advertisers with instant fixed payouts in USDC on Stellar after completion.\n    \n1.  Influencers publish the content and provide proof links to the smart contract. B4B algorithms verify the sufficiency of the submitted task.\n    \n1.  Influencers unlock their payment within 24 hours on their Stellar wallet.\n    \n1.  Advertisers can view a dashboard with results and links from influencers, as well as their budget spending on integrations.\n    \n1.  Integrate the new functionality with the current version of the platform, including influencers' reputation data.\n    \n1.  Cover the functional autotests and launch full testnet.\n    \n1.  Integrate off-ramp USDC withdrawal (with API partners—OffRampMeDaddy) to USD for Web2 influencers from their Stellar wallet.\n    \n1.  Conduct final audits, prepare a monitoring dashboard, migrate the database, and launch on Stellar mainnet with full functionality.\n    \n1.  Integrate mainnet Passkey verification with the Telegram mini-app for Social Score checking and influencer onboarding",
                        "stellar.successCriteria": "After the launch:\n\n• Each brand confirms monthly deposits of $5,000-$10,000\n\n• 50 brands engage in monthly content creation\n\n• $1M+ Annual Recurring Revenue (ARR) achieved within one year\n\n• 1,000 influencers/KOLs onboarded through Passkey and Telegram Mini app with Influence Score\n\n• Viral growth of influencers and companies on the platform\n\n• Concept and Go-To-Market (GTM) strategy approved and prepared for scaling",
                        "stellar.tractionEvidence": "Here's a link to our 3-month story detailing product upgrades and new hypothesis testing:\n\nhttps://docs.google.com/document/d/1ueaclx9c7L6Y1O3YEiE6CA0l6kiqmpzgw98hOPP4Frg/edit?usp=sharing\n\n  \n\nTLDR: We have completed the Proof of Concept (PoC) version, which has successfully launched on Stellar testnet with Soroban smart-contract implementation and Passkey sign-up on the platform.\n\nThe fully functional testnet has been successfully launched. The B4B Community of Influencers in Telegram has expressed enthusiasm for the passkey integration, providing positive feedback.\n\nWe have just launched our application as a Telegram Mini App to simplify onboarding for Telegram influencers. This app calculates their Influence Score and allows them to invite friends to grow their influence.",
                        "stellar.goToMarketPlan": "Influencers\n\nWe currently offer invite-only access to attract high-quality content creators. This approach enables us to build a community of genuine Web3 influencers—not mere shillers—who are eager for meaningful interactions with each other.\n\nOur influencers now fulfill 70% of advertisers' requests.\n\nStrategies for expanding our influencers/KOLs network:\n\n1.  Referral program\n    \n\nAfter successfully completing an advertising campaign, an influencer typically brings in 2-3 other influencers.\n\n1.  Telegram mini-app for user incentivization with future implementation of Passkey auth https://t.me/B4BinfluenceBot/InfluenceScore?startapp=ref_djx8KO Users can measure their influence score and increase it by inviting influencers to the platform. We aim to onboard approximately 10,000 Telegram influencers with new Web2 audiences into the Web3 space.\n    \n1.  Collaborations with major Web3 ecosystems and attracting engaged influencers in the space\n    \n1.  Influencer marketing on the B4B platform to engage more users\n    \n\nAdvertisers\n\nWe have successful case studies: https://docsend.com/view/yuz9srtbugarfxx9\n\nAfter collaborating with Web3 leaders and analyzing our initial cases, we've refined our product. We're now developing an enhanced model for KOL engagement, which has already secured $150,000 in pre-orders.\n\nStrategies for expanding our influencers/KOLs network:\n\n1.  B2B sales via connections and partners (50 pre-commitments after the last two conferences)\n    \n1.  Referral program (influencers often recommend us to brands unprompted)\n    \n1.  AMA sessions with marketing leaders and projects in the Web3 marketing sphere",
                        "stellar.tranche1Deliverables": "The goal: Develop the new proved functionality and launch the final MVP of B4B.app on the Stellar testnet. Implement core functionality allowing advertisers to set up deliverables for influencers, with interactions facilitated through Soroban Smart Contract.\n\nTotal Timeline: 1 month  \nTotal Budget: $30,000\n\nDeliverable 1 - New Smart-contract logic with Content creation campaign\n\nBrief description:\n\n1.  Advertisers create deposits on smart contracts for content creation campaigns.\n    \n1.  They set up tasks (post, repost, content, etc.) for content creation, specifying fixed payments and target metrics for influencers' profiles.\n    \n1.  Influencers meeting the target criteria gain access to create content and receive instant payment upon completion via smart contract.\n    \n1.  Influencers publish content, submit proof links, and unlock payment.\n    \n1.  The payment is released from the smart contract 24 hours after ad completion.\n    \n\nHow to measure completion - Smart Contract on Soroban completed\n\nEstimated date of completion - 1 month after the start\n\nBudget - $10,000 \n\n1 Blockchain Dev - $8000 x 1 month = $8,000  \n¼ Analytics - $2000  \n\nDeliverable 2: Ad Campaign List and Workflow for Influencers\n\n1.  Verified influencers view available content creation campaigns with instant payment options. They receive notification of new available offers.\n    \n1.  Influencers accept tasks and prepare content\n    \n1.  Upon completion, influencers submit proof links\n    \n1.  Influencers receive payment from Soroban SC for completed campaigns within 24 hours\n    \n\nHow to measure completion - Frontend and Backend parts completed with SC integration\n\nEstimated date of completion - 1 month after the start\n\nBudget - $10,000 \n\n½ Frontend Dev $4,000\n\n½ Backend Dev $4,000\n\n¼ Designer $2,000\n\nDeliverable 3: Dashboard for Advertisers\n\n1.  Advertisers deposit funds for content creation tasks\n    \n1.  Set up tasks with target metrics and prices for each piece of content\n    \n1.  Publish ad campaigns with automatic payment via smart contract\n    \n1.  Receive updates on newly created content and performance analytics\n    \n\nHow to measure completion - Frontend and Backend parts completed with SC integration\n\nEstimated date of completion - 1 months after the start\n\nBudget - $10,000 \n\n½ Frontend Dev $4,000\n\n½ Backend Dev $4,000\n\n¼ Designer $2,000",
                        "stellar.tranche2Testnet": "The goal: Launch a full version of B4B.app on Stellar's testnet. Integrate the platform's complete functionality, including direct ad campaign launches and content creation tasks. Implement off-ramp exchanges of USDC to USD on Stellar for Web2 influencer payouts (integrating with partners—RampMeDaddy). Ensure thorough test coverage of all features.\n\nTotal Timeline: 1 month  \nTotal Budget: $30,000\n\nDeliverable 1 - Integrate the full functionality and Testnet launch\n\nWe plan to integrate the new implemented MVP functionality with the core architecture of the platform to prepare for mainnet launch and full database migration. The Advertisers will be able to create the content on the budget with fixed deliverables or choose the direct integrations with the influencers. The main payment logic works with USDC via Soroban Smart-contract. We'll implement comprehensive autotest coverage for core functionalities and initiate a testnet launch for our supportive influencer community.\n\nHow to measure completion - The testnet launched\n\nEstimated date of completion - 1 month after the start\n\nBudget - $16,000\n\n1 Backend Dev $8,000\n\n½ Blockchain Dev $4,000\n\n½ Frontend Dev $4,000\n\nDeliverable 2 - Implement Off-ramp Exchange for Web2 Influencers\n\nWeb2 influencers need to convert their USDC payments received on their Stellar wallet to USD in their bank accounts, complying with all KYC requirements. We'll integrate Stellar services to enable Web2 influencers to access these features on our platform. For the integration we plan to collaborate with ecosystem project RampMeDaddy via API.  \n\nhttps://rampmedaddy.com/\n\nhttps://stellar.org/use-cases/ramps\n\nhttps://github.com/stellar/stellar-protocol/blob/master/ecosystem/sep-0024.md \n\nHow to measure completion - The off-ramp integrated by API\n\nEstimated date of completion - 1 month after the start\n\nBudget - $14,000\n\n½ Frontend Dev $4,000\n\n Backend Dev $8,000\n\n¼ Analytics $2,000",
                        "stellar.tranche3Mainnet": "Milestone 3 - Mainnet\n---------------------\n\nThe goal: Final preparation for Stellar and Soroban mainnet launch. Migrate database of active B4B.app influencers and create accounts with Stellar wallet and passkey. Audit smart contract payment logic. Register and connect with on-ramp and off-ramp USD-USDC exchanges on Stellar. Deploy on mainnet and provide tech support for users.\n\nTotal Timeline: 1 month  \nTotal Budget: $30,000\n\nDeliverable 1 - Smart Contracts Audit preparation (internal)\n\nPrepare codebase for audit with supporting documentation  \nInteract with audit providers and ensure comprehensive documentation and test coverage  \nPublish a public report and codebase of the audited smart contract with payment logic\n\nHow to measure completion - Smart Contract on Soroban audited\n\nEstimated date of completion - 1 months after the start\n\nBudget - $10,000  \nBlockchain Dev - $8,000  \nAnalytics - $2,000\n\nDeliverable 2 - Mainnet Launch and User Migration Support\n\nDeploy smart contracts on mainnet\n\nComplete technical migration of registered users' database (influencers and advertisers)\n\nLaunch all integrations on the mainnet (off-ramp)\n\nImplement autotest coverage, monitoring and analytics\n\nProvide instructions and manual tech support for all users to ensure a successful mainnet launch on Stellar with scaling database\n\nHow to measure completion - Mainnet launch\n\nEstimated date of completion - 1 month after the start\n\nBudget - $10,000  \nBackend Dev - $8,000\n\nQ&A expert $2,000\n\nDeliverable 3 - Telegram mini App with Stellar Passkey launch \n\nPrepare user onboarding with Stellar wallet creation using Passkey in their accounts. Integrate Passkey into the Telegram Mini App for seamless influencer onboarding from Telegram and easy Influence Score checking.\n\nProvide instructions for all user types\n\nHow to measure completion - Telegram mini App with Passkey prepared for scaling \n\nEstimated date of completion - 1 months after the start\n\nBudget - $10,000\n\nFullstack Dev - $8,000  \nQ&A expert $2,000",
                        "stellar.teamMembers": "Anton",
                        "stellar.urls": {
                            "website": "https://stellar-influencer.b4b.app/",
                            "codeRepository": "https://gitlab.com/b4b-world/b4b-soroban",
                            "videoURL": "https://www.youtube.com/watch?v=cVztU4Ig8ng"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/b4b-world/",
                            "twitter": "https://x.com/b4b_world",
                            "discord": "https://discord.gg/cx6xndBz"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 66666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 202505.53,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-06-27T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:9",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recu6fJQwuDeFeXlv",
                    "projectId": "daoip5:stellar:project:xlm.sh",
                    "projectName": "xlm.sh",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recu6fJQwuDeFeXlv",
                    "status": "Awarded",
                    "description": "A gateway that enables users to access decentralized websites by appending `.sh` to their Soroban domains.",
                    "fundsApprovedInUSD": 36000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1puNtIoqp28jhoYkITaKwizBMJlrjQ0zfcE_G5ej0Sqk",
                        "stellar.productsAndServices": "This funding will be used for the following improvements, and here is a brief description; detailed descriptions can be found in the technical architecture document: \n1. Support for sub-domains \n2. Improve the performance and availability \n3. Add a pin cache feature \n4. Deploy an IPFS cluster to ensure availability \n5. Add support for setting IPFS/IPNS records on Sorban\n6. Provide a professional homepage and more visually appealing error prompt pages \n7. Provide detailed tutorials and documentation.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "- My goal is to become the gateway entry point of the most widely used distributed storage network in the Stellar ecosystem. \n- I hope that in the next year, at least 10 DApps will choose it as an entry point. \n- I also hope to attract individual users who would use xlm.sh as their gateway to Web3 websites, accessing their Web3 content such as blogs, ID pages, and other resources through it.",
                        "stellar.tractionEvidence": "'- Since I shared xlmsh on X on 09/10/2024 (10 days ago), Blend and Tansu have completed their respective integrations, and you can access them through blend.xlm.sh and tansu.xlm.sh.\n- In addition, over the past 10 days, we have received nearly 1,000 unique visitors. While this isn't a lot, I think it's a good start for a project that has only been online for 10 days.\n- The maintainer of Tansu wrote a blog introducing the use of xlm.sh. If you're interested, you can take a look.",
                        "stellar.goToMarketPlan": "- I will attract users by providing easy-to-follow tutorials.\n- I will directly reach out to other DApp developers and offer necessary support if they show interest.\n- I will promote through channels like X and others.",
                        "stellar.tranche1Deliverables": "Before submitting this round of SCF, I've spent some time getting it to work on the mainnet. I believe the currently running version can be considered the MVP version. And Blend and Tansu have integrated it, which I think demonstrates the feasibility of the product.",
                        "stellar.tranche2Testnet": "We will iterate quickly on all the new features described above. We won't wait for all features to be completed before releasing. After we complete a feature and test it without issues, we will release a new version. Therefore, we will not separate Testnet and Mainnet. Our goal is to gradually roll out the promised features within three months.",
                        "stellar.tranche3Mainnet": "- Completion of the all improvements described above. \n- Completion date: Before Jan 31, 2025 \n- Budget: 36000",
                        "stellar.teamMembers": "overcat",
                        "stellar.urls": {
                            "website": "https://xlm.sh/",
                            "codeRepository": "https://gist.github.com/overcat/dadfbd565a474e6d4a04e08d060b8d60",
                            "videoURL": "https://vimeo.com/1021569318"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 36000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 108743.2,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-24T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:10",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recNs5mLS2K2GFKVu",
                    "projectId": "daoip5:stellar:project:trustless-work",
                    "projectName": "Trustless Work",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recNs5mLS2K2GFKVu",
                    "status": "Awarded",
                    "description": "Trustless Work provides decentralized escrow services for secure B2B, e-commerce, and marketplace transactions, simplifying payments without intermediaries.",
                    "fundsApprovedInUSD": 70000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.trustlesswork.com",
                        "stellar.productsAndServices": "Trustless Work is an Escrow-as-a-Service (EaaS) platform designed to facilitate secure, transparent, and decentralized transactions across industries. Built on Stellar's Soroban smart contract platform, it allows users to securely hold funds, release payments based on pre-agreed milestones, and manage disputes efficiently. The platform offers open APIs that developers can integrate into their applications to enable trustless transactions, making it ideal for marketplaces, B2B payments, real estate deals, e-commerce platforms, and businesses requiring deposit management. Trustless Work's open-source smart contracts and modular architecture allow easy customization to suit different use cases.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "-   MVP Completed: Core escrow smart contracts successfully deployed on Stellar testnet with at least 10 beta users providing positive feedback.\n    \n-   Testnet Integration: Full integration of Trustless Work API with Stellar Anchors, with successful test transactions and partner feedback.\n    \n-   Mainnet Launch: Trustless Work fully operational on Stellar mainnet, achieving at least 100 real-world transactions in the first three months, and onboarding key early partners.",
                        "stellar.tractionEvidence": "'-   DraperU-Stellar Astro Hacker House: succesfully completed DraperU Astro HAcker house program, getting valuable feedback on our product idea.\n    \n-   Beta testing: Recently Sponsored a hackathon (oct 2024) that resulted in 7 dev teams building solutions for agriculture, mobility, real estate, marketing and privacy with our API V0.1.\n    \n-   User Discovery Interviews: Conducted 15+ interviews with potential customers in sectors like marketplaces, legal tech, and banking, providing evidence of demand and product-market fit.\n    \n-   Partnerships: Established collaboration with early reference customers in legal tech and banking to battle-test escrow solutions in real-world scenarios.\n    \n-   DraperU-Stellar Embark program: Accepted into DraperU-Stellar Embark program to accelerate our MVP development and GTM.",
                        "stellar.goToMarketPlan": "We will leverage early partnerships in the legal tech and banking sectors to drive initial adoption, focusing on customer-funded growth.\n\nWe will sponsor hackathons to attract developers and build traction among web3 communities.\n\nOur API-first approach aims to provide developer-friendly tools to facilitate easy integration for e-commerce platforms, marketplaces, and B2B businesses, ensuring rapid adoption through partner networks. Additionally, we will create educational content and conduct outreach campaigns to educate businesses on the benefits of decentralized escrow services.\n\nWe will be leveraging Open Source development platform like Only Dust to build Open Source tools like escrow viewers, template contracts & dev tools to attract developers and platforms who integrate our services. .",
                        "stellar.tranche1Deliverables": "1.  Deliverable : Develop core escrow smart contracts on Soroban to support basic escrow use cases (milestone-based payments, fund locking).\n    \n    -   How to Measure Completion: Deployment of Soroban contracts on Stellar testnet with documentation.\n        \n    -   Estimated Date of Completion: January 2025.\n        \n    -   Budget: $30,000 in XLM.",
                        "stellar.tranche2Testnet": "1.  Deliverable 2: Integrate Trustless Work API with Stellar Anchors for on/off ramps, implement basic user interface for escrow creation.\n    \n\n-   How to Measure Completion: Successful test transactions on Stellar testnet, user feedback, and functional integration with Anchors.\n    \n-   Estimated Date of Completion: March 2025.\n    \n-   Budget: Non-monetary (Access to Stellar LaunchKit)",
                        "stellar.tranche3Mainnet": "Deliverable 3: Launch Trustless Work platform on Stellar mainnet, including USDC support and on/off ramps integrations.\n\n-   How to Measure Completion: Public deployment on Stellar mainnet with functioning API and smart contracts, open-source availability.\n    \n-   Estimated Date of Completion: May 2025.\n    \n-   Budget: $40,000 in XLM.",
                        "stellar.teamMembers": "Alberto Chaves, Armando Cortés Murillo, Joel Vargas, Caleb",
                        "stellar.urls": {
                            "website": "https://www.trustlesswork.com",
                            "codeRepository": "https://github.com/Tico4Chain-Coders",
                            "videoURL": "https://www.loom.com/share/732c57eb500c45c5b5d63d603c7bbc7f?sid=6023bde3-c8f7-40a1-ba2e-2d6a0ba90dc9"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/trustlesswork"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 46666.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 125434.77,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:11",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recxtseGT8HXT3ZDC",
                    "projectId": "daoip5:stellar:project:streamingfast-core-dev-team-at-the-graph",
                    "projectName": "StreamingFast (core dev team at The Graph)",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recxtseGT8HXT3ZDC",
                    "status": "Awarded",
                    "description": "StreamingFast will develop its Firehose and Substreams technologies to bring Stellar and its community the advanced data indexing capabilities of The Graph. These technologies include Substreams-powered-Subgraphs backed by a network of hundreds of indexers and Substreams which adds a powerful, blockchain-agnostic engine that is parallelized and streaming-first.",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1Afn8wlGQFmnaZQJ-7ov_JnReat9iTWV5JFvu3GMlc0g/edit?usp=sharing",
                        "stellar.productsAndServices": "Here are the features Stellar would benefit from:  ● \\*\\*Simple DevEx\\*\\*. New Codegen tools and GUI enable a quick and easy development of a Substreams and subgraph, either locally or through a remote VS Code space with all dependencies pre-installed (see this link to try it out:                 \\[https://github.com/streamingfast/substreams-starter\\](https://github.com/streamingfast/substreams-starter)). ● \\*\\*High performance.\\*\\* With the Substreams engine backing \\`graph-node\\`, Stellar’s community will have access to Subgraphs that sync in orders of magnitude faster. ● \\*\\*Ready-to-use Subgraphs.\\*\\* Developers will gain immediate access to Substreams-powered subgraphs as StreamingFast will launch the first Substreams-powered subgraph on The Graph network. ● \\*\\*Foundational Substreams Modules.\\*\\* Gain access to several foundational modules developed by StreamingFast, these modules offer critical access points to raw Stellar data, enabling developers to quickly bootstrap their projects across key areas of the Stellar ecosystem. ● \\*\\*Comprehensive Documentation and Guides.\\*\\* Detailed documentation and step-by-step guides enable developers to start fast and avoid unnecessary pitfalls.",
                        "stellar.successCriteria": "Success for Stellar (immediate): Make Stellar data easier than ever to be indexed and expand access to the largest community of web3 developers. Success for Stellar (long-term): To enable long-term indexing and querying via multiple Indexers, indexing rewards must be activated. The Graph Foundation will assess and then guide Stellar’s proposal through the steps to activate indexing rewards on a new chain. Success for The Graph/StreamingFast: Number of bytes processed by the Substreams engine or Subgraph queries made on The Graph network.",
                        "stellar.tractionEvidence": "Lifetime subgraphs/APIs: 90K+ Lifetime developers: 53K+ Lifetime queries: 1.1 trillion+ Over 7K dapps have consumed data through The Graph The Graph ecosystem serves 900M+ queries per day right now in the depths of this market activity, but has served 1.5B-2B in recent times across 44K+ APIs Tens of thousands of developers use The Graph across 40+ networks for applications such as Uniswap, Synthetix, KnownOrigin, Art Blocks, Gnosis, Balancer, Livepeer, DAOstack, Audius, Decentraland, and many others On the network, there are 450+ Indexers serving subgraph queries, 11,300+ Delegators, and 2,500+ Curators\n\nWhile the traction information shared above referred to all the data compiled since the beginning of The Graph with the bulk of it happening on the Hosted Service, in 2024 the Graph migrated all Hosted Service activity towards its on-chain decentralized service. This is the publicly available information for now:\n- The list of 70+ supported networks: https://thegraph.com/networks/\n- The list of ~10K subgraphs deployed on The Graph network: https://thegraph.com/explorer?chain=arbitrum-one\n- The list of indexer and queries currently on the Graph: https://thegraph.com/explorer/network?chain=arbitrum-one",
                        "stellar.goToMarketPlan": "StreamingFast  and Stellar will jointly plan a co-marketing campaign amplified across The Graph’s channels. Additionally, resources will be allocated as follows: StreamingFast to send a representative to host a The Graph <> Stellar technical workshop, with such workshop being mutually agreed upon by both parties in advance, and conducted either in person or online; To monitor Stellar ecosystem channels for feedback and questions; To onboard ecosystem partners interested in leveraging The Graph’s stack.",
                        "stellar.tranche1Deliverables": "Weeks 1 to 2:\n\nTest the archive node to identify any unique behaviors with the API. \n\nDeliverable: \n\n- Complete the integration of the RPC-Poller.\n- Compare the outputted Firehose blocks to the Stellar RPC. \n\nSuccess Metrics: The Firehose is successfully producing accurate Stellar full blocks.\n\nWeeks 2 to 4: \n\nDeliverable: \n\n- Complete the decoding of byte streams into high-order Protobuf models.\n- Sync blocks from genesis so that history is reprocessed up to the chain head (Note: at this point we’ll be temporarily hitting your nodes more heavily to create the flat files).\n- Development of Foundational Substreams Modules for Stellar, to enable native subgraph developer experience.\n\nSuccess Metric: We usually do one or two quality assurance passes during that time.",
                        "stellar.tranche2Testnet": "Week 5-8: \nDeliverable: \n- Rolling out the public production endpoints (Mainnet and Testnet).\n- Pre-processing of the Substreams foundational modules.\n- Integration of Stellar into official documentation on The Graph and StreamingFast docs.\n- Integration of Stellar into the DevContainer to enable codegen tooling.\nSuccess Metric: Q.A. rounds are passed and the endpoints are live.",
                        "stellar.tranche3Mainnet": "Weeks 8 to 52:\n\nDeliverable: \n\n- Launch and maintenance of: the Substreams endpoint, the foundational modules, the Substreams-powered subgraph, and the codegen tooling. \n- StreamingFast to host public production endpoints for Stellar. This includes a sponsored free tier.\n- Community management and developer relations are allocated to the Stellar community.\n- Gather feedback to define essential data for the first Substreams-powered subgraph on The Graph network and on the Stellar codegen tool flow.\n\nStreamingFast to do on-going maintenance for the Firehose replication protocol into the chain's codebase. StreamingFast tracks any changes and releases binaries when you change code and when StreamingFast changes code. This includes releasing Firehose/Substreams binaries for the protocol, maintaining Substreams modules for the block model of the chain, and releasing binaries for the blockchain node with instrumentation if need be.\nMeasure of success: Stellar developers can successfully launch a Substreams or Substreams-powered Subgraph onto The Graph in under 10 minutes. \nBudget (Integration & Maintenance): US 100,000 - can be paid quarterly over the course of the 52 weeks\nBudget (Hosting): US 50,000 - can be paid quarterly over the course of the 52 weeks",
                        "stellar.teamMembers": "Mathieu Bouliann",
                        "stellar.urls": {
                            "website": "https://thegraph.com/docs/en/new-chain-integration/",
                            "codeRepository": "https://github.com/streamingfast/substreams",
                            "videoURL": "https://www.youtube.com/watch?v=K-nhC2FCB5k&t=1s"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/graphprotocol"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 150000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 497394.31,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:12",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recNQZK29Ly63kIP2",
                    "projectId": "daoip5:stellar:project:mercuryo",
                    "projectName": "Mercuryo",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recNQZK29Ly63kIP2",
                    "status": "Awarded",
                    "description": "Mercuryo aims to launch a branded crypto debit card in collaboration with Mastercard. We aim to connect this card to USDC and XLM, enabling users to spend their crypto balance globally.",
                    "fundsApprovedInUSD": 50000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://spend-api.redoc.ly/",
                        "stellar.productsAndServices": "We will launch the first crypto debit card, fully api based, fully LOBSTR branded. This card will be seamlessly integrated into the wallets UX, user can top it up with USDC and XLM.\n\nOnce Mercuryo deployed the infrastructure, a separate card terminal with Mastercard for Stellar, any project will be able to launch their own custom card program for users*\n\nMercuryo to date has the best product on the market, one of the few that gives wallets a neo bank like look an feel for their debit card program.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "No of cards issued:\n\n5.000 issued cards within 1 year of launch.",
                        "stellar.tractionEvidence": "Mercuryo to date has over 7m KYC'd users and processes billions in payment volume annually.\n\nThe partnership with mastercard has been made official recently - https://cointelegraph.com/news/mastercard-non-custodial-crypto-spending-card\n\nUsers can already issue a crypto debit card via our website (mercuryo branded).",
                        "stellar.goToMarketPlan": "Step 1: Soft launch\n\n-> Lobstr invites its team, family and friends to open a card, add it to apple pay and use it for 2 weeks.\n\n-> Announcement of mastercard partnership + marketing for early bid sign up.\n\nStep 2 Go Live:\n\n-> Go live for all users in EU and UK.\n\n-> Marketing campaign, Mercuryo and Stellar to convert users to create debit card.  \n(incl. x space, blog, paid marketing campaign, 0 fee campaign from mercuryo side to attract more users, user aquisition campaign with for example ethermail)",
                        "stellar.tranche1Deliverables": "1.  [Deliverable 1]\n    \n    -   Brief description\n        \n        -   Set up of card terminal with mastercard, approval of branding.\n            \n        -   Set up of top ups channels for XLM and USDC on stellar.\n            \n        -   Connectivity of debit cards to apple and google pay.\n            \n    -   How to measure completion\n        \n        -   test card available for Lobstr team to test.\n            \n        -   Contract officially signed between wallet partner, Mastercard and Mercuryo\n            \n    -   Estimated date of completion\n        \n        -   5 weeks\n            \n    -   Budget\n        \n        -   30.000 USD",
                        "stellar.tranche2Testnet": "1.  [Deliverable 2]\n    \n    -   Brief description\n        \n        -   Integration of card API on Wallet side, custzomization to design and UX.\n            \n    -   How to measure completion\n        \n        -   Fully embedded flow, card can be issued in beta directly through app.\n            \n    -   Estimated date of completion\n        \n        -   3 weeks\n            \n    -   Budget\n        \n        -   15.000 USD",
                        "stellar.tranche3Mainnet": "1.  [Deliverable 3]\n    \n    -   Brief description\n        \n        -   Go live and launch\n            \n        -   Marketing campaign incl 0 fee campaign - cheapest off ramp in crypto*\n            \n    -   How to measure completion\n        \n        -   Enable card creation for users in EU and UK, any user can test and verify.\n            \n    -   Estimated date of completion\n        \n        -   2 weeks\n            \n    -   Budget\n        \n        -   5.000 USD",
                        "stellar.teamMembers": "Pascal, Pascal",
                        "stellar.urls": {
                            "website": "https://communityfund.stellar.org/dashboard/projects/recFWwOP3o3W6rQBf",
                            "videoURL": "https://www.loom.com/share/b7c10dbac17b4dd2805f9c64075936b9?sid=88afbb40-0c3c-4ee9-aae7-18dc6b5d63c8"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/mercuryo-io/mycompany/"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 156811.32,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:13",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recqvm203drzGVJ0t",
                    "projectId": "daoip5:stellar:project:soroban-resource-usage-reporter",
                    "projectName": "Soroban Resource Usage Reporter",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recqvm203drzGVJ0t",
                    "status": "Awarded",
                    "description": "In the coding and testing phases, this tool enables developers to efficiently track resource usage through key metrics within the Soroban ecosystem.",
                    "fundsApprovedInUSD": 18240.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1gAGDgGSSGEKMWUDlbCoPF0owVu3Cwl38YKdcqKB_eTc/edit#heading=h.1fob9te",
                        "stellar.productsAndServices": "This tool helps developers optimize smart contract code by tracking function call frequency, displaying cost per execution with notable variations, calculating average resource consumption for benchmarking, and offering optimization suggestions to reduce resource usage and improve contract efficiency.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "1. User Adoption: A significant percentage of developers actively using the tool during their development processes.\n\n2. Feedback and Satisfaction: Positive user feedback and high satisfaction ratings regarding usability and effectiveness in monitoring resource consumption.\n\n3. Continuous Improvement: Regular updates and enhancements based on user feedback and changing development needs.",
                        "stellar.tractionEvidence": "Background\n\nSoroban Resource Usage Reporter is designed to meet the specific needs of developers working within the Soroban ecosystem. In the coding and testing phases, this tool enables developers to efficiently track resource usage through key metrics, much like Hardhat Gas Reporter helps Ethereum developers streamline contract efficiency. By offering insights into these metrics, developers are empowered to write more efficient and cost-effective smart contracts from the very start.\n\nFor Stellar, this tool can help drive adoption and best practices within the ecosystem. By providing developers with early-stage resource usage tracking and optimization suggestions, Stellar can foster a community that is conscious of resource efficiency, which is crucial for maintaining scalability and cost-effectiveness across the network.\n\nAdditionally, as developers refine their contracts with the help of our Resource Usage Reporter, this can lead to better overall performance and lower transaction costs on the Stellar chain, contributing to Stellar’s long-term success.\n\nGoal\n\nWe propose to develop a Node.js-based Resource Usage Reporter tool specifically for Stellar, designed to offer developers detailed insights into resource consumption metrics during their coding and testing cycles. The primary aim is to enable developers to track key data points, such as execution frequency and resource fee, and receive basic suggestions for improving efficiency.\n\nLooking ahead, while our current focus is on optimizing development workflows through essential resource tracking, we aim to expand the tool’s functionality to further support the Soroban ecosystem as it grows. This will reinforce Stellar’s commitment to developer support and network sustainability, with an emphasis on enhancing workflows and contributing to the chain’s long term performance and scalability.\n\nConsidering resource limitations, the resource usage reporter will assist developers in optimizing their smart contract code by highlighting cost variations in contract function calls under constrained resources, as well as displaying function call runtimes. The insights provided in the generated table will guide developers in reducing resource consumption, managing fee limitations, and improving the speed of contract function execution.\n\nhttps://docs.google.com/document/d/1gAGDgGSSGEKMWUDlbCoPF0owVu3Cwl38YKdcqKB_eTc/edit",
                        "stellar.goToMarketPlan": "Looking ahead, while our current focus is on optimizing development workflows through essential resource tracking, we aim to expand the tool’s functionality to further support the Soroban ecosystem as it grows. This will reinforce Stellar’s commitment to developer support and network sustainability, with an emphasis on enhancing workflows and contributing to the chain’s long term performance and scalability.",
                        "stellar.tranche1Deliverables": "1.Resource Usage Reporter library github repository\n\nWe need to develop the resource usage reporter, including encapsulation of objects and functions, clean code, and a well-designed way to use it.\n\n-   Resource usage reporter library implementation\n    \n-   Resource usage reporter library documentation\n    \n-   Unit test & 100% test coverage\n    \n\n2.Npm package\n\nOnce it was complete, we needed to release the resource usage reporter to npm in order to make it available to a wide audience of developers.\n\n3.Resource usage reporter demo github repository\n\nTo help guide developers in using the resource usage reporter, we will provide a simple but comprehensive demo code to get started. We will based on soroswap to build in our resource usage reporter then display the result of it.\n\n-   Resource usage reporter demo implementation\n    \n-   Resource usage reporter demo documentation\n    \n-   The user portal for the resource usage reporter demo\n    \n\n4.UAT support\n\nFix the relevant bugs from the UAT period.",
                        "stellar.tranche2Testnet": "As Soroban Resource Usage Reporter is an auxiliary development tool, it can be applied to Local Network, Testnet, and Mainnet directly.",
                        "stellar.tranche3Mainnet": "As Soroban Resource Usage Reporter is an auxiliary development tool, it can be applied to Local Network, Testnet, and Mainnet directly.",
                        "stellar.teamMembers": "leo.meng",
                        "stellar.urls": {
                            "website": "https://docs.google.com/document/d/1gAGDgGSSGEKMWUDlbCoPF0owVu3Cwl38YKdcqKB_eTc/edit",
                            "codeRepository": "https://github.com/57blocks/stellar-resource-usage-report/",
                            "videoURL": "https://www.loom.com/share/2a3e0656ac854ae0898a20770b3cf21f?sid=2bb8261d-031e-40b0-9c3c-14c217360d84"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 18240.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 56684.4,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-13T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:14",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/reczkZYQwOf7sZnJG",
                    "projectId": "daoip5:stellar:project:stellar-razor-and-blazor-suite",
                    "projectName": "Stellar Razor and Blazor Suite",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reczkZYQwOf7sZnJG",
                    "status": "Awarded",
                    "description": "Open-Source Razor components for seamless SDEX integration in .NET apps, for Visual Studio and Visual Studio Code.",
                    "fundsApprovedInUSD": 60000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://github.com/lockb0x-llc/SDEX-Razor-Components/wiki/Technical-Architecture",
                        "stellar.productsAndServices": "The SDEX Razor Tools project rounds out the existing features and user-interface components provided by the Stellar Razor Tools and the Stellar Identity Platform by adding full trading capabilities, robust portfolio management, and optional secure integration with identity management.\n\nThis combination allows developers to build complete Stellar applications, from basic account management to secure trading and DeFi interactions, all within a unified .NET environment.\n\nSDEX Razor Tools - Product List with Stellar Usage\n\n1. Real-time Order Book Component\n\n- Feature: Displays live buy/sell orders for specific asset pairs on the SDEX with real-time updates.\n\n- Stellar Usage: Uses the Stellar Horizon API to fetch live order book data from the SDEX.\n\n2. Open Orders Component\n\n- Feature: Shows active buy/sell orders for the user’s account, with options to modify or cancel orders.\n\n- Stellar Usage: Interacts with Horizon’s offer management endpoints to manage open offers on the SDEX.\n\n3. Submit Buy/Sell Offer Component\n\n- Feature: Enables users to submit new buy/sell offers on the SDEX.\n\n- Stellar Usage: Leverages Stellar transactions to create and submit offers through Horizon.\n\n4. Completed Orders Component\n\n- Feature: Displays completed buy/sell orders with filtering options.\n\n- Stellar Usage: Retrieves user transaction history from the Horizon API, focusing on completed trades.\n\n5. Portfolio Tracker Component\n\n- Feature: Tracks account balances, asset values, and historical performance.\n\n- Stellar Usage: Fetches account balances and asset values using the Horizon Account API.\n\n6. Market Depth & Order Book Visualization\n\n- Feature: Offers a visual representation of market depth, showing liquidity levels for asset pairs.\n\n- Stellar Usage: Uses data from the order book API to visualize liquidity depth and trading walls.\n\n7. Transaction History Component\n\n- Feature: Displays transaction history with filtering, sorting, and detailed views.\n\n- Stellar Usage: Pulls transaction data from the Horizon transactions endpoint, showing all account operations.\n\n8. Fee Calculator Component\n\n- Feature: Estimates transaction fees for various operations.\n\n- Stellar Usage: Uses Stellar network fee data to estimate the cost of transactions based on network congestion.\n\n9. Multi-Account & Multi-Signature Manager\n\n- Feature: Manages multiple Stellar accounts and configures multi-signature settings.\n\n- Stellar Usage: Uses Stellar’s multisig operations to manage additional signers and set thresholds.\n\n10. Trading Pairs Component\n\n- Feature: Lists available trading pairs on the SDEX, helping users discover tradable markets.\n\n- Stellar Usage: Uses Stellar’s order book API to identify and list active trading pairs.\n\n11. Optional Soroban Integration (Advanced)\n\n- Feature: Allows interaction with Soroban smart contracts, enabling complex DeFi operations.\n\n- Stellar Usage: Uses the Soroban SDK to deploy and manage smart contracts, enabling automated strategies.\n\n12. NuGet Package Distribution\n\n- Feature: Packages all components into a single, installable library.\n\n- Stellar Usage: Makes it easy for developers to integrate Stellar features into .NET applications.",
                        "stellar.successCriteria": "Community adoption of the tools by developers to integrate Stellar blockchain operations into their applications.",
                        "stellar.tractionEvidence": "The previously released Razor Component Library receives steady traffic and cloning of its Github Repository and NuGet package.\n\nHere is the current NuGet Trends chart for that library, which was released on April 20, 2024 NuGet Trends\n\nWe released the Microsoft Identity Platform for Stellar on 10/20/2024 and are in the process of promoting the release and collecting adoption data.",
                        "stellar.goToMarketPlan": "Go-To-Market Plan for SDEX Razor Tools\n\n1. Market Overview\n\n- The SDEX Razor Tools are designed for .NET developers to integrate Stellar Decentralized Exchange (SDEX) features into their applications.\n\n- The toolkit will enable the creation of trading and portfolio management apps on Stellar, leveraging reusable Razor components that are familiar to .NET developers.\n\n2. Target Audience\n\n- .NET Developers: Primary users who build financial, trading, and portfolio management applications.\n\n- Stellar Developers: Developers already working within the Stellar ecosystem who want to add trading features to their apps.\n\n- FinTech Startups: FinTech companies interested in exploring Stellar as a blockchain network for trading applications.\n\n- DeFi Builders: DeFi developers looking to integrate Soroban smart contracts alongside SDEX functionality.\n\n3. Key Value Propositions\n\n- Easy .NET Integration: Simplifies Stellar trading integration using familiar Razor components.\n\n- Complete Trading Suite: Covers the entire trading workflow, from submitting offers to managing portfolios.\n\n- Security & DeFi-Ready: Optimized for secure integration with the Stellar DotNet Identity Framework and optional support for Soroban contracts.\n\n4. Positioning & Messaging\n\n- Positioning Statement:\n\n- \"SDEX Razor Tools: Simplifying Stellar Trading for .NET Developers – Build secure, scalable trading apps with ready-to-use Razor components.\"\n\n- Core Messaging:\n\n- For Developers: \"Quickly integrate Stellar’s SDEX into your .NET applications with plug-and-play Razor components.\"\n\n- For FinTech Startups: \"Expand your trading capabilities with secure Stellar-based solutions built for .NET.\"\n\n- For Stellar Community: \"Enhance your Stellar projects with powerful trading tools that are optimized for .NET development.\"\n\n5. Launch Strategy & Phases\n\nPhase 1: Pre-Launch Preparation (Weeks 1-8)\n\n- Goals: Generate awareness, set up initial user base, and prepare materials for launch.\n\n- Key Actions:\n\n- Beta Testing:\n\n- Launch a closed beta to selected .NET developers and Stellar developers via GitHub.\n\n- Collect feedback using GitHub Issues and Discussions.\n\n- Documentation & Tutorials:\n\n- Create complete documentation, tutorials, and a demo project that showcases how to build trading apps using SDEX Razor Tools.\n\n- Marketing Collaterals:\n\n- Develop marketing materials, including a landing page on PakanaComponents.com, blog posts, and a product video demo.\n\n- Microsoft Marketplace Preparation:\n\n- Prepare and submit the components for the Microsoft Marketplace, ensuring compliance with publishing requirements.\n\n- Primary Channels:\n\n- GitHub, PakanaComponents.com, and Microsoft Marketplace.\n\nPhase 2: Initial Launch & TestNet Campaign (Weeks 9-16)\n\n- Goals: Increase awareness, collect user feedback, and drive TestNet adoption.\n\n- Key Actions:\n\n- Public GitHub Release:\n\n- Release the open-source GitHub repository for SDEX Razor Tools, making it available for public testing and feedback.\n\n- Microsoft Marketplace Launch:\n\n- Launch the NuGet package and Razor components on the Microsoft Marketplace for .NET developers.\n\n- Content Marketing:\n\n- Publish tutorials, blogs, and case studies on PakanaComponents.com, showing how to use the tools in real-world scenarios.\n\n- Developer Outreach:\n\n- Focus outreach efforts on .NET developer communities, including forums like Reddit (.NET), Stack Overflow, and .NET-specific blogs.\n\n- Organize a webinar or virtual event to introduce the toolkit and guide developers through its integration.\n\n- Primary Channels:\n\n- GitHub, PakanaComponents.com, Microsoft Marketplace, Reddit (.NET), Stack Overflow, and .NET Blogs.\n\nPhase 3: MainNet Launch & Growth (Weeks 17-22)\n\n- Goals: Successfully launch the toolkit on MainNet, increase adoption, and demonstrate real-world use cases.\n\n- Key Actions:\n\n- MainNet Announcement:\n\n- Announce the MainNet launch on PakanaComponents.com, GitHub, and .NET development forums.\n\n- Showcase Integrations:\n\n- Collaborate with early adopters to create case studies or success stories that can be published on PakanaComponents.com and featured on the GitHub repo.\n\n- Continued Content Marketing:\n\n- Publish success stories, advanced use cases, and tips for optimizing the toolkit for DeFi or secure trading applications.\n\n- Microsoft Marketplace Promotion:\n\n- Promote the NuGet package through the Microsoft Marketplace, and feature it in .NET development newsletters and communities.\n\n- Primary Channels:\n\n- GitHub, PakanaComponents.com, Microsoft Marketplace, and .NET developer newsletters.\n\n6. Marketing Channels & Tactics\n\n- GitHub (Primary Channel):\n\n- Use GitHub Discussions, Issues, and Releases to communicate updates, collect feedback, and support users.\n\n- PakanaComponents.com:\n\n- Serve as the landing page, offering tutorials, documentation, blog posts, and case studies to support developers.\n\n- Microsoft Marketplace:\n\n- Highlight the components as part of the Microsoft ecosystem, reaching .NET developers directly where they search for tools and components.\n\n- .NET Developer Forums & Blogs:\n\n- Engage with Reddit (.NET), Stack Overflow discussions, and popular .NET developer blogs to increase awareness.\n\n- Email Newsletters:\n\n- Utilize .NET-specific newsletters and community mailing lists to reach target users.\n\n7. Success Metrics & KPIs (Adjusted)\n\n- MVP Phase:\n\n- 10 downloads of the NuGet package.\n\n- 2 developers actively using the components in TestNet.\n\n- 5 GitHub stars and at least 5 issues/suggestions logged.\n\n- TestNet Phase:\n\n- 20 downloads of the NuGet package.\n\n- 5 developers using the components, with positive feedback.\n\n- 1 partnership integration with a FinTech or Stellar-based project.\n\n- MainNet Phase:\n\n- 50 downloads of the NuGet package.\n\n- 5 developers using the components on MainNet.\n\n- 2 successful case studies or integrations showing real-world use of the SDEX Razor Tools.\n\n8. Budget Allocation for GTM Activities\n\n- Pre-Launch Preparation: $2,500\n\n- Documentation, tutorials, and initial marketing materials.\n\n- TestNet Campaign: $4,000\n\n- Webinar costs, promotional materials, and community outreach.\n\n- MainNet Launch & Growth: $6,000\n\n- Case studies, marketplace promotion, and continued content marketing.\n\n-   Travel $5,000\n    \n    -   Promotional materials and incidentals\n        \n    -   Airfare, travel, and tickets to one conference for two people.\n        \n\n9. Post-Launch Strategy\n\n- Ongoing Support:\n\n- Use GitHub Issues as the primary support channel, with continuous documentation updates on PakanaComponents.com.\n\n- Iterative Development:\n\n- Collect and prioritize user feedback via GitHub, focusing on adding new features and improving integration.\n\n- Developer Evangelism:\n\n- Engage in .NET conferences, meetups, and relevant online communities to promote use cases and drive adoption.",
                        "stellar.tranche1Deliverables": "'-   Real-time Order Book Component\n    \n    -   Description: Displays live buy/sell orders for specific asset pairs with real-time updates.\n        \n    -   How to Measure Completion: Correct fetching and display of real-time order book data from the SDEX using the Stellar Horizon API.\n        \n    -   Estimated Date of Completion: Week 4\n        \n    -   Budget: $4,000\n        \n-   Open Orders Component\n    \n    -   Description: Shows active buy/sell orders, with options to modify or cancel orders.\n        \n    -   How to Measure Completion: Successful display and management of user-specific open orders.\n        \n    -   Estimated Date of Completion: Week 5\n        \n    -   Budget: $4,000\n        \n-   Submit Buy/Sell Offer Component\n    \n    -   Description: Allows users to submit buy or sell offers on the SDEX.\n        \n    -   How to Measure Completion: Successful transaction creation and offer submission to the SDEX.\n        \n    -   Estimated Date of Completion: Week 6\n        \n    -   Budget: $4,000\n        \n-   Portfolio Tracker Component\n    \n    -   Description: Tracks account balances and asset values, displaying a user’s overall portfolio.\n        \n    -   How to Measure Completion: Accurate display of asset balances and values based on user accounts.\n        \n    -   Estimated Date of Completion: Week 7\n        \n    -   Budget: $4,000\n        \n-   Transaction History Component\n    \n    -   Description: Displays user transaction history with filtering and sorting capabilities.\n        \n    -   How to Measure Completion: Successful display of user transactions from the Stellar TestNet.\n        \n    -   Estimated Date of Completion: Week 8\n        \n    -   Budget: $4,000\n        \n-   Market Depth & Order Book Visualization\n    \n    -   Description: Adds a depth chart visualization to the order book component, showing market liquidity.\n        \n    -   How to Measure Completion: Accurate visualization of market depth using real-time TestNet data.\n        \n    -   Estimated Date of Completion: Week 9\n        \n    -   Budget: $4,000\n        \n-   Fee Calculator Component\n    \n    -   Description: Estimates transaction fees for various operations.\n        \n    -   How to Measure Completion: Correct fee estimation based on current network fees on the TestNet.\n        \n    -   Estimated Date of Completion: Week 10\n        \n    -   Budget: $4,000\n        \n-   Multi-Account & Multi-Signature Manager\n    \n    -   Description: Manages multiple accounts and configures multi-signature settings (may be implemented as update to the Stellar Component Toolkit).\n        \n    -   How to Measure Completion: Successful multi-account management and multisig configuration on the TestNet.\n        \n    -   Estimated Date of Completion: Week 11\n        \n    -   Budget: $4,000\n        \n-   NuGet Package Distribution\n    \n    -   Description: Package all components into a single NuGet library for easy installation.\n        \n    -   How to Measure Completion: Successful publication to NuGet.org with installation instructions.\n        \n    -   Estimated Date of Completion: Week 12\n        \n    -   Budget: $4,000\n        \n\nTotal Budget for tranche: $36,000",
                        "stellar.tranche2Testnet": "Security & Integration Testing\n\n-   Description: Conduct thorough security audits and integration tests across all components.\n    \n-   How to Measure Completion: Pass security and integration tests, ensuring components are secure and ready for MainNet.\n    \n-   Estimated Date of Completion: Week 16\n    \n-   Budget: Use of Stellar LaunchKit credits for third-party audits",
                        "stellar.tranche3Mainnet": "'-   Real-time Order Book Component (MainNet)\n    \n    -   Description: Deploy and optimize the real-time order book component for MainNet usage.\n        \n    -   How to Measure Completion: Live, accurate, and consistent order book display on MainNet.\n        \n    -   Estimated Date of Completion: Week 17\n        \n    -   Budget: $2,000\n        \n-   Open Orders & Submit Offer Components (MainNet)\n    \n    -   Description: Ensure both components operate seamlessly on the MainNet.\n        \n    -   How to Measure Completion: Successful modification, cancellation, and submission of offers on MainNet.\n        \n    -   Estimated Date of Completion: Week 18\n        \n    -   Budget: $2,000\n        \n-   Portfolio Tracker & Transaction History (MainNet)\n    \n    -   Description: Finalize integration with MainNet to track balances and display transaction history.\n        \n    -   How to Measure Completion: Accurate balance display and transaction history retrieval on MainNet.\n        \n    -   Estimated Date of Completion: Week 19\n        \n    -   Budget: $2,000\n        \n-   Integration with Stellar DotNet Identity Framework\n    \n    -   Description: Optimize components for seamless integration with the Identity Framework, ensuring secure transaction handling.\n        \n    -   How to Measure Completion: Components support secure transaction signing and user management on MainNet.\n        \n    -   Estimated Date of Completion: Week 20\n        \n    -   Budget: $4,000\n        \n-   Tutorial and Reference Project\n    \n    -   Description: Sample Razor application demonstrating how to use the components to perform real-world operations on-chain in a Visual Studio project with walk-through video.\n        \n    -   How to Measure Completion: Publication of working source code on GitHub for a Visual Studio project that demonstrates how to get started with the toolkit and use it on Mainnet to retrieve the order book, submit, modify, and cancel an offer using a Stellar account.\n        \n    -   Estimated Date of Completion: Week 22\n        \n    -   Budget: $6,000\n        \n-   Final Testing, Documentation & Launch\n    \n    -   Description: Perform final MainNet testing, complete documentation, and launch the full NuGet package.\n        \n    -   How to Measure Completion: Successful MainNet deployment, complete user-ready documentation, and public launch announcement.\n        \n    -   Estimated Date of Completion: Week 23\n        \n    -   Budget: $8,000\n        \n\nTotal Budget for tranche: $24,000",
                        "stellar.teamMembers": "Steven Bret Tomlinson, Joshua Kassabian",
                        "stellar.urls": {
                            "website": "https://github.com/lockb0x-llc/SDEX-Razor-Components",
                            "codeRepository": "https://github.com/lockb0x-llc/SDEX-Razor-Components",
                            "videoURL": "https://www.youtube.com/@PakanaSoftware"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 60000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 167937.66,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-27T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:15",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recSO1s068FUtkTaJ",
                    "projectId": "daoip5:stellar:project:k3-labs",
                    "projectName": "K3 Labs",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recSO1s068FUtkTaJ",
                    "status": "Awarded",
                    "description": "Develop automated workflows for seamless integration with Stellar, enabling users to create triggers, read data, and execute transactions without deep blockchain expertise",
                    "fundsApprovedInUSD": 75000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1o-kcPQd5KucHIDcBDTaqos4qz2soXRleIzMHdoBGBvU/edit?usp=sharing",
                        "stellar.productsAndServices": "With the SCF Build Award, K3 Labs will develop automated workflows specifically designed for Stellar’s blockchain, enabling use cases such as automated token transfers, cross-border payments, and DeFi lending/borrowing. Each workflow can include triggers based on Stellar smart contract events and direct integrations with Soroban smart contracts to execute transactions seamlessly.\n\nFeatures to Develop:\n- Trigger Functionality: Enable workflows to start based on Stellar blockchain events.\n- Read Stellar Data: Access data from Stellar accounts, smart contracts, and on-chain transactions.\n- Write Operations: Develop the ability to execute transactions directly from workflows, such as sending tokens or interacting with Soroban smart contracts.\n\nHow Stellar Is Used: Stellar will be used for handling payment-related operations, interacting with Soroban smart contracts for DeFi workflows, and reading blockchain data to enhance the automation capabilities.\n\nImpact: This integration will allow K3 Labs users to leverage Stellar’s fast transaction times and low fees to automate business processes and financial operations, thereby increasing efficiency and accessibility.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success Metrics:\n- Number of Users: Onboard 1,000 active users within the first 3 months post-launch.\n- Automated Workflows: Deploy 500+ unique workflows running on Stellar’s blockchain.\n- Community Growth: Grow our community to over 10,000 members across different platforms.\n\nImpact:\n- Expanded Financial Access: Simplify access to decentralized finance tools by enabling automated workflows, reducing the barrier to entry for non-technical users.\n- Increased Adoption of Stellar: Increase adoption of Stellar blockchain by making it easy for developers and enterprises to integrate Stellar functionalities into their operations without deep technical expertise.",
                        "stellar.tractionEvidence": "Evidence of Prior Traction:\n - Node operators delegated amount: Over 2B USD has been restaked on EigenLayer, showcasing strong dedication and support for K3 Labs\n - Operator Network: We have established a robust network of 22 operators and are featured on the EigenLayer AVS (Active Validator Set) page, highlighting our operational presence and credibility\n - Beta Users: Over 300 beta testers have participated in testing the platform, providing valuable feedback on workflow automation. \n - On-Chain Transactions: Users have executed workflows resulting in multiple on-chain transactions on testnets and mainnets, demonstrating successful use of the platform. \n - Community Engagement: Over 500 members in our Telegram community, actively participating in discussions and beta tests.",
                        "stellar.goToMarketPlan": "Go-to-Market Strategy:\n- Community Engagement: Continue building and engaging with the community on social platforms such as Telegram, Twitter, and Discord.\n- Partnerships: Establish strategic partnerships with existing DeFi platforms, NFT projects, and blockchain technology providers to increase adoption. Integrations of these platforms will allow for organic marketing efforts and access to larger user bases of already established projects.\n- Public Launch: Execute a phased launch, starting with early users from the beta program, followed by a broader public launch with promotional campaigns.\n- Enterprise Engagement: We are already gaining traction and will continue to engage with large enterprises from both Web2 and Web3 directly, encouraging them to use our platform at scale",
                        "stellar.tranche1Deliverables": "Milestone 1: Minimum Viable Product (MVP)\n\n - Brief Description: Develop an initial version of the K3 Labs workflow automation platform with Stellar integration, enabling users to create basic workflows that interact with Stellar blockchain functionalities, such as reading data and executing simple transactions.\n - How to Measure Completion: Deployment of the MVP with basic workflow automation capabilities, including reading data on Stellar, accessible to a group of beta testers.\n - Estimated Date of Completion: Month 1\n - Budget: $35,000",
                        "stellar.tranche2Testnet": "Milestone 2: Beta Launch and GTM\n\n - Brief Description: Deploy the MVP onto Stellar Testnet, adding more complex workflow capabilities such as interaction with Soroban smart contracts, and introduce the ability to test cross-chain integrations. GTM activities will include the creation and distribution of multiple Stellar-specific templates supporting event triggers, bridging, and automated XLM trading - and demo videos and blog posts to support each. The grant will also support a targeted marketing campaign to the Stellar community including the creation of unique content, paid advertising, and active participation in Meridian 2025.\n\n - How to Measure Completion: \n   - Successful deployment on Stellar Testnet, with the ability for users to execute complex workflows and interact with Soroban smart contracts\n   - 100+ Stellar specific users.\n   - Enough feedback from the initial user set to identify the most popular use-cases for migration to full Mainnet\n - Estimated Date of Dev Completion: Month 2\n - GTM Activities (on-going)\n - Budget: $40,000",
                        "stellar.tranche3Mainnet": "-",
                        "stellar.teamMembers": "William, Alex Hrankin",
                        "stellar.urls": {
                            "website": "https://www.k3-labs.com/",
                            "codeRepository": "https://github.com/k3-labs",
                            "videoURL": "https://www.youtube.com/watch?v=PyP-oJdJpy0",
                            "pitchDeck": "https://drive.google.com/file/d/14s3wYOfk8juTWJaqtSd0OPBitjrIvRyw/view"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/k3-labs",
                            "twitter": "https://x.com/k3_labs"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 75000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 224791.65,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-06-11T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:16",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec5wu2mm18ZnTHqP",
                    "projectId": "daoip5:stellar:project:swift-wallet-sdk",
                    "projectName": "Swift Wallet SDK",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec5wu2mm18ZnTHqP",
                    "status": "Awarded",
                    "description": "Implementation of the Swift Wallet SDK to offer native iOS developers the same functionality that is available in the TypeScript, Kotlin and Flutter Wallet SDKs.",
                    "fundsApprovedInUSD": 76800.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://github.com/Soneso/stellar-swift-wallet-sdk/blob/main/docs/architecture/architecture.pdf",
                        "stellar.productsAndServices": "Interoperability between payment applications such as wallets and on/off ramps such as Stellar anchors has always been one of the most important pillars for Stellar. That's why the Stellar Development Foundation (SDF) started defining standards for wallets and anchors very early on to facilitate their interoperability and to maximize the adoption.\n\nThe basic consideration here is that, from the wallet developer's point of view, it should make no difference whether they integrate with one anchor or with several different ones. The power of this interoperability standard is that you code once and ideally with very little modifications you can support multiple companies and you can provide a very competitive service in terms of your wallet offering.\n\nHowever, because these standards were defined very early on to maximize adoption, with very little information about the most important user cases, the consequence was that they had to be extended again and again over the last 10 years to reflect the wallet and anchor builder’s needs. But evolving the standard is not an easy thing, you don’t want to break anyone who is already compatible, so you need to create this backwards compatible evolution system that ends up becoming almost like a patchwork where you either grow by having a fixed set of endpoints with a lot of optional parameters or you have a bunch of endpoints that do slightly different things. It is probably impossible to get as close to a good API as if you had defined that from the go considering all the use cases and accommodated all of them. As a result, these standards have become very complex, extensive, and interconnected over time. See for example SEP-06 or SEP-24.\n\nThe standard API for interoperability between wallets and anchors was defined by SDF via so-called Stellar Ecosystem Proposals (SEPs). And the original recommendation for developers to become interoperable was to read the SEPs and implement them. However, since these are very complex, extensive and cover many edge cases, this led to many different interpretations during implementation.\n\nThat's why SDF came up with the idea of implementing so-called Wallet SDKs about two years ago. These are software libraries that implement the needed functionality and that developers can integrate into their program, so as not to keep reinventing the wheel over and over again.\n\nThe integration of a wallet SDK makes it very easy for the developer of a client application to become interoperable. They do not have to develop the communication with the anchor themselves, but only use the SDK. Furthermore, this helps to remain interoperable, because every time the standard evolves, a new version of the SDK is also released, and the developer only must update to use the new version of the library. It is a common, natural process for software developers. And, because the functionality is already implemented, developers can become interoperable much faster and at a much lower cost than if they were to implement the functionality from scratch themselves. This means that developers have more time to focus on implementing their business logic instead of constantly reinventing the wheel by having to implement Stellar details.\n\nWallet SDKs are currently offered for three different programming languages. The Stellar Development Foundation created and maintained the TypeScript and the Kotlin Wallet SDKs. And the Flutter (dart) Wallet SDK was developed and is maintained by me (Soneso). You can find their documentation on the official Stellar docs website under: Build a Wallet with the Wallet SDK.\n\nAll three SDKs offer the same functionality and the same interfaces for integration. These were defined by SDF when the TypeScript and Kotlin SDKs were implemented.\n\nThe new Swift Wallet SDK will implement all the current features of the other SDKs from the Wallet SDK family (Stellar Integration, SEP-01, SEP-10, SEP-09, SEP-12, SEP-24, SEP-06, SEP-38, SEP-30, SEP-07). As soon as new features are defined and implemented by SDF, the Swift Wallet SDK will grow with them. Like the other Wallet SDKs, the Swift Wallet SDK will be build upon the corresponding Horizon SDK, the Horizon iOS Stellar SDK, of which I am the main developer and maintainer.\n\nIf you are interested in learning more about the importance and usability of the Wallet SDKs, please check out this Meridian presentation by Alex Cordeiro (Senior Director, Engineering, SDF).",
                        "stellar.successCriteria": "The SDK makes it easy for developers of Stellar projects to create highly usable products.",
                        "stellar.tractionEvidence": "Because the Swift Wallet SDK is a new project, I can only provide evidence of prior traction or validation via the Horizon iOS Stellar SDK, on which the Swift Wallet SDK will be build upon. The open-source Horizon iOS Stellar SDK is used by many projects including the Lobstr Wallet and has more than 100 stars on GitHub. It has also won the Stellar Build Challenge #6. You can find it here on GitHub: Horizon iOS Stellar SDK",
                        "stellar.goToMarketPlan": "The SDK will be listed on the official Stellar Wallet SDK Page and on the Stellar Wallet SDK docs page. Furthermore, a new section will be created for the SDK in the official Stellar Discord Channel sdk-hub, where I will be available to developers for their questions and help them with the integration.",
                        "stellar.tranche1Deliverables": "#### Deliverable 1: Stellar Network\n\n-   Brief description: Implementation of the predefined features and API for communication with the Stellar Network. Most of them are described here: https://developers.stellar.org/docs/build/apps/wallet/stellar.\n    \n-   How to measure completion: The following features will be available: Create Account, Modify Account, Modify Assets (Trustlines), Swap Assets, Transfer (Payments), Path Pay, Manage Sell and Buy Offers, Account Merge, Fund Testnet Account, Building Advanced Transactions, Sponsoring Transactions, Fee Bump Transactions, Accessing Horizon SDK, Submit Transaction, Using XDR to Send Transaction Data. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 20. Nov 2024\n    \n-   Budget: 12.800\n    \n\n#### Deliverable 2: Stellar Authentication (SEP-10)\n\n-   Brief description: Wallets connect to anchors using a standard way of authentication via the Stellar network defined by the SEP-10 standard. This deliverable will contain all the components required for SEP-10 Authentication with Anchors. See also the official Wallet SDK docs here: https://developers.stellar.org/docs/build/apps/wallet/sep10.\n    \n-   How to measure completion: The following features will be available: Info Loader for SEP-01 (Stellar Toml) and the SEP-10 authentication process will be covered including Default Signer, Client Domain Signer, Validations, JWT tokens handling, preparation of Auth Tokens to be used for the successive SEP's to be covered. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 10. Dec 2024\n    \n-   Budget: 8.400\n    \n\n#### Deliverable 3: Hosted Deposit and Withdrawal (SEP-24)\n\n-   Brief description: The SEP-24 standard defines the standard way for anchors and wallets to interact on behalf of users. Wallets use this standard to facilitate exchanges between on-chain assets (such as stablecoins) and off-chain assets (such as fiat, or other network assets such as BTC). This deliverable will cover the SEP-24 flow. See Wallet SDK docs: https://developers.stellar.org/docs/build/apps/wallet/sep24.\n    \n-   How to measure completion: The following features will be available: Withdrawal, Deposit, Fetching Single Transactions, Transaction History, Transactions Watcher, SEP-09 KYC fields. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 5. Jan 2025\n    \n-   Budget: 10.600",
                        "stellar.tranche2Testnet": "#### Deliverable 1: Quotes (SEP-38)\n\n-   Brief description: The SEP-38 standard defines a way for anchors to provide quotes for the exchange of an off-chain asset and a different on-chain asset, and vice versa. This deliverable will cover the SEP-38 flow.\n    \n-   How to measure completion: The following features will be available: Info, Get Prices, Get Price, Post Quote, Get Quote, Asset Identification Format. See docs: https://developers.stellar.org/docs/build/apps/wallet/sep38. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 25. Jan 2025\n    \n-   Budget: 8.800\n    \n\n#### Deliverable 2: KYC API (SEP-12)\n\n-   Brief description: SEP-12 defines a standard way for stellar clients to upload KYC (or other) information to anchors and other services. Our SEP-06 implementation will use this protocol, but it can serve as a stand-alone service as well. This deliverable will cover the SEP-12 flow.\n    \n-   How to measure completion: The following features will be available: Add customer, Get Customer, Update Customer, Delete Customer, Verify Provided fields, Upload binary data. See docs: https://developers.stellar.org/docs/build/apps/wallet/sep6#providing-kyc-info. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 20. Feb 2025\n    \n-   Budget: 8.000\n    \n\n#### Deliverable 3: Programmatic Deposit and Withdrawal (SEP-06)\n\n-   Brief description: The SEP-06 standard defines a way for anchors and wallets to interact on behalf of users. Wallets use this standard to facilitate exchanges between on-chain assets (such as stablecoins) and off-chain assets (such as fiat, or other network assets such as BTC). See Wallet SDK docs here: https://developers.stellar.org/docs/build/apps/wallet/sep6.\n    \n-   How to measure completion: The following features will be available: Get Anchor Info, Deposit, Deposit-Exchange, Providing KYC Info, Withdrawal, Withdrawal-Exchange, Get Exchange Info, Fetching Transactions, Trecking Transactions. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 15. March 2025\n    \n-   Budget: 10.200\n    \n\n#### Deliverable 4: Recovery (SEP-30)\n\n-   Brief description: The SEP-30 standard defines the standard way for an individual (e.g., a user or wallet) to regain access to their Stellar account after losing its private key without providing any third party control of the account. During this flow the wallet communicates with one or more recovery signer servers to register the wallet for a later recovery if it's needed. See Wallet SDK docs here: https://developers.stellar.org/docs/build/apps/wallet/sep30.\n    \n-   How to measure completion: The following features will be available: Create Recoverable Account, Get Account Info, Recover Wallet. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 10. April 2025\n    \n-   Budget: 8.400\n    \n\n#### Deliverable 4: URI Scheme to facilitate delegated signing (SEP-07)\n\n-   Brief description: The SEP-07 standard defines a way for a non-wallet application to construct a URI scheme that represents a specific transaction for an account to sign. The SDK will provide the functionality to easily parse, construct and sign SEP-07 Stellar URIs. See Wallet SDK docs here: https://developers.stellar.org/docs/build/apps/wallet/sep7.\n    \n-   How to measure completion: The following features will be available: construct, parse and sign Tx and Pay URIs, parse and construct replacement parameter. Access to these features is made possible via an API that is predefined for all Wallet SDKs. Test cases and documentation will be available.\n    \n-   Estimated date of completion: 30. April 2025\n    \n-   Budget: 7.600",
                        "stellar.tranche3Mainnet": "#### Deliverable 1: Test, Release & Stellar Docs\n\n-   Brief description: I will test all Stellar Network related Features on MainNet, publish a release, prepare the docs and create a pull request to the Stellar Docs repo, so that the new Swift Wallet SDK can be added to list of Wallet SDKs.\n    \n-   How to measure completion: all Stellar Network related features work perfectly on mainnet, a release is published and the pull request is added.\n    \n-   Estimated date of completion: 9. May 2025\n    \n-   Budget 2.000",
                        "stellar.teamMembers": "Christian Rogobete",
                        "stellar.urls": {
                            "website": "https://github.com/Soneso/stellar-swift-wallet-sdk",
                            "codeRepository": "https://github.com/Soneso/stellar-swift-wallet-sdk",
                            "videoURL": "https://youtu.be/YjmWVLasTYk"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 76800.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 211480.15,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-01T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:17",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec7DMQ1TCxcapjR3",
                    "projectId": "daoip5:stellar:project:siborg",
                    "projectName": "SiBorg",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec7DMQ1TCxcapjR3",
                    "status": "Awarded",
                    "description": "SiBorg is developing an on-chain sponsorship protocol that tokenizes advertising spaces across websites, newsletters, and Telegram channels. This enables sponsors to invest in the future growth of publishers while creating a new asset class. SiBorg will integrate its existing system with Stellar's Soroban to leverage scalable architecture and efficient on/off-ramping solutions.",
                    "fundsApprovedInUSD": 95900.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1C4VBIqMYsLmAXk6a57r3ek1d-HDomBdS/view?usp=sharing",
                        "stellar.productsAndServices": "What SiBorg Is \nSiBorg is building a decentralized monetization protocol, transforming the visibility of media and creators into a new asset class by tokenizing advertising spaces across multiple interfaces. This allows buyers to speculate on the future growth of publishers.\n\nThe Problem\nThere are no Web3-native sponsorship solutions. Apps and publishers have to rely on off-chain (and often opaque) methods to generate revenue from sponsors. While we are seeing more decentralized tools for the creator economy (e.g., Lens, Paragraph), current approaches to generating revenue still rely on traditional business models (gifts, subsriptions, advertising), which don’t leverage tokenization opportunities. As a result, one cannot invest in the growth of a media outlet, creator, or app's visibility, they can only spend advertising budgets, stuck in a KPI-centric model.\nThe Solution\nWe are creating an on-chain sponsorship protocol that introduces a new asset class by tokenizing advertising spaces across websites, newsletters, and Telegram channels. This asset class transforms visibility into a tradable financial instrument, allowing sponsors to invest in the future growth of publishers, such as media outlets. Our solution builds trust and strengthens reputations by aligning the interests of sponsors, now seen as investors, with those of publishers. Publishers retain full control over the content displayed, preventing scammy ads from appearing. This also creates an additional revenue stream for publishers, who receive upfront payments and earn royalties from secondary market transactions. Publishers can join our marketplace to create tokenized offers for their ad spaces. Sponsors can then purchase these spaces and submit advertising proposals for publisher approval. Sponsors also benefit from a secondary market, where they can resell ad spaces or, in the future, even use them as collateral for loans.\n\nHow It Works and Its Use of Soroban\nWe’ve already launched a first version on Base (EVM). Now, we’re planning to deploy on the Stellar network using Soroban to take advantage of the scalable architecture and seamless global on and off-ramping capabilities.\n- “DSponsor” Smart Contracts (permissionless)\n    - These contracts handle the tokenization of ad spaces, turning visibility (like digital website parcels) into assets that can be traded.\n    - They also include DeFi and marketplace logic, as well as handlers for ad submission (on the sponsor side) and validation (on the publisher side). Important to note: The contracts store only data hashes, while actual files (such as logos) are stored on decentralized storage platforms like IPFS.\n- “App” Frontend \n    - The frontend allows both sponsors and publishers to interact with smart contracts, enabling features like login functionality, handling payments for tokenized ad spaces, and administration tools for managing ad campaigns.\n    - With a focus on user experience, the app is designed to operate without requiring any Web3 knowledge, ensuring ease of use with minimal transaction fees, near-instant settlements, and smooth on-ramping.\n-  “Relayer” API & SDK\n- GraphQL and REST APIs, along with SDKs in JavaScript, Python, Go, and Rust, serve information from smart contract events to the frontend.\n- This system allows any publisher (creators, dApps, media outlets) to automatically integrate validated ads into their platforms, including websites, newsletters, Telegram channels, with more platforms to come.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success and Impact\nAdoption Rate:\n- Number of Active Publishers: Track the number of applications, media outlets and content creators actively tokenizing their ad spaces on the platform. This will provide insights into marketplace traction and early adoption.\n- Growth Rate of Advertisers: Measure the monthly growth rate of new advertisers (by wallet address) buying tokenized ad spaces on the platform.\n- Marketplace Transactions: Monitor the number of ad spaces bought, sold, or resold within the secondary market to gauge user engagement and liquidity.\n\nEngagement and Reliability:\n- Smart Contract Usage: Track the number of ad submissions processed and validated via the smart contracts on Stellar, indicating the volume of real-world use.\n- API Usage: Measure how often the \"Relayer\" API & SDK (for ads integration) is called, specifically by external platforms like websites and newsletters.\n- Community Participation: Gauge participation and contributions in community channels (e.g., Discord, Twitter) and GitHub activity related to SiBorg's open-source elements.\n- Support Requests: Track support requests from publishers and advertisers to identify pain points and improve user experience.\n\nIntegration Success:\n- Ecosystem Partnerships: Measure the number of partnerships with media outlets, creators, and advertising agencies, and projects within the Stellar ecosystem. Track the total volume of ad spaces these partners contribute to the platform.\n- Diversification: Track which interfaces (website iframe, newsletter code, Telegram bot) are the most used, and those that are not performing.\n\nBusiness Metrics:\n- Revenue: Monitor revenue streams from transaction fees from ad space trades, analyze primary market (mint, when an ad offer is created) and secondary market (when sponsors resell tokens)\n- Customer Satisfaction: Conduct surveys to measure satisfaction among publishers, advertisers, and platform partners. Focus on ease of use, transaction speed, and marketplace trust.",
                        "stellar.tractionEvidence": "Partnerships: We’ve successfully integrated with Cryptoast, the largest Web3 media outlet in France. You can see our collaboration in this video showcasing the app and Cryptoast as a partner. We’re also in advanced talks with Cointribune and DeFi France. (https://www.loom.com/share/39d072c1e2314788a07115cec95507d0?sid=a8d79d2d-338b-4848-a263-aa228164190d)\n\nMarketplace activity: Our marketplace has 50 active buyers and has generated over $10,000 in transaction volume. You can check out the transaction details through this link (https://dsponsor-app.siborg.io/leaderboard)\n\nCommunity:\n- Twitter (X): Our Twitter account has grown to over 30,000 followers, accessible via this link (https://x.com/SiBorgLabs).\n- Discord: We’ve also built a community of over 1,000 members on Discord (https://discord.gg/siborglabs)",
                        "stellar.goToMarketPlan": "Initial Target Audience:\n- Web3 Media Outlets & Creators: Start by targeting media outlets and content creators already familiar with blockchain technology, particularly those in the Stellar ecosystem. Early partnerships with these entities will provide use cases and social proof for future clients.\n- Advertisers in Crypto & Tech: Initially onboard advertisers from the crypto and tech space, who are more likely to explore and adopt tokenized ad spaces.\n\nLaunch Campaigns & Events:\n- Partnership Announcements: Announce key partnerships (e.g., with Web3 media outlets) to demonstrate adoption and attract additional publishers.\n- Ad Space Auctions: Host exclusive tokenized ad space auctions with well-known publishers to generate buzz and show real-world use of the marketplace.\n- Stellar Ecosystem Engagement: Participate in Stellar-related events, such as Stellar Community Fund (SCF) rounds, hackathons, and conferences, to increase visibility within the Stellar community.\n\nEducation & Awareness:\n- Webinars and Demos: Host webinars and publish tutorials to educate potential users on the benefits of tokenizing ad spaces and how to integrate the Relayer API & SDK into their platforms.\n- Content Marketing: Create blog posts, case studies, and video content that highlight successful ad campaigns using SiBorg's platform, focusing on how tokenization improves revenue and efficiency.\n\nPartnerships and Integrations:\n- Strategic Media Partnerships: Collaborate with Web3 agencies and media outlets to onboard more publishers and increase ad space supply.\n- Ad Agencies & Brands: Build partnerships with Web3-focused ad agencies and brands to attract larger advertisers looking for innovative ad models.\nLong-Term Focus:\n- Cross-Chain Expansion: Once the platform is established on Stellar, explore cross-chain integrations to allow more advertisers and publishers from other ecosystems to participate.\n- DeFi Integration: Offer advertisers the ability to use tokenized ad spaces as collateral for loans or yield farming, creating additional liquidity and use cases for the assets",
                        "stellar.tranche1Deliverables": "From EVM to Soroban (MVP)\nBudget: $47,000\n\nBrief description: We plan to adapt core parts of our existing smart contracts by \"translating\" them from Solidity to Rust for deployment on Soroban. The goal is to start with the essential features and then expand by developing the necessary indexer, backend services, and frontend interfaces. Features : ad spaces tokens creation (creator, permissionless), ad submission (token owner), ad validation (creator)\n\nHow to measure completion: The first step will be considered complete when a fully functional stack is live on Stellar testnet, allowing users to set up tokenized ad space offers and submit ad proposals. The user interface will be accessible to a selected pool of beta testers, from whom we will gather feedback.\n\nMilestones:\n#1 : Smart contracts (Rust/Soroban) codes, tests and deployments on Testnet\nETA: November 30, 2024\nBudget: $23,000 \n#2 : Indexer SubQuery or Goldsky) & “relayer” Typescript code implementation\nETA: December 21, 2024\nBudget: $14,000 \n#3 : User interface (from scaffold-soroban, React + Freighter connection) \nETA: January 11, 2025\nBudget: $10,000",
                        "stellar.tranche2Testnet": "Payments, marketplace features\nBudget: $30,000\n\nBrief description: Since the core protocol is functioning well, the next step is to implement key features for both the primary market (paid mint) and secondary market (token resale). All transactions will occur on-chain, and SiBorg Ads on Stellar will continue to offer advanced transaction options, including Direct sales (fixed prices) and Auctions (English \"bid to earn\" model) Features : airdrop (free mint), payable mint, direct sales & auctions secondary market, on ramp integration\nHow to measure completion: This phase will remain in the testnet but should include all payment logic. Users must be able to buy and sell tokenized ad spaces using both tokens from their wallets and via the onramp system.\n\nMilestones:\n#1 : Marketplace Smart contracts (Rust/Soroban)\nETA: March 8, 2025\nBudget: $20,000 \n#2 : Indexer SubQuery or Goldsky) & “relayer” Typescript update implementation\nETA: March 22, 2025\nBudget: $6,000 \n#3 : UI (React) - include integrations with MoonPay, APS, and/or USDD Gateway\nETA: April 19, 2025\nBudget: $4,000",
                        "stellar.tranche3Mainnet": "Live on Mainnet\nBudget: $52,800\n\nBrief description: This phase focuses on transitioning from the testnet environment to the Stellar mainnet for real-world use. Since this step involves critical payment processes, audits are essential to prevent misuse and potential issues. If there is remaining budget, we also plan to explore additional features, such as bridging (e.g., with Allbridge). \nHow to measure completion: This phase is considered partially complete once the first real transaction occurs on Stellar mainnet. After that, we will focus on ensuring security and raising external awareness through audits and outreach. Our main goal is to deploy an offer with real ad spaces displayed on an interface of a participant in the Stellar ecosystem\n\nMilestones :\n#1 : Audit \nETA: May 24, 2025\nBudget: $33,900  (based on estimated quotes)\n#2 : Fixs + website/newsletter/Telegram integrations\nETA: May 31, 2025\nBudget: $11,400  (dependent on audit outcome)\n#3 : Testnet to Mainnet transition (smart contracts, backend services, frontend)\nETA: May 31, 2025\nBudget: $7,500",
                        "stellar.teamMembers": "Maxime Gay, Maxime Gay",
                        "stellar.urls": {
                            "website": "https://www.siborg.io",
                            "codeRepository": "https://github.com/siborg-ads/dsponsor-contracts",
                            "videoURL": "https://www.loom.com/share/b647d292f50141ed9ecbf46afbf69567?sid=df551db6-7bd1-4865-a067-ee2326e42ec1"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/siborg/",
                            "twitter": "https://x.com/SiBorgLabs",
                            "discord": "https://discord.gg/siborglabs"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 63933.34,
                                "denomination": "USD"
                            },
                            {
                                "amount": 193946.92,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-29T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:18",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recP8ThGTCNqAQIj6",
                    "projectId": "daoip5:stellar:project:cede-labs",
                    "projectName": "Cede Labs",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recP8ThGTCNqAQIj6",
                    "status": "Awarded",
                    "description": "Cede Labs specializes in bridging the gap between Centralized Finance (CeFi) and Decentralized Finance (DeFi) by offering seamless, secure connectivity to over 15 Centralized Exchange (CEX) APIs. Our innovative solutions unlock liquidity from CEXs, enabling effortless integration for dApps and asset managers to optimize their operations without compromising user experience.",
                    "fundsApprovedInUSD": 119800.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://cede-labs.notion.site/Stellar-Tech-Overview-125c717c212b80488f3ce60b8af574d2",
                        "stellar.productsAndServices": "The Problem:\nCEX connectivity presents significant challenges due to the tremendous lack of fluidity between centralized finance (CeFi) and decentralized finance (DeFi). This disconnection prevents the seamless transfer of liquidity, with over 40% of crypto liquidity trapped in centralized exchanges, limiting the potential for DeFi innovation and broader ecosystems like Stellar. Moreover, existing liquidity gateway solutions are inefficient, expensive, or not user-friendly (FIAT on-ramp, Bridges, …); with CEX integration being highly complex, especially for Web3 teams whose core expertise lies elsewhere. Adding to the difficulty, the maintenance of CEX API keys requires heavy ressources and continuous monitoring. \n\nThe Solution:\nTo bridge the gap between CeFi & DeFi, Cede Labs is building two products: \n\n- Cede.store:\nTo answer to a demand of DeFi & blockchain builders to bring more liquidity into their products (dApps, wallets, …) in a simple way without spending money or development time, Cede Labs built cede.store. \nCede.store is a non-custodial browser extension to store CEX (centralized exchanges) API keys and to sign CEX requests from the client-side. Any dApp can integrate cede.store in order to track and/or manage a user's CEX assets with a familiar UX and DX as DeFi wallets (e.g. Metamask).\nAny dApp can integrate cede.store in order to track and/or manage a user's CEX assets. In that way, we offer the dApp a way to track and manage a user's CEX assets while staying non-custodial and keeping the same UX as any DeFi browser wallet.\n\nTo integrate cede.store into a dApp, similar to how a DeFi wallet functions, the dApp interacts with a provider object (e.g., `window.ethereum` for EVM wallets or `window.cede` for cede.store). The dApp can execute various methods, such as retrieving balances or initiating a withdrawal from the exchange to the blockchain.\n\nIf a project prefers not to interact directly with this API, they can utilize our widget, which facilitates the transfer of funds from a CEX to the user’s address. For a list of all our partners, visit https://cede.store/partners.\n\n\n- Cede SDK:\nFor more advanced integrations and white-label needs, builders can opt to use our Cede SDK. This solution offers deeper customization of CEX connectivity, allowing developers to store CEX API keys wherever they see fit, ensure mobile compatibility, and bypass the need for the cede.store browser extension.\nCurrently, Cede SDK is a CEX connectivity SDK helping custody providers and custodians fast-forward their CEX integrations for asset management. \nBasically: Fireblocks’ CEX connectivity as a service.\n\nStellar Integration & Soroban: As part of our broader strategy, Cede Labs is working to integrate the Stellar blockchain into its API and SDK. This will allow Stellar-based dApps to access liquidity from centralized exchanges, greatly expanding Stellar’s utility. Soroban, Stellar’s smart contract engine, will be instrumental in this integration, particularly through the introduction of an \"Instant Protocol Deposit\" feature. This feature will enable users to seamlessly transfer assets from CEXs directly into Stellar-based protocols, such as DeFi applications, without the need for intermediaries. By leveraging Soroban, we ensure that this functionality is permissionless and optimized for security and scalability, helping Stellar attract significant liquidity and making it a competitive player in the DeFi space.\n\nWhy We Chose Stellar\nWe selected Stellar’s blockchain infrastructure for three primary reasons:\n1. Alignment with Our Vision for Institutional-Grade Liquidity Solutions: Stellar provides the scalability, low transaction fees, and cross-border functionality essential for institutions managing large volumes of digital assets. With Stellar’s infrastructure, we can offer our clients seamless connectivity to manage CEX liquidity more efficiently, allowing them to bridge the gap between centralized exchanges and decentralized applications.\n2. Focus on Cross-Border Payments and Financial Inclusion: Stellar’s well-established reputation as a leader in cross-border payments perfectly aligns with our goal to facilitate liquidity management across global markets. For institutional players looking to streamline CEX operations and manage assets across borders, Cede.store and Cede SDK offer the ideal tools to integrate into the Stellar ecosystem.\n3. Strong connections with the institutional space and with Ripple: the current niche where Cede Labs is focusing at the moment with Cede SDK product is the custody solutions space. Knowing that Stellar is very close to Ripple, one of the leaders in the institutional custody space with its product Ripple Custody, is a strong argument that led us to choose Stellar. \n\nThis not only empowers financial institutions but also accelerates the integration of Stellar’s ecosystem into mainstream financial operations. As we continue to refine our offerings, Cede Labs is committed to driving the adoption of Stellar by providing the tools and infrastructure necessary for institutional participation in the blockchain ecosystem.",
                        "stellar.successCriteria": "To measure the success and impact of Cede Labs and our Cede.store extension and SDK, we have identified key metrics across adoption, developer engagement, integration, and business performance. These KPIs will help us track our growth, user satisfaction, and overall contribution to the Stellar ecosystem.\n\nAdoption Rate:\n- Number of Active Projects: We will track the number of institutional clients and dApps actively using the Cede.store extension or Cede SDK to manage liquidity between CEXs and the Stellar blockchain. This metric will help us gauge how widely our solutions are being adopted within the Stellar ecosystem.\n- Growth Rate: Monthly and quarterly growth rates of new projects integrating Cede.store or Cede SDK will be monitored. This will include metrics such as the number of new users, the volume of liquidity flowing between CEXs and the Stellar chain through our solutions, and the total value locked (TVL) on Stellar brought from CEX liquidity through Cede Labs products. \n\nDeveloper Engagement and Reliability:\n- SDK Packages Downloads: Track the number of downloads and installations of the Cede SDK by developers. This metric will provide insights into the adoption rate among Stellar developers and how many projects are integrating our SDK.\n- Extension Usage: Monitor the number of active users interacting with the Cede.store extension, especially those using it to facilitate cross-chain liquidity transfers.\n- Community Participation: Track the level of engagement in the Stellar community, including GitHub contributions to our open-source codebase (once live) and participation in developer forums and social media.\n- Support Requests: Monitor the volume and types of support requests from developers and institutions using Cede.store and Cede SDK. This helps identify common issues and improve product support and documentation.\n\nIntegration Success:\n- Partnerships: Measure the number and quality of strategic partnerships with key stakeholders in the Stellar ecosystem, including dApp developers, custody providers, and financial institutions.\n- Financial Institution Onboarding: Track the number of financial institutions adopting Cede Labs' solutions for asset tokenization and liquidity management across CEXs. This will be a key indicator of our traction within institutional markets.\n- New B2B & B2B2C companies onboarded on Stellar through Cede Labs product: track the number of our current & new partners using our tech that will discover Stellar ecosystem through Cede SDK or Cede.store and will decide to integrate Stellar blockchain on their businesses and products. \n\nBusiness Metrics:\n- Revenue: We will monitor revenue streams from enterprise solutions, such as consulting services, licensing fees for the Cede SDK, and integration partnerships. This metric will help us assess the commercial viability of our offerings.\n- Customer Satisfaction: Regular customer satisfaction surveys will be conducted to gauge the experiences of our partners and users. This will help us identify areas for improvement and ensure that we are meeting the needs of the institutional players and developers we serve.",
                        "stellar.tractionEvidence": "https://docs.google.com/document/d/1nyXMeZB_GcZ-qPjnUAJRuLPH8rBFHugC0yYDMZi4JT8/edit?tab=t.0",
                        "stellar.goToMarketPlan": "Our go-to-market strategy at Cede Labs is designed to drive widespread adoption of our Cede.store extension and Cede SDK among institutional players and key stakeholders in the Stellar blockchain ecosystem. We are focusing on both ecosystem partnerships and financial institution onboarding to fuel our growth and expand our presence within the Stellar ecosystem.\nEnd-user acquisition\nRegarding retail end-users, we understand after our 3 years of experience that a B2B2C GTM is the most efficient and relevant strategy to bring massive amounts of users in a new ecosystem with minimum efforts and without crazy marketing expenses. Indeed, the strategy focus on partners acquisition which will be detailed in the points below, and we leverage our partners’ community to top down the user acquisition. Furthermore, we leverage cede.store users to bottom-up collaboration with new partners.\n\nEcosystem Partnerships – B2B\nWe will target startups and established developers within the Stellar ecosystem by offering deep integration and consulting support. Our goal is to ensure that any project looking to manage liquidity between centralized exchanges (CEXs) and Stellar can leverage our tools to do so seamlessly.\n- Integrator for Development: We offer hands-on integration services for startups looking to build their decentralized applications (dApps) on Stellar using Cede.store and the Cede SDK. Our team will provide technical guidance to ensure that our partners can leverage CEX connectivity effortlessly.\n- Technical Consulting: Cede Labs will offer tailored consulting services to help institutional and startup clients navigate the technical complexities of managing CEX liquidity with Stellar. This will include architectural advice, best practices for security, and guidance on optimizing cross-chain interactions.\n- Licensing and SLA Implementation: Based on market research, we plan to introduce a licensing system and Service Level Agreements (SLAs) to provide customized solutions for different client needs. These services will ensure premium support and priority access to updates, making it easier for partners to rely on our solutions in critical financial operations.\n\n\nFinancial Institution Onboarding – B2B\nTargeting financial institutions is a cornerstone of our strategy. We are focusing on custody solutions, OEMS, prime brokers, market makers, and other services & tech providers providing their services to asset managers.\n- Target Audience: We are actively engaging with leading institutional-grade products in our space, as well as the clients of our prospects (banks, family offices, VC funds, and other asset managers company investing in crypto), in order to better understand the need and making them pressuring their service & tech providers about the need for CEX connectivity, meaning our clients. Therefore, this strategy will help promoting Cede.store and Cede SDK as foundational solutions for their blockchain operations. The goal is to introduce our tools for use cases like asset tokenization, liquidity management, and cross-border transactions.\n- Innovation & Product Departments: We are specifically approaching innovation & Product teams within financial institutions to explore tokenization and liquidity management use cases. Cede.store provides a seamless way for banks to manage liquidity between CEXs and decentralized platforms like Stellar, streamlining these operations securely and efficiently.\n- Partnerships with Consulting Firms: Collaborating with leading consulting firms like Accenture and KPMG, we aim to integrate our technology into broader blockchain solutions offered to financial institutions. These partnerships will help fast-track institutional adoption of our tools and generate in-bound traction. \n- Collaboration with Stellar Development Foundation (SDF): We are closely working with the SDF partnership team to facilitate institutional onboarding and foster partnerships. Our company is already recognized as an official service provider on the Stellar website, positioning us as a trusted provider of CEX liquidity solutions within the ecosystem.\nIncubation and Support\nCede Labs is leveraging support from top incubators and accelerators to enhance our network, credibility, and institutional reach.\n- Incubators: We are currently incubated by BNB Chain Incubator at Station F, which provide valuable access to resources, networking opportunities, and collaborations with startups and enterprises in the web3 ecosystem.\n- Upcoming Partnerships and new offices: Cede Labs is currently discussing top partnerships with the top 2 crypto French companies at the moment: Kiln, the international leader of institutional staking, and Ledger. In the coming months, Cede Labs will probably be implemented in Ledger offices or Kiln offices, ensuring easier access to their resources and developing long-term partnerships.\n- Previous Fundraising: raised 750k$ in pre-seed with GSR, Stake Capital, among several well-known business angels in the industry (co-founder of Ledger, Angle Protocol, Aave, Meria/Hasheur, …) in S2 2022.\n\n\nMarketing and Branding\nOur marketing efforts are centered around building a strong brand presence within the blockchain and financial sectors through targeted social media campaigns.\n- Social Media Presence: We will maintain an active presence on LinkedIn, Twitter, and Discord to engage with our target audience and promote the unique value propositions of Cede.store and Cede SDK. By engaging directly with the Stellar community and institutional stakeholders, we will build awareness of our product offerings.\n\nBy implementing these strategies, Cede Labs aims to become the provider of CEX-to-Stellar liquidity management solutions, driving innovation within the Stellar ecosystem. Through strategic partnerships, financial institution onboarding, and community engagement, we are positioned to significantly contribute to the adoption and development of Stellar as a blockchain leader in institutional finance.",
                        "stellar.tranche1Deliverables": "I) Steps for our MVP\n\tFrom November 2024 to February 2025 - $44 500\n\n- Integration of a Stellar chain into cede.store extension\n\nBrief Description\nWe will integrate the Stellar blockchain into the cede.store extension and its provider API. The goal is to enable users to withdraw liquidity from CEXs to the Stellar chain. Additionally, this integration will allow dApps to use the provider API to perform the same function.\n\nHow to Measure Completion\nCompletion will be measured by ensuring that transfers from centralized exchanges to Stellar blockchain work from the extension and the dApp, using cede.store Provider API.\n\nEstimated date of completion: December 28, 2024\n\nBudget: $17 800 \n\n- Integration of a Stellar chain to the SDK\n\nBrief Description\nSome dApps might manage CEX API keys directly for users to eliminate the need for downloading the cede.store extension. For these clients, we offer our white-label solution, Cede SDK. We will integrate the Stellar chain into the SDK to enable the retrieval of Stellar chain data, initiate withdrawals to Stellar, and track the status of these withdrawals.\n\nHow to Measure Completion\nCompletion will be measured by ensuring that all methods used for CEX withdrawals to the Stellar chain are functional. We have an SDK demo stand that allows us to test these methods.\n\nEstimated date of completion: January 15, 2025\n\nBudget: $17 200\n\n- Documentation improvements + playground\n\nBrief Description\nTo help our partners to integrate the Provider API or the Cede SDK, we’ll improve our developer documentation, integration guides and create/update the playground allowing to play with Provider API.\n\nHow to Measure Completion\nCompletion will be measured by ensuring that all methods used for CEX withdrawals to the Stellar chain are functional. We have an SDK demo stand that allows us to test these methods.\n\nEstimated date of completion: February 15, 2025\n\nBudget: $9 500",
                        "stellar.tranche2Testnet": "II) Steps for our TestNet\n\tFrom February 2025 to April 2025 - $55 500\n\n- Penetration testing of cede.store & SDK\n\nBrief Description\nIn order to ensure the safety of both products before open-sourcing them, we will conduct whitebox penetration testing.\n\nHow to Measure Completion\nThe audit report will be presented by the end of the audit for both products: cede.store and Cede SDK.\n\nEstimated date of completion: February 31, 2025\n\nBudget: $27 500\n\n- Open-sourcing of cede.store and some parts of the SDK\n\nBrief Description\nTo get more trust from users and our clients, we’ll open source the extension and Cede SDK. This implies making some code refactoring and splitting the codebase - currently we use the monorepo. These changes also imply a lot of QA after the migration to ensure that provider API and Cede SDK are stable and nothing is broken.\n\nHow to Measure Completion\nCompletion will be measured by ensuring that cede.store extension and Cede SDK package repos are public.\n\nEstimated date of completion: March 15, 2025\n\nBudget: $11 000\n\n- React SDK with hooks to communicate with cede.store extension\n\nBrief Description\nThe @cedelabs/react-sdk is a comprehensive React SDK containing react hooks designed to streamline the integration of cede.store into dApps. With a range of powerful features and hooks, this SDK simplifies the process of interacting with the cede.store extension. It facilitates various actions, such as retrieving user balances, identifying available networks, and initiating and tracking withdrawal requests.\n\nHow to Measure Completion\nCompletion will be measured by ensuring that @cedelabs/react-sdk is available and has methods allowing to integrate withdrawals from CEXs to Stellar, as well as presence of the developer documentation.\n\nEstimated date of completion: April 1st, 2025\n\nBudget: $17 000",
                        "stellar.tranche3Mainnet": "III) Launch on MainNet\n\tFrom April 2025 to May 2025 - $19 800\n\n- Instant protocol deposit testnet & audit - withdraw from the exchange directly to the protocol\n\nBrief Description\nIPD stands for Instant Protocol Deposit. We plan to develop a feature to directly invest user’s CEX assets to a protocol while staying non-custodial. \nFor example, a user will be able to invest directly in an AAVE lending pool from his CEX assets.\nIt allows any players to attract the maximum liquidity from CEX to the user’s wallet.\nSimilar to transak one (FIAT to smart-contract): https://transak.com/transak-one\n\nHow to Measure Completion\nCompletion will be measured by ensuring on our demo app that funds withdrawn from a CEX are directly deposited into the Stellar protocol on behalf of the user (the user keeps ownership of funds)\n\nEstimated date of completion: May 15, 2025\n\nBudget: $19 800",
                        "stellar.teamMembers": "Cedelabs, Felix, Nikita Terekhov",
                        "stellar.urls": {
                            "website": "https://sdk.cede.store",
                            "codeRepository": "https://github.com/cedelabs/sdk-examples",
                            "videoURL": "https://www.loom.com/share/e0fad42cec0243a3954933ac4313f597?sid=0a5228a0-4570-4a74-91cc-f2f784bdd76d"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/cede-labs",
                            "twitter": "https://twitter.com/CedeLabs",
                            "discord": "https://discord.gg/V7hgKf6NWf"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 79866.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 247446.34,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-30T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:19",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recVpLJSgXgMroJVF",
                    "projectId": "daoip5:stellar:project:equitx",
                    "projectName": "EquitX",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recVpLJSgXgMroJVF",
                    "status": "Awarded",
                    "description": "Enabling Stellar users to trade xAssets, participate in governance, and earn liquidity rewards on a secure and flawless DeFi platform.",
                    "fundsApprovedInUSD": 105000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1mOZHyFoe9iy4MnBr7lNZh-eLi54gLrKEoFymBX5xNyE/edit?tab=t.0",
                        "stellar.productsAndServices": "As a reminder, EquitX enables the creation and management of synthetic assets mirroring small-cap stock performance, enhancing liquidity and investor access.\n\nOur goal with the SCF Build Award is to complete the development of the entire EquitX protocol, bringing it from its current foundational state to full functionality. We have already developed the core smart contracts for collateralization, liquidation, and stability pools, and now aim to finish the entire system. The key areas of development include:\n\n-   Admin tool for new asset onboarding: this tool will enable admins to onboard new xAssets linked to real-time data feeds. Stellar's blockchain will ensure transparent tracking and asset registration, allowing for scalable and efficient asset addition.\n    \n-   Blockchain indexing system: a Stellar-based indexing system will track all transactions (collateral, trading, liquidation) in real time, improving transparency and auditability while feeding data to the analytics tool. We will use a server for this functionnality.\n    \n-   Automatic liquidation system: using Soroban smart contracts, this system will automatically liquidate under-collateralized positions based on real-time data from Stellar, ensuring platform stability and mitigating risk.\n    \n-   DEX interaction: integrate liquidity pools of xAssets into Stellar’s decentralized exchanges, allowing users to trade xAssets at optimal prices. Stellar's DEX framework ensures secure and efficient trade execution.\n    \n-   Advanced analytics and reporting tool: we will use Stellar's transaction data to develop a tool providing real-time insights into asset performance and platform activity, enhancing user decision-making and platform transparency.\n    \n-   Full UI/UX development: the final user interface will offer seamless access to all platform functions, powered by Stellar and Soroban, for trading, governance, and analytics.\n    \n\nThese developments will complete the EquitX protocol, providing users with a fully functional, scalable, and secure platform for trading xAssets, earning rewards, and participating in decentralized governance.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success for EquitX is about democratizing access to investments in nano-cap, micro-cap, and small-cap companies, offering opportunities that have traditionally been difficult for retail investors to tap into. The platform’s success will be measured by both quantitative and qualitative outcomes:\n\n1. New users and investor base expansion: we aim to attract a diverse user base, starting with blockchain-savvy investors and expanding to include non-crypto-native investors.\n\n-   Output: Reaching 20,000 active users within the first 12 months of full platform launch, with a balanced mix of both crypto and non-crypto investors.\n    \n-   Impact: Expanding financial access to traditionally hard-to-reach investment opportunities, allowing retail investors to diversify their portfolios into smaller, high-growth companies. This broadens financial inclusion by offering exposure to markets typically reserved for institutional investors.\n    \n\n1. Enhanced liquidity for nano, micro, and small-cap companies: by offering these companies a platform where their stocks are represented as synthetic assets (xAssets), EquitX increases their market visibility and provides an alternative source of liquidity.\n\n-   Output: Onboarding 5+ nano, micro, and small-cap companies as xAssets within the first year. We won’t be integrating more than 5 company xAssets within this first year to keep good liquidity for each asset. \n    \n-   Impact: Helping smaller companies grow by increasing their visibility and liquidity without requiring them to go through conventional fundraising channels, such as equity dilution. This can drive economic growth, particularly in niche markets and emerging sectors.\n    \n\n1. Increased Trading Volume and Liquidity in the DeFi Space: EquitX expects substantial trading volume within the platform itself, where users can trade synthetic assets backed by small-cap companies. Additionally, EquitX will leverage Stellar’s DEXs to facilitate external trading of xAssets, further enhancing liquidity for both investors and small-cap stocks.\n\n-   Output: Reaching $60 million XLM in total trading volume, both within the EquitX platform and through external trading on Stellar DEXs, within the first year.\n    \n-   Impact: Bringing new liquidity into the Stellar ecosystem by encouraging the trading of synthetic assets. This will drive platform engagement, while also fostering financial innovation by bridging traditional financial markets and decentralized finance (DeFi).\n    \n\n1. Total Value Locked (TVL): EquitX expects to accumulate significant value locked within its platform, providing liquidity for synthetic assets and enhancing trading opportunities.\n\n-   Output: Reaching $15 million in Total Value Locked (TVL) within the first year.\n    \n-   Impact: A strong TVL will ensure liquidity and stability across the platform, encouraging more active participation from investors and supporting efficient trading of xAssets. This will also build confidence in the platform’s sustainability and growth potential.\n    \n\n1. Number of Collateralized Debt Positions (CDPs): EquitX aims to drive high user engagement through the opening of Collateralized Debt Positions (CDPs), allowing users to collateralize assets and mint xAssets.\n\n-   Output: Establishing 1,500 CDPs within the first year.\n    \n-   Impact: The growth in the number of CDPs will demonstrate active user participation and platform trust. This will enhance liquidity within the system and create a more robust market for xAssets, reinforcing the platform’s role as a bridge between traditional finance and decentralized finance.\n    \n\n1. Security and transparency: Stellar’s blockchain, combined with Soroban smart contracts, will provide secure, transparent, and efficient transactions for users.\n\n-   Output: Maintaining 100% transparency and security for all platform transactions, with no security breaches or fraud.\n    \n-   Impact: Enhancing user trust and confidence in the platform, which is crucial for widespread adoption and long-term growth.\n    \n\nIn summary, success for EquitX will be measured by the growth of its user base, the liquidity it brings to nano, micro, and small-cap companies, the trading volume it facilitates, and the financial opportunities it opens up for a broader audience. The impact goes beyond numbers, EquitX will create a new bridge between traditional finance and decentralized finance, offering a solution for investors to access untapped market potential in a secure, transparent, and efficient manner.\n\nThese numbers are mainly based on a similar protocol, Indigo, that has been launched 2 years ago on Cardano.",
                        "stellar.tractionEvidence": "Testnet and Development Phase\n\nActively refining the platform on the testnet to optimize user experience and security before launch.  \nTestnet link\n\nGrowing Presence on Social Media\n\nBuilding a community on X with 500+ followers, engaging with the DeFi ecosystem.  \nX profile\n\nNewsletter Engagement\n\n200+ subscribers receive updates on technical progress and market insights, building early interest. From our website: https://equitx.com/ \n\nDirect Collaboration with LOAM\n\nLOAM helps co-develop smart contracts and optimize collateralization.  \nLOAM link\n\nReflector, a key component\n\nReflector provides reliable real-time price data for synthetic assets.  \nReflector link\n\nIncubation with ESSEC Ventures\n\nSupported by ESSEC Ventures with mentorship and networking opportunities.  \nESSEC Ventures link\n\nComparable Protocol: \n\nIndigo Protocol is a decentralized platform on Cardano that creates synthetic assets, similar to EquitX’s approach. However, Indigo focuses on synthetic assets that are native to other blockchains, such as cryptocurrencies, rather than stocks like EquitX. While both platforms share similar technical processes, EquitX uniquely targets synthetic representations of small-cap equities on Stellar’s blockchain. Currently:\n\n-   Indigo’s Total Value Locked (TVL) in USD stands at $33.81 million with a peak at $125.56 million in March 12, 2024, demonstrating the strong market demand for decentralized synthetic assets​  \n    DefiLama\n    \n-   8,73 million of their stablecoin iUSD is circulating for a total market cap of $7,61 million  \n    DefiLlama\n    \n    Retrospectively, only 2 months after launch, Indigo was at: \n    \n-   14.37M TVL \n    \n-   6.38M USD in iAssets \n    \n-   935 CDPs\n    \n\nIndigo on X\n\nOverall report",
                        "stellar.goToMarketPlan": "After completing the development of the EquitX protocol, our go-to-market strategy will follow a phased approach:\n\n-   Content marketing on Discord and X: during the development phase, we will and are already publishing content on Discord and X to build awareness and generate interest in the protocol. We will continue sharing updates and insights, ensuring the community stays engaged and informed as we progress toward launch.\n    \n-   Rewards and surprises for early users: to create hype and incentivize early adoption, we will announce and offer rewards to users who engage with the platform from the start. This strategy will build excitement around the launch and foster early community loyalty.\n    \n-   Liquidity injection from investors: to boost initial liquidity, we plan to seek investments for liquidity injection. This will provide a strong foundation for trading and stability pools, ensuring the platform has the liquidity needed to support early users and incentivize engagement.\n    \n-   Targeted user acquisition: after launch, we will focus on acquiring early adopters from the DeFi community, particularly those interested in synthetic assets and decentralized governance. For that, we may invest in paid marketing on social media to accelerate user growth and ensure broad exposure within the DeFi space.\n    \n-   Community engagement and governance: launching the governance system early will allow users to actively shape the platform's direction. We will encourage participation through token staking and voting, ensuring the community is deeply involved and rewarded for their engagement, fostering long-term loyalty.\n    \n-   Educational content and onboarding: to simplify the onboarding process, we will create educational materials such as guides, tutorials, and webinars. This will help users understand how to trade xAssets, participate in governance, and maximize their experience on the platform, fostering trust and usability.\n    \n-   Collaborations: with other DeFi projects (especially DEXs) of the ecosystem. This will also raise awareness about our protocol and extend our user base from existing Stellar users.\n    \n\nOur phased launch will start with governance token distribution and asset onboarding, followed by full functionality like trading and staking. By combining early community engagement through rewards, liquidity injection from investors, and targeted marketing, we will establish a strong initial user base and a stable liquidity environment.",
                        "stellar.tranche1Deliverables": "The following milestones have been completed following our first award, to create our first MVP - https://equitxcompany.github.io/equitx-project/#/: \n\n✔ Smart Contracts Framework Development for Collateralization and Stability Pools: Design and development of the foundational smart contracts framework to manage the collateralization process and interactions with stability pools. This includes the logic for creating, managing, and liquidating collateral positions, as well as the reward mechanism for pool participants. \n\n✔ Oracle Development for Real-Time Valuation: Development of an oracle system to provide real-time valuation data for small-cap equities, ensuring accurate and timely information for trading and collateral assessment. \n\n✔ User Interface Prototype for Asset Management and Collateralization: Creation of a user interface prototype enabling users to visualize, manage their assets, and initiate collateralization operations. This prototype will also include visualizations of stability pools and functionalities to participate in them.\n\n✔ Integration and Initial Testing of Smart Contracts with User Interface Prototype: Integration of the developed smart contracts with the user interface prototype, followed by a testing phase to ensure the reliability and security of interactions.",
                        "stellar.tranche2Testnet": "1) Admin Tool for New Asset Onboarding\n\n-   Description: Development of a tool that allows platform admins to onboard new xAssets efficiently. The tool will link new assets to oracles for real-time data, manage asset parameters (e.g., collateralization ratios), and ensure they can be traded on the platform.\n    \n-   Success Measurement: A fully functional tool that allows admins to add new xAssets, integrated with oracles for market data, and linked to the platform’s collateralization and liquidation systems. The first batch of xAssets is successfully onboarded and tested.\n    \n-   Estimated Completion Date: November 26, 2024 (~1 month) \n    \n-   Budget: $14,700\n    \n\n2) Blockchain Indexing System Setup\n\n-   Description: Setup of a blockchain indexing system to track and archive all transactions on the platform, including collateralization, minting, trading, and liquidation. This system will provide real-time data to the backend and user interface, and ensure transparency for audits. Using a server? \n    \n-   Success Measurement: A fully functional indexing system that archives transactions in real-time and provides accurate data for the platform’s user interface and backend services. The system successfully tracks the first batch of xAssets onboarded and their associated transactions.\n    \n-   Estimated Completion Date: January 03, 2025 (~1 month and a week) \n    \n-   Budget: $21,000\n    \n\n3) Automatic Liquidation System Development\n\n-   Description: Development of an automatic liquidation system that monitors collateral positions in real-time. When a position falls below the required health threshold, the system automatically triggers liquidation via smart contracts to ensure platform stability.\n    \n-   Success Measurement: A fully operational automatic liquidation system that accurately tracks collateralization health and triggers liquidations when necessary, preventing under-collateralization. Successfully tested on real market conditions with xAssets.\n    \n-   Estimated Completion Date: January 20, 2025 (~3 weeks)\n    \n-   Budget: $10,500\n    \n\n4) xUSD Integration and Liquidity Pool Creation on Stellar DEXs\n\n-   Description: This milestone involves two key tasks. First, the integration of xUSD into the EquitX protocol with the creation of the first stability pool for the xToken, allowing users to stake and provide collateral within the platform. Second, the creation of liquidity pools for xUSD on major Stellar decentralized exchanges (DEXs), enabling users to trade xUSD efficiently across multiple DEXs. \n    \n-   Success Measurement: Successful integration of xUSD into the protocol, with a functional stability pool available for users to provide collateral and maintain platform stability.\n    \n-   Liquidity pools for xUSD are live on major Stellar DEXs, enabling trading. \n    \n-   Estimated Completion Date: January 31, 2025 (~1,5 week)\n    \n-   Budget: $6,300",
                        "stellar.tranche3Mainnet": "5) Advanced Analytics and Reporting Tool\n\n-   Description: Development of an advanced analytics and reporting tool that provides real-time insights into xAsset performance, collateral health, trading volume, and liquidation events. The tool will serve both users and admins, offering detailed reports to aid in decision-making.\n    \n-   Success Measurement: A fully operational analytics tool that provides detailed reports on platform activity, including collateral health, liquidation history, and trading metrics. Successfully delivers insights to both users and admins with real-time data from the indexing system.\n    \n-   Estimated Completion Date: February 22, 2025 (~3 weeks)\n    \n-   Budget: $16,800\n    \n\n6) Full UI/UX Development (Final Version)\n\n-   Description: Complete development of the final user interface and experience for the platform, ensuring a smooth and intuitive design for all user interactions. The UI will cover asset management, trading, governance, and rewards, providing users with an optimized experience.\n    \n-   Success Measurement: A fully polished, user-friendly interface that integrates all platform functionalities (asset management, governance, trading, and reporting). The final version is launched, successfully tested with user feedback, and ready for broad user adoption.\n    \n-   Estimated Completion Date: April 06, 2025 (~1,5 months) \n    \n-   Budget: $25,200\n    \n\n7) Platform Testing and Optimization\n\n-   Description: Conduct testing and optimization of the platform’s core functionalities, including smart contracts for collateralization, liquidation, and trading. This milestone will ensure that the platform performs well under various scenarios, including stress tests in real market conditions. Additionally, it will include fine-tuning the system for scalability and user experience improvements.\n    \n-   Success Measurement: Full testing and optimization of the platform's core features, with documented performance improvements. The platform successfully passes stress tests under simulated real-world market conditions, ensuring scalability and robustness.\n    \n-   Estimated Completion Date: April 25, 2025 (~3 weeks) \n    \n-   Budget: $10,500",
                        "stellar.teamMembers": "Mohamed  Dabladji",
                        "stellar.urls": {
                            "website": "https://equitx.com/",
                            "codeRepository": "https://github.com/EquitXCompany/equitx-project",
                            "videoURL": "https://youtu.be/A6r_Rzc2N2A?si=IdNPNvJEmbxhLTO2",
                            "pitchDeck": "https://www.canva.com/design/DAGSn0wx6OU/3lqT6wvo1Pv1-5U3lUPDfA/edit?utm_content=DAGSn0wx6OU&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/equitx/",
                            "twitter": "https://x.com/Equit_X"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 70000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 243164.14,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Financial Protocols"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:20",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec5hF8af5tfhSlT2",
                    "projectId": "daoip5:stellar:project:untangled",
                    "projectName": "Untangled",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec5hF8af5tfhSlT2",
                    "status": "Awarded",
                    "description": "Untangled Vault is an automated, non-custodial, data-driven asset management protocol enabling anyone to set and execute strategies to fit investor risk/return appetite.",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1p9XyJo8uuvMboWFaF-QS4KgWhx1ZSjqsytIxDyDDPKo/edit",
                        "stellar.productsAndServices": "Untangled Vault is an automated, non-custodial, data-driven asset management protocol enabling anyone to set and execute strategies to fit investor risk/return appetite. Untangled Vault is powered by Untangled pool, an asset tokenization protocol focusing on RWA private credits and Credio, a risk oracle providing machine learning model inferences and onchain monitoring of RWA. Untangled Vault is an EVM compatible smart contract platform. This application is to deploy Untangled Vault and necessary supporting components of Untangled Pool and Credio on Stellar. This necessitates the conversion of EVM contracts to Soroban as well as adapting and building all relevant technical components. For details please refer to the link \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\[https://docs.google.com/document/d/1p9XyJo8uuvMboWFaF-QS4KgWhx1ZSjqsytIxDyDDPKo/edit\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\](https://docs.google.com/document/d/1p9XyJo8uuvMboWFaF-QS4KgWhx1ZSjqsytIxDyDDPKo/edit)",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Stellar is home to major RWA projects like Franklin Templeton's Benji and Wisdom Tree, but its DeFi ecosystem is still in its early stages according to [Dune](https://dune.com/scoffie/stellar?utm_medium=email&_hsenc=p2ANqtz-8sZJMo2DPSBx_uZtMgpu-gyu9eEVe7E5EYaNBnfEVVnOXkGqG9v8rKvdtO3zXZjfKJSvYoUTaYWi-9oG0ciIU78EJEIX0Tzs0qxgYJyOKoKd_YqDI&_hsmi=96780372&utm_content=96780372&utm_source=hs_email) and defillama dashboard [https://defillama.com/chain/Stellar](https://defillama.com/chain/Stellar). This presents a unique opportunity for Untangled Finance to make a impact, especially with the launch of the Soroban smart contract platform. RWAs (on any chain including Stellar) face challenges in moving beyond a mere, close-loop tokenisation to a landscape where tokens have more utility on secondary markets e.g. trading, used as collateral in lending markets or composed into products that fit investor risk, return and usage preferences. At Untangled and Credio, our risk modelling and oracle service, we believe these boils down to Product  * a liquid product that can achieve balance between risk, return and liquidity such as tokenized MMF, index funds or short term treasuries * a product that have a low barrier to entry e.g. minimum investment size or KYC particularly for emerging markets such as Brazil, Mexico, Colombia, Turkey, Ukraine and Nigeria * Stellar infrastructure primitives that can support such product innovations. Legal  * Token is tradable or used as collateral in third party systems after a possible short lock-up period * Minimum KYC requirement on secondary market beyond some compulsory require e.g. sanction list whitelisting Liquidity  * Who can provide liquidity for the secondary market? Think of market makers and other large liquidity providers  * What is optimal incentive design and quantum from the protocols concerned and  Stellar? XLM incentive included. * Feasibility of non-custodial wallet distribution and/or DeFi secondary trading/staking.",
                        "stellar.tractionEvidence": "\\\\\\\\\\\\\\* Protocol developed and audited, launched on Celo mainnet - \\\\\\\\\\\\\\[Audit report\\\\\\\\\\\\\\](https://github.com/Verilog-Solutions/.github/blob/main/Audit/Untangle\\\\\\\\\\\\\\_Protocol\\\\\\\\\\\\\\_Audit/Untangled\\\\\\\\\\\\\\_FInance\\\\\\\\\\\\\\_Audit\\\\\\\\\\\\\\_Report.pdf) \\\\\\\\\\\\\\* Closed a strategic seed round led by Fasanara Capital, an institutional asset manager managing $4.5bn private credit portfolio with a network of 140 asset originators in 65 countries - \\\\\\\\\\\\\\[Coindesk article\\\\\\\\\\\\\\](https://www.coindesk.com/business/2023/10/10/tokenized-rwa-platform-untangled-goes-live-gets-135m-funding-to-bring-private-credit-on-chain/) \\\\\\\\\\\\\\* Sourced a pipeline of institutional-grade assets through partnership with Fasanara - \\\\\\\\\\\\\\[Fist pool launch coverage\\\\\\\\\\\\\\](https://www.coindesk.com/business/2024/05/02/tokenized-private-credit-platform-untangled-opens-its-first-usdc-lending-pool-on-celo/) \\\\\\\\\\\\\\* First pool live with $250k in TVL - \\\\\\\\\\\\\\[Link to pool TVL\\\\\\\\\\\\\\](https://app.untangled.finance/#/celo/pool-note/2) \\\\\\\\\\\\\\* Developed world’s first RWA decentralized credit oracle, Credio - \\\\\\\\\\\\\\[Whitepaper\\\\\\\\\\\\\\](https://credio.network/docs/whitepaper) \\\\\\\\\\\\\\* Credio is currently in pilot phase with a top credit rating agency - \\\\\\\\\\\\\\[Link to public dashboard on stablecoin depeg monitoring service\\\\\\\\\\\\\\](https://dune.com/untangled\\\\\\\\\\\\\\_credio/stablecoin-depeg-dashboard-summary)",
                        "stellar.goToMarketPlan": "\\* Investor segment: We will target 3 groups \\* DAO Treasuries: Increasingly DAOs are allocating to RWAs. RWAs bring scale and stable and uncorrelated income for DAO, helping them to grow their treasury sustainably. However, some RWAs like private credits, whilst having higher yields and bigger real world impact, suffer from low liquidity ('no free lunch' principle in financial markets). With Untangled vault issuers can craft bespoke strategies for DAO treasuries, balancing yields and liquidity. We believe that this is a strong differentiation, currently lacking among RWA investment opportunities on Stellar. \\* Institutional users: In a balanced portfolio, RWA yields are a source of stability that institutional users seek. We will be working with partners in our network including Fasanara, a big player in the digital asset market, to approach institutional investors in allocating liquidity to Untangled Vault. \\* Retail users: Most currently RWA protocols (including our existing pool) set a high minimum investment amount. With Untangled vault we can set a lower minimum amount, removing a significant barrier to entry for many retail users. \\* Underlying product segments we will target \\* Pegged asset projects: Any pegged assets such as tokenized money market funds like Franklin Templeton's Benji token  \\* Stablecoin projects: likewise any stablecoins backed by RWAs, like USDC and staked tokens",
                        "stellar.tranche1Deliverables": "Deliverable 1: Untangled Credit Vault (MVP) (See detailed deliverables above) \\\\\\* What: Develop and deploy a single credit vault contract (ERC-4626 extension) on Soroban, supporting basic vault issuance and asset management for RWAs. \\\\\\* Measure: Successfully deploy the credit vault contract on Soroban testnet with basic functionality tested, including vault issuance and withdrawal epochs. \\\\\\* When: 4 weeks from award approval. Deliverable 2: Credio Oracle (MVP) (See detailed deliverables above) \\\\\\* What: Develop and deploy the first Credio oracle contract on Soroban, integrating basic ML-based credit risk scoring. \\\\\\* Measure: Test deployment of the credit risk scoring mechanism on Soroban testnet,. \\\\\\* When: 4 weeks from award approval. Budget: \\\\\\* $50k",
                        "stellar.tranche2Testnet": "Deliverable 1: Untangled Credit Vault (Testnet) (See detailed deliverables above) \\* What: Expand credit vault features to support more advanced asset management and cross-chain integration on the Soroban testnet. \\* Measure: Fully functional credit vault on the testnet with cross-chain module integration and basic user testing. \\* When: 6 weeks from award approval. Deliverable 2: Credio Oracle (Testnet) \\* What: Integrate ML models and complete credit scoring functionality \\* Measure: Successful deployment of oracle and inference mechanisms on the Soroban testnet with real-time risk scoring. \\* When: 6 weeks from award approval. Budget: \\* No XLM reward, but access to Stellar LaunchKit for audits and infrastructure credits.",
                        "stellar.tranche3Mainnet": "Deliverable 1: Untangled Credit Vault (Mainnet) \\* What: Launch the credit vault contract on the Stellar mainnet, integrating multisig, other cross-chain transaction management, and user interface support. \\* Measure: Full deployment on the Stellar mainnet, with all main features functional and available for user interaction. \\* When: 12 weeks from award approval. Deliverable 2: Credio Oracle (Mainnet) (See detailed deliverables above) \\* What: Deploy the Credio Oracle on the Stellar mainnet \\* Measure: Full deployment of the Credio Oracle on Stellar mainnet. \\* When: 12 weeks from award approval. Budget: \\* $100,000k - covering final development and mainnet deployment for both Vault and Credio",
                        "stellar.teamMembers": "quntangled",
                        "stellar.urls": {
                            "website": "https://www.untangled.finance/",
                            "codeRepository": "https://github.com/untangledfinance",
                            "videoURL": "https://www.youtube.com/watch?v=wyKOIUHUpP4",
                            "pitchDeck": "https://docs.google.com/presentation/d/1loxPEFtkhAdb6VXvdPwQ2qkVxQnuS617uy4rAiMCuxo/edit#slide=id.g2b9d921223b_0_0"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/untangled-finance",
                            "twitter": "https://twitter.com/untangledfin",
                            "discord": "https://discord.gg/neucRJEWHe"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 150000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 466661.72,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-30T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:21",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recg8QhGImWoK3n1g",
                    "projectId": "daoip5:stellar:project:rango",
                    "projectName": "Rango",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recg8QhGImWoK3n1g",
                    "status": "Awarded",
                    "description": "Rango proposes activating Stellar multi-chain interoperability by integrating the Stellar chain, along with its prominent, secure DEXs and bridges, into the Rango ecosystem. Crypto users, from novice to professional, will be able to swap any token from any chain to Stellar and vice versa with the best rates and lowest fees, all without changing interfaces. Rango's smart routing engine suggests optimized routes, allowing users to select their desired route based on outcome amount, network fees, and speed.",
                    "fundsApprovedInUSD": 60000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1cfkJbDTpdfrr-EFJdd4Y05uhL-cV6gC0yNibE4_-cFw/edit?usp=sharing",
                        "stellar.productsAndServices": "The Rango product is fully operational for daily users, also providing cross-chain swap services across 50+ dapps and wallets. Rango’s core features include multi-chain interoperability, secure decentralization, and fast, optimized routing. With Stellar integration, all users and the Rango ecosystem of dapps and wallets will gain smooth, easy access to Stellar, further enhancing Rango’s multi-chain capabilities.  \nStellar is a promising blockchain network, given its mission to advance blockchain adoption within traditional finance, evidenced by partnerships with industry leaders like IBM, Deloitte, and Franklin Templeton.  \n\nBeyond expanding Rango’s ecosystem connections, Stellar holds numerical value for Rango's future growth. Maya chain, for example, currently shows statistics lower to Stellar's potential. Here are the current stats for Maya on Rango:\n\n-   Total swaps (to and from Maya): approximately $6 million, generating about $10K in annual revenue.\n    \n\nThis figure could serve as a conservative estimate for Stellar’s performance on Rango, excluding the projected revenue from major partners like Trust Wallet, which is expected to activate Stellar support.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "According to Rango's statistics from similar chains and considering current Rango users, we define these achievements as success:\n\n-   Achieving 10M USD cross-chain swap volume between Stellar and other chains in 3 months after launch\n    \n-   Achieving 40K cross-chain swaps between Stellar and other chains in 3 months after launch\n    \n-   Activation of stellar cross-chain swaps in at least 5 wallets or dApps 1 year after launch\n    \n\nHowever, according to changing market conditions, the terms must be updated/normalized once we reach the launch phase.",
                        "stellar.tractionEvidence": "Total swap volume : +$3B USD  \nTotal unique wallets : +770K  \nTotal swaps : +2.6M\n\nWallets, dapps that integrated Rango cross-chain swap infrastructure : +50 Including : Trust wallet, Binance Web3 wallet, Edge wallet, Exodus wallet, Orbs liquidity hub, soon Metamask,...",
                        "stellar.goToMarketPlan": "a. Partnerships and Listings\n\n-   Assets Listings: Ensure Stellar most used assets are successfully routed on Rango.\n    \n-   Ecosystem Activations: Negotiation of activating Stellar in Rango integrators' ecosystem especially in giant wallets like Trust Wallet and Binance web3 wallet.  \n    \n    b. Launch Campaign\n    \n-   Partnership Announcements: Co-announce with Stellar, its integrated bridge, DEX and wallets across social media and blog.\n    \n-   AMA Session: Host an X space AMA session with Stellar and Rango teams to engage the community and update about the integration.  \n    \n    c. Content and Education\n    \n-   Tutorials and Guides: Create step-by-step guides on how to reach Stellar via Rango.\n    \n-   Learning quests: Onboarding Rango and DeFi users to Stellar through incentivized quests.  \n    \n    d. Ongoing Marketing\n    \n-   Continuous Community Engagement: Regular updates on new features such as bridge, DEX, and wallets expansion, along with co-marketing for each new integration.",
                        "stellar.tranche1Deliverables": "a. Chain integration, To/From Stellar Bridge Activation\n\n-   Objective: Integrate Stellar chain and implement a Stellar bridge into Rango\n    \n-   Success Measure: Successful activation enabling users to bridge assets to/from Stellar\n    \n-   Timeline: 6 weeks\n    \n-   Budget: $6,000  \n    \n    b. Integration of Stellar Wallet Connect and Most used Extension Wallet\n    \n-   Objective: Integrate most used Stellar wallet through Wallet Connect and a extension like Lobstr\n    \n-   Success Measure: Users can connect and manage Stellar assets\n    \n-   Timeline: 4 weeks\n    \n-   Budget: $6,000  \n    \n    c. Integration of Stellar's Most Used DEX\n    \n-   Objective: Enable on-chain swaps of Stellar assets directly\n    \n-   Success Measure: Users can trade Stellar assets across Rango active chains\n    \n-   Timeline: 4 weeks\n    \n-   Budget: $12,000\n    \n\n* Since the deliverables are developed simultaneously, total MVP development estimated timeline : 12 weeks",
                        "stellar.tranche2Testnet": "Rango does not deploy testnets at the moment, new integrations go live on Rango local to test out different scenarios. Finally the approved integrations will be merged into Rango main infrastructure and application.",
                        "stellar.tranche3Mainnet": "a. Swap and bridge single step aggregation + audit\n\n-   Objective: Develop Rango Soroban contract to aggregate Stellar on-chain swap and bridge into a single transaction\n    \n-   Success Measure: Single-step transaction to/From Stellar is activated\n    \n-   Timeline: 12 weeks\n    \n-   Budget: $6,000 (development) + 24,000 (audit)  \n    \n    b. Testing and Quality Assurance of Stellar Integration\n    \n-   Objective: Ensure all integrations work seamlessly\n    \n-   Success Measure: Comprehensive testing with documented outcomes\n    \n-   Timeline: 2 weeks\n    \n-   Budget: Free of Charge  \n    \n    c. Stellar Most used Wallets, Best rate DEX and bridges R&D to expand and enhance Stellar experience on Rango\n    \n-   Objective: Support additional Stellar wallets, DEX and bridges\n    \n-   Success Measure: Expanded wallet support and enhanced routing\n    \n-   Timeline: Lifetime\n    \n-   Budget: Free of Charge  \n      \n    d. Onboarding users to Stellar\n    \n-   Objective: Educate and engage Rango and DeFi users with Stellar\n    \n-   Success Measure: Bridged volume to Stellar\n    \n-   Timeline: Post-launch (2 campaigns)\n    \n-   Budget: $6,000  \n    \n\n* Since the deliverables are developed simultaneously, total Mainnet development estimated timeline : 12 weeks",
                        "stellar.teamMembers": "Alex Ramirez",
                        "stellar.urls": {
                            "website": "https://app.rango.exchange/",
                            "codeRepository": "https://github.com/rango-exchange",
                            "videoURL": "https://youtu.be/pLWjaev_t3o?si=gq7i4HzXbEOxRGeu"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/RangoExchange",
                            "discord": "https://discord.gg/q3EngGyTrZ"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 20000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 49788.26,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-01-09T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-31:grantApplication:22",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-31",
                    "grantPoolName": "scf-31",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec1aqc0VAiLYnxnM",
                    "projectId": "daoip5:stellar:project:normal",
                    "projectName": "Normal",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec1aqc0VAiLYnxnM",
                    "status": "Awarded",
                    "description": "Normal enables Stellar investors to trade any Top 100 crypto with low fees and deep liquidity",
                    "fundsApprovedInUSD": 70000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/15tjQ9NMJO8RAL4p71bi3KqfW2uTLwWiB/view?usp=sharing",
                        "stellar.productsAndServices": "'-   xBTC, xETH, and xSOL (additional markets launching soon)\n    \n    -   Soroban tokens using Band price oracles to track the value of Bitcoin, Ethereum, and Solana respectively\n        \n    -   Direct integration with Lumenswap, StellarX, and Allbridge for wider asset support on Stellar DeFi\n        \n\n-   A decentralized order book of XLM and USDC markets for the assets above:\n    \n    -   On-chain order management via Soroban contracts with off-chain order matching for speed and scalability\n        \n    -   Supports market, limit, take profit, and stop-loss order types\n        \n-   Normal AMM\n    \n    -   A unique liquidity engine ensuring every order is filled quickly and at a fair price\n        \n    -   Manages synthetic token minting, bridging, and burning\n        \n    -   Distributes trading fees in the form of yield to liquidity providers",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "There are two key success metrics for us:\n\n1.  A resilient system that stands the test of time and market cycles\n    \n1.  Acquire $10m in TVL on Stellar - enabling anyone with USDC access on Stellar to reliably trade Top 100 cryptos on-chain",
                        "stellar.tractionEvidence": "-   1,000+ users\n    \n-   $220k TVL\n    \n-   Our current platform is not on-chain and will be migrated on-chain upon the launch of the Normal Protocol. The data above is restricted to our database and not publicly verifiable.",
                        "stellar.goToMarketPlan": "-   Partner with Beans to give their users Top 100 crypto investing via Stellar USDC\n    \n-   Token integration and co-marketing with:\n    \n    -   StellarX\n        \n    -   Lumenswap\n        \n    -   Aqua\n        \n    -   Soroswap\n        \n-   Sponsored videos on YouTube and threads on X with small to medium-sized influencers who focus on Stellar",
                        "stellar.tranche1Deliverables": "1.  The Normal Protocol\n    \n    a.  Description = A suite of Soroban programs for decentralized central limit order books and the Normal AMM for the minting, trading, and management of synthetic assets on Stellar that track the value of BTC, ETH, SOL (and any other crypto).\n        \n    a.  Completion\n        \n        i.  Open-source GitHub repository containing all smart contract code (https://github.com/normalfinance/normal-v1)\n            \n        i.  Market creation, order management, order matching, and liquidity provision testable via Stellar Lab\n            \n        i.  Successfully passing code tests with 80%+ coverage for the four features listed above\n            \n    a.  Deadline = February 1st, 2025\n        \n    a.  Budget = $30,000\n        \n        i.  Hire a Rust smart contract engineer (a core team hire, not a contractor) for 400 hours of Soroban work @ ~$50/hour = $20,000\n            \n        i.  Pay our co-founder and primary engineer, Joshua Blew, for 200 hours of Soroban work @ ~$50/hour = $10,000",
                        "stellar.tranche2Testnet": "1.  The Normal Trading Interface\n    \n    a.  Description = A Next.js web application deployed to https://stellar.normalfinance.io/ enabling beta testers to buy and sell xBTC, xETH, and xSOL on Stellar with market and limit orders and provide liquidity to the Normal AMM to earn yield.\n        \n    a.  Completion\n        \n        i.  Open-source GitHub repository containing all UI code (https://github.com/normalfinance/ui)\n            \n        i.  A complete list of Soroban testnet deployed program addresses available in our docs (https://docs.normalfinance.io/)\n            \n        i.  Live testnet trading and liquidity provision available on our web app (https://demo.stellar.normalfinance.io/)\n            \n    a.  Deadline = March 1st, 2025\n        \n    a.  Budget = $15,000\n        \n        i.  Hire a full-stack engineer (a core team hire, not a contractor) for 200 hours of Next.js work @ ~$50/hour = $10,000\n            \n        i.  Pay our co-founder and primary engineer, Joshua Blew, for 100 hours of Next.js work @ ~$50/hour = $5,000",
                        "stellar.tranche3Mainnet": "1.  Security Audit\n    \n    a.  Completion = A commit to our Normal-v1 GitHub repo for a new /audits folder containing the initial audit results and subsequent review(s).\n        \n    a.  Deadline = April 1st, 2025\n        \n1.  xBTC, xETH, and xSOL Markets\n    \n    a.  Description = Tradable assets via the Normal trading interface with full support for market and limit orders and liquidity provision.\n        \n    a.  Completion = Orders can be placed by anyone and are promptly executed at https://stellar.normalfinance.io/\n        \n    a.  Deadline = April 1st, 2025\n        \n    a.  Budget = $75,000\n        \n        i.  AMM liquidity - to be deposited and locked in the AMM to fill orders until enough market maker and trader volume is achieved = $60,000 ($20k/market)\n            \n        i.  Institutional market maker incentives - rebates on trading fees to attract outside liquidity = $12,000 ($4k/market)\n            \n        i.  Keeper bot servers - bots that carry out off-chain order matching and maintain protocol integrity = $3,000 ($1k/market)\n            \n1.  Launch GTM Campaign\n    \n    a.  Description = Relevant partnerships, integrations, and incentives for acquiring early users for Normal on Stellar\n        \n    a.  Completion\n        \n        i.  [ ] Live xBTC, xETH, and xSOL trading support on Beans and Lumenswap and/or StellarX\n            \n        i.  [ ] At least 3x co-marketing campaigns on X and Discord with listed Stellar partners\n            \n        i.  [ ] A public Google sheet with links for tracking all sponsored YouTube and X content along with engagement data and our ROI via users acquired and volume generated\n            \n    a.  Deadline = April 30th, 2025\n        \n    a.  Budget = $10,000\n        \n        i.  Partnership incentives - activity-based rewards and giveaways for partner users (i.e Beans, Lumenswap, StellarX, etc.) that trade or provide liquidity on Normal = $5,000\n            \n        i.  YouTube content sponsorship - 4x dedicated videos about Normal created by Stellar-specific YouTubers and 3x 30-second sponsor ad slots on Stellar-based videos = $2,500\n            \n        i.  X content sponsorship - 25x sponsored threads by esteemed Stellar thought leaders and users; 10x at launch and the remaining 15x spread out over 3 months = $2,500",
                        "stellar.teamMembers": "Joshua Blew",
                        "stellar.urls": {
                            "website": "https://www.normalfinance.io/protocol",
                            "codeRepository": "https://github.com/normalfinance/normal-v1",
                            "videoURL": "https://youtu.be/ugcGKJLsTvE"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/normalfi",
                            "twitter": "https://x.com/normalfi",
                            "discord": "https://discord.gg/xQMvceZjeS"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 46666.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 126722.17,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-02-19T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                }
            ]
        }
    ]
}