{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar",
    "type": "Foundation",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf-30",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:1",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recm9ZUkSwbmmjm9I",
                    "projectId": "daoip5:stellar:project:bousol-wallet",
                    "projectName": "Bousol Wallet",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recm9ZUkSwbmmjm9I",
                    "status": "Awarded",
                    "description": "Bousol is a blockchain-based digital wallet enabling secure, low-cost cross-border payments and financial services for underserved communities.",
                    "fundsApprovedInUSD": 149215.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1ggseronyv3m632ZIOncVRcJu6j8naWkkQWQ2Jjm5GLs/edit?usp=sharing",
                        "stellar.productsAndServices": "1.\tAdvanced Cross-Border Payments: Utilize Stellar for faster, low-cost remittances with stablecoins like USDC, reducing fees and enhancing accessibility.\n\t2.\tUSSD Integration: Enable access to Bousol services via simple mobile phones, leveraging Stellar’s low-cost transactions to increase financial inclusion.\n\t3.\tMerchant Payments: Use Stellar for instant settlements, allowing local businesses to accept digital payments and improve cash flow.\n\t4.\tPeer-to-Peer Lending (ROSCAs): Create Stellar-based smart contracts for secure group savings and lending, enhancing community finance.\n\t5.\tCompliance and KYC: Integrate Stellar’s KYC tools to improve security and regulatory compliance, building user trust.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "1. User Growth and Financial Access\n\t•\tOutput: 60,000 active users in the first 12 months (40,000 in Haiti, 20,000 in the diaspora).\n\t•\tImpact: Provides unbanked individuals with digital access to secure, low-cost transactions, savings, and credit, reducing reliance on traditional banks.\n2. Humanitarian Disbursement Efficiency\n\t•\tOutput: Partner with 3 organizations to conduct 100,000 digital aid transactions in the first year.\n\t•\tImpact: Improves aid delivery to vulnerable communities by reducing leakage and ensuring transparent, secure transfers.\n3. Merchant Adoption and Economic Growth\n\t•\tOutput: Onboard 100 merchants within 18 months to accept Bousol payments.\n\t•\tImpact: Promotes digital transactions, enhances local commerce, and reduces cash dependency.\n4. Empowerment via Group Savings and Credit (ROSCAs)\n\t•\tOutput: Establish 50 ROSCA groups with 1,000 participants in the first year.\n\t•\tImpact: Supports community-based savings and lending, fostering economic resilience.\n5. Inclusive Access through USSD\n\t•\tOutput: Non-smartphone users access Bousol via USSD in the first year.\n\t•\tImpact: Expands financial access to all users, reducing the digital divide.\n6. Lower Remittance Costs\n\t•\tOutput: Cut remittance fees by 50% for diaspora users.\n\t•\tImpact: Increases disposable income for recipients, supporting economic stability.\n7. Scalability Beyond Haiti\n\t•\tOutput: Expand to two more markets within 3 years.\n\t•\tImpact: Broaden financial inclusion globally by replicating success in similar underserved regions.\nBousol aims to enhance financial access, empower communities, and drive sustainable economic growth through innovative digital solutions.",
                        "stellar.tractionEvidence": "https://stellar.expert/explorer/public/account/GDBY72P52GCJTNXRXQYEI2XY3IEZVAM67A2MJ34CP24PKNYFGFWUB52W, https://play.google.com/store/apps/details?id=com.bousol.wallet, https://apps.apple.com/us/app/bousol-paon-bleu-inc/id6503965498",
                        "stellar.goToMarketPlan": "Our go-to-market plan for Bousol focuses on leveraging humanitarian partnerships and initiatives to drive adoption, especially in underserved, cash-based communities:\n1. Humanitarian Partnerships and Integrations\n\t•\tPartnerships with NGOs and Humanitarian Organizations: Build on existing collaborations with organizations like the Inter-American Development Bank (IDB), and Mercy Corps, and future ones like the World Food Program (WFP), and Food and Agriculture Organization (FAO) to use Bousol for digital disbursements in humanitarian aid programs. This highlights Bousol’s reliability for distributing aid securely and transparently, ensuring funds reach those who need them most.\n\t•\tIntegration with Humanitarian Programming: Develop tailored solutions for NGOs and aid agencies to facilitate bulk disbursements, cash-for-work programs, and other financial aid distribution through the Stellar Disbursement Platform, enhancing the impact of humanitarian efforts.\n2. Community-Centric Outreach and Education\n\t•\tLocal Partnerships and On-the-Ground Activations: Collaborate with local community organizations, NGOs, and humanitarian entities to promote Bousol directly to beneficiaries in community centers, markets, and other accessible locations, ensuring awareness and accessibility for all.\n\t•\tUser Education Workshops: Conduct workshops and training sessions with local community leaders and aid organizations to educate users about the benefits of digital financial services through Bousol, emphasizing security, ease of use, and cost-effectiveness.\n3. Target Audience Segmentation\n\t•\tHumanitarian Beneficiaries and Local Communities: Focus on local users in Haiti who are recipients of humanitarian aid, as well as low-income households, small merchants, and unbanked individuals who need accessible financial services.\n\t•\tDiaspora Communities Supporting Local Families: Target Haitians and Afro-Caribbean immigrants in the US and Canada who send remittances to family members in Haiti, highlighting Bousol as a secure, low-cost alternative to traditional remittance channels.\n4. Localized Product Promotions and Incentives\n\t•\tIncentives for Humanitarian Recipients: Offer incentives, such as transaction fee waivers or bonuses, for users who receive aid disbursements through Bousol to encourage ongoing use of the platform.\n\t•\tReferral Programs and Onboarding Bonuses: Encourage new users, especially those in rural and underserved areas, to join Bousol through referral incentives and bonuses for first-time transactions.\n5. Digital and Influencer Marketing\n\t•\tDigital Campaigns Focused on Humanitarian Impact: Create targeted digital marketing campaigns that highlight the positive impact Bousol is making in humanitarian settings, emphasizing secure and efficient aid distribution and financial empowerment.\n\t•\tInfluencer Marketing and Testimonials: Partner with local influencers, humanitarian field workers, and aid beneficiaries to share success stories and testimonials, building trust and awareness.\n6. Key Partnerships for Scaling and Sustainability\n\t•\tCollaborations with Local Payment Providers and Financial Institutions: Continue integrating with local payment systems like MonCash, credit unions, and banks to offer cash pickup, deposits, and other essential services, making Bousol an accessible platform for both aid distribution and everyday transactions.\n7. Continuous Feedback and Iteration\n\t•\tMonitor Humanitarian Program Feedback: Regularly gather feedback from humanitarian partners and beneficiaries to optimize the platform’s user experience and functionality, ensuring it meets the needs of those most reliant on these services.\n8. Expansion to Other Humanitarian Markets\n\t•\tScalability Beyond Haiti: After establishing a strong base in Haiti, expand Bousol’s model to other regions with humanitarian needs, leveraging partnerships with international organizations and proven success in aid distribution to scale effectively.\nBy prioritizing humanitarian impact and partnerships, Bousol aims to become a trusted platform for both aid distribution and digital financial empowerment in underserved communities.",
                        "stellar.tranche1Deliverables": "1: Humanitarian Program Digital Payments\n\t•\tDescription: Develop Bousol Wallet features for instant digital payments to beneficiaries, ensuring secure and transparent transactions.\n\t•\tMeasure of Completion: Deployment of wallet with customized features for humanitarian aid programs, pilot testing with 1-2 organizations, and 100 community members completing transactions.\n\t•\tEstimated Completion Date: 6 weeks from project start.\n\t•\tBudget: $28,059\n2: Merchant and Cash Pickup Feature\n\t•\tDescription: Enable users to withdraw digital currency from local merchants, integrating cash pickup with existing local payment systems like Moncash.\n\t•\tMeasure of Completion: Feature deployment, integration with Moncash and 10 merchants, and 50 successful transactions.\n\t•\tEstimated Completion Date: 5 weeks from MVP.\n\t•\tBudget: $22,044\nIntegration with KYC Vendor\n\t•\tDescription: Integrate KYC vendor (e.g., Sumsub) for tiered user verification to ensure compliance and security.\n\t•\tMeasure of Completion: Successful integration, 100 users verified through KYC system, and user feedback.\n\t•\tEstimated Completion Date: 6 weeks from MVP.\n\t•\tBudget: $24,620",
                        "stellar.tranche2Testnet": ": USSD Integration\n\t•\tDescription: Develop USSD functionality for non-smartphone users to access Bousol services using basic mobile phones.\n\t•\tMeasure of Completion: USSD feature deployment, 100 transactions completed in the first month, and user feedback.\n\t•\tEstimated Completion Date: 5 weeks from Testnet start.\n\t•\tBudget: Access to Stellar LaunchKit for audits and infrastructure credits (no direct XLM award).\n\t•\tDeliverable 5: ROSCA Group Savings and Lending Feature\n\t•\tDescription: Implement ROSCA (Rotating Savings and Credit Association) group savings and lending features using Stellar smart contracts.\n\t•\tMeasure of Completion: Deployment of feature, 10 ROSCA groups created, 200 active users, and user feedback.\n\t•\tEstimated Completion Date: 6 weeks from Testnet.\n\t•\tBudget: Covered by Stellar LaunchKit credits.",
                        "stellar.tranche3Mainnet": "Enhanced Admin Panel\n\t•\tDescription: Develop and enhance the admin panel for better transaction monitoring, user management, and analytics.\n\t•\tMeasure of Completion: Deployment of enhanced admin panel with listed features and feedback collection.\n\t•\tEstimated Completion Date: 6 weeks from Mainnet start.\n\t•\tBudget: $24,320\nStellar Disbursement Platform (SDP) Integration\n\t•\tDescription: Integrate with Stellar Disbursement Platform (SDP) for real-time monitoring and compliance for humanitarian transactions.\n\t•\tMeasure of Completion: Successful integration, real-time tracking of 1000 transactions, and feedback collection.\n\t•\tEstimated Completion Date: 4 weeks from Mainnet.\n\t•\tBudget: $20,700",
                        "stellar.teamMembers": "judejb",
                        "stellar.urls": {
                            "website": "https://bousolapp.com",
                            "codeRepository": "https://docs.google.com/document/d/1ESDab04hGMfqeoW4tudEYuwRqnBm5KzEs7xmg6SPl0Q/edit?usp=sharing",
                            "videoURL": "https://youtu.be/H9IUqm4CyYE"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 149215.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 799215.11,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:2",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec7yuazvycNZIcvj",
                    "projectId": "daoip5:stellar:project:coindisco",
                    "projectName": "Coindisco",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec7yuazvycNZIcvj",
                    "status": "Awarded",
                    "description": "Galaxy Ramp offers an onramp for any token on the Stellar network to help users simplify the purchase of Stellar tokens with fiat using Soroban. Existing solutions do not allow direct purchase with a card or bank account on Stellar any tokens except XLM or USDC.",
                    "fundsApprovedInUSD": 96000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1aTdBr2zLeHGrxvXEymB6L2w5LqHBASBUZiw_rJTpI5M",
                        "stellar.productsAndServices": "Existing on-ramp providers currently only support XLM and USDC as the only Stellar tokens users can purchase through their services. \nGalaxy Ramp is a new on-ramp solution that allows users to purchase any Stellar token by combining familiar fiat on-ramp experience with the power of Soroban smart contacts. \nThis solution will leverage an on-ramp API integration of one of Coindisco's trusted partners. \nWe will build a website, back-end infrastructure and Soroban smart contacts logic for this solution.\nThe website will allow users to connect their Stellar wallet and initiate purchases of popular Stellar tokens.\nIn order to purchase a Stellar token, a user will first need to purchase Stellar USDC through our on-ramp partner. Stellar USDC will be used as a “value transfer asset” in this flow. \nWhen a user initiates a transaction, we will determine the best USDC rate for the asset and display that on the interface along with any fees. \nWhen a user commits to the transaction, a new proxy Stellar wallet will be created by a Soroban smart contract. That wallet will be associated to user-owned Stellar wallet via our back-end. \nThat proxy wallet will be controlled by our back-end and Soroban smart contacts. An asset trustline will be automatically established on the proxy wallet.\nThe purchased USDC in the transaction will first arrive to the proxy wallet. From there, we will leverage custom back-end service and multiple Soroban smart contracts to find the best asset-to-USDC rate, convert USDC to the asset a user request in the flow, and send the obtained asset balance to user's wallet address.  \nWe will also create a widget that will allow other products on the network to integrate this product directly and securely.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Based on our market research, we expect Galaxy Ramp to be a popular solution among both Stellar users and product creators. We also expect demand from asset issuers on the network who will look for user-friendly solutions for selling their tokens. Our prospected targets for the first launch year:\n- 20,000+ unique customers \n- $500,000+ worth turnover\n- 30+ unique Stellar assets purchased by users. \n\nAfter the initial launch, we will be offering Galaxy Ramp integration to popular wallets and products on the network. The target is to have the Galaxy Ramp widget solution integrated into 5 unique products on the Stellar network.",
                        "stellar.tractionEvidence": "Since its launch in Q1 2024, Coindisco has demonstrated stable growth in userbase and revenue, achieving over $100,000 in turnover within the first couple of months since launch. \nWith Coindisco, we have established live integrations with leading on- and off-ramp providers such as Moonpay, Revolut, and Stripe, enabling thousands of users worldwide to seamlessly buy crypto. \nWorking with multiple on ramp providers, researching customer behavior and the state of the crypto landscape allowed us to develop unique features like 'True fee' and 'Insights' that make Coindisco a stand-out product among other solutions on the market according to user surveys.  \nWe will leverage that experience when creating the Galaxy Ramp, which will further enhance our offerings and provide a new unique service for the Stellar network that meets the needs of the growing ecosystem.",
                        "stellar.goToMarketPlan": "We will launch and promote the Galaxy Ramp web application on social networks and at various fintech conferences. As we integrate with more onramp providers, we'll carry out cross-promotion activities to attract more users. The functionality will also be embedded into the existing Coindisco web and mobile apps. We will also do our best to integrate the Galaxy Widget or SDK into the most popular Stellar products.",
                        "stellar.tranche1Deliverables": "Deliverable 1:\nDevelop Galaxy Ramp Soroban smart contract;\nDevelop backend services (Route builder, Wallet manager, Wallet listener, Swap listener);\nDevelop Galaxy Ramp user interface;\nDeliverable 2:\nTesting as-is without the integrations with 3rd party services.\nHow to measure completion: The code will be available on our GitHub. The interface will be available on the \"beta\" website.\nCompletion date:  01.10.2024\nBudget: $68,000.00",
                        "stellar.tranche2Testnet": "Deliverable 1:\nDeployment of the Soroban contracts to Stellar Testnet;\nDeliverable 2:\nIntegration with the Swap Router on Testnet;\nIntegration with the onramp provider’s sandbox.\nHow to measure completion: Galaxy Ramp will be available on Testnet.\nCompletion date:  01.11.2024\nBudget: $18,000.00",
                        "stellar.tranche3Mainnet": "Deliverable 1:\nDeployment of the Soroban contracts to Mainnet;\nIntegration with the swap router on Mainnet;\nDeliverable 2:\nTesting with real money and release.\nHow to measure completion: Galaxy Ramp will be live on Pubnet and available globally.\nCompletion date:  01.12.2024\nBudget: $10,000.00",
                        "stellar.teamMembers": "Vitaly",
                        "stellar.urls": {
                            "website": "https://coindisco.com/",
                            "codeRepository": "https://github.com/coindisco",
                            "videoURL": "https://drive.google.com/file/d/1je8N-mDUdGI5-b_Lmz1to9434H-9mTU8"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/coindisco"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 96000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 330151.27,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-06-27T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:3",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recRfE25wZkOThcrq",
                    "projectId": "daoip5:stellar:project:rarible.com-and-stellar",
                    "projectName": "Rarible.com & Stellar",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recRfE25wZkOThcrq",
                    "status": "Awarded",
                    "description": "Rarible is excited to deliver a world class NFT experience to Stellar.  Rarible will integrate Stellar NFT's into Rarible.com, and in turn expand the ecosystem, user adoption and multiply transactions to a whole new level.",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://www.mermaidchart.com/raw/b64d6736-f59c-47cf-9f73-70641eb8a4f0?theme=light&version=v0.1&format=svg",
                        "stellar.productsAndServices": "Infrastructure\nAPI suite (see https://rarible.org/)\nMint and Trade NFT’s Via stellar assets",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Impact\n\nNew Collection Launches:\n- Measure the number of new Stellar-based NFT collections created on Rarible\n- Track the diversity of creators adopting Stellar for their NFT projects\nTransaction Volume:\n- Monitor the increase in on-chain transactions related to Stellar NFTs\n- Observe the growth in trading volume for Stellar-based NFTs on Rarible\nUser Adoption:\n- Track the number of unique wallets interacting with Stellar NFTs on Rarible\n- Measure the percentage of Rarible users who engage with Stellar-based NFTs\nCross-Chain Activity:\n- Analyze the number of users engaging with both Stellar and other blockchain NFTs on Rarible\n- Monitor cross-promotion and cross-collection activities between Stellar and other supported blockchains\nEcosystem Expansion:\n- Track the number of new Stellar-focused NFT projects and communities formed on Rarible\n- Measure the growth of Stellar-based NFT utilities and use cases (e.g., gaming assets, digital collectibles, access tokens) launched through Rarible",
                        "stellar.tractionEvidence": "https://www.similarweb.com/website/rarible.com/",
                        "stellar.goToMarketPlan": "Rarible is excited to deliver a world class NFT experience to Stellar.\nRarible’s standard contractual model includes 4 elements:\nRarible has worked with many different chains, teams and foundations,\nand can provide a flexible contracting strategy to support our client’s\nneeds.\n\nFor Stellar, we propose a phased approach to acceptance and payment\nas follows:\n\nPhase 1: Integration\nLicensing and configuration for Stellar NFT minting and trading on\nRarible.com.\n\nProposed Phase 2\n*Note: A Secondary agreement will be required to initiate Phase 2\nPhase 2: Marketing\nLicensing and configuration of Rarible NFT infrastructure to\nsupport new chain\nAnnual support and maintenance subscription for deployed\nsoftware\nMint pack licensing for per mint platform fees\nCoordination services for marketplace success - community and\ncreator onboarding.\n\nDescription: Deploying Rarible NFT infrastructure on Stellar so that\nRarible.com and other parties can mint and trade NFTs on Stellar\nvia $XLM.\n\nCompletion criteria: Demonstration of NFT minting and trading\nworkflow on Stellar explorer using Rarible delivered contracts and\nsystems.\n\nDelivery timeframe: Generally 90 days for non-EVM chain.\nCreator enablement on Stellar marketplace via Rarible.com.\n\nPhase 3: Incentives\nIncentivized Minting for NFT community creation and growth\nRarible believes the best way to “cold-start” a vibrant NFT ecosystem is\nthrough the incentivization of both creators and early adopters. There\nare two mechanisms for incentivizing early adopters to pursue the\nminting mechanics and make it a habit. Those are by offering free mints,\nand by selectively delivering airdrops to the most active minting and\ntrading wallets. Rarible manages campaigns related to the former, while\nwe can provide a playbook to our customers on incentivizing airdrops,\nwhile Rarible itself does not conduct these.\nDescription: Following the acceptance of Phase 1 deliverables,\nRarible will coordinate the strategy and delivery of the first 90 days\nof Stellar creator minting. This 90 day plan will feature over 100\nartists, creators and projects, and will be designed to drive\nawareness and adoption of Stellar NFTs within the Stellar\ncommunity, as well as into the broader Rarible.com ecosystem.\nHighlights include:\n\nRarible Takeover Week - First 5 drops will be featured for 5\ndays on the top of Rarible.com homepage. Associated\nmarketing\n\nDrop schedule managed by Rarible for the first 3 months with\nongoing marketing support.\nNote that Rarible will manage incentivization of creators as\nneeded to successfully deliver this program. Incentives are\nincluded in Phase cost.\nAcceptance criteria: Stellar representative reviews Artist /\ncollector line up for Rarible.com take over, and approves creator\ntargets for 90 day campaign.\nPayment terms: Due upon Phase 2 kickoff (following Phase 1\nacceptance\nDelivery timeframe: Rarible.com takeover week within 60 days of\nPhase 2 kickoff. Project runs for 90 days following the initial\ntakeover launch.\nDescription: Following the acceptance of Phase 2 deliverables, the\nStellar marketplace on Rarible.com will be ready to offer mints.\nHistorically, Rarible charges a $2 / mint platform fee for each mint\nconducted on Rarible.com and on Rarible X marketplaces. This fee\ncovers the scalable costs of infrastructure as mints increase. For a\nMinting Incentivization campaign, Rarible reduces the platform\ncost to $0/mint for a specified number of mints, removing the cost\nof minting as a barrier to participation. Rarible instead sells a “mint\nNote, that following the initial Mint Pack based incentivization phase,\nRarible generally recommends that the customer “turn on” a $2 / mint\nplatform fee, where that fee is used to offset mint pack costs, and to\nfund an ongoing creator enablement fund, thereby making the ongoing\noperation of the marketplace self sustaining.\nNote, while Rarible does not operate chain specific airdrop incentives,\nwe would recommend allocating ~ $200,000 of airdrops for the first 90\ndays.\n\nPhase 4: Ongoing Maintenance and Support Annual cost to manage ongoing support of Stellar Marketplace on\nRarible.com\npack” to the customer with a specified number of mints at a\ndiscounted price.\nFor the initial 90 days of no-cost minting, Rarible recommends\na 500,000 mint pack at the cost of $200,000. This dramatically\nreduces the cost per mint to $.40.\nAcceptance criteria: This mint pack is accepted upon completion\nand acceptance of Phase 2 deliverables.\nPayment terms: Due upon Phase 3 kickoff (following Phase 2\nacceptance)\n\nDescription: Rarible provides a support team dedicated to the\nongoing success of your marketplace, creators and users. We\nhandle 1st line support via FAQs and a ticketing system, and\nmanage and deliver to SLAs.\n\nAcceptance criteria: Annual customer review. Acceptance due\nprior to expiration of annual agreement.\nPayment terms: Due on acceptance",
                        "stellar.tranche1Deliverables": "Tranche 1 - Kick off (50K) \n\n- Implement Stellar blockchain indexing in Rarible's backend\n- Set up nodes to sync with the Stellar network\n- Create data models to store Stellar blockchain data\n\nAPI Development\n- Develop new API endpoints for Stellar-based NFTs\n- Extend existing APIs to support Stellar NFT operations\n- Implement Stellar-specific logic for minting, transferring, and burning NFTs\n\nSDK Updates:\n- Update Rarible SDK to include Stellar blockchain support\n- Add methods for interacting with Stellar-based NFTs",
                        "stellar.tranche2Testnet": "Tranche 2 - Testnet  (50K)\n\nWallet Integration:\n\n- Integrate Stellar's preferred wallet solution (e.g., Freighter or Albedo)\n- Implement wallet connection and transaction signing for Stellar",
                        "stellar.tranche3Mainnet": "Tranche 3 - Mainnet (50k)\n\nUser Interface Updates:\n\n- Add Stellar as a blockchain option in Rarible's UI\n- Implement UI components for Stellar-specific features\nCollection Creation Process:\n\n- Develop a UI flow for users to create Stellar-based NFT collections\n- Implement backend logic to register new collections on the Stellar blockchain\n- Update indexing service to capture new collection data\nTesting and Deployment:\n\n- Conduct thorough testing of the entire integration\n- Deploy updates to staging environment\n- Perform final tests and deploy to production",
                        "stellar.teamMembers": "Anna Tobin",
                        "stellar.urls": {
                            "website": "https://Rarible.com"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/rarible"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 101656.22,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-12-05T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:4",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recEC30UHrhQ3h2Ue",
                    "projectId": "daoip5:stellar:project:token-tails",
                    "projectName": "Token Tails",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recEC30UHrhQ3h2Ue",
                    "status": "Awarded",
                    "description": "Develops RWA web3 gaming franchise to help real cats in a shelter with real-world integration between real and virtual NFT cats",
                    "fundsApprovedInUSD": 96000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.tokentails.com/team-and-backing/technical-documentation",
                        "stellar.productsAndServices": "We did a huge market research and found a path which we should follow in order to get higher retention rate and make an impact on global scale\n- Wallet activator - fund each user account wallet with 0.1 XLM to activate it upon sign-up on the first on-chain interaction. It'll allow us to onboard web2 users and to go cross-play on Google Play Store, Apple app store, Steam, Epic store so we won't be limited to Browser ( we are launched on TG as well )\n- Enchantment - real cats in a shelter linking system via enchantments Smart contract with pre-existing NFT cat to grant certain stats and improvements to existing cat. It'll allow for existing NFT cat owner which is not linked with real cat in a shelter to both donate to multiple cats and to get multiple enchantments for a single NFT cat making it stronger, faster and with extra perks based on type of enchantment. The better enchantment, the higher the cost - price will be based on the amount which cat needs to be healed and it'll reflect enchantment type rarity and power.\n- Stake to craft - staking program which yields random NFTs such as NFT Wearables and NFT Consumables ( which are destroyed upon usage ) OR enchantments that will be linked with NFT cat. User will need to stake $TAILS tokens.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "- Global recognition\n- 500k users\n- 50k DAU\n- Partnership with 25 major cat shelters\n- 1000 saved cats on monthly basis\n- Transforming charity into interactive fun-to-do thing where even users who are not into charity will be interested in participating as it'll be a part of the game",
                        "stellar.tractionEvidence": "timeline:\n- Task-on campaign to get first users - attracted first 10k members : https://taskon.xyz/campaign/detail/13703047 \n- 6.6k preregistrations with Earn Alliance + AMA - 6.6k early adopters -> https://www.earnalliance.com/mints/token-tails-badge\n- Rockit pre-accelerator - got connected with mentors - validated on business level -> https://x.com/tokentails/status/1793559617647300900\n- Weekly zealy quests for 3 months, 300 early adopters organically -> https://zealy.io/cw/tokentails\n- Won technorama, pitched to several hundred people individually + publicly pitched to 200 people -> https://x.com/tokentails/status/1798033726393467016 , won e-contest with over 3.4k votes -> https://projektas.lrytas.lt/technorama-2024/dalyvis/23\n- Earn Alliance AMA - over 100 listeners who likes our idea and wished us a success -> https://x.com/EarnAlliance/status/1800163829768401291\n- LoveTap X Wizardia X Token Tails 3-way contest to win NFTs - attracted hunders of users -> https://x.com/LoveTapToken/status/1803726904949977218\n- Listing on Isotopic - increased web traffic -> https://x.com/tokentails/status/1809141171165552667\n- Carbify campaign - global public good collab, validated positive philantropists engagement -> https://x.com/tokentails/status/1811408751288529056\n- Listing on DAppRadar - increased web traffic, displayed high retention rate -> https://x.com/tokentails/status/1813444834407129239\n- Listing on SpinTop - increased web traffic, displayed high retention rate -> https://x.com/tokentails/status/1818197681149194383\n- Intract quest to win 10 cats - hundreds of people participated, were interested to play Token Tails -> https://www.intract.io/quest/66b35560ddcc9d45b303bbfa\n- Cross-questing with other 6 games\n- Reached 25k players -> https://x.com/tokentails/status/1826562304575766859\n- Magic store validation - over 30k+ of votes -> https://x.com/MagicStoreWeb3/status/1833807767871631486",
                        "stellar.goToMarketPlan": "Cross-questing with other games ( we already started doing that )\nPaid marketing campaign to create co-marketing activities with cat-related influencers\nParticipate in live talks, X spaces, AMA sessions ( we already started doing that )\nJoining every crypto-related event to bring awareness towards Token Tails project\nKOLs onboarding by our Ambassador in Asia - Sky Wee, full list ( check subsheets as well ) -> https://docs.google.com/spreadsheets/d/1FnvyJfql7LO428CaoxA3r5uWT2D_4AzqKDZQ93Rc8qs \nPR across major web2 gaming and web3 portals \nHost roundtable show -> https://roundtable.live/\nPartnership with 5 more cat shelters ( we have 2 in queue, we already partnered with Pink Paw -> https://www.facebook.com/rozine.pedute )\nOnboard first 500k users\nReach 50k DAU\nstart launchpad IDOs on: DAO Maker, Magic Square, SpinTop, DAppList, N3MUS, Poolz Finance, Spores Network, Kommunitas ( partnered )\nLaunch ambassadors program to onboard people who wants to grow with and for Token Tails\nLaunch token on MEXC ( we have good offer ) + Gate ( if they'll be up to price reduction ) + Probit free listing\nExpand functionalities, release more mini-games to make it more attractive by introducing more NFT utilization activities\nHost gaming tournaments\nWe are partnered with 29 marketing companies / agencies / firms to push us in terms of marketing post-launch",
                        "stellar.tranche1Deliverables": "ESTIMATES breakdown in google sheet -> https://docs.google.com/spreadsheets/d/1ldrlgLhCdIMf8ShYMOhUwtkR0kcVwHp9KnALooRSpNI/edit?usp=sharing\n\n1. Wallet activator\n    a. Brief description: Fund each user Stellar account wallet ( pre-created on server side ) with 0.1 XLM to activate it upon sign-up on the first on-chain interaction ( on-demand ), activated with internal system on cross-play\n    b. How to measure completion: After first on-chain interaction - wallet will be funded and activated for follow-up on-chain transactions. Account wallet address will be displayed in profile section, can be tracked.\n    c. Estimated date of completion: November\n    d. Budget: $4500 ( ŽB X 50hours + EL X 10 hours )\n2. Enchantments smart contract\n    a. Brief description: Smart contract to link existing cat with enchantment, where each enchantment has unique id and cat holds an array of enchantments\n    b. How to measure completion: Contract is pushed to open-sourced repository and has unit tests that covers required functionality, provided with the documentation on how to deploy and interact with smart contract\n    c. Estimated date of completion: November\n    d. Budget: $4000 ( EL X 30 hours + LK X 25 hours )\n3. Stake to Craft\n    a. Brief description: Users will be allowed to stake $TAILS tokens on Stellar for a specific period of time ( ranging from 1 week to 6 months ) to craft items, the bigger value of staked tokens, the higher rarity of items will be unlocked. They'll enchantments as rewards, in our tokenomics we have a pool which will be distributed for rewards, in case of staking, half of rewards will be distributed to user in a form of enchantments, another half will be used to cover the cat in a shelter needs as each cat will be linked with an enchantment. \n    b. How to measure completion: Contract is pushed to open-sourced repository and has unit tests that covers required functionality. Implementation is available to be tested on https://test.tokentails.com. User can stake tokens and earn rewards.\n    c. Estimated date of completion: December\n    d. Budget: $17200 ( ŽB X 100 hours + LK X 255 hours )\n4. Enchantment system within game ecosystem\n    a. Brief description: Creation of enchantments creation in CMS, enchantments linking system on server side, integration between NFT cat and Enchantments Soroban smart contract, marketplace of enchantments, enchantments linking for selected cat ( from both FE and BE perspective ), on-chain enchantments funds distribution. Preparation of initial pool of enchantments together with cat shelters to start providing aid to cats in need. Create enchantments types: Coins boosters, Stats boosters and embed with: Catbassadors, Purrquest, Clash of Claws games, rewards mechanics, create special effects.\n    b. How to measure completion: Player can get buy an enchantment, see the enchantments and links with real cats in a shelter, experience the enchantments in-game ( effects & stats boosts ), stack enchantments ( buy multiple enchantments to boost NFT cat )\n    c. Estimated date of completion: January\n    d. Budget: $62300 ( ŽB X 650 hours + ER X 420 hours )",
                        "stellar.tranche2Testnet": "1. Enchantments smart contract deployment on testnet, testing\n    a. Brief description: Testing enchantments smart contract with enchantment system integration, fix bugs if occurs\n    b. How to measure completion: Enchantment system integration is fully working on testnet integrated web https://test.tokentails.com  and telegram test env game https://t.me/CatbassadorsTestBot\n    c. Estimated date of completion: February\n    d. Budget: $2000 ( EL X 10 hours + DŠ X 50 hours )\n2. Stake to craft deployment on testnet, testing\n    a. Brief description: Testing stake to craft implementation and integration with game, check if rewards are being unlocked\n    b. How to measure completion:  Stake to Craft will be live on testnet integrated web https://test.tokentails.com and telegram test env game https://t.me/CatbassadorsTestBot\n    c. Estimated date of completion: February\n    d. Budget: $2000 ( EL X 10 hours + DŠ X 50 hours )",
                        "stellar.tranche3Mainnet": "1. Enchantments smart contract deployment on mainnet, testing\n    a. Brief description: Testing enchantments smart contract with enchantment system integration, fix bugs if occurs\n    b. How to measure completion: Enchantment system integration is fully working on mainnet offical web https://tokentails.com and telegram game https://t.me/CatbassadorsBot \n    c. Estimated date of completion: February\n    d. Budget: $2000 ( EL X 10 hours + DŠ X 50 hours )\n2. Stake to craft deployment on mainnet, testing\n    a. Brief description: Testing stake to craft implementation and integration with game, check if rewards are being unlocked\n    b. How to measure completion: Stake to Craft will be live on mainnet official web https://tokentails.com and telegram game https://t.me/CatbassadorsBot \n    c. Estimated date of completion: February\n    d. Budget: $2000 ( EL X 10 hours + DŠ X 50 hours )",
                        "stellar.teamMembers": "Zygimantas Bagdzevicius",
                        "stellar.urls": {
                            "website": "https://tokentails.com",
                            "codeRepository": "https://github.com/zbagdzevicius/tokentails",
                            "videoURL": "https://www.youtube.com/watch?v=AJNlfP39WeM",
                            "pitchDeck": "https://docs.google.com/presentation/d/1G8F_HxNLwxkBSZ9XAcnvtH9SQFBjtI6Wq_2Y6FEXLdQ"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/in/zygimantas-bagdzevicius/",
                            "twitter": "https://x.com/tokentails",
                            "discord": "https://discord.gg/4FVYmnd7Hg"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 96000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 536005.55,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:5",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recq4UtMlUBoNw4TP",
                    "projectId": "daoip5:stellar:project:tokenops",
                    "projectName": "TokenOps",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recq4UtMlUBoNw4TP",
                    "status": "Awarded",
                    "description": "Companies can create&track token distributions (vesting,payroll,grants,airdrops), VCs keep track of their portfolios of vesting tokens.",
                    "fundsApprovedInUSD": 60000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://vestinglabs.notion.site/Tokenops-Stellar-Vesting-Architecture-2f0f52e6b1d04369a917cf7a7e3e3c32?pvs=4",
                        "stellar.productsAndServices": "TokenOps.xyz is a token operations and lifecycle management platform.\nIt is composed of two products for two different target customers: \n1. Token Issuers\n2. Early stage investors (VCs, Investment DAOs, angel investors) \n\n1.Token Issues\nTokenOps helps crypto CFOs, Fin-Ops/accounting professionals with track their existing on-chain token distributions and create new ones (vesting, payroll, grants, airdrops...). \nIt's used already by leading organization in web3, like Request, Morpho, 1inch, CowSwap, etc.\nWe offer a range of open-source and fully audited smart contracts which can be used with the users wallet/multisig (it's fully non-custodial):\n- TokenOps time-lock contracts\n- Sablier token streaming protocol \n- Superfluid token streaming protocol\n- Custom contracts (if your team has already developed and can be \"imported and managed\" through our interface)\nOur unique value proposition is being an aggregator that can work with any underlying contract. Therefore, we are not directly competing with any project in the field of token vesting / distribution, as we provide additional tooling and usability on top of them. \n\nHere are:\n- A product walkthrough deck: https://docsend.com/view/8jvjd3i4pvjhibqx\n- Demo video: TokenOps - Product Update - Watch \n\n2. Early stage investors (VCs, Investment DAOs, angel investors) \n\nTokenOps.xyz is a portfolio management and operations tool that allows you to streamline tedious back-office, fin-ops & accounting, and get powerful insights:\n- Track future tokens and vesting tokens portfolio (incl other vestees and what they do with their tokens)\n- Import and track any (custom) vesting smart contract, and token streams (Superfluid, Sablier, Hedgey, etc.)\n- Claim vested tokens from a single place, with a timely alerting system\n- Integrate the data into web2/web3 accounting tools\n\nProduct demo deck: https://docsend.com/view/qbbkiktjkg8ws7ak\nDemo video: https://www.loom.com/share/c22d753f98c34719a62069f71193d78a?sid=ae79ac1c-d550-4ed8-a2df-67933030d448\nSteller integration: Building on top of the timelock example and using Claimable Balances, we plan to develop a fully featured reference token vesting library and contract for the Stellar ecosystem. We will fully integrate it within the TokenOps platform, providing a frontend UI. Uplifting the token distribution features to the same level users are accustomed to on other leading EVMs.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Higher and more sticky TVL on Stellar. More transactions. \nMore companies launching tokens and using Stellar as their primary chain for financial operations (treasury, payroll, etc.)\nAncillat: also have Stellar Foundation as a user to manage grants payment and lifecycle",
                        "stellar.tractionEvidence": "You can see on our website the logo of the companies that currently using our product, from EVM L1/2 like Taiko, Meld, Redbelly, to DeFi OG projects (1inch, Cowswap, Morpho, etc) and leading VC (Animoca, Polymorphic, etc.). \nReceived grants from Starknet, Meld, Polygon...",
                        "stellar.goToMarketPlan": "Our initial GTM is rooted in virality. Investors and projects have strong benefits and network effects of being on the same platform, which will lead to increased progressive adoption and integration into other tools. \nThrough our product for VCs we can have early access to their portfolio companies, pre-TGE. This allows us to onboard them early on our platform and keep servicing them through powerful integrations with other tools in the financial operations and backoffice stack. This enables a positive viral loop and network effects. \nAs we expand our services also towards on-chain payroll and compensation, we can upsell and cross-sell to existing and new customer. In addition, we will also onboard customers in web2 that need a fast and cheap way to pay for good and services with stable coins on-chain. We will become a player in international/cross-boarder payments, challenging neobanks and fintech, powered by blockchain tech.",
                        "stellar.tranche1Deliverables": "Vesting smart contracts re-coding from EVM/Solidity to Stellar/Soroban. - Time 4 weeks, from grant reception\n\nDeliverables:\n- Git repository with the library code\n- Addresses of test deployments and mainnet deployments with test transactions\nBudget: $40k",
                        "stellar.tranche2Testnet": "Smart contract Audit - Timeline 1-2 weeks from Smart contract completion (pending availability of auditors) - \nDeliverable: Audit document\nBudget: Varies by auditor, $10-30k range",
                        "stellar.tranche3Mainnet": "Integration of Stellar-based smart contract into app Front End - Timeline 1-2 weeks from smart contract audit completion \nDeliverable: Access to the platform allowing to manage full contract’s lifecycle from the UI\nBudget: $10k",
                        "stellar.teamMembers": "Fabio Mancini",
                        "stellar.urls": {
                            "website": "https://tokenops.xyz/",
                            "codeRepository": "https://github.com/VestingLabs",
                            "videoURL": "https://www.loom.com/share/916ba4e420974ca5a4e50a5904d9b2e6"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/tokenops",
                            "twitter": "https://x.com/TokenOps_xyz"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 209847.48,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:6",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec0jaspuekXupv9N",
                    "projectId": "daoip5:stellar:project:skyhitz",
                    "projectName": "Skyhitz",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec0jaspuekXupv9N",
                    "status": "Awarded",
                    "description": "Offers a platform for music fans to invest in NFTs, supporting artists by turning streams into revenue, powered by Stellar’s Soroban smart contracts.",
                    "fundsApprovedInUSD": 75000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://ibb.co/kSk63vc",
                        "stellar.productsAndServices": "Music NFT Investment Engine:\n- What It Does: Enables users to easily invest in fractional ownership of music NFTs, turning fan support into financial gain.\n- Stellar Integration: Soroban smart contracts will be used to manage ownership rights and automate payouts to investors based on the performance of the music (e.g., streams, downloads).\n- Impact: This will empower both artists and fans, making it simple for anyone to invest in music and earn passive income while artists raise money with their work.\n\nGlobal On/Off Ramps:\n- What It Does: Allows users to cash in and out of their earnings through crypto and fiat transactions, accessible worldwide.\n- Stellar Integration: Stellar’s payment network will be utilized for fast and low-cost cross-border transactions, ensuring users can convert their revenue into local currencies seamlessly.\n- Impact: This will make it easy for users to access their earnings globally, breaking down barriers to entry for music investors around the world.\n\nFaster Music Streaming Speeds:\n- What It Does: Ensures that users experience fast and high-quality streaming when previewing or consuming music NFTs.\n- Stellar Integration: The blockchain technology will track engagement metrics (streams, likes, etc.), while the streaming infrastructure will be enhanced through Cloudflare.\n- Impact: Improved streaming performance will increase engagement, benefiting both artists and investors by boosting revenue opportunities.\n\nAutomated Royalty Distribution:\n- What It Does: Ensures artists and collaborators receive their share of revenue automatically through smart contracts.\n- Stellar Integration: Soroban smart contracts will handle the automated distribution of royalties to multiple stakeholders, based on predefined splits.\n- Impact: This eliminates manual intervention, ensuring transparency and daily payouts, building trust with artists and investors.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "- User Growth:\n    - Onboard over 10,000 active users within the first 6 months after the Mainnet launch.\n    - Expand our beta testing program to include 1,000 selected users, allowing for continuous feedback and improvements before scaling further.\n        - This growth will create a vibrant ecosystem where fans and investors can support their favorite artists, empowering musicians to take control of their revenue streams without relying on traditional intermediaries like labels. This increases financial inclusion for artists, especially independent musicians, and provides new earning opportunities for users.\n- Music NFT Sales:\n    - Facilitate the investment in 5,000+ music NFTs within the first year, allowing artists to generate direct income from their music.\n        - This democratizes access to music funding and monetization, giving artists more control over their careers. For users, it opens the door to invest in music, turning fans into stakeholders who can financially benefit from the success of their favorite music NFTs.\n- Soroban Smart Contract Usage:\n    - Execute 100,000+ transactions on Stellar’s Soroban network, including automated payouts, equity share distributions, and investments.\n        - This drives adoption of Stellar's blockchain technology while offering a transparent, decentralized system for handling music royalties, reducing fraud, and ensuring fair and timely payments to artists and investors.\n- Global On/Off Ramp Integration:\n    - Implement seamless on/off ramps worldwide, enabling users to cash out earnings in local currencies.\n        - Expanding global financial access, particularly in regions where traditional banking infrastructure may be weak or expensive. This allows artists from all over the world to participate and earn from the platform, fostering a truly global music economy.\n- Partnerships and Collaborations:\n    - Establish 5+ strategic partnerships with music industry players, Web3 platforms, and NFT communities to drive adoption.\n        - These partnerships will integrate Skyhitz into larger ecosystems, spreading the platform’s reach and allowing us to scale rapidly. This creates a wider network effect, benefiting both artists and users by increasing platform visibility and trust.\nImpact:\n- Financial Empowerment for Artists: Skyhitz offers a revolutionary way for independent and emerging artists to monetize their work directly from fans, cutting out intermediaries that traditionally take a large cut. This levels the playing field, especially for musicians in underserved regions or those not backed by major labels.\n- New Investment Opportunities for Fans: Skyhitz turns music lovers into investors. Fans can financially support and share in the success of the music they love, which creates a new form of engagement and loyalty within music communities.\n- Blockchain Adoption in Music: By integrating Soroban smart contracts, Skyhitz will be a leading example of how blockchain technology can be applied to the creative industries, inspiring other platforms to adopt decentralized solutions for transparency, trust, and fairness.\n- Expansion of Financial Access: With our global on/off ramps, Skyhitz will provide access to decentralized financial tools for artists and fans in regions with limited banking infrastructure, helping break down financial barriers and democratizing access to the music economy.",
                        "stellar.tractionEvidence": "Skyhitz Project Traction and Validation\n- User Numbers:\n    - Our platform currently has 7,000 monthly unique visitors actively exploring music NFTs, a clear indicator of growing interest and user adoption.\n    - Beta Testers: We launched a beta program for our music NFT marketplace, where 100 selected users have signed up to test the new features. Feedback from these users is driving further development.\n\n- On-Chain Transaction History:\n    - We’ve successfully implemented and tested Stellar’s Soroban smart contracts for automatic music NFT payouts. You can view our on-chain transactions on Stellar’s public ledger.\n\n- User Discovery Interviews:\n    - We conducted over 20 user interviews with artists and fans to understand their needs. This feedback is already shaping our development roadmap, with specific focus on streaming efficiency, ease of cashing out, and NFT ownership.\n\n- Beta Program Sign-Up:\n    - 100+ beta testers have signed up for the latest version of Skyhitz, helping us refine features such as fractional ownership, NFT submissions, and payout distributions.\n    - Promo video\n\n- Community Engagement (+114.0% Month over month):\n    - We’ve garnered attention on TikTok with our recent promotional campaign, resulting in a steady increase in sign-ups and engagement from music fans and crypto enthusiasts.\n    - Our posts on Twitter and Discord about new features have led to meaningful interactions with artists who are eager to onboard their music to the platform.",
                        "stellar.goToMarketPlan": "'- Beta User Expansion & Community Building:\n    - Leverage the 100 selected beta users to gather testimonials, case studies, and feedback. These users will act as early ambassadors and evangelists for the platform.\n    - Expand the beta program by inviting more users through targeted marketing campaigns on platforms like TikTok, Twitter, and Discord, where music and crypto communities are already active.\n    - Engage artists directly through partnerships and exclusive NFT drops, creating buzz within their fanbases and driving user growth organically.\n- Partnerships with Music Communities:\n    - Form partnerships with music collectives, indie artist communities, and Web3 platforms to integrate Skyhitz as the go-to platform for music NFT investments.\n    - Tap into Stellar’s network of partners and Soroban smart contract adopters, aligning with ecosystem initiatives that help build credibility and visibility.\n    - Engage with crypto influencers and NFT advocates to promote Skyhitz within relevant Web3 and music tech circles.\n- Content Marketing & Education:\n    - Launch educational content (blog posts, tutorials, webinars) that explains how fans can invest in music NFTs and earn revenue, simplifying the process for non-crypto-savvy users.\n    - Use real-world success stories from the beta testers to create compelling case studies and social proof that will resonate with potential users.\n    - Explainer videos and TikTok ads can highlight the simplicity of investing in music and how Skyhitz makes it possible for anyone to participate.\n- Paid Advertising Campaigns:\n    - Paid ads on TikTok and Instagram targeting both music lovers and crypto enthusiasts with short, engaging videos that explain how Skyhitz allows them to invest in music NFTs.\n    - Focus on geographies with a strong interest in music and crypto, such as the U.S., Latin America, and parts of Europe, to drive early adopters.\n- Influencer and Artist Collaborations:\n    - Partner with up-and-coming music artists to release exclusive music NFT drops on Skyhitz. The artists’ fanbases will help drive initial users to the platform, with incentives like early access or exclusive rewards.\n    - Work with crypto and NFT influencers to promote the platform, using their reach to build credibility in the Web3 space.\n- Launch Events & Web3 Conferences:\n    - Attend and present at Web3 conferences, such as Stellar’s Meridian and crypto-focused music events, to showcase the platform and onboard artists and investors directly.\n    - Organize virtual launch events where artists can perform and release their music NFTs live, driving immediate engagement from the community.\n- Referral Programs and Incentives:\n    - Implement a referral program that rewards users for bringing in new artists and investors, increasing the platform's network effect.\n    - Offer exclusive rewards or bonus NFTs to early adopters who actively promote the platform or contribute valuable feedback during the beta phase.",
                        "stellar.tranche1Deliverables": "Brief Description:\n- Build the core features of the Skyhitz platform, enabling users to submit and purchase music NFTs, with the initial implementation of Soroban smart contracts for automated payouts.\n- Launch the beta program with 100 selected users to gather feedback and iterate on the core functionality.\n\nHow to Measure Completion:\n- Successfully deploy the MVP platform with all core functionality (music NFT submission, investment, payout system) and onboard the first batch of users.\n- Collect user feedback from the beta testers.\n\nEstimated Date of Completion:\n- 3 months after funding approval.\n\nBudget Breakdown:\n- Developer salaries: $25,000\n- Smart contract development and integration: $5,000\n- User testing and feedback iteration: $2,500\n- Total for MVP Tranche: $32,500 in XLM",
                        "stellar.tranche2Testnet": "Brief Description:\n- Integrate Soroban smart contracts on the testnet, allowing users to interact with test assets and enabling simulated payouts, fractional ownership, and the investment engine.\n- Conduct audits and further testing to ensure security and scalability of the platform on Stellar’s testnet.\n\nHow to Measure Completion:\n- Successfully deploy Skyhitz on the Stellar testnet, allowing internal and user testing of all contract features.\n- Pass security audit and receive feedback from the Stellar ecosystem.\n\nEstimated Date of Completion:\n- 5 months after funding approval\n\nBudget Breakdown:\n- Smart contract testing on testnet: $2,500\n- Security audits: $5,000 (with access to Stellar LaunchKit credits)\n- Infrastructure testing and scaling: $2,500\n- Total for Testnet Tranche: Non-XLM tranche, supported by Stellar LaunchKit.",
                        "stellar.tranche3Mainnet": "Brief Description:\n- Full launch of Skyhitz on the Stellar mainnet, allowing artists and users to buy, sell, and invest in music NFTs with real assets and fully functioning smart contracts.\n- Add on/off ramps to allow global users to cash out earnings seamlessly and expand marketing efforts for full-scale adoption.\n\nHow to Measure Completion:\n- Launch Skyhitz on the Stellar mainnet with all features live, including NFT investments, automated payouts, and fiat conversion options.\n- Achieve user growth, with at least 1,000 users onboarded in the first month of the mainnet launch.\n\nEstimated Date of Completion:\n- 6 months after funding approval.\n\nBudget Breakdown:\n- Developer salaries: $20,000\n- Mainnet deployment and final audit: $7,500\n- On/off ramps integration and global payments: $5,000\n- Marketing for mainnet launch: $5,000\n- Total for Mainnet Tranche: $32,500 in XLM",
                        "stellar.teamMembers": "Alejo Mendoza",
                        "stellar.urls": {
                            "website": "https://skyhitz.io",
                            "codeRepository": "https://github.com/skyhitz",
                            "videoURL": "https://www.youtube.com/watch?v=2_zJOTuw7AA"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://twitter.com/skyhitz"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 25000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 269029.53,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:7",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recsfR7WfhvD7zd8o",
                    "projectId": "daoip5:stellar:project:convexity-humanitarian-aid-transfer-solution-chats",
                    "projectName": "Convexity Humanitarian Aid Transfer Solution (CHATS)",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recsfR7WfhvD7zd8o",
                    "status": "Awarded",
                    "description": "CHATS offers blockchain-based cash and voucher solutions to improve programs by MercyCorps, UNICEF  and other iNGOs partners and donors to ensure transparent, secure, and efficient aid distribution.",
                    "fundsApprovedInUSD": 89500.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1M73BeqJJsubZqrMxfjvr_8t3Onm4bUum/view",
                        "stellar.productsAndServices": "The SCF Build Award will fund crucial developments to expand and improve the CHATS platform using Stellar’s blockchain infrastructure. Relevant improvements include:-\n\n1. Integration of Stellar Payment Rails\n   Stellar’s payment rails will facilitate real-time cross-border and local payments, enabling CHATS to seamlessly support multi-currency disbursements. Stellar's infrastructure will ensure transactions happen securely and efficiently, minimising volatility and currency conversion issues.\n\n2. Migration of Reserve Assets to Stellar USDC\n  Migrating CHATS’ digital assets  reserve assets to Stellar USDC will help stabilise value during aid disbursements, enabling more transparent tracking of funds. This would  allow for the quick redemption of funds by vendors and aid recipients. \n\n3. Offline Payment Integration (USSD/SMS)\n  Using  Stellar’s payment infrastructure, we will improve CHATS’ offline payment functionalities via USSD and SMS, ensuring transactions are recorded securely and uploaded once beneficiaries access the internet, resulting in secure settlement even in remote areas without internet access.\n\n4. Cash for Work Feature Upgrade\n   Stellar's transparency and tokenization will improve CHATS conditional cash transfers for Cash-for-Work programs. Stellar’s advanced smart contract functionality will improve  real-time validation and disbursement of funds, ensuring that only eligible recipients receive aid. \n\n Impact on CHATS\n- Stellar's infrastructure will enable CHATS to handle more transactions at lesser costs and improve its cross-border aid distribution efficiency.\n- The integration of Stellar UDSC will improve the speed and security of aid disbursements.\n- Offline capabilities and multi-currency support will ensure that CHATS reaches more beneficiaries, especially in remote, underserved areas.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "The pilot promotes and facilitates the implementation of the USAID Nafoore Activity’s Youth Fund entrepreneurship and economic empowerment activities \n1. Number of youth who receive financial support for new small business start-ups \n2. Number of existing microenterprises or Income-Generating Activities (IGAs) supported through a full-suite CVA delivery solution\n3. Number of preferred vendors registered in the CHATS platform that have procured goods and equipment through the blockchain solution.\n4. Number of cohorts using the CHATS platform to implement apprenticeship activities under the USAID Nafoore’s Youth Fund \n\nThis blockchain-enabled funding model and solution is scaled and replicated in other regions or sectors of intervention of the USAID Nafoore Activity\n1. Number of social projects that are continuing operations after the initial pilot funding period and areas of implementation\n2. Number of small businesses that are generating continuous revenues after the initial pilot funding period",
                        "stellar.tractionEvidence": "[https://www.unicefventurefund.org/story/chats-transparent-digital-cash-and-voucher-transfer-beneficiaries-through-blockchain  ]\n\n[https://humanitariangrandchallenge.org/world-humanitarian-day-transforming-crisis-response-through-bold-innovations/ ]\n\n[https://withconvexity.com/2023/12/23/roddenberry-foundation/  ]",
                        "stellar.goToMarketPlan": "Short-term Objective (6 months)\n\nThe pilot grant will develop a sustainability and scalability strategy by linking its CVA delivery mechanisms to new interventions under the USAID Nafoore Activity – Nafoore (“added value” in the Fulani language) is a $17m USAID-funded violent extremism prevention program, rooted in positive youth development. The project is led by Mercy Corps Mauritania.\n \nBy leveraging blockchain, the pilot will create a more inclusive financial ecosystem that empowers youth to access the seed capital needed to start small businesses and social projects. CHATS can first build trust across institutional stakeholders of the program by ensuring that funds are tracked and used for their intended purpose. CHATS automates the release of funds based on predefined conditions, such as the completion and approval of a business plan, project milestones, business performance metrics; or in the case of an  apprenticeship scheme: timesheets. This ensures funds are used as intended, fostering accountability among young entrepreneurs. Additionally, if the program requires a procurement process, CHATS ensures that preferred vendors are being used by program participants, by managing the transactions between vendors and recipients.\n\nMid-Term objectives (5 - 18 months)\n\nPursue program implementation in collaboration with:\n1. UNICEF Country Offices in Africa and Haiti, \n2. Other MercyCorp Country offices \n3. iNGO partners.",
                        "stellar.tranche1Deliverables": "Refinement of CHATS Application Suite\nDocumented Software Architecture Update, Updated Product Requirement documentation, Updated Users Dashboards (NGO, Donor, Field Agent, Beneficiary, Vendor) with outlined features and Stellar Blockchain Integration. \n16 Weeks\n$60,000.00\n\nFeatures\n1. CHATS Software Architecture Updates \n2. Integrations such as payment API, language, currency and converter\n3. Integration of Stellar Payment rails\n4. Offline Payment integration (USSD/SMS)\n5. Cash for Work feature Upgrade\n6. Offline Onboarding integration\n7. Automated migration of digital reserve assets to Stellar USDC\n8. Donor Dashboard Metrics upgrade",
                        "stellar.tranche2Testnet": "Security Check & Validation \nBeta testers are able to create accounts, complete KYC, fund projects/accounts and run projects on the platform using the test environment. They can invite donors and donors fund projects with the USDC token on Stellar Blockchain network and donors are able to view and monitor the projects in real time.\n8 Weeks\n$24,500.00\n\nActivities\n1. Beta Testing\n2. Smart Contract Audit\n3. Penetration and Vulnerability Assessment\n4. Security and Platform Update based on feedback from (1), (2) and (3) above",
                        "stellar.tranche3Mainnet": "Migration to Live Environment\nBeta testers are able to create accounts, complete KYC, fund projects/accounts and run projects on the platform using the live environment. They can invite donors and donors fund projects with the USDC token on Stellar Blockchain network and donors are able to view and monitor the projects in real time.\n4 Weeks\n$5,000",
                        "stellar.teamMembers": "Convexity Humanitarian Aid Transfer Solution (CHATS), Sandy Om'iniabohs",
                        "stellar.urls": {
                            "website": "https://www.chats.cash",
                            "codeRepository": "https://convexity-tech-team.gitbook.io/chats-documentation/",
                            "videoURL": "https://youtu.be/loMAoquNAJc?si=GLTjKDoMGl4IrtjB",
                            "pitchDeck": "https://drive.google.com/file/d/1b76JxRaizYCG8WH4zBdf-nN-ra61fKTu/view?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/convexity/",
                            "twitter": "https://x.com/withconvexity_"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 59666.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 359786.06,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-07-07T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:8",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recQqSzJ9ggbbyirH",
                    "projectId": "daoip5:stellar:project:scopex",
                    "projectName": "ScopeX",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recQqSzJ9ggbbyirH",
                    "status": "Awarded",
                    "description": "ScopeX offers an all-in-one fee-free fiat remittance platform to help Indian migrants with top-notch transactions security.",
                    "fundsApprovedInUSD": 48000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docsend.com/view/vrcxaj3jvhvjtc6n",
                        "stellar.productsAndServices": "With the SCF Build Award, ScopeX will develop and enhance its remittance platform, including a comprehensive WebApp and Mobile App to streamline cross-border payments for the EU-India corridor. Key features include user registration and KYC compliance using Stellar's SEP-12 standards, allowing for seamless onboarding and regulatory compliance. Users will benefit from non-custodial wallet creation, with Stellar accounts and secure passkey encryption for easy wallet management. The platform will facilitate fiat deposits and stablecoin transfers through SEP-24/06 protocols and the Horizon API, ensuring fast, low-cost transactions. For recipients in India, withdrawals in INR will also be managed through SEP-24/06 protocols, enabling real-time conversion and bank transfers. \nAdditionally, stablecoin arbitrage will be leveraged, providing users with zero-cost remittances while driving revenue for ScopeX.",
                        "stellar.successCriteria": "Success for ScopeX means revolutionizing the way Indian migrants in the EU send money back home, providing a faster, cheaper, and more secure remittance solution powered by blockchain. We aim to onboard 50,000 users within the next 12 months, capturing a significant share of the €10B EU-India remittance market, with a goal to process €50M in remittances during that period. By offering a zero-cost remittance service, we will enable users to save €1M annually in fees, directly benefiting their families in India. Success also involves building strong community trust through partnerships, ensuring ScopeX becomes a trusted brand among Indian migrants. Additionally, we aim to deliver transactions in under 2 minutes and achieve a 95% user satisfaction rate.",
                        "stellar.tractionEvidence": "https://docs.google.com/document/d/1nMi4pypy2XjzNpT-RpXQEaF8lY739Ywo/edit\nhttps://stellarchain.io/accounts/GARBVCTB4JARQQESCTXRCXYW6SUKLT3AUQZBY5Q7BZXWKYJ7YF6RDIPV",
                        "stellar.goToMarketPlan": "ScopeX’s go-to-market strategy is centered around appealing to Indian sentiments with the message \"For the Indians, by the Indians.\" We deeply understand the Indian user mindset, which prioritizes cost savings, and we offer a no-cost remittance solution to attract more users to our platform. To build trust, we engage directly with local Indian communities and promote our product through community organizations. Our performance marketing efforts on Meta and Google have been effective, and our referral program is growing in popularity. Additionally, we collaborate with Indian grocery stores—both online and offline—to further promote our platform, and we are working with influencers and bloggers to spread the word. With this 360-degree GTM approach, we are creating a comprehensive strategy to ensure widespread adoption and build lasting trust with our target audience.",
                        "stellar.tranche1Deliverables": "Stellar Integration to the BE [$28800, 6 weeks]\nBrief Description: \n- Integrating stellar SDK/APIs to our backend replacing the component of current blockchain;\n- Facilitating wallet/account creation using external keypair (provided by a WaaS provider: dfns.io) and easy wallet recovery.\n- Delegated signing of transactions with passkeys\n- Account-to-account asset transactions and verification\n\nMeasure of completion: Fully operational BE with Stellar SDK and APIs, verified through internal testing and a pilot transaction phase.\nCompletion Date: 6 weeks\nBudget: $28800 (3 developers, 720 hr @ $40/hr)\n\nWe received the activation award for this activity. We have completed this task.",
                        "stellar.tranche2Testnet": "Onramp/Offramp Anchor Integration [$28800, 6 weeks]\nBrief Description: Our current on/off ramp service providers run exchanges in India but they are not Stellar anchors. We are running a joint project to build up the Stellar anchor service in India. We will upgrade the existing endpoints with SEPs (including KYC) for a harmonized interaction with the anchors to facilitate the onramp and offramp services for euro/usdc and usdc/inr. This service will help other Stellar projects to do onramp/offramp and anchoring service in India. Recently we have been approached by many such projects, referred by Stellar Core Team,  who want to leverage the anchoring service in India. Our mission aligns with recent focus of Stellar team to extend its presence in India, the top remittance receiver country in the world ($125B in 2023).\n\nMeasurement of Completion: Functional onramp/offramp services with Euro and INR\nEstimated Date of Completion: 6 weeks\nBudget: $28800 (3 developers, 720 hr @ $40/hr)",
                        "stellar.tranche3Mainnet": "Moving Existing Users to New System [$19200, 4 weeks]\nDescription: Currently 60% of our existing users are on the Polygon chain. In this activity, we will implement a user-friendly migration process for existing ScopeX users to transition their accounts to the new system on Stellar including\n- Creating new wallets on Stellar chain\n- Securing passkeys to users’ devices\n- Building USDC trustline\n- Prefunding wallets with XLM for paying gas fees\n- Sharing KYC with anchors\n- Building an engaging UI for users for easy onboarding, and migrations\nMeasure of Completion: Successfully onboarding users to the Stellar ecosystem.\nCompletion Date: 4 weeks.\nBudget: $19200 (3 developers, 480 hr @ $40/hr)",
                        "stellar.teamMembers": "Milan Agrawal",
                        "stellar.urls": {
                            "website": "https://scopex.money",
                            "videoURL": "https://www.loom.com/share/bcc3eae4d2bd475d864e86b634ebc8f0?sid=a883763c-a30e-4325-99a0-c58576afa70a"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/0xscopex/",
                            "twitter": "https://twitter.com/0xScopeX"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 32000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 212880.17,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-12-10T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:9",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recdpGqD8HIslsaOT",
                    "projectId": "daoip5:stellar:project:mugglepay-stripe-for-stellar",
                    "projectName": "MugglePay: Stripe for Stellar",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recdpGqD8HIslsaOT",
                    "status": "Awarded",
                    "description": "Help merchants accept crypto on Stellar through autoswap smarts contract built on Soroban. (e.g. pay-in XLM, pay-out USDC)",
                    "fundsApprovedInUSD": 28000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/19L82Iescrq0NZhCbayLK94NwDS50ASttOkWQeDBITNU/edit",
                        "stellar.productsAndServices": "Product - : \nMugglePay is a cryptocurrency payment gateway designed to assist merchants in accepting cryptocurrency payments. The product consists of payment software development kits (SDKs) integrated with various e-commerce platforms like WordPress, Shopify or WooCommerce. Additionally, it is powered by autoswap smart contracts on the Soroban blockchain.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "We will have merchants start accepting Stellar payments (e.g. AI Agents, E-Commerce Shop). Micropayments are essential for cross-border focused blockchains for Stellar because Stellar enables low-cost, fast transactions, which is crucial for financial inclusion. Stellar's infrastructure allows individuals and small business to pay in cryptos. Using Soroban smart contracts, these payments can be automated and scaled, supporting more complex use cases like programmable payments. This combination provides a powerful solution for global commerce and financial access.",
                        "stellar.tractionEvidence": "1. E-Commerce (like WordPress, Shopify) can start accepting Stellar payments (XLM, USDC) with MugglePay SDK \n2. The pay-in tokens will autoswap to stablecoins with Soroban. If the buyer pay in with XLM, our Soroban contracts will interact with SoroSwap and auto convert to USDC to merchants.",
                        "stellar.goToMarketPlan": "1. Marketing: Announce the release of MugglePay supporting Stellar assets (XLM, USDC) on official media channels such as Medium, Twitter, Telegram, and YouTube. Feature the release of Stellar Payment products on prominent media platforms to drive user engagement. such as Yahoo Finance, CoinDesk etc.\n2. Campaign:  Provide exclusive campaign support for Stellar Early adopter. Offer a 5%-10% discount to users paying with Stellar.\n3. Referral program: A referral program is established to incentivize existing users to invite new merchants and users to join the platform.",
                        "stellar.tranche1Deliverables": "Brief description: design the product of payments on Stellar / Soroban, including UI, Frontend on the product side, and the data structure schema design of the backend and the contracts.\nThe design should support the payment through wallets like LOBSTR, and integration with SoroSwap.\nHow to measure completion: design deck of Stellar Payment UI, and the tech design deck of contracts built on Soroban \nEstimated date of completion: Oct 7th \nBudget: $6,000",
                        "stellar.tranche2Testnet": "Brief description: We support auto-exchanging, allowing automatic conversion of crypto payments such as Stellar XLM into stable tokens like USDC. This process effectively reduces the risk of volatility. With the auto convert feature, merchants can eliminate the potential volatility risk that comes with accepting volatile currencies assets. \nHow to measure completion: integration of auto swap contracts on Soroban (SoraSwap). \nEstimated date of completion: Oct 30th \nBudget: $12,000",
                        "stellar.tranche3Mainnet": "Brief description: End to end integration. Launch the payment plugin to support XLM, USDC-Stellar payments on commonly used e-commerce platforms such as WooCommerce and Wordpress, enabling seamless acceptance of Stellar payments by merchants. How to measure completion: payment plugin launched in Wordpress app store, which supports XLM, USDC Stellar payments. The user interface is where merchants can select to accept Stellar in the WordPress. When users purchase items from the merchant's store, they will see the option to pay with Stellar and can proceed to the payment page to pay with Stellar. \nEstimated date of completion: Nov 20th \nBudget: $10,000",
                        "stellar.teamMembers": "Shawn Yu",
                        "stellar.urls": {
                            "website": "https://mugglepay.com/",
                            "codeRepository": "https://github.com/mugglepay/",
                            "videoURL": "https://www.youtube.com/watch?v=hX_dnzGolbA",
                            "pitchDeck": "https://drive.google.com/file/d/1dhr5tlgh7meM89RFuGi2o3smN1D-IOoz/view?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/mugglepay/",
                            "twitter": "https://x.com/paymuggle"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 18666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 132118.64,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:10",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recu5pymuQTqCQDZ2",
                    "projectId": "daoip5:stellar:project:rampmedaddy",
                    "projectName": "RampMeDaddy",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recu5pymuQTqCQDZ2",
                    "status": "Awarded",
                    "description": "RampMeDaddy is integrating Stellar Passkey Smart wallets directly into Telegram, offering a seamless user experience with Face ID for creating and managing self-custodial wallets. This allows us to provide each user with a unique wallet to hold funds and send low-cost, global peer-to-peer payments using USDC.xlm—all within Telegram. Our mission is to empower underbanked regions and revolutionize international remittances, leveraging Telegram’s global reach of over 1 billion users.",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1XYBYa2CvItTWp5uG9t6Pf0sLy4ObG_NW/edit?usp=sharing&ouid=103920731595476073914&rtpof=true&sd=true",
                        "stellar.productsAndServices": "We are building out Stellar Passkey Smart wallets integrated into Telegram, allowing users to easily hold and access USDC.xlm in self custodial wallets simply through Face ID. This will make peer-to-peer payments more seamless and accessible, with low fees and fast transaction times on Stellar. The Passkey integration will streamline the onboarding process for creating a Wallet and enhance the user’s experience operating the wallet by removing the “crypto complexities” associated with wallet management. \n\nWe are building our product on top of the Stellar blockchain to specifically utilize the Passkey Smart Wallets on Soroban and the network of Stellar Anchors, which will have a significant impact on the user experience and overall operations of RampMeDaddy.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "In the short term, success means rapidly scaling RampMeDaddy to tens of thousands of users by Q1 2025, who will rely on the platform to send global payments seamlessly via Telegram. This will result in the creation of tens of thousands of active Stellar Passkey smart wallets, which are foundational to providing users with secure and accessible USD accounts. By achieving these milestones, we aim to generate significant transaction volume, driving early adoption of our platform.\n\nIn the long term, success looks like RampMeDaddy becoming the go-to payment app for global transactions across multiple social media platforms. Our target is to onboard 100,000 users into Stellar Passkey wallets by the end of 2025, which we anticipate will drive $10M in USDC.xlm on-chain and facilitate $100M in transaction volume. The impact extends far beyond these numbers, as we will be expanding financial access to millions of people, especially in underbanked regions. By providing USD accounts via Telegram, we can help users in these areas connect to the global financial system, bridging the gap between traditional banking and modern digital currencies.\n\nUltimately, RampMeDaddy’s long-term vision is to empower millions of users globally, making payments as simple and intuitive as sending a message, and offering financial services to populations that have historically been excluded from the system.",
                        "stellar.tractionEvidence": "Traction and Evidence Doc: https://docs.google.com/document/d/1ijVv0C-RGzjx1asVQGV-L0s3OSKHur35jpDfa6WMkc0/edit?usp=sharing",
                        "stellar.goToMarketPlan": "Our go-to-market strategy leverages Telegram’s massive global user base of over 1 billion monthly users. Marketing directly within Telegram has proven highly effective, with access to thousands of crypto-focused channels for targeted outreach. Additionally, we’ll partner with hackathons and universities to engage younger, tech-savvy, and international populations who can benefit from global payments. This will help us identify key markets where RampMeDaddy gains traction, allowing us to optimize our paid marketing campaigns.\n\nAfter conquering a sufficient market share of Telegram, we will be pursuing other messaging / social media platforms to deploy RampMeDaddy on.",
                        "stellar.tranche1Deliverables": "1. Finalize Product Development of MVP\nGoal: Complete the development of our MVP, integrating Stellar Passkey Smart Wallets within the RampMeDaddy Telegram app. This integration will ensure that Stellar Passkey Smart Wallets work seamlessly, allowing RampMeDaddy to create wallets that users can easily claim using Face ID.\nCompletion Criteria:\n- MVP Development: The MVP is fully developed with all essential features, including the integration of Stellar Passkey Smart Wallets within the RampMeDaddy web app. This integration will enable users to create, manage, and interact with their wallets easily and securely.\n- Stellar Integration: Ensure full compatibility with the Stellar blockchain, allowing users to seamlessly claim their self-custodial wallet and add and transact in USDC.\n- Functionality: Ensure the MVP can work seamlessly with our on/off-ramp partners to provide a streamlined fiat-to-USDC conversion process into the user’s wallet.\n- Internal Testing: Conduct rigorous internal testing to identify and resolve any bugs or issues related to the Stellar Passkey Smart Wallet integration.\n- User Documentation: Prepare comprehensive user documentation, promotional materials, and tutorials to guide users through the process of using Stellar Passkey Smart Wallets within RampMeDaddy.\nTimeline: November, 2024 (Early November)\nDevelopment Budget Requested: $70,000",
                        "stellar.tranche2Testnet": "2. Testnet Integration\nGoal: Integrate the functioning RampMeDaddy app MVP into Telegram and successfully complete transactions on the Stellar testnet. This step ensures that the entire transaction process, from wallet creation to USDC transactions, operates smoothly within the Telegram environment.\nCompletion Criteria:\n- MVP Integration: Fully integrate the RampMeDaddy app MVP with Telegram, allowing users to interact with the app and initiate transactions directly within the Telegram interface.\n- Stellar Testnet Transactions: Successfully conduct transactions on the Stellar testnet, verifying that RampMeDaddy can create wallets, add USDC, and facilitate transactions seamlessly within the testnet environment.\n- Functionality Testing: Test the end-to-end process, including wallet creation by RampMeDaddy and wallet claiming by the user through Face ID, to ensure a streamlined user experience.\n- Backend Performance: Ensure that backend processes, including the creation of Stellar Passkey Smart Wallets and transaction handling, function efficiently and reliably during testnet operations.\n- Internal Testing and Debugging: Conduct thorough internal testing on the testnet to identify and resolve any issues related to integration, transaction processing, or wallet functionality.\n- User Documentation: Update user documentation to reflect the testnet integration process, preparing for a smooth transition to the mainnet in future stages.\nTimeline: December 2024 (Before 2025!)\nDevelopment Budget Requested: $0… just need testnet USDC.xlm!",
                        "stellar.tranche3Mainnet": "3. Mainnet Launch\nGoal: Officially launch the fully integrated RampMeDaddy Telegram app on the Stellar mainnet, making it publicly available for real-time global payments. This stage will confirm that all features are fully operational, providing a secure and seamless experience for users to transact directly within Telegram.\nCompletion Criteria:\n- Full Mainnet Integration: Successfully deploy the RampMeDaddy web app on the Stellar mainnet, enabling real users to create Stellar Passkey Smart Wallets, add USDC, and complete transactions with real funds.\n- Public Launch: Open the RampMeDaddy platform to the public, allowing users worldwide to engage with our services within Telegram. This includes support for wallet creation, Face ID verification, and peer-to-peer USDC transactions.\n- System Stability: Monitor system performance during the initial launch period to ensure the platform operates smoothly under real-world conditions, addressing any issues promptly to maintain a seamless user experience.\n- User Support and Documentation: Provide comprehensive support and updated documentation to guide users through the platform, including tutorials and troubleshooting resources to facilitate a smooth onboarding process.\n- Security Audits and Checks: Conduct comprehensive security audits and checks to ensure the platform's robustness and safeguard user data and funds. This includes engaging third-party auditors, performing penetration testing, and implementing best practices in security to maintain a secure and trustworthy environment for users.\n- Feedback and Iteration: Gather user feedback post-launch to identify areas for improvement and iterate on features to enhance the overall user experience.\nTimeline: January 2025 (Early January)\nDevelopment Budget Requested: $80,000",
                        "stellar.teamMembers": "Trevor Hoffman",
                        "stellar.urls": {
                            "website": "www.rampmedaddy.com",
                            "codeRepository": "https://github.com/trustek-io/rampmedaddy-frontend/",
                            "videoURL": "https://youtu.be/a84Z9afUL1A?si=qSAwXaHgI-_UsG_z",
                            "pitchDeck": "https://docsend.com/v/32rgx/rampmedaddy"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 100000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 718131.54,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-07-07T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:11",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec1ZJuYde6wkjlWJ",
                    "projectId": "daoip5:stellar:project:rahat",
                    "projectName": "Rahat",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec1ZJuYde6wkjlWJ",
                    "status": "Awarded",
                    "description": "Integrate Rahat, a financial access platform on Stellar to help humanitarian agencies empower vulnerable communities with efficient, transparent, and low-cost aid delivery with automated weather triggers event before the onset of a climate disaster.",
                    "fundsApprovedInUSD": 149962.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://bit.ly/3XK44IW",
                        "stellar.productsAndServices": "With the SCF Build Award, Rahat will utilize the Stellar network to enhance aid distribution for vulnerable communities. By integrating existing Rahat modules in Stellar, we will enable secure and swift USDC/XLM disbursements using stellar disbursement platform APIs. Rahat will allow beneficiaries to use simple feature phones or QR cards to receive aid while vendors process transactions through an app for streamlined aid delivery and utilize the existing Stellar's ecosystem. Local vendors will use Rahat's vendor app to facilitate USDC/XLM redemptions for beneficiaries, making digital transactions more accessible.\n\nWe plan to integrate weather forecast (eg, https://global-flood.emergency.copernicus.eu/) APIs with Soroban smart contracts to automate aid disbursements in response to disaster conditions, providing timely support. Multisignature approvals via Soroban smart contracts will ensure that aid is distributed only after verification from multiple parties making disbursement secure and accountable.\n\nA beneficiary management tool will help in validating and targeting the aid recipients and onboard them to the rahat distribution platform. This project will enhance Rahat’s open-source ecosystem and complement the Stellar Disbursement Platform.\n\nBy contributing to the Stellar ecosystem, we aim to leverage community support to grow and scale Rahat. For more project details: https://bit.ly/3B7QZjM\n\nCurrent Rahat Platform Demo - https://www.youtube.com/watch?v=yZhEGAKWbaE",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Short Term Success: We will successfully integrate Rahat into the Stellar ecosystem, completing a Proof of Concept (POC) for our cash distribution system with smart contracts and an early warning system. This includes fully implementing a beneficiary management tool and a communication system for real-time notifications. Additionally, we will develop a vendor app for unbanked beneficiaries and deploy the platform on Stellar’s Mainnet. We will also register with the Digital Public Goods Alliance (DPGA) and ensure readiness for open-source contributions.\n\nLong Term Impact: Following the POC, we will expand Rahat’s Cash and Voucher Assistance (CVA) and anticipatory action on Stellar, starting with crypto-friendly regions (Indonesia) to support more communities and enhance climate resilience. Our goal is to distribute $1M worth of aid to 25,000 vulnerable communities by 2025, aligning with the SDG goal 1 - No Poverty. (https://bit.ly/3XuNKKF) We aim to increase open-source collaboration by engaging with the developer community and promoting Rahat as a blockchain-based humanitarian model.",
                        "stellar.tractionEvidence": "Our platform has been deployed to support over 20,000 beneficiaries. Our impact for 2023 is available here - https://rahat.io/reports We are supported by prominent organizations, including UNICEF, GSMA, and the Ethereum Foundation. \n\nRahat is recognized as a Digital Public Good (https://app.digitalpublicgoods.net/a/11721) and is an open-source project with 100 contributors (https://cauldron.io/project/8539).\n\nWe have successfully completed cash transfer project with UNICEF Nepal and currently working with Danish Red Cross in Anticipatory Action. We have working/worked with various agencies -  Tayaba, Essilor Luxottica Foundation and local government to manage and distribute funds and commodities efficiently. \n\nMore Information\n- https://rahat.io/media-mention\n- https://rahat.io/blogs",
                        "stellar.goToMarketPlan": "Following the completion of the POC, our next step is to pilot the Rahat Cash and Voucher Assistance (CVA) program on Stellar. We've partnered with the GSR Foundation to extend the project into Indonesia and will collaborate with humanitarian agency to localize and implement the potential pilot.",
                        "stellar.tranche1Deliverables": "Deliverable 1: Requirement Analysis and Project Planning\n- Brief description: Define the project scope, goals, and functional requirements. Establish a detailed project plan outlining timelines, key milestones, user stories, scrum board ready and resource allocation.\n- How to measure completion: Completion of a comprehensive project requirement document and project plan, signed off by the project manager and stakeholders.\n- Estimated date of completion: Week 2\n- Budget: 84,938.07 XLM (USD 8,160)\nDeliverable 2: UI/UX Design\n- Brief description: Design the user interface and user experience for the Rahat platform, focusing on accessibility for unbanked populations. This includes wireframes, prototypes, and final UI assets.\n- How to measure completion: Completion of wireframes, high-fidelity designs, and UI/UX prototypes, followed by stakeholder approval.\n- Estimated date of completion: Week 3\n- Budget: 14,156.34 XLM (USD 1,360)\nDeliverable 3: Frontend Development\n- Brief description: Develop the frontend of the platform using Next.js, integrating the UI/UX design and creating the beneficiary and vendor portals.\n- How to measure completion: Completion of the frontend application with full functionality, including navigation, form submission, and interactions.\n- Estimated date of completion: Week 5\n- Budget: 39,658.58 XLM (USD 3,810)\nDeliverable 4: Smart Contract Development and Stellar Integration\n- Brief description: Develop Soroban smart contracts to manage USDC disbursement, multisignature triggers, and approvals. Integrate with Stellar via the Stellar SDK and Horizon API for blockchain interaction.\n- How to measure completion: Successful deployment of Soroban smart contracts on the Stellar Testnet, with test transactions and multisig functionality validated.\n- Estimated date of completion: Week 10\n- Budget: 159,883.42 XLM (USD 15,360)\nDeliverable 5: Early Warning System Integration\n- Brief description: Integrate weather forecast APIs, such as Glofas, to trigger early warnings for disaster events, which will automatically activate the multisig approval process for aid disbursement.\n- How to measure completion: Integration with weather API, tested trigger mechanisms, and simulation of disaster conditions to validate functionality.\n- Estimated date of completion: Week 12\n- Budget: 83,688.98 XLM (USD 8,040)\nDeliverable 6: Beneficiary Management Tool Setup\n- Brief description: Implement the Beneficiary Management Tool for importing, validating, and managing beneficiary data from sources like Excel or Kobo Toolbox.\n- How to measure completion: Fully functional tool that allows data import, validation checks, and storage of beneficiary details, with test cases completed.\n- Estimated date of completion: Week 13\n- Budget: 83,688.98 XLM (USD 8,040)\nDeliverable 7: Communication Tool Setup (SMS, WhatsApp)\n- Brief description: Set up the Rumsan Communication Tool to send real-time notifications via SMS, WhatsApp, and email to beneficiaries regarding aid disbursement and updates.\n- How to measure completion: Functional notification system integrated with SMS and WhatsApp APIs, tested by sending notifications to test users.\n- Estimated date of completion:Week 14\n- Budget: 83,688.98 XLM (USD 8,040)\nDeliverable 8: Multisig Trigger\n- Brief description: Implement the multisignature approval process within Soroban smart contracts, requiring multiple approvals before aid disbursement.\n- How to measure completion: Fully functional multisignature trigger tested with both automated (weather API) and manual (Rahat Admin) approval.\n- Estimated date of completion: Week 15\n- Budget: 83,688.98 XLM (USD 8,040)\nDeliverable 9: Vendor App Integration\n- Brief description: Develop and integrate the Rahat Vendor App, allowing vendors to verify beneficiary USDC balances and facilitate token exchanges for goods or cash.\n- How to measure completion: Completion of vendor app with full functionality for balance checking and transactions, tested in both live and test environments.\n- Estimated date of completion:Week 16\n- Budget: 91,183.51 XLM (USD 8,760)\nDeliverable 10: End-to-End System Integration\n- Brief description: Integrate all components of the system (frontend, backend, smart contracts, APIs) to ensure a seamless workflow, from beneficiary onboarding to aid disbursement and vendor exchange.\n- How to measure completion: Completion of end-to-end testing, with all system components interacting as expected and no critical issues.\n- Estimated date of completion: Week 19\n- Budget: 198,188.82 XLM (USD 19.040)\nDeliverable 11: Unit Testing\n- Brief description: Perform unit testing across all components to ensure each module functions as expected, including frontend components, smart contracts, and API integrations.\n- How to measure completion: Successful completion of unit tests for all major components, with test reports generated and no major issues.\n- Estimated date of completion: Week 20\n- Budget: 53,710.84 XLM (USD 5,160)",
                        "stellar.tranche2Testnet": "Deliverable 1: Testnet Deployment of Smart Contracts\n- Brief description: Deploy Soroban smart contracts on the Stellar Testnet, which will manage USDC disbursement, multisignature triggers, and approvals. The deployment will serve as a test environment for validating the functionality and scalability of the smart contracts.\n- How to measure completion: Successful deployment of smart contracts on the Stellar Testnet, with all intended functionalities (USDC disbursement, multisignature approvals) tested and validated via sample transactions.\n- Estimated date of completion: Week 21\n- Budget: 200,062.45 XLM (USD 19.220)\nDeliverable 2: User Acceptance Testing (UAT)\n- Brief description: QA engineers will conduct UAT to ensure the system meets the business requirements and functions as expected. UAT will focus on validating key workflows such as USDC disbursement, multisig approvals, and vendor redemption processes, ensuring that the system is ready for end-user interaction.\n- How to measure completion: Completion of UAT with a report documenting test cases, expected outcomes, and actual results. All critical functionality should pass without major issues.\n- Estimated date of completion: Week 22\n- Budget: 64,827.73 XLM (USD 6,228)\nDeliverable 3: Bug Fixing and Feedback Implementation\n- Brief description: Address issues, bugs, or gaps identified during the pilot testing phase. This includes improving the user experience, fixing smart contract issues, and addressing any technical errors. Also, implement feedback provided by stakeholders to enhance the overall platform functionality.\n- How to measure completion: All critical and high-priority bugs are resolved, and feedback from pilot testing is implemented. Verification through retesting in a staging environment before the final deployment.\n- Estimated date of completion: Week 23\n- Budget: 56,833.56 XLM (USD 5,460)\nDeliverable 4: Documentation\n- Brief description: Prepare comprehensive documentation for the system. This includes:\n    - SRS (Software Requirements Specification): Detailing the functional and non-functional requirements of the Rahat system.\n    - User Manual: A guide for end-users (beneficiaries, vendors, and admins) explaining how to use the system and its features.\n    - Developer Guide: Technical documentation that guides developers in maintaining and enhancing the system, including API references, architecture details, and how to integrate with Stellar.\n- How to measure completion: Completion of the SRS, User Manual, and Developer Guide, with each document reviewed and approved by the project manager and key stakeholders. Documentation should be made available on a platform like GitHub or the project’s official documentation site.\n- Estimated date of completion: Week 23\n- Budget: 59,956.28 XLM (USD 5,760)",
                        "stellar.tranche3Mainnet": "Deliverable 1: Mainnet Deployment\n- Brief description: Deploy the Soroban smart contracts and platform on the Stellar Mainnet, allowing for real-world transactions involving USDC disbursement to beneficiaries. Ensure the platform is stable, secure, and fully functional for live operations.\n- How to measure completion: Successful deployment of all components (smart contracts, backend, frontend) on Stellar Mainnet with real transactions processed, verified, and recorded on the blockchain. All integrations with Stellar (via Horizon API) should be operational.\n- Estimated date of completion: Week 25\n- Budget: 57,166.65 XLM (USD 5,492)\nDeliverable 2: Post Production Test\n- Brief description: Conduct a thorough Post Production Test to validate that the deployed system on the Mainnet is stable and operates as expected in a live environment. This includes running functional tests, performance tests, and security audits to ensure there are no critical issues post-deployment.\n- How to measure completion: Completion of test cases for all key functionalities (USDC disbursement, multisig approvals, vendor transactions), including load testing and security auditing. A post-production test report documenting the results, any issues found, and their resolutions.\n- Estimated date of completion: Week 26\n- Budget: 42,552.31 XLM (USD 4,088)\nDeliverable 3: Documentation, Open Source, and Publication\n- Brief description: Finalize comprehensive project documentation and make the Soroban smart contracts and other relevant code open-source. This includes publishing the SRS, User Manual, Developer Guide, and any relevant code repositories on platforms such as GitHub for public access. \n- How to measure completion: Successful publication of all relevant documentation on GitHub (repo cleanups) and the project's official website, along with an open-sourced code (L-GPL 3.0 or MIT). Additionally, at least one blog post or article published to highlight the project. \n- Estimated date of completion: Week 24\n- Budget: 103,091.50 XLM (USD 9,904)",
                        "stellar.teamMembers": "Ruchin Singh",
                        "stellar.urls": {
                            "website": "https://rahat.io/",
                            "codeRepository": "https://github.com/rahataid",
                            "videoURL": "https://www.youtube.com/watch?v=D9eu5_TuVcg",
                            "pitchDeck": "https://bit.ly/4dhWYQw"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/rumsan",
                            "twitter": "https://x.com/rahataid"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 99974.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 602840.68,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-07-07T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:12",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recwxiAUvdOz3nlNh",
                    "projectId": "daoip5:stellar:project:nodies",
                    "projectName": "Nodies",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recwxiAUvdOz3nlNh",
                    "status": "Awarded",
                    "description": "With 3+ years of experience, Nodies offers the Stellar community high-performance RPC & Horizon services in Mainnet and Testnet.",
                    "fundsApprovedInUSD": 62000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/1ECPrsvs2CrolOu-OO-JxNegh5qEz_niC/view?usp=sharing",
                        "stellar.productsAndServices": "Nodies plans to integrate Stellar RPC and Horizon into our platform, nodies.app. Upon integration, users will be able to easily create private endpoints for the corresponding blockchain on our platform and enjoy highly performant RPC and Horizon services.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success for our project is defined by 3 primary metrics:\n1. Completion of Deliverables on Time: We consider our project successful if all deliverables are completed within the specified timelines.\n2. High Performance of RPC and Horizon: Another crucial indicator of success is the performance of our nodes. We benchmark our nodes to ensure they provide fast, reliable access. Achieving and maintaining high performance in these benchmarks confirms our capability to deliver top-tier infrastructure services.\n3. Widespread Adoption of Nodies’ Stellar Endpoints: A significant measure of our success is the broad adoption of our Stellar Mainnet and Testnet endpoints. We aim for a substantial number of developers and projects to utilize these endpoints, demonstrating the value and effectiveness of Nodies’ services within the developer community.\n\t\nBy achieving these goals, we ensure not only the fulfillment of our project requirements but also the broader impact and utility of Nodies’ offerings in the blockchain ecosystem.",
                        "stellar.tractionEvidence": "We currently have over 3000 registered users on our platform. We average around 1-1.5 billion RPC requests daily, with peaks of close to 3 billion. Our Snapshot services, though fairly new, are already seeing significant download traffic at about 3TB per day.",
                        "stellar.goToMarketPlan": "Our go-to-market strategy is centered around leveraging Nodies' established reputation for high-performance and reliable Web3 infrastructure. Here's our approach:\n- Targeted Community Outreach - We will actively engage with the Stellar and broader blockchain developer communities through forums, developer events, and partnerships to promote our services, emphasizing our proven track record in providing reliable and cost-effective RPC and Horizon solutions.\n- Partnerships - We will build partnerships with blockchain projects and foundations, as we've successfully done with Kava, Metis, and many others, to integrate our services into their ecosystems, helping streamline developer onboarding and infrastructure setup.\n- Content Marketing - We will create targeted content (blog posts, updated docs pages, tutorials, etc.) highlighting the benefits of using our infrastructure, particularly in simplifying blockchain development, ensuring fast response times, and maintaining high uptime.\n- Scalable Pricing Models - We will offer clear and affordable pricing models to accommodate both small developers and large enterprises, reducing the barriers to entry and scaling as needed.",
                        "stellar.tranche1Deliverables": "1. MVP Deliverable 1\n    a. Allocate hardware and spin up Stellar Mainnet & Testnet RPC and Horizon nodes in multiple geographical regions\n    b. Completed once all nodes are syncing up to the current block\n    c. Estimated to complete within 2 weeks\n    d. Budget $35,000\n2. MVP Deliverable 2\n    a. Load test RPC nodes using Flood/Vegeta across various RPC methods\n    b. Completed once all nodes are load-tested to handle high RPS without issues, See here for more on our benchmark standards.\n    c. Nodies will publish results of the load tests on our Docs page, in addition to other channels as requested by SCF team. \n    d. Estimated to complete within 1 week after completion of Deliverable 1.\n    e. Budget $5,000",
                        "stellar.tranche2Testnet": "1. Testnet Deliverable 1\n    a. Whitelist Stellar testnet RPC and Horizon onto Nodies' platform, enabling access to public and private endpoints\n    b. Nodies will notify SCF team once the endpoints are available\n    c. Estimated to complete within 2-3 days after completion of MVP Deliverable 2. \n    d. Budget $5,000\n2. Testnet Deliverable 2\n    a. Allocate 5 million daily requests in public traffic for Stellar RPC and Horizon Testnet for a period of 1 year\n    b. This automatically becomes available upon completion of Testnet Deliverable 1\n    c. Budget $6,000\n3. Testnet Deliverable 3\n    a. Update Stellar and Nodies Docs pages\n    b. Estimated to complete within 1 week after completion of Testnet Deliverable 2, dependent on coordination with Stellar’s Docs team.\n    c. Budget $0",
                        "stellar.tranche3Mainnet": "1. Mainnet Deliverable 1\n    a. Whitelist Stellar testnet RPC and Horizon onto Nodies' platform, enabling access to public and private endpoints\n    b. Nodies will notify SCF team once the endpoints are available\n    c. Estimated to complete within 2-3 days after completion of MVP Deliverable 2. \n    d. Budget $5,000\n2. Mainnet Deliverable 2\n    a. Allocate 5 million daily requests in public traffic for Stellar RPC and Horizon Mainnet for a period of 1 year\n    b. This automatically becomes available upon completion of Mainnet Deliverable 1\n    c. Budget $6,000\n3. Mainnet Deliverable 3\n    a. Update Stellar and Nodies Docs pages\n    b. Estimated to complete within 1 week after completion of Mainnet Deliverable 2, dependent on coordination with Stellar’s Docs team.\n    c. Budget $0",
                        "stellar.teamMembers": "giantfrog",
                        "stellar.urls": {
                            "website": "https://nodies.app",
                            "codeRepository": "https://github.com/baaspoolsllc",
                            "videoURL": "https://youtu.be/NhgJcrslBWg"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/nodies_infra",
                            "discord": "https://nodies.app/discord"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 62000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 338972.35,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-03T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:13",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recYojyYEHFK01KlM",
                    "projectId": "daoip5:stellar:project:hoops-finance",
                    "projectName": "Hoops Finance",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recYojyYEHFK01KlM",
                    "status": "Awarded",
                    "description": "Hoops Finance offers a user-centric DeFi platform for multi-token management, liquidity swaps, and universal savings, empowering users and developers with real-time analytics and seamless token exchanges.",
                    "fundsApprovedInUSD": 100000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://bastianstudio.notion.site/Technical-Architecture-e4c6c5480b57490ca88acdc3634b0980?pvs=4",
                        "stellar.productsAndServices": "1. Data Indexer and Oracle Services\nDescription:\nThis product will aggregate real-time financial data from various DeFi protocols and provide off-chain data proofs through oracle services. It will offer comprehensive market data, transaction history, and sentiment analysis to users.\nKey Features:\n- Real-Time Data Indexing: Aggregates and indexes financial data from multiple Soroban DeFi protocols.\n- Oracle Services: Provides verified data proofs from off-chain sources.\n- Sentiment Analysis: Integrates sentiment analysis tools for market trends based on social media and historical data.\nStellar Integration:\n- Data Storage: Utilize Stellar’s blockchain to store indexed data, through an Oracle contract, ensuring transparency and immutability.\n- Interoperability: Leverage Stellar’s interoperability features to fetch and verify data from off-chain sources.\nImpact:\n- Enhanced Decision-Making: Provides users with reliable and transparent access to financial data, improving investment strategies.\n- Increased Trust: Uses Stellar’s secure ledger to build user trust in the data provided.\n- Improved Risk Assessment: Sentiment analysis enhances risk management by providing deeper insights into market trends.\n2. DeFi Protocol with Automated Liquidity Management\nDescription:\nThis product will offer a comprehensive DeFi platform with features such as automated liquidity management, customizable smart savings accounts, and advanced portfolio management tools. Users will be able to create and manage custom trading strategies and risk profiles through an intuitive user interface.\nKey Features:\n- Automated Liquidity Management: Manages liquidity across multiple pools and protocols using advanced algorithms.\n- Customizable Smart Savings Accounts: Allows users to create personalized savings accounts with custom strategies and risk profiles.\n- Advanced Portfolio Management: Provides tools for creating, managing, and optimizing digital asset portfolios.\n- Custom Strategy Builder: Enables users to automate trades based on custom strategies directly through the user interface.\nStellar Integration:\n- Smart Contracts: Utilize Stellar’s smart contracts (Soroban) to automate liquidity provision, enforce custom strategies, and manage funds securely.\n- Decentralized Exchange (SDEX): Integrate with Stellar’s decentralized exchange for real-time trading and portfolio adjustments.\nImpact:\n- Increased Efficiency: Automates liquidity management and trading strategies, reducing manual effort and improving investment returns.\n- Enhanced User Experience: Provides tailored financial solutions and an intuitive interface to manage investments seamlessly.\n- Broadened Accessibility: Expands access to decentralized finance by offering user-friendly tools and automating complex processes.\n- Built Trust: Leverages Stellar’s secure and transparent environment to ensure user confidence in the platform’s reliability and security.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Key Metrics\n- User Engagement:\n    - Active Users: A growing number of active users.\n    - User Retention: High retention rates.\n- Partnerships:\n    - Ecosystem Integrations: Successful partnerships with multiple projects.\n    - Enterprise Clients: Acquisition of enterprise customers.\n- Platform Performance:\n    - Reliability and Uptime: High reliability.\n    - Scalability: Scalable infrastructure.\n- Revenue Growth:\n    - Subscription Services: Steady growth in revenue.\n    - Pro Dashboard: Successful monetization.\n    - Liquidity Management: Fees from LP tokens and swaps.\nImpact Metrics\n- Market Influence:\n    - Market Data Authority: Trusted source for accurate market data.\n    - Soroban Visibility: Increased visibility and integration.\n- Ecosystem Growth:\n    - Innovation: Drives ecosystem innovation.\n    - Community Engagement: Strong, engaged community.\n- User Empowerment:\n    - Financial Decisions: Tools for informed decisions.\n    - Accessibility: Financial tools for all users.\n- Social Impact:\n- \n    - Financial Inclusion: Promoting financial inclusion worldwide",
                        "stellar.tractionEvidence": "Our project demonstrates significant traction and validation within the Stellar ecosystem and beyond. We are currently tracking all AMM transactions from Soroswap, Phoenix, and Aquarius, as well as partially tracking Comet, highlighting our platform's growing financial impact. Our user engagement is robust, with over 50,000 combined impressions on X (formerly known as Twitter), reflecting strong community interest and interaction with our updates. We have received substantial support from key players, including Easy A, Stellar’s official channels, and various ecosystem protocols and projects, which have enhanced our platform’s capabilities and user experience. In addition, we have conducted numerous discovery interviews via Discord and Google Meetings and participated in events like Consensus and Cornell Blockchain to gather direct feedback.\nWe have also actively sought validation through in-person channels, such as presenting at StartupGrind NYC (video link), signing up for CubeSummitNYC, and preparing to present at Meridian 2024. Our commitment to transparency is evident as we build everything in public and engage in continuous conversations with ecosystem partners and SDF developers. This comprehensive approach underscores our project's traction and validation, positioning us well within the Stellar community and the broader blockchain industry.",
                        "stellar.goToMarketPlan": "After completing our submission, our go-to-market strategy will focus on multiple channels to ensure broad reach and engagement within the ecosystem, along with establishing a foundation for sustainable growth and adoption:\n\n- Social Media Presence and Automation:\n    - Automated Market Data Posting: We will leverage automation tools to consistently post relevant market data, insights, and updates across our social media channels. This will enhance our visibility and establish us as a trusted source of information in the market.\n    - User Engagement: Inviting users to explore and use our free platform through engaging content, tutorials, and community interaction. This will help build a loyal user base and drive initial adoption.\n- Partnerships with Ecosystem Projects:\n    - Collaborations: We aim to partner with various projects within the ecosystem to integrate specific functionalities and enhance our platform’s capabilities. These partnerships will not only strengthen our platform but also foster a collaborative environment in the ecosystem.\n    - Infrastructure Utilization: By offering our infrastructure to current and future projects, we will create a mutually beneficial relationship that promotes growth and innovation across the board.\n- Enterprise and Financial Institutions:\n    - Premium Offerings: We will offer our platform’s advanced features and infrastructure to enterprise customers and private financial institutions for a premium. This will open up new revenue streams and establish our platform as a robust solution for high-end users.\n    - Tailored Solutions: Providing customized solutions to meet the specific needs of enterprise customers and financial institutions, thereby ensuring a higher value proposition.\n- Pro Dashboard Development:\n    - Advanced Features: The creation of a pro dashboard will include advanced signals, custom portfolio strategies, and other premium features that cater to professional traders and institutional investors.\n    - Unique Value Proposition: This pro dashboard will set us apart by providing users with unique tools and insights, thereby boosting Soroban’s visibility and accessibility.\n- Community Building and Support:\n    - Educational Content: Developing and distributing educational content such as webinars, tutorials, and guides to help users understand and leverage our platform effectively.\n    - Customer Support: Establishing a robust customer support system to assist users, gather feedback, and continuously improve our offerings.\n- Marketing and Outreach:\n    - Targeted Marketing Campaigns: Running targeted marketing campaigns to reach potential users and stakeholders within and beyond the ecosystem.\n    - Events and Conferences: Participating in industry events, conferences, and webinars to showcase our platform and network with potential partners and customers.",
                        "stellar.tranche1Deliverables": "It is important to note that all data indexed by our platform has always been mainnet data. Therefore, we are arranging the tranches based on the progression of Soroban smart contract functionality, rather than the indexer itself.\n- Deliverable 1: Proof of Concept and Simple MVP\n- Brief Description:\n    - Presented a proof of concept at the Easy A Consensus hackathon, showcasing a simple MVP with Soroban financial data on a liquidity pair.\n- Completion Metrics:\n        - Demonstrated functionality during the hackathon.\n    - Simple MVP deployed with live Soroban data.\n    - Status: Completed ✅\n    - Completion Date: June 2024\n    - Budget: $0\n- Deliverable 2: Public Swap Page UI and Savings Account UI\n- Brief Description:\n    - Develop the user interface for the public swap page and savings account, allowing users to interact with the platform's DeFi features.\n- Completion Metrics:\n        - UI components live and accessible to users.\n    - Positive user feedback on usability and design.\n    - Status: Ongoing ⚙️\n    - Completion Date: September 2024\n    - Budget: $10,000",
                        "stellar.tranche2Testnet": "- Deliverable 3: Improved UI and Data from Soroswap\n- Brief Description:\n    - Launched an improved user interface with updated data from Soroswap. This marked the beginning of the indexer and the testing phase for the proof of concept, incorporating community and customer feedback.\n- Completion Metrics:\n        - Updated UI live with enhanced usability.\n        - Data from Soroswap integrated and displayed accurately.\n    - Indexer tested and adjusted based on user input.\n    - Status: Completed ✅\n    - Completion Date: August 2024\n- Deliverable 4: Swaps and Savings Accounts on Testnet\n- Brief Description:\n    - Implement swaps and savings account functionalities on the testnet, allowing for comprehensive testing and feedback collection.\n- Completion Metrics:\n        - Swaps and savings accounts features deployed on testnet.\n    - Active testing and feedback collection from users.\n    - Status: Ongoing ⚙️\n    - Budget: $10,000\n    - Completion Date: November 2024\n    -",
                        "stellar.tranche3Mainnet": "'- Deliverable 5: Integration of Phoenix, Soroswap, and Aquarius into Indexer\n- Brief Description:\n    - Integrated Phoenix, Soroswap, and Aquarius protocols into the platform's indexer, ensuring comprehensive data coverage.\n- Completion Metrics:\n    - Data from Phoenix, Soroswap, and Aquarius indexed and displayed accurately on the platform.\n    - Status: Completed ✅\n- Deliverable 6: Integration of Blend Weighted Pools and Backstop Functionality\n- Brief Description:\n    - Integrate Blend weighted pools and backstop functionality into the platform, enhancing liquidity management.\n- Completion Metrics:\n    - Weighted pools and backstop functionality implemented and operational.\n    - Status: Ongoing ⚙️\n    - Budget: $10,000\n    - Completion Date: November 2024\n- Deliverable 7: Savings Accounts and Swaps on Mainnet\n- Brief Description:\n    - Launch savings accounts and swaps functionalities on Soroban mainnet, managed by an Automated Liquidity Manager utilizing our oracle.\n- Completion Metrics:\n        - Savings accounts and swaps features live on mainnet.\n    - Automated Liquidity Manager operational, leveraging real-time data from the indexer.\n    - Status: Ongoing ⚙️\n    - Budget: $20,000\n    - Completion Date: Q1 2025\n- Deliverable 8: Add Lending Pools, Borrowing/Lending Capabilities, and New Routes for Aggregation\n- Brief Description:\n        - Integrate lending pools into the platform's indexer and enable smart accounts to borrow and lend.\n    - Develop and implement new routes for liquidity aggregation.\n- Completion Metrics:\n        - Lending pools indexed and data available.\n        - Borrowing and lending functionalities live for smart accounts.\n    - New aggregation routes operational.\n    - Status: Planned 🗓️\n    - Budget: $25,000\n    - Completion Date: Q1 2025\n- Deliverable 9: Allow Users to Deposit Liquidity Tokens and Add Multi-Hops for Aggregator\n- Brief Description:\n        - Enable users to deposit liquidity tokens into their accounts for direct management.\n    - Implement multi-hop functionality for the liquidity aggregator.\n- Completion Metrics:\n        - Liquidity token deposit functionality live.\n    - Multi-hop aggregation feature operational.\n    - Status: Planned 🗓️\n    - Budget: $5,000\n    - Completion Date: Q1 2025\n- Deliverable 10: Add Subscription System, Sentiment Analysis, Advanced UI for Smart Accounts, and Market for Liquidity Pool Deposits\n- Brief Description:\n        - Develop a subscription system to provide access to advanced API data unavailable in the public API.\n        - Implement sentiment analysis based on fundamental analysis (text and social media) and technical analysis of historical data to track trends.\n        - Develop an advanced user interface allowing users to manually specify every operation, including protocol, tokens, and liquidity pools.\n    - Create a market for liquidity pool deposits to enable more fluid liquidity redistribution across markets.\n- Completion Metrics:\n        - Subscription system live and operational.\n        - Sentiment analysis functionality operational and providing accurate insights.\n        - Advanced UI live and providing extensive customization options.\n    - Liquidity pool deposit market operational and facilitating liquidity redistribution.\n    - Status: Planned 🗓️\n    - Budget: $20,000\n    - Completion Date: Q1 2025",
                        "stellar.teamMembers": "Bastian Alexander Koh Cuende, Tim Baker",
                        "stellar.urls": {
                            "website": "https://hoops.finance",
                            "codeRepository": "https://github.com/alexanderkoh/hoops-UI, https://github.com/Hoops-Finance",
                            "videoURL": "https://vimeo.com/1010830478?share=copy"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 66666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 381454.81,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:14",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recGwkWWrGuZAuC3b",
                    "projectId": "daoip5:stellar:project:arculus-x-stellar-payments-with-soroban",
                    "projectName": "Arculus x Stellar: Payments With Soroban",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recGwkWWrGuZAuC3b",
                    "status": "Awarded",
                    "description": "Arculus enables stablecoin or token holders on Stellar to pay at any Visa/MasterCard merchant, directly from self-custody wallets, utilizing Soroban smart-contracts.",
                    "fundsApprovedInUSD": 148400.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/drawings/d/1GI27C-G8A2JkL-lsbr8smC3ufmsygxUghMH_cRu82iM/edit?usp=sharing",
                        "stellar.productsAndServices": "PRODUCT\n\nUtilizing Soroban, Arculus will write the smart contract that will allow holders of stablecoins (and potentially other tokens) on Stellar to use those funds at any merchant worldwide that accepts Visa or MasterCard. This solution allows for payments directly from a self-custody wallet with the consumer not giving up ownership until the moment of spend.\n\nPROBLEM\n\nCold storage, while highly secure for storage of crypto assets, are often not ideal for a transactional experience. Arculus has already solved this issue with our next-gen hardware wallet that combines the security of cold storage with the usability of a hot wallet.\n\nCurrently, the practical utility of using cryptocurrencies in daily commerce, where speed and convenience are paramount, leaves much to be desired. \n\nMost merchants do not accept direct payment in tokens or stablecoins; most merchants still want fiat currency. At the very few merchants that do accept digital asset payments, it is a slow process of QR codes, deep-linking, or double checking addresses. In short, it is a slower, more difficult process for both consumers and merchants.\n\nArculus is making it possible to bridge the gap between consumers with digital assets and traditional merchants by extending the unique transactional features of our cold-storage ecosystem - using Soroban smart contracts to connect self-custodied assets to traditional card payment rails. Arculus with Stellar makes it simple and efficient to pay from cold storage with Stellar tokens. That means meeting the current most popular methodology (VISA/MC Card Tap-To-Pay at POS terminals) where its at.\n\nSOLUTION\n\nArculus is no stranger to the world of traditional payments. Arculus is created by Composecure, which for the past 20 years has been the world's leading manufacturer of metal payment cards.\n\nUtilizing Stellar's new smart contract platform, Soroban, we will write smart contracts that allow fiat payments from self-custody & cold storage utilizing USDC on Stellar. This functionality will be demonstrated through simulated payment transactions with USDC on testnet and mainnet, as a real world payment scenario would require a licensed transmittance of payment to the merchant acquirer via Visanet. This paves the way for many different entities to adopt the smart contract and use in their own localities, for their own models, with their own remitters (Scaleable B2B Soroban Crypto to Fiat functionality with Stellar Anchor integration).\n\nIn practice, the smart contract logic would be loaded onto the chip on a card that's also loaded with a Visa or Mastercard applet. A user would tap to pay at any point of sale terminal, and it would act just as a normal fiat tap-to-pay transaction would, except the balance would be deducted from their cold-storage wallet.\n\n**Although USD is the dominant backing currency for stablecoins today, this same solution can work as non USD stablecoins on stellar for this solution.**\n\nWHAT PROBLEMS DOES THIS SOLVE?\n\nThis has the potential to solve many issues in a variety of use-cases. Most notably, and obviously, this greatly increases the real world use case of crypto assets - in this case, Stellar. Allowing people to spend their crypto assets in a way that is familiar and as easy as what they already do every day.\n\nStellar-Aid Example: Distribute Stellar-Aid branded cards that have this smart contract logic loaded - and can receive aid disbursements. Users of this card will be able to immediately utilize the aid, and eliminate Steps 3 and 4 of the Stellar-Aid Workflow, allowing for faster and more simple access to much-needed aid.\n\nOverall, this project solves the problem of current clunky and slow processes of paying for goods or services with crypto assets, and brings the usability to the current premium accepted methodology.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Make USDC on Stellar as transactional for consumers around the world as fiat. \nThrough B2B Partners, global consumers will start using stablecoins or tokens on the Stellar blockchain for day-to-day real world payments, and continue to store value onto the Stellar Blockchain as a hedge against inflation.",
                        "stellar.tractionEvidence": "https://polygonscan.com/address/0x389c6f04d39ff038cc99f94bce338d2f5eb64a67#code\n\nThe above link showcases the current smart contract operating on polygon that we have loaded onto VISA/MC payment cards and successfully uses USDC on Polygon contained in the Arculus wallet to purchase goods and settle in local currency. \n\nThis functionality is displayed in the Pitch Video Link.",
                        "stellar.goToMarketPlan": "Our go-to-market strategy is to bring on B2B partners that are already active in the crypto-space or in card payments, and bring them the efficiency and speed of payments on Stellar. Arculus is already working with Moneygram as an on and off ramp for USDC on Stellar. \nAdditionally, we see the potential for a remittance card product that allows consumers to more easily access their USDC on Stellar. We also see a very valuable use with Stellar Aid-Assist, where Aid recipients could directly send or spend Aid funds anywhere that accepts Visa or Mastercard. This use case would reduce the need for Aid-Assist recipients to obtain local fiat.",
                        "stellar.tranche1Deliverables": "1. [Develop Soroban Collateral #1 - Controller]\n\t\t\t\t\t\ta. There are two contracts, the controller contract and the collateral contract. There will be a single instance of the controller contract           \t\t\t\t\t\t(owned by an administrator). It deploys an instance of the collateral contract for a particular user. The controller contract also invokes operations in the collateral contract.\n \t\t\t\t\t\tb. Completion for this milestone is validated by the completion of the second milestone, when the controller deploys the instance of the collateral contract and invokes given operations in the collateral contract.\n             c. 10/15/24\n             d. $50,500\n\n\n \t\t\t\t2. [Develop Soroban Collateral #2 - Collateral]\n\t\t\t\t\t\ta. Developed in tandem with the Controller contract. There will be an instance of the collateral contract for each user. The user \"owns\" the collateral contract but cannot perform operations on it directly. The collateral contract holds a balance of crypto assets. It also tracks a spent amount for each asset, which limits the amount the user can withdraw.\n \t\t\t\t\t\tb. Completion for this milestone is validated by the completion of the first milestone, when the Collateral contract and it's operations are invoked through the Controller contract.\n             c. 10/15/24\n             d. $42,300\n\n\n\t\t\t3. [Develop Operations Architecture]\n\t\t\t\t\t\ta. There are four main operations. These operations are invoked by the UI on the controller contract and must be authorized by the administrator. The controller contract will then invoke the corresponding operation on the collateral contract. The collateral contract will only allow operations initiated by the controller contract. The four operations are described below.\n\n- Spend: Spend some amount of a particular crypto asset. The administrator initiates this operation when the user performs a spend operation in the financial arena, such as a purchase using a card. If there is a sufficient balance in the asset, the collateral contract increments the spent amount for that asset.\n- Payment: The administrator initiates this operation when the user makes a payment to pay down the outstanding balance. This reduces the spent amount of the appropriate asset.\n- Withdraw: The user requests to withdraw the collateral balance to another crypto account. The user may withdraw the balance of the asset minus the spent amount.\n- Liquidate: The bank seizes the collateral assets. The spent amount of the appropriate asset is sent to the bank's treasury account.\n\n \t\t\t\t\t\tb. Completion for this milestone is validated by initial testing of the Soroban Collateral, where invoking the controller contract, authorized by the admin, invokes corresponding operations on the collateral contract. This milestone requires testable functionality of the first two milestones.\n             c. 10/30/24\n             d. $36,800",
                        "stellar.tranche2Testnet": "1. [Deploy Initial Smart Contracts on Testnet]\n\t\t\t\t\t   a. Activate Controller and Collateral smart contracts on Soroban's sandboxed test network.\n  \t\t\t\t\t b. Completion for this milestone is validated by the successful upload of both smart contracts to the testnet.\n             c. 11/2/24\n             d. N/A\n\n\t\t    2. [Conduct Bug Testing and Fixes]\n\t\t\t\t\t   a. During testing of the functionality of the smart contracts, De-Bug as necessary. \n  \t\t\t\t\t b. That any bugs encountered are eliminated and the smart contracts move toward a smooth as intended experience.\n             c. 11/30/24\n             d. N/A\n\n\t\t    3. [Test network load and scalability]\n\t\t\t\t\t   a. Ensure the system can scale efficiently and perform under heavy usage without issues before going live.\n  \t\t\t\t\t b. Review logs and metrics from the test runs to see real-time data on how the system performed under stress. Cover various levels of \ttransaction volumes and user loads and ensure these test scenarios hold up. Make fixes as necessary. \n             c. 12/15/24\n             d. N/A\n\n\t\t\t\t\t4. [Final Security Internal Review]\n\t\t\t\t\t   a. Code Review - Testing and Validation - Compliance Check - Sign Off.\n  \t\t\t\t\t b. Ensure that all testing and verification passes tests flawlessly. These checks include static analysis, logic verification, unit testing, integration testing, penetration tests, compliance review, detailed report, and final sign off for approval of readiness for Mainnet launch. This final testnet milestone ensures stabilization.\n             c. 1/12/24\n             d. N/A",
                        "stellar.tranche3Mainnet": "1. [Mainnet Preperation]\n\t\t\t\t\t   a. Develop a deployment plan outlining the steps and timing for the mainnet launch, and confirm that all infrastructure components are ready and properly configured for Mainnet operation.\n  \t\t\t\t\t b. Completion for this milestone is validated by ensuring that the deployment plan aligns with the goals of the project fully, and that infrastructure components are tested and configured properly.\n             c. 1/30/24\n             d. $8,500\n\n\t\t\t\t2. [Mainnet Launch]\n\t\t\t\t\t   a. Deploy the smart contracts to the mainnet according to the deployment plan.\n  \t\t\t\t\t b. Launch and monitor the system closely for any issues or anomalies immediately following deployment.\n             c. 2/3/24\n             d. $10,300\n\n\t\t\t\t3. [Post-Launch Activities]\n\t\t\t\t\t   a. Ongoing monitoring to ensure the system operates smoothly and detects any unexpected issues early. Determine and document scope for consumer launch requirements (External Audit, etc.) Research development requirements for Non-USD Stablecoin support in this model.\n  \t\t\t\t\t b. Perform monitoring, asset monitoring infrastructure & dashboard development, future development research, determine audit budget and requirements.\n             c. Ongoing & Periodic\n             d. N/A",
                        "stellar.teamMembers": "Jonah Johnson",
                        "stellar.urls": {
                            "website": "https://www.getarculus.com",
                            "codeRepository": "https://docs.google.com/document/d/1ZyDhCaCBMjPvo8EzhMEXSFy4WtGPRk0MI4Z7Ae8Ipgg/edit?usp=sharing",
                            "videoURL": "https://vimeo.com/1010382415?share=copy"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 98933.34,
                                "denomination": "USD"
                            },
                            {
                                "amount": 274970.92,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:15",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recFc20CibJqREDyr",
                    "projectId": "daoip5:stellar:project:transfermole",
                    "projectName": "TransferMole",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recFc20CibJqREDyr",
                    "status": "Awarded",
                    "description": "TransferMole turns social media usernames into universal payment addresses to simplify P2P payments for non-crypto natives. It removes complexity from crypto routing and navigating on-/offramp steps.",
                    "fundsApprovedInUSD": 60000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docsend.com/view/pdrenfqpav5v4cmc",
                        "stellar.productsAndServices": "TransferMole currently consists of 2 parts:\n\nPart 1: Social payment directory - maps social media usernames to financial termination accounts (e.g. crypto address on any supported chain, bank account, debit card)\nPart 2: Payment routing network - provides available payment methods based on recipient's termination account\n\nWith the SCF Build Award, we would like to expand the payment routing network to Stellar's on- and off-ramp partners. This would provide people more localised payment options when sending and receiving payments with social media usernames. The SCF Build Award helps to launch the following additional features: \n\nFeature 1: Offramp from embedded wallet\n- When users sign up to TransferMole, they currently add a receiving crypto address or create a new wallet (we have integrated Circle's programmable wallets with private key abstraction for Web2 users)\n- With the Build Award, users could directly offramp their USDC balance with Stellar's local offramp providers\n- Example: Freelancer receives USDC payment to Telegram username and off-ramps to local bank account via Stellar anchor\n\nFeature 2: Pay social username with local payment option\n- Today, users can make payments to Telegram, Instagram and other social media usernames. Each username resolves to a payment page with available payment options based on how the recipient can receive funds. Today's payment options are (1) USDC from Ethereum, Base, Avalanche or Polygon and (2) Visa/Mastercard\n- With the Build Award, the available payment options could be expanded and include local payment services\n- Example: Send USDC payment to Telegram username and on-ramp using a local e-wallet",
                        "stellar.successCriteria": "We expect to service 500,000 users by Q1 2025, across Web2 and Web3, who use their Telegram or social username to receive payments for the following use cases:\n- Freelancers accepting client payments with the LinkedIn, Google or other social username\n- Creators/Influencers engaging their Web2 audience with giveaways/airdrops to their Telegram, Instagram or Tiktok usernames\n- Migrant workers, families and friends supporting people overseas with casual transfers to their social username\n\nUltimately, irrespective of the use case, our mission is to simplify global P2P payments by removing the need to understand crypto or cross-border payments. For us, success is when people start sharing their social usernames for one-off payment acceptance, especially around social commerce.",
                        "stellar.tractionEvidence": "Soft launched live product at app.transfermole.com\nSigned up ~1000 early adopters -> See export from Db",
                        "stellar.goToMarketPlan": "We just signed a partnership with YesCoin, one of the top rated Telegram games. This allowing us to acquire users at scale, ultimately tapping into +30 million Telegram users to turn their usernames to payment addresses. \n\nAside from this, our marketing & user acquisition strategy can be summarized as follows:\n\nTarget Audience\n- Web3 Telegram users with interests in socialfi, payments, remittance, airdrops.\n\nChannels & Tactics\n- Social media\n    - User acquisition campaigns with Galxe, Zap, (ongoing) and YesCoin, top-rated Telegram game\n    - KOL partnerships with giveaways (ongoing)\n    - Referral incentives (live)\n    - Gamification (whack-a-mole telegram rewards game -> live)\n    - Content types:\n        - Communicate value proposition: Simplicity, flexibility, and security. New features, chains and tokens onboarded.\n        - Communicate WHY: P2P payment experience can & should be more simple. Large market opportunity. Big source of onboarding of web2 users to the onchain economy is social and payments.\n        - Host/attend frequent X spaces with partners (Mario Nawfal spaces confirmed)\n- Cross-project collaborations on Telegram, Twitter, Farcaster\n\nMetrics for Q4 2024\n- New user signups to app: 20,000/week\n- Community growth on Telegram & X -> 5,000/week\n- Community growth on Warpcast -> 150/week",
                        "stellar.tranche1Deliverables": "Scope/Deliverables: \n- Integration of 1 anchor partner for USDC offramp services in EU jurisdiction\n- Embedded functional UX into wallet connected to social username \n- Manual KYC flow where required\n\nAcceptance criteria: \nAbility to offramp $100 USDC to a debit card or bank account through a Stellar anchor partner\n\nEst. completion:\nDecember 2024\n\nBudget:\n$20,000",
                        "stellar.tranche2Testnet": "Scope/Deliverables: \n- Geo-based selection of anchor partners (limited scope to 10 countries)\n- Intuitive UX for offramp services\n- Embedded KYC flow\n\nAcceptance criteria: \n- Invite 25 test users from community to offramp a reward payment\n- Gather, analyse and incorporate feedback\n\nEst. completion:\nJanuary 2025\n\nBudget:\n$20,000",
                        "stellar.tranche3Mainnet": "Scope/Deliverables: \n- Geo-based selection of anchor partners (limited scope to 10 countries)\n- Intuitive UX for offramp services\n- Localised payment options when sending payment to social media username\n- Embedded KYC flow\n\nAcceptance criteria: \n- Public deployment to entire community\n- Public announcements (with KOL support)\n\nEst. completion:\nMarch 2025\n\nBudget:\n$20,000",
                        "stellar.teamMembers": "Gregor Arn",
                        "stellar.urls": {
                            "website": "https://www.transfermole.com",
                            "videoURL": "https://www.loom.com/share/bd69aa76e72f4efea878180cd8283b84?sid=ea25cfc9-6d39-433a-a4c1-3977a57b62c0",
                            "pitchDeck": "https://docsend.com/view/36auczttwbnrvec8"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/transfer-mole/",
                            "twitter": "https://x.com/GoTransferMole"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 256570.42,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:16",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recnj68U9UZAHjBOi",
                    "projectId": "daoip5:stellar:project:trustful",
                    "projectName": "Trustful",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recnj68U9UZAHjBOi",
                    "status": "Awarded",
                    "description": "Decentralizing/enhancing Trustful to enable limitless use cases, fostering a solid governance and reputation ecosystem on Stellar.",
                    "fundsApprovedInUSD": 92000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://blockful.notion.site/Trustful-Stellar-v1-e823df97b9d9422e95dc9e23290cef2c?pvs=97#13d2b88f367b4db0888d688ff314dc12",
                        "stellar.productsAndServices": "Next steps\nThe product is evolving from a MVP to a fully-fledged V1 platform that:\n- Utilizes Stellar Badges and Smart Contracts: Transitioning from a database to smart contracts on the Stellar network to enhance security, transparency, and decentralization.\n- Empowers User Profiles: Introduces user profiles that allow members to showcase their contributions and reputation within the Stellar ecosystem.\n- Enables Reputation-Based Groups/Communities: Allows the creation of reputation groups/communities where members define what is important within their context, leveraging Stellar ecosystem quests.\n\nThis V1 phase aims to build on the initial MVP by creating a more sophisticated and impactful reputation system that deeply integrates with the Stellar ecosystem, advancing beyond simple contributions to shape the future of community governance and resource distribution.\n\nTrustful use cases and Stellar ecosystem growth\n1. Creating Reputation-Backed Communities The system enables the creation of communities within the Stellar ecosystem that are backed by reputation data. This approach encourages the formation of small, active nodes of communities—whether they consist of developers, event organizers, or builders—based on shared interests and goals. These communities are formed through a series of reputation badges and corresponding scores. The badge system allows communities to define what is important to them through quests, thereby attracting and aggregating like-minded individuals. This leads to the establishment of specialized working groups that are aligned with the community’s values and objectives. By leveraging reputation data, these reputation-backed communities not only strengthen the social fabric of the Stellar ecosystem but also ensure that collaboration and growth are driven by shared commitments and contributions, rather than just token holdings.\n2. Reputation as Data for Decision-Making Reputation data can be seamlessly integrated into decision-making processes, such as grant applications, to enhance the fairness and impact of resource allocation. Take, for instance, the user flow within the Stellar Community Fund (SCF). Applicants can link their wallets, along with the wallets of their team members involved in the project. These wallets will reflect the cumulative reputation earned within the Stellar ecosystem.\n\nCheck the use case flow here.\n\nSome use cases drive:\n- First Stellar Quadradic Funding Reputation Based: In this incredible use case, reputation acts as a multiplier for voting power, allowing users with fewer tokens to amplify their influence based on their contribution to the ecosystem. By engaging in key activities such as participating in community quests, interacting with Stellar dApps, and maintaining an active presence, users accumulate reputation badges that can increase their voting power to a quadradic funding to small projects or events. What if the major Stellar conferences were funded this way from now on?\n- Incentivizing more members to register on the SCF dashboard: Encouraging broader participation by getting more community members to sign up and engage with the Stellar Community Fund (SCF).\n- Encouraging all team members of applicants to register and complete quests: Promoting the accumulation of reputation within the ecosystem, fostering quality interactions between Stellar and grantees.\n- Motivating active members to remain engaged: Offering the opportunity to earn reputation and be considered for roles such as ambassadors, voters, and other key positions, thus keeping them actively involved in the ecosystem.\n- Incentivizing interaction with dApps on Stellar: Encouraging engagement from users and builders, and attracting more high-quality protocols to the ecosystem by leveraging an active user base.\n\nIn summary:\nThe system encourages broader participation by motivating more members to participate in Stellar actions, thus increasing engagement with the Stellar Community Fund. \n\nIt promotes a culture where all team members of applicants are encouraged to sign up and complete quests, helping them build their reputation within the ecosystem. This approach fosters meaningful interactions between Stellar and its grantees. \n\nActive members are incentivized to stay engaged by offering them the chance to earn reputation, making them eligible for important roles such as ambassadors, voters, grantees and other key positions. By driving interaction with dApps on Stellar, the system not only boosts user and builder engagement but also attracts more high-quality protocols to the ecosystem, benefiting from an active and thriving user base.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success in this context would be measured by both output and impact:\n- Output:\n    - Number of Reputation Badges imported, issued, and created\n    - Number of communities creating their own reputation frameworks\n    - Number of new users funding their wallets and using Trustful to interact with the Stellar ecosystem\n    - Increase in transactions related to reputation building and quadratic funding\n    - Builders creating and using wallets to receive funds, and the number of projects funded\n\n- Impact:\n    - Expanding financial access by enabling a broader range of users to engage with the Stellar ecosystem, especially those who may not have had access to traditional financial services.\n    - Democratizing funding by allowing smaller contributions to have a meaningful impact through the quadratic funding mechanism.\n    - Strengthening ecosystem participation by incentivizing more users to engage in governance and funding, thus building a more active and reputable community.\n    - Empowering builders by providing accessible funding and resources, enabling innovation and further growth within the Stellar ecosystem.\n\nBy focusing on both quantitative outputs and qualitative impacts, success would not only be about scaling numbers but also about the meaningful change these activities bring to the ecosystem and broader financial inclusion.",
                        "stellar.tractionEvidence": "We launched an MVP as part of our first application – this is a Legacy project. \nThis proposal is aimed at preparing the dApp to generate real traction moving forward. The MVP was recently presented to the community during a call on Discord, which helped us gather valuable feedback and insights on the platform’s usability. The feedback received will inform the next steps and improvements, setting the foundation for broader adoption and user engagement.",
                        "stellar.goToMarketPlan": "Our go-to-market plan focuses on leveraging a quadratic funding event as a key launch strategy and integration with other dApps on Stellar\nThis event will serve as the first big real-world application of Trustful's reputation system, driving immediate engagement and showcasing the platform's unique value in decentralized governance and funding.\n\nWe plan to:\n1. Engage key communities and partners within the Stellar ecosystem to participate in and promote the event, building early traction.\n2. Activate growth strategies by incentivizing both participants and voters through reputation-based rewards, ensuring continuous engagement beyond the event.\n3. Expand marketing efforts across social media, crypto forums, and partnerships with influential players in the Stellar space, highlighting the event as a milestone for the future of decentralized funding.\n4. Showcase case studies and success stories from the event to attract additional communities, users, and developers to adopt and integrate Trustful’s reputation system.\n5. Iterate quickly based on feedback from participants and early adopters, making improvements to drive long-term scalability and adoption.\n\nThe Funding Formula:\n- Matching Pool: A pool of funds is set aside by the Stellar Community Fund (SCF) to match donations from individual contributors. Trustful's reputation system will play a critical role in determining how these funds are allocated, leveraging reputation as a factor to amplify the impact of each contributor's support.\n- Donations: Individuals contribute to the projects they support, and those with a higher reputation on Trustful—earned through previous participation in the ecosystem—may have enhanced influence in the donation process. Their reputation can help boost the visibility and impact of their contributions in the quadratic matching process.\n- Quadratic Matching: The key to quadratic funding is the matching formula. The matching amount is calculated in a way that prioritizes breadth of support over the size of individual donations. In Trustful's system, reputation will be an additional layer that affects the matching calculation. The more individual contributors a project has, and the higher the reputation of these contributors on Trustful, the larger the matching amount it can receive. This means that even small contributions from highly reputable community members can have a greater impact than larger contributions from users with lower reputation.\n\nExample:\n- User A: Contributes $50, has no reputation badges.\n- User B: Contributes $30, but has several reputation badges on Trustful, earning them a 5% reputation multiplier.\nEven though User B contributed a smaller amount, their reputation boosts their influence, making their contribution count for more in the quadratic funding calculation. This creates a system where reputation and community engagement play a central role, ensuring that projects are supported by a broad base of trusted and active participants.\n\nObs:\nThis initiative is aimed at supporting and incentivizing contributors who drive education around Stellar and Trustful. A key growth strategy here is that projects receiving rewards through this QF round will be required to create educational content or projects related to Stellar and Trustful, giving a significant boost to both together.\n\nAdditionally, all participants will be using Trustful for this QF, allowing us to launch a real use case of reputation-driven resource allocation, this will generate further growth, as the round will be focused on educational projects about Trustful and Stellar, driving awareness and engagement across the community.\n\n\nThe growth:\nUsers funding their Stellar wallet (this is where a partnership with Albedo or another wallet fits)  \n⬇  \nHundreds of thousands of users interacting with the Stellar ecosystem to build their reputation  \n⬇  \nUsers donating  \n⬇  \nBuilders creating wallets  \n⬇  \nBuilders funding their wallets  \n⬇  \nBuilders receiving funding to build on Stellar\n⬇ \nBuilders creating projects to generate growth around Trustful <> Stellar\n\nWe also plan to:\n1. Expand Trustful’s reputation use cases: By integrating real-time SCF data, we'll create new pathways for grantees and funders to engage with reputation-based funding.\n2. Drive community adoption: The Stellar quests integration will encourage more users to participate and build reputation, enhancing engagement through SCF-related tasks.\n3. Showcase new features: During the launch, we will promote the SCF API integration to highlight how Trustful can enhance transparency and efficiency in grant distribution.\n4. Target developers and partners: By offering resources open-source and storybooks, we’ll attract developers and ecosystem partners to build on Stellar and use Trustful, further expanding its capabilities and use cases.\n\n\nNote that some dApps, such as Tansu and also the Brazilian ambassadors community, are already prepared and taking the first steps to integrate Trustful into their activities. The QF round will take place after we achieve all the milestones, gather user feedback, and implement necessary improvements to ensure the QF round runs smoothly.",
                        "stellar.tranche1Deliverables": "MVP is live! \nFeel free to access the dApp and issue your Reputation Early Adopter badge\n\nThe MVP was part of the Activation Award, and we have already presented it to the community, which received it positively and provided ideas for use cases (this is the spirit). We will soon have a dApp (Tansu) integrating Trustful for maintainer levels and to aggregate reputation for the participants involved in the dApp. In addition to the use cases we can implement to improve ambassador processes, resource allocation, and events on Stellar, we already have dApps that managed to find use cases.\n\n- Check the gathered feedback here.",
                        "stellar.tranche2Testnet": "Milestone 1: Smart Contract Development and Decentralization\n[Deliverable 1: Smart Contracts on Stellar]\nBrief description: Development and deployment of multiple smart contracts on the Stellar network to manage reputation scoring and FeeBumps integration.\nHow to measure completion: Smart contracts are deployed and functional on the Stellar testnet, passing initial tests.\nEstimated date of completion: December 2024\n\nRationale: This milestone involves building and testing multiple smart contracts, deploying them on Stellar, and ensuring proper decentralization. It also includes the integration of transaction management through Stellar’s FeeBumps, which requires back-end expertise.\n\n[Deliverable 2: Decentralization of the Badges and Score reputation system]\nBrief description: Ensure that reputation badges and scoring are decentralized, with contracts operating independently on Stellar.\nHow to measure completion: Decentralization process completed, validated by multiple independent nodes.\nEstimated date of completion: December 2024\n\nRationale: Decentralizing the scoring process ensures that reputation data is securely managed and resistant to central control, which is critical for the long-term viability of the system.\n\nMilestone 2: User Profile Features and Reputation Dashboard\n[Deliverable 1: User Profiles]\nBrief description: Development of user profile features integrated with the reputation system.\nHow to measure completion: Profiles are created for users, displaying their reputation badges and community involvement.\nEstimated date of completion: December 2024\n\nRationale: Building user profiles and integrating them with reputation data requires both back-end and front-end development. This also includes design work for a user-friendly interface.\n\n[Deliverable 2: Reputation Dashboard]\nBrief description: Creation of a dashboard for users to view and manage their reputation across communities.\nHow to measure completion: Fully functional dashboard available on the front-end, displaying user reputation data.\nEstimated date of completion: December 2024\n\nRationale: A reputation dashboard is essential for users to easily track and manage their progress, badges, and community standing, providing a transparent interface for engagement.\n\nMilestone 3: Community Reputation Framework and Customization\n[Deliverable 1: Community-Specific Reputation Tools]\nBrief description: Tools for creating and managing customizable reputation frameworks for individual communities.\nHow to measure completion: Communities can create their own reputation frameworks and manage them independently.\nEstimated date of completion: January 2025\n\nRationale: Creating customizable frameworks for different communities will require advanced logic in the smart contracts and a flexible UI for community administrators.\n\n[Deliverable 2: Scoring Mechanisms and UI Development]\nBrief description: Develop scoring mechanisms and user-friendly interfaces for community reputation management.\nHow to measure completion: Scoring mechanisms and a flexible UI are available for community administrators to manage reputation.\nEstimated date of completion: February 2025\n\nRationale: This milestone involves more complex logic and integration with Stellar quests, ensuring a tailored approach to community reputation management.",
                        "stellar.tranche3Mainnet": "Milestone 4: Code Review and Testing\n[Deliverable 1: Deployment on Mainnet]\nBrief description: Deploy the smart contracts and the entire system on the mainnet to enable full functionality and usage in a live environment.\nHow to measure completion: Successful deployment on the mainnet with all necessary features functional and accessible to the users.\nEstimated date of completion: February 2025\n\nRationale: Deploying on the mainnet is crucial for transitioning from testing to a fully operational system, ensuring real-world application and adoption of the protocol.\n\n[Deliverable 2: Code Review]\n- Brief description: Comprehensive review of the entire codebase.\n- How to measure completion: Completion of the code review with a report.\n- Estimated date of completion: February 2025\n- Rationale: A code review is essential to ensure the robustness and security of the system, given the sensitivity of reputation data.\n\n[Deliverable 3: Testing of the Entire System]\n- Brief description: Thorough testing of smart contracts, front-end, and back-end systems to ensure seamless integration.\n- How to measure completion: System passes all predefined tests, with no critical bugs remaining.\n- Estimated date of completion: February 2025\n- Rationale: Extensive testing is necessary to identify and resolve any issues, ensuring the system functions smoothly across all components.",
                        "stellar.teamMembers": "Daniela  Zschaber",
                        "stellar.urls": {
                            "website": "https://trustful-stellar.vercel.app/",
                            "codeRepository": "https://github.com/blockful-io/trustful-stellar-dapp",
                            "videoURL": "https://www.youtube.com/watch?v=xXrUs-s8TvM"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 61333.34,
                                "denomination": "USD"
                            },
                            {
                                "amount": 385329.74,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-27T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:17",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recX2wXDG0aIJ4z4I",
                    "projectId": "daoip5:stellar:project:komet-formal-verification",
                    "projectName": "Komet: Formal Verification",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recX2wXDG0aIJ4z4I",
                    "status": "Awarded",
                    "description": "Komet gives developers a tool to fuzz and formally verify Rust code by property testing in Rust, a language they already know",
                    "fundsApprovedInUSD": 100000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1Jr-r8sHDDVqoxvmBOFlSvL1DFS9cCd88Jmrl7mVrmqY/edit",
                        "stellar.productsAndServices": "We used the previous Activation Award to build an MVP tool that currently supports a limited set of Soroban host functions in order to demo formal verification features on the fxDAO smart contracts. With this Build Award, we aim to achieve three primary goals:\n1. Expand Host Function Support: This award will allow us to expand functionality to include all Soroban host functions, enabling comprehensive testing and verification of any smart contract deployed on Soroban.\n2. Improved Interface and Documentation: Enhance the tool’s interface to improve readability of the verification results and provide more meaningful warnings to developers. We will expand the documentation to include detailed installation and usage instructions, as well as demo contracts to experiment on and real-world video examples.\n3. Performance Enhancements: We will test the tool on real-world contracts and use it in our audits, use the feedback to improve the tool. Running formal verification proofs can be time-consuming, and this award will allow us to optimize the performance of Komet, reducing the time required to execute these proofs.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success and impact for Komet would be defined by having auditing firms integrate it into their formal verification process, positioning Komet as the go-to tool for ensuring the security of high TVL protocols on Stellar. \nThe output would be Komet becoming a core part of the audit workflow for protocols, leading to widespread adoption by developers and security teams. Ideally, our goal would be to have four full-time formal verification engineers continuously engaged with large protocols as more value is locked on Stellar.\nThe impact would be significant: by making formal verification the gold standard for Stellar protocols, Komet would reduce the likelihood of security breaches, ultimately protecting user funds and fostering greater confidence in the Stellar ecosystem. This would help drive further adoption of Soroban smart contracts, making Stellar more competitive in the DeFi space and beyond.",
                        "stellar.tractionEvidence": "For prior traction and validation, we would like to highlight our success with Kontrol, a tool similar to Komet but built for Solidity instead of Rust and Soroban. Kontrol has been widely adopted by hundreds of developers, including professional auditing firms, solo auditors, and internal testing teams. Notably, major protocols such as Optimism and Lido have incorporated Kontrol into their security flow. This widespread usage validates the core concept of Komet and demonstrates the demand for such a tool in blockchain ecosystems.\n\nAs for Komet itself, we have already begun exploring its application during the FxDAO smart contract audit. During this audit (available here),  we discovered 10 informational and 10 potentially critical findings. Of the critical findings, considering the hypothetical creation of tests designed using the invariants raised in the audit, 7 out of the 10 would likely have been discovered using fuzzing, and definitely would have been found using formal verification. While not trivial to be identified during testing, the remaining three could be validated and demonstrated using Komet’s formal verification capabilities. Of the 10 informative findings, three could have been found using either fuzzing or formal verification, and the remaining 7 are related to protocol design or best practices. Not only would Komet help shorten the duration of audits due to the ease of validating invariants, but would also empower developers and engineers to test and protect their own code.\n\nGoing forward, we believe that Komet could make all future Soroban audits more efficient, enabling developers and auditors alike to catch critical issues earlier in the development cycle. This validation from both Kontrol’s success and Komet’s real-world applicability shows that Komet is poised to have a substantial impact on the Soroban ecosystem.",
                        "stellar.goToMarketPlan": "Our go-to-market strategy for Komet will follow the blueprint we successfully used for Kontrol, our open-source formal verification tool for Solidity. After building Kontrol, we maintained and improved it through paid formal verification engagements. Developers can freely use the tool, but many projects and protocols hire us to assist with writing tests and proofs and to guide them through the verification process.\nAdditionally, we monetize Kontrol by charging larger protocols for the compute power necessary to run proofs on their extensive codebases, as these often outgrow the developer's local resources.\nFor Komet, we plan to replicate this strategy. After completing the grant project, we will offer Komet to the Stellar community as an open-source tool for developers to use. Beyond that, we will provide services to help projects write formal verification proofs, execute them, and optimize the tool for their specific needs, ensuring the highest level of security. This will allow us to continue developing Komet while building long-term relationships within the Stellar ecosystem.",
                        "stellar.tranche1Deliverables": "Tranche 1 has already been completed using the previous SCF #28 activation award of $50,000. These were the deliverables from the first tranche, all of which have been completed (included links where possible):\n\n[x] Open-source BSD-3 licensed repository with CI setup, importing the KWasm semantics, and including the implemented Soroban host functions.\n    - https://github.com/runtimeverification/komet/ \n[x] Komet property tests for the selected functions from the FxDAO/vaults contract.\n    - Added to the project repository as CI tests.\n[x] Clear documentation on the remaining host functions that must be implemented for complete Soroban support.\n    - GitHub issue: https://github.com/runtimeverification/komet/issues/28 \n[x] CLI tool capable of fuzzing Rust property tests and proving simple properties.\n    - Available via the kup package manager.\n[x] Documentation with installation and usage instructions.\n    - https://docs.runtimeverification.com/index/komet\n\nWe propose to break down the remaining award into 2 tranches, which are outlined below.",
                        "stellar.tranche2Testnet": "Tranche 2 of the Komet project will focus on expanding the tool's capabilities and performance to support all Soroban host functions so that it can handle a wide range of real-world smart contract verifications. \n\n1. Implementation of Semantics for All Soroban Host Functions\n- Objective: Expand Komet to support the entire set of Soroban host functions.\n- Completion Criteria:\n    - Komet’s KSoroban semantics will cover all Soroban host functions, ensuring the tool can verify a complete range of Soroban smart contracts.\n    - The test suite will include extensive tests for each host function to validate their correctness.\n- Estimate:  2 engineers, 4 weeks\n\n2. Fuzzing Support for Soroban Contracts\n- Objective: Ensure that Komet’s fuzzer is capable of running property-based tests for all Soroban host functions, helping developers explore various input scenarios and edge cases.\n- Completion Criteria:\n    - Successfully fuzz non-trivial properties of real-world Soroban contracts.\n    - Fuzz testing will be functional across all Soroban host functions.\n    - Invite & assist community projects to run the fuzzer on their codebases, and collect detailed feedback.\n- Estimate: 2 engineers, 1 week\n\n3. UI/UX Improvements\n- Objective: Make Komet more user-friendly by improving the interface and user experience, specifically focusing on error messaging and the display of results from fuzzing and formal verification.\n- Planned Improvements:\n    - Enhanced error messages that provide clear, actionable information, thus reducing the learning curve for developers unfamiliar with formal methods.\n    - Better presentation of testing results, including visual representations of falsifying examples to make it easier for developers to understand and address issues.\n- Completion Criteria:\n    - Komet will display clear and informative error messages during contract verification.\n    - Developers will be able to easily interpret and act on their test results.\n- Estimate: 2 engineers, 1 week",
                        "stellar.tranche3Mainnet": "The Mainnet phase will focus on the symbolic execution & the prover. In addition, we will refine the user interface, and gather feedback from early users. This phase will make Komet a production-ready tool for all Soroban developers.\n\n1. Prover Improvement for Real-World Contracts\n- Objective: Improve the symbolic execution prover to handle the complexity of real-world contracts, including advanced contract logic and large codebases.\n- Completion Criteria:\n    - Komet will successfully prove non-trivial properties of sophisticated Soroban contracts.\n    - We will concentrate on the prover’s performance, working to ensure that typical proofs can be completed on the engineer’s local machines within a reasonable amount of time. We will use Kontrol’s performance as benchmarks to work towards.\n- Estimate: 2 engineers, 4 weeks\n\n2. Real-World Testing and Developer Feedback\n- Objective: Incorporate feedback from developers using Komet in the Testnet phase and refine the tool based on real-world use cases.\n- Completion Criteria:\n    - Conduct testing sessions with users who tried the fuzzer after phase 2 to gather insights and feedback.\n    - Use feedback to identify further optimizations and improvements for the prover and fuzzer.\n    - Lastly, we will perform some level of formal verification on 3 selected Stellar projects to ensure Komet is working as expected.\n- Estimate: 1 engineer, 2 weeks\n\n3. Finalize Documentation & Examples\n- Objective: Create robust documentation for the tool, along with examples and demo videos.\n- Completion Criteria:\n    - Documentation that will guide a user new to formal verification from installation to running the formal verification tool on their test suite.\n    - At least 2 demo contracts for developers to clone and run the prover and test its features\n    - At least 2 demo video walk-throughs of using Komet to perform formal verification on real-world smart contracts.\n- Estimate: 1 engineer, 2 weeks",
                        "stellar.teamMembers": "Paul Len",
                        "stellar.urls": {
                            "website": "https://komet.runtimeverification.com/",
                            "codeRepository": "https://github.com/runtimeverification/komet",
                            "videoURL": "https://youtu.be/L3W_oqwDyRk"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/3142238/",
                            "twitter": "https://twitter.com/rv_inc",
                            "discord": "https://discord.gg/CurfmXNtbN"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 100000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 334122.16,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #3 - Mainnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-02T00:00:00Z"
                    },
                    "completionPercentage": 100.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:18",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recSDU41kudJLzoXL",
                    "projectId": "daoip5:stellar:project:tansu---soroban-versioning",
                    "projectName": "Tansu - Soroban Versioning",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recSDU41kudJLzoXL",
                    "status": "Awarded",
                    "description": "Bring decentralization back to Version control System with Soroban providing transparency, integrity and security.",
                    "fundsApprovedInUSD": 99360.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/19Mz1cMHRRFikdieiE3SKmVQzDskjQKQiu9ljgVO_I7g/edit?usp=sharing",
                        "stellar.productsAndServices": "Tansu for developer communities\n\nAfter a successful POC phase. Tansu is starting to show our vision and can be played with on Testnet.\n\nWe have an ambitious proposal for the Build award. Besides the road to mainnet and real adoption, we have two objectives:\n1. Offer a decentralized platform for developers to maintain and interact with projects;\n2. Add an emphasis on people behind projects through the use of reputation badges.\n\nDecentralized organization\n\nProjects will have access to their own Decentralized Autonomous Organization (DAO). The community of a project will be able to vote on new features or organizational changes. There are several SCF open source projects we might be able to leverage. The project will have a wallet and the DAO will be used to control the funds allocation. There are going to be mainly two pools. The first pool is dedicated to developers. Funds will be automatically distributed to active maintainers based on specific criteria. The rest of the funds would be managed by the DAO for other purposes such as compensating non-developers, infrastructure costs, or even organizing events. The use of a complex system of redistributions typically used in web3 projects, such as Quadratic Funding (QF), will be evaluated.\n\nTools will be implemented to add/remove maintainers programmatically based on the on-chain status of the project. To that end, we are already leveraging Soroban Domains and will continue to do so and see how we can extend our partnership. Discussions are in progress to get a standard around metadata for instance.\n\nOther personas will be added on-chain as to give other responsibilities. This will further increase projects' transparency and give all participants some visibility.\n\nRelease process on-chain. From triggering the release to registering it.\n\nAdd a level of trust per hash. Combining time based rules with additional factors such as voting from maintainers, to mark specific hashes as more trusted: this introduces a finality concept and enables consumers of the contract to use specific trust levels depending on their own risk profile. We will evaluate the possibility to combine this concept with an automatic update of the hash. This would allow a fully trustless mode of operation. Linked to that, we will add tools to reject a hash. As maintainers can get compromised, it is important to have means to indicate that a project and person is compromised.\n\nFinally, users will be able to subscribe to projects to get news about new trusted releases, security related issues and DAO events.\n\nThe people behind the code\n\nBehind projects, we have people. We want to add profiles for people registered on-chain and recognise their contributions. We will leverage the solution from Trustful and build yet another sustainable partnership between SCF projects.\n\nBadges are not vanity tokens. They will play an essential role in defining permissions on the protocol. Linked to the DAO, badges will reflect the level of trust the community has in someone.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Besides completing the tranches, the success of our project will primarily be measured by the number of open-source projects registered. Moving past registrations, we will look at how often on-chain data is updated and how our dApp is used. Note that we will never use any invasive tracking solution on the dApp and only GDPR compliant solutions will be considered.\n\nOn the community side, we hope that Tansu will enable more decentralized communities of developers to exist. Ultimatly, we wish for the whole development lifecycle to happen in a decentralized way, outside of solutions like GitHub.\n\nLast but not least, if our project can successfully detect a security incident and warn users effectively, it would be a huge win.",
                        "stellar.tractionEvidence": "Pamphile presented Tansu to a \"community call of the mind\" where it was well received. People have also been engaging positively on our project page. We started a collaboration with the Trustful team. And we have been interacting with the Soroban Domains team to propose a specification for an Ersatz of a SEP1 file.\n\nBesides these public communications, Pamphile also interacted with prominent members of the Stellar community and they shared their enthusiasm.\n\nTansu is just starting on testnet and we just kicked of the public communication phase as we have something people can actually use now. We hope that in the following weeks we will get more traction.",
                        "stellar.goToMarketPlan": "As a public good project, we don't yet have concrete monetisation plans. At that point we are more interested into providing monetisation tools to support the projects on our platform. The Support button will allows people to show their support in XLM to a project and if they wish, give a tip to the platform. Monthly options will also be made available and could generate a constant revenue stream.\n\nAs we add new features, driven by community feedback, we might add more enterprise oriented features. At that point we are thinking about adding some fees to specific contract calls and features in the dApp itself.\n\nRegardless of a hypothetical monetization, we have a strong commitment toward open-source and our code will remain public. We will ensure that there is a great documentation so that anyone can freely Quickstart our infrastructure and build on top of it as they wish. Consulting Manao GmbH, our company, will also be open for consulting services on Tansu and related technologies.",
                        "stellar.tranche1Deliverables": "The planning outlined below, and in the other tranches, assumes an average level of effort of 15 per week per person for a total duration of 6 months making it sustainable in terms of development engagement for all parties.\nFor simplicity, the start of the tranche is represented as W1-for Week 1. While the developers have some affinity, backend/frontend/contract, all developers will be involved on all aspects of the proposal.\n\nWe expect to deliver a MVP within 2 months.\n\n1. Decentralized organization backend;\n    a. Create a decentralized organization when a project register,\n    b. Create a new project and see that a DAO is created on-chain.\n    c. W1 to W5\n    d. USD 12K\n2. Decentralized organization frontend;\n    a. Frontend for the DAO with different flow for project's collaborators and users,\n    b. We can create a DAO, make proposals and trigger flows from the dApp (team priviledges, release and flag commits).\n    c. W3 to W8\n    d. USD 12K\n3. Maintenance before Testnet tranche;\n    a. Stabilize the project: code cleanup and maintainability efforts,\n    b. Upon specific actions such as making commits, receive a badge on-chain.\n    c. W1 to W2 and W6 to W8\n    d. USD 9120",
                        "stellar.tranche2Testnet": "1. Add reputation badges backend;\n    a. Projects get a set of badges to define the level of contribution,\n    b. Upon specific actions such as making commits, receive a badge on-chain.\n    c. W1 to W5\n    d. USD 12K\n2. Add reputation badges frontend;\n    a. Projects get a set of badges to define the level of contribution,\n    b. See the Tansu reputation of a user registered on Tansu.\n    c. W3 to W8\n    d. USD 10K\n3. Backend infrastructure;\n    a. Deploy the backend on GCP and connect the frontend,\n    b. The app will be more reactive and do far less contract calls.\n    c. W1 to W8\n    d. USD 11120",
                        "stellar.tranche3Mainnet": "1. UI testing;\n    a. Add a full suite of UI tests with Playwright,\n    b. All scenarios are fully covered.\n    c. W1 to W4\n    d. USD 12K\n2. Contract testing;\n    a. Harden the testing of the contract and prepare for the audit,\n    b. Fuzzy testing can be done with confidence and the audit passes.\n    c. W1 to W2\n    d. USD 1120\n3. Event subscription;\n    a. Add the possibility to subscribe to a project to get updates,\n    b. Get informed about specifics on a project (new commit, incidents, DAO proposals, releases).\n    c. W4 to W7\n    d. USD 10K\n4. Documentation;\n    a. Write guides and walk through,\n    b. Guides are published on our main website and blog.\n    c. W5 to W8\n    d. USD 10K\n5. Community feedback;\n    a. Based on community feedback, make changes,\n    b. W1 to W8.\n    c. No cost",
                        "stellar.teamMembers": "Tupui",
                        "stellar.urls": {
                            "website": "https://tansu.dev",
                            "codeRepository": "https://github.com/tupui/soroban-versioning",
                            "videoURL": "https://youtu.be/JsE4JGm-6Fs"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 165600.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 778072.86,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-07-10T00:00:00Z"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:19",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recFudOvNezhmYZig",
                    "projectId": "daoip5:stellar:project:subs",
                    "projectName": "Subs",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recFudOvNezhmYZig",
                    "status": "Awarded",
                    "description": "Subs offers an SDK to help businesses manage blockchain subscriptions using Stellar's Soroban smart contracts.",
                    "fundsApprovedInUSD": 139480.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1sfMrphotsnK_qAgITtpvgak7Eb7RUjlcgcmQ8V1yDG0",
                        "stellar.productsAndServices": "What Subs Is:\nSubs SDK is an all-in-one development toolkit specifically designed to enable developers to create, manage, and optimize subscription-based Dapps on Stellar. With a focus on recurring crypto payments, Subs SDK simplifies the integration of blockchain-based subscription services, making it easier for businesses to leverage Stellar’s technology to offer subscription models without complexity.\n\nThe Problem:\nManaging recurring payments and subscriptions in blockchain environments can be a complex and time-consuming process, particularly for businesses that are accustomed to traditional payment systems. There is a lack of straightforward solutions that combine ease of use with the security and transparency of decentralized payments, making it difficult for companies to adopt blockchain-based subscription models efficiently.\n\nThe Solution:\nSubs provides a comprehensive SDK that simplifies the creation and management of recurring payment services on Stellar. The Subs SDK offers the following key components:\n\n1. Recurring Payments Automation:\n    - Description : Subs SDK simplifies the creation and management of automated, recurring payment systems on Stellar. This allows businesses to handle subscription models with ease, ensuring that customers' payments are processed automatically without manual intervention. With features like smart contract automation, developers can build robust, scalable recurring billing systems in no time.\n    - Avantage : Simplifies payment collection and subscription management for businesses, with transparent on-chain validation.\n\n2. Flexible Subscription Models:\n    - Description : The SDK supports a variety of subscription models, including daily, weekly, monthly, or yearly subscriptions, with the ability to customize trial periods, SEP-41 token types, and pricing structures. It also allows for \"buy-now, pay-later\" schemes and partial payments.\n    - Avantage : Businesses can tailor subscription plans to their specific needs, increasing flexibility and customer satisfaction.Additionally, Subs ensures that all smart contracts are regularly maintained and \"bumped\" to prevent automatic deletion, so businesses don't have to worry about contract expiration or disruption of services​​.\n\n3. Sponsored Transactions for End-Users:\n    - Description : Subs SDK integrates a sponsored transaction system where businesses can absorb transaction fees, allowing users to subscribe without worrying about network fees. This is particularly useful in onboarding new crypto users who may be unfamiliar with Stellar's native gas fees. Additionally, users could benefit from a faucet option, where merchants can provide the XLMs needed to activate their addresses and sponsor transactions, further simplifying the onboarding process.\n    - Avantage : This approach improves user experience by removing common friction points in blockchain transactions, increasing subscription rates. By offering both sponsored transactions and a merchant-supported faucet, we make it easier for new users to engage with the platform and participate in the ecosystem.\n\n4. Multi-Currency Support and Cross-Chain Compatibility:\n    - Description : Subs SDK will support multiple tokens such as stablecoins like USDC. \n    - Avantage : This feature will attract businesses that operate globally and need to cater to users using different currencies.\n\n5. Data Privacy and Decentralized Security:\n    - Description : Leveraging Stellar's Soroban smart contract framework, Subs SDK ensures all payment transactions and subscription data are securely stored on-chain without exposing sensitive personal information. Data is stored on Aleph and encrypted, similar to how emails are secured, guaranteeing that subscription details are immutable and verifiable.\n    - Avantage : Ensures compliance with data privacy regulations, reassuring businesses and users that their financial and personal data are secure.\n\n6. Developer-Friendly Tools & API Integration:\n    - Description : Subs SDK offers robust API support, that provides real-time insights into subscription performance, customer retention, and payment success rates.\n    - Avantage : Developers can save time and effort by integrating external services and leveraging a complete development toolkit. Additionally, They will have a new way to monetize their work through a subscription model or recurring donation.\n\nHow It Works and Its Use of Soroban:\nBy leveraging Stellar's smart contracts, Subs SDK simplifies subscription management, payments, and user interactions without requiring developers to deploy new contracts. With pre-built, audited contracts, it ensures security and ease of use.\n1. Subs SDK with Soroban Contract Interactions:\n    - The SDK offers existing Soroban-based smart contracts for subscription management, allowing developers to plug into these contracts without complex deployment.\n    - Interaction with Existing Contracts: Developers can easily call predefined methods for creating subscriptions, processing payments, and managing renewals or cancellations.\n    - Flexible Subscription Logic: The SDK supports various subscription models, fixed-term, recurring, or usage-based, enabling customization without changing the underlying contracts.\n    - Admin Control: Authorized business accounts can manage settings like pricing and trials directly through the established contract, simplifying oversight.\n    - No Deployment Needed: Focused on interaction, the SDK streamlines development, allowing businesses to integrate subscription functionality with reduced complexity.\n\n2.  Subs SDK with API:\n    - Fetch data from Existing Contracts: The API facilitates easy access to subscription contracts, enabling businesses to query statuses and manage payments.\n    - Webhooks for Notifications: Real-time notifications for important events, such as payments and cancellations, enhance business responsiveness.\n    - Gasless Transactions: The API enables businesses to absorb transaction costs, improving user experience by eliminating blockchain fee concerns.\n\n3. Subscription Management Platform:\n    - Subs offers a hosted frontend platform that businesses can use to redirect users for payment and subscription management without direct SDK integration.\n    - User Redirection for Signup: Businesses can redirect users to the Subs platform for easy subscription management.\n    - Self-Hosted Management: Users can handle subscriptions, canceling, renewing, or upgrading, without using the SDK, offering flexibility.\n    - Multi-Tier Subscription Options: The frontend supports different subscription plans, with actions processed through Soroban's smart contracts.\n    - Business Dashboard: A simple dashboard provides insights into active subscriptions and payment statuses, giving businesses a complete overview without needing coding skills.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "To measure the success of Subs SDK, we will focus on a series of quantifiable KPIs that evaluate our impact across adoption, developer engagement and business metrics. Additionally, we will track the broader impact of Subs in terms of increasing financial access, enabling businesses to implement recurring payments globally, and improving financial inclusion.\n\nAdoption Rate:\n- Number of Active Businesses Using Subs:\n    - Success will be defined by reaching 20 active businesses using Subs SDK for managing subscriptions within the first year. These businesses will span industries such as SaaS platforms, content creators, and other subscription-based services.\n    - Impact: Expanding the use of recurring payments across industries enables businesses to grow sustainably and reach a global user base through blockchain, increasing transparency and reducing fees compared to traditional payment systems.\n- Monthly Growth Rate:\n    - We aim to achieve a 10% monthly growth rate in the number of businesses integrating Subs SDK. This growth will be driven by businesses transitioning from traditional payments to decentralized, blockchain-based subscriptions.\n    - Impact: Steady growth in the number of businesses and recurring payments processed will support financial inclusion by reducing transaction costs and expanding access to decentralized financial tools in regions with limited banking infrastructure.\n\nDeveloper Engagement and Reliability:\n- SDK Downloads:\n    - A key goal is to see 500 SDK downloads within the first 6 months of launching on Stellar's mainnet. This will indicate developer interest and adoption of the Subs SDK for integrating subscription features into DApps.\n    - Impact: Increased SDK downloads reflect the expanding use of Stellar’s infrastructure for real-world applications, driving blockchain adoption by enabling developers to implement subscription models with ease..\n- API Usage:\n    - We will track API call volume, aiming for 5,000 monthly API calls by the end of year one. This metric will show how often businesses and developers are interacting with the Subs contracts to manage subscriptions.\n    - Impact: High API usage will reflect real-world impact, showing that businesses are actively using Subs to manage customer subscriptions, facilitating automated and reliable recurring payments globally.\n- Community Participation:\n    - Our goal is to have at least 200 active participants engaging with our developer community on Stellar's Discord (our project's channel), GitHub, and forums. This includes contributions to improving Subs SDK, testing, and community-driven innovation.\n    - Impact: Increased community participation drives collaboration and feedback, enhancing the long-term sustainability of Subs as a key tool within the Stellar ecosystem.\n- Support Requests:\n    - We aim to maintain a support request resolution rate of 95% within the first 24 hours. A high volume of requests resolved quickly will ensure that businesses and developers can rely on Subs SDK to meet their needs efficiently.\n    - Impact: Efficient support increases trust in the platform, encourages broader adoption, and ensures businesses can scale without interruptions.\n\nIntegration Success:\n- MVP, Testnet, and Mainnet Deployments:\n    - Our goal is to achieve at least 50 businesses transitioning from testnet to mainnet deployments within 6 months of launching Subs on Stellar’s mainnet. These businesses will use Subs to manage real-world recurring payments.\n    - Impact: A high number of businesses moving from testing to live environments indicates the robustness and reliability of Subs, supporting its adoption for critical financial services globally.\n- Partnerships:\n    - We aim to secure 10 strategic partnerships within the Stellar ecosystem, including collaborations with SaaS platforms, decentralized content creators, and fintech companies integrating Subs SDK for their subscription services.\n    - Impact: Partnerships will expand the reach of Subs across different sectors, positioning it as a leading solution for blockchain-based recurring payments and contributing to the growth of the Stellar ecosystem.\n\nBusiness Metrics:\n- Revenue:\n    - We aim to generate $500,000 in revenue within the first year, primarily through consulting services, and integration support for enterprise clients. Recurring revenue will also be tracked as more businesses adopt Subs.\n    - Impact: Revenue growth indicates not only the scalability of our business model but also the value we provide to companies seeking blockchain-based subscription solutions. This will strengthen the sustainability of the project.\n- Customer Satisfaction:\n    - We will conduct bi-annual surveys to measure customer satisfaction, aiming for a satisfaction rate of 80% or higher among businesses and developers. Survey results will be used to identify areas for improvement in our SDK, API, and frontend platform.\n    - Impact: High customer satisfaction will demonstrate that Subs is delivering value, driving long-term adoption, and encouraging businesses to expand their use of Stellar for subscription management.",
                        "stellar.tractionEvidence": "At Subs, our vision is to deliver a global subscription management solution that integrates seamlessly with Stellar's blockchain infrastructure. Through our market research, we've identified a significant demand for recurring payment systems across various industries, especially in regions where traditional banking systems are either inefficient or inaccessible. This is why we believe Stellar, with its focus on cross-border payments and financial inclusion, is the ideal platform to power our subscription solution.\n\nMarket Research and Identified Needs\nThrough our preliminary market research, we’ve observed key trends in the adoption of subscription services across multiple world sub-regions, particularly in markets that are expanding their digital financial infrastructure. Our research focused on businesses operating in regions like Latin America, Africa, and Southeast Asia, where cross-border payments and recurring financial services like micro-lending, mobile payments, and subscription models are rapidly growing.\n- Latin America: In countries like Brazil and Mexico, businesses are increasingly looking for efficient and low-cost ways to manage recurring payments, especially for subscription services like SaaS platforms, content creators, and telecommunications. However, traditional banking fees are prohibitive, making blockchain solutions like Stellar’s low-fee transactions ideal for these businesses.\n- Africa: In regions where mobile payments dominate like Ferdinand's country, Togo, there is a growing need for blockchain-based recurring payments to enable micro-insurance, subscription services for utilities, and other financial products. With Stellar's accessibility and low transaction fees, Subs SDK is positioned to provide businesses with a secure and scalable solution to manage recurring billing efficiently.\n- Southeast Asia: In countries like Indonesia and Philippines, the rise of digital financial services, combined with the need for cross-border payment solutions, creates an opportunity for Subs SDK to power global subscription services. \n\nWe chose Stellar for two main reasons:\n1. Alignment with our vision for global financial access: Stellar’s blockchain infrastructure provides the scalability, low-cost transactions, and cross-border functionality that are crucial for businesses looking to offer subscription services in emerging markets.\n2. Cross-border payment focus: Stellar is widely recognized for its ability to facilitate cross-border payments, making it the perfect network to help businesses in developing markets manage global subscriptions.\n\nStellar’s focus on financial inclusion aligns with our goal to bring decentralized recurring payments to regions where traditional financial services are underdeveloped. By leveraging Stellar’s Soroban smart contracts, we are offering a blockchain solution that will empower businesses to manage recurring payments and subscriptions, especially in markets where banking services are less reliable.",
                        "stellar.goToMarketPlan": "Our go-to-market strategy for Subs SDK on Stellar is designed to ensure widespread adoption and effective usage across multiple sectors. We are primarily focusing on ecosystem partnerships and financial institution onboarding to drive growth. Given our B2B focus, we are targeting startups, SaaS platforms, content creators, and fintech companies that can benefit from integrating subscription-based payment systems.\n\nEcosystem Partnerships - B2B\nWe aim to partner with startups and businesses across the Stellar ecosystem to integrate Subs SDK for managing recurring payments. By collaborating with various Web3 and Web2 companies, we aim to establish Subs as the go-to solution for businesses looking to adopt subscription models on Stellar.\n- Integrator for Subscription Development: We will provide hands-on integration services to help startups and businesses efficiently implement subscription models using Subs SDK. Our team will assist with setting up recurring payments and managing subscriptions directly through Soroban smart contracts.\n\n- Technical Consulting: We will offer expert consulting services to guide businesses through the integration process, ensuring they can smoothly integrate blockchain-based subscription services with their existing platforms.\n\nFinancial Institution Onboarding - B2B\nWe are targeting global financial institutions in regions such as Latin America, Africa, and Southeast Asia to help them integrate Subs SDK for recurring payments and subscription services. These regions are experiencing rapid growth in fintech adoption, and many financial institutions are looking for innovative blockchain solutions to handle recurring payments and financial products. Subs SDK offers a powerful tool for financial products like subscription services, automated recurring payments, and lending models.\n\nTarget Audience: We are engaging with major banking groups and fintech companies across these regions to introduce Subs SDK as a solution for developing subscription-based financial services. Our focus is on banks, microfinance institutions, and digital payment platforms that can leverage blockchain for recurring payment systems, including micro-lending, insurance premiums, and bill payments.\n- Latin America: Many countries in this region are undergoing rapid fintech development, with financial institutions seeking to provide more inclusive banking and payment solutions. Subs SDK can help these institutions offer recurring payment services that cater to underserved populations.\n- Africa: With the growth of mobile money services and fintech innovation, financial institutions in Africa are eager to adopt decentralized solutions for recurring payments and subscriptions. Subs SDK can support recurring financial products such as micro-insurance and savings schemes.\n- Southeast Asia: The rapid digitization of financial services in Southeast Asia presents an opportunity to introduce Subs SDK to help regional banks and fintechs manage subscription-based services like mobile phone plans, subscription-based loans, and other recurring payments.\n\nMarketing and Branding\nOur marketing strategy focuses on building awareness and credibility for Subs SDK in both the blockchain and traditional financial sectors. We will leverage a mix of content marketing, social media, and community engagement to grow our presence.\n- Social Media Presence: We will establish a strong presence on LinkedIn, Twitter, and Telegram to engage with businesses, developers, and financial institutions. Our content will highlight how Subs SDK can unlock new revenue streams through subscription models on Stellar.\n- B2B Branding: We will leverage insights from our leadership team to craft B2B branding campaigns that position Subs as the preferred subscription solution for businesses looking to embrace blockchain technology. These campaigns will focus on the unique benefits of Soroban-powered subscription management.\n- Educational Content and Case Studies: We will create in-depth tutorials, webinars, and case studies that demonstrate the value of Subs SDK to developers and businesses. By showcasing successful use cases, we aim to inspire broader adoption of blockchain-based subscription models.\n\nBy executing this go-to-market strategy, Subs SDK will position itself as the leading toolkit for managing recurring payments and subscriptions on Stellar.",
                        "stellar.tranche1Deliverables": "Milestone 1:  Development of Subs Soroban Smart Contracts\n\nDescription: This milestone involves developing the Soroban-based smart contract that powers the core functionality of Subs. The smart contracts will manage recurring payments, subscription creation, cancellation, renewal, and other core processes. The contract will be optimized for scalability and security to handle high transaction volumes on Stellar.\n\nHow to Measure Completion: Completion will be measured by deploying the smart contract on Stellar’s testnet. The contract will undergo internal testing to ensure it handles subscription lifecycles (e.g., automated payments, renewals, cancellations) and security audits to verify its robustness.\n\nEstimated Date of Completion: October 31, 2024\nBudget:$19,450\n------\n\nMilestone 2: SDK Development & Integration with Soroban Smart Contract\n\nDescription: Develop the first version of the core layer of Subs SDK, which will allow developers to interact with the pre-deployed Soroban smart contracts. The SDK will provide methods for businesses to create, manage, and monitor subscriptions without needing to write new contracts.\n\nHow to Measure Completion: Completion will be measured by releasing this version of the SDK with full documentation and integration examples on GitHub. Testing will ensure the SDK’s ability to interact with the smart contracts, handle subscription-related functions, and manage user payments.\n\nEstimated Date of Completion: November 31, 2025\nBudget: $17,680\n------\n\nMilestone 3: Development of the minimal subscription payment page (Subs Frontend Platform)\n\nDescription: Develop a subscription page to allow users to subscribe.\n\nHow to Measure Completion: Completion will be measured by the deployment of the frontend. \n\nEstimated date of completion: December 20, 2025\nBudget: $7,220",
                        "stellar.tranche2Testnet": "Milestone 4: Launch of the API for Stellar Subs Backend Integration\n\nDescription: Add stellar to Subs API that will enable businesses to integrate the subscription management features of Subs into their own backend systems. The API will allow businesses to handle subscription data, payment datas, gasless transactions & faucet system…\n\nHow to Measure Completion:\nCompletion will be measured by releasing  API documentation with stellar endpoints and examples. The API should be able to interact with the Soroban smart contracts and be used by beta testers during the testnet phase.\n\nEstimated Date of Completion: January 17, 2025\nBudget: $17,180\n----\n\nMilestone 5: Development  of the full version of Subs Frontend  Platform\n\nDescription: Develop a stellar frontend version platform that allows businesses and users to manage subscriptions without needing to integrate the SDK directly into their own systems. The platform will be hosted and will provide businesses with the ability to redirect users for subscription management (e.g., signups, cancellations, renewals).Additionally, the platform will be clonable if desired, giving businesses the flexibility to customize it for their specific needs.\n\nHow to Measure Completion: Completion will be measured by the deployment of the frontend. It will include basic features for subscription management and interactions with the smart contracts. User feedback from testing on testnet will be collected and used for further refinement.\n\nEstimated date of completion: February 7, 2025\nBudget: $12,200\n----\n\nMilestone 6: Launch of Subs on Stellar Testnet (Beta Testing)\n\nDescription: Launch Subs SDK, API, and frontend platform on Stellar’s testnet. This will be the beta phase where select businesses and developers will be able to test the full suite of features, including SDK interactions, smart contract automation, and frontend usability for subscription management.\n\nHow to Measure Completion: Completion will be measured by a successful testnet deployment and feedback from beta testers. Performance metrics such as subscription creation, recurring payments, and transaction success rates will be evaluated.\n\nEstimated Date of Completion: February 28, 2025\nBudget: $19,670",
                        "stellar.tranche3Mainnet": "Milestone 7: Mainnet Launch of Subs on Stellar\n\nDescription: Deploy the Subs SDK, API, and frontend platform on the Stellar mainnet. This will mark the official release, allowing businesses to use Subs for live subscription payments and recurring billing on the Stellar blockchain.\n\nHow to Measure Completion: Completion will be measured by a successful mainnet deployment. Key performance indicators such as the number of businesses using Subs, the total value of recurring payments, and the number of transactions processed will be tracked to measure success.\n\nEstimated Date of Completion: March 30, 2025\nBudget: $28,990\n----\n\nMilestone 8: Post-Mainnet Feature Enhancements and Business Scaling\n\nDescription: Following the mainnet launch, this phase will focus on refining the Subs SDK, API, and frontend platform based on user feedback.\n\nHow to Measure Completion: Completion will be measured by successful implementation of additional features and improvements. We will also track customer satisfaction through feedback and usage metrics (e.g., increased transactions, reduced failures).\n\nEstimated Date of Completion: April 30, 2024\nBudget: $17,090",
                        "stellar.teamMembers": "Elom, Ferdinant Attivi, Esteban",
                        "stellar.urls": {
                            "website": "https://stellar.subsprotocol.com/",
                            "codeRepository": "https://github.com/Subs-Protocol",
                            "videoURL": "https://www.loom.com/share/b75aa770bcd84393beef148d2014cc15?sid=e4ff0bca-b1ab-45c7-81f5-03aba698f5d4"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/subsprotocol",
                            "twitter": "https://x.com/subsprotocol"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 92986.66,
                                "denomination": "USD"
                            },
                            {
                                "amount": 544385.43,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Developer Tooling"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:20",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec8oYbd5tHsa1sGc",
                    "projectId": "daoip5:stellar:project:kryptos",
                    "projectName": "Kryptos",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec8oYbd5tHsa1sGc",
                    "status": "Awarded",
                    "description": "Integrating Stellar Network and Ecosystem into Kryptos to help users and businesses to aggregate all their financial data and unlock access to an ecosystem of fintech applications and services built using the first-ever financial data standardization protocol in Web3.",
                    "fundsApprovedInUSD": 35000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "We have already started to test the Horizon Account APIs to pull all the necessary data from the chain, we are also planning to run our own node if necessary.  You can find our highlevel architecture diagram here: https://drive.google.com/file/d/1O3lCvvE5-zw4d-o4Tmf4VjvCPB5DZWG1/view?usp=sharing",
                        "stellar.productsAndServices": "We would like to integrate Stellar network data with Kryptos Financial Data Aggregation Engine. This includes the integration of APIs to fetch data related to Asset Balances, Full Historical Transactions, Payments, Orders, DeFi activity, Asset Prices etc. \n\nBy integration the above and standardizing the financial data, we unlock a lot of fintech applications and services including Portfolio management solutions, tax reporting, accounting, enterprise finance etc.",
                        "stellar.successCriteria": "The success and impact of integrating Kryptos with the Stellar ecosystem can be seen in several tangible benefits that enhance the platform’s capabilities and user experience:\n1. Comprehensive Financial Management: Kryptos introduces a full range of financial tools to Stellar, including advanced portfolio management, and crypto tax reporting, making it easier for users to manage their assets efficiently.\n2. Global Compliance: Users across 30+ countries can now navigate crypto tax regulations effortlessly using Kryptos. This global reach ensures that users and businesses on Stellar can meet their tax obligations smoothly and reliably, wherever they are based.\n3. Enhanced Business Tools: With integrations to popular ERP systems like Xero and Quickbooks, businesses on Stellar can seamlessly connect their crypto transactions to their broader financial operations. This integration simplifies accounting processes and enhances financial transparency.\n4. Developer Empowerment: Kryptos provides developers with robust APIs and tools that streamline the creation of new financial applications on Stellar. This support fosters innovation and expands the variety of services available within the ecosystem.\n5. Ecosystem Growth: By enhancing the financial capabilities available on Stellar, Kryptos helps attract a broader user base—from individual investors to large institutions—thereby growing the network’s participation and strengthening its market position.\n\nIn essence, Kryptos not only enriches the Stellar ecosystem with crucial financial and compliance tools but also opens up new possibilities for users and developers, driving the ecosystem’s expansion and enhancing its appeal as a comprehensive financial platform.",
                        "stellar.tractionEvidence": "You can check our socials and see that we have integrated many chains before and are backed by industry leaders. We also have more than 30k registered users on the platform with a monthly MAU of 10k from 20+ countries.",
                        "stellar.goToMarketPlan": "1. Launch Phase:\n- Goal: Increase awareness and educate potential users.\n- Actions:\n    - Distribute informative articles and press releases.\n    - Conduct webinars and live demos.\n    - Collaborate with crypto influencers to reach a broader audience.\n2. Engagement Phase:\n- Goal: Encourage trial and initial feedback.\n- Actions:\n    - Provide detailed guides and support to help new users get started.\n    - Implement a referral program to leverage word-of-mouth promotions.\n3. Growth Phase:\n- Goal: Convert trial users to paying customers and expand user base.\n- Actions:\n    - Regularly release updates and new features based on user feedback.\n    - Showcase user success stories and the value provided by the platform.\n4. Retention Phase:\n- Goal: Maintain user engagement and loyalty.\n- Actions:\n    - Offer discounts and exclusive access.\n    - Keep the community engaged with regular updates and insider news.\n    - Foster a user feedback loop for continuous improvement and community involvement.",
                        "stellar.tranche1Deliverables": "Deliverable 1: Initial API Integration and Data Setup\n- Brief Description: Establish the infrastructure and initial API connectivity with Stellar's Horizon API. This stage addresses the demand for comprehensive financial tools in the Stellar ecosystem by setting up foundational data aggregation for asset balances, transactions, and more.\n- Tasks:\n    a. Create test transaction data on the mainnet covering all operations and scenarios.\n    b. Set up infrastructure using full history service providers like Blockdameon or ValidationCloud or run a Horizon node.\n    c. Integrating the Horizon Account APIs - Asset Balances, Transactions, Orders, Payments, Claimable Balances, and Liquidity Pool Transactions, Assets data\n    d. Perform initial testing on the test account using PostMan to ensure all the data is being retrieved.\n- How to Measure Completion: Successful fetching and initial display of test data from the Stellar network.\n- Estimated Date of Completion: Week 2\n- Budget: 1 Senior Integration Developer, 30-50hrs of work - $125/hr ~ $6,000 [varies if we have to set up the node infra]\nDeliverable 2: Data Standardization and Preliminary Mapping\n- Brief Description: Begin mapping and standardizing fetched data to align with Kryptos data standards, focusing on ensuring data quality and completeness for accurate financial reporting.\n- Tasks:\n    a. Mapping of the response object with the Kryptos data standardization framework.\n    b. Fetch and integrate asset pricing data from oracles on-chain or using off-chain sources like CMC, CG, Cryptocompare, Defilama, etc.\n    c. Conduct on-chain asset mapping with the internal asset database.\n    d. Manual mapping of all the 26 operations supported in the Stellar ecosystem with appropriate standardized financial labels.\n    e. Mapping of DeFi platforms and any other financial platforms addresses for data richness\n- How to Measure Completion: Data is correctly formatted and integrated into Kryptos systems.\n- Estimated Date of Completion: Week 4\n- Budget: ~$9000\n    a. 1 Senior Integration Developer (30-40hrs @$125/hr - ~$4500)\n    b. 1 Backend Developer – (30-40hrs @$125/hr - ~$4500)",
                        "stellar.tranche2Testnet": "Deliverable 3: Integration Testing and User Testing\n- Brief Description: Extensive testing of the integration in a testnet environment to ensure reliability and accuracy of the data integration, preparing for public release.\n- Tasks:\n    a. Develop unit test cases for the integration.\n    b. Implement automatic checks for monitoring integration uptime.\n    c. Data validation by comparing the response from APIs with explorer/on-chain data. Validating balances, transaction counts etc.\n    d. Push integration to developer environment for QA testing - Functional testing of the integration flow and validating the data.\n- How to Measure Completion: Integration passes all tests without errors and matches expected outcomes.\n- Estimated Date of Completion: Week 5-6\n- Budget: ~$5000 \n    a. 1 Senior Integration Developer (15-20hrs of work @$125/hr ~ $2500)\n    b. 1 QA Tester (20-25hrs @$80/hr ~ $2500)",
                        "stellar.tranche3Mainnet": "Deliverable 4: Production Launch and Marketing Rollout\n- Brief Description: Launch the fully tested and validated integration on the mainnet, accompanied by a comprehensive marketing strategy to maximize user adoption and engagement.\n- Tasks:\n    a. Push the fully tested integration to production.\n    b. Final QA validations across all product lines including B2C, Enterprise, CPA and Developer API products.\n    c. Enable the full feature suite for Stellar ecosystem users covering - Crypto Tax reporting in 30+ countries, Accounting and Bookkeeping Solutions for Enterprises, Financial reporting and integrations to ERP solutions like Xero, Quickbooks, etc.\n    d. Create and distribute marketing materials such as guides, videos, and announcements.\n    e. Conduct marketing campaigns, including email newsletters, social media announcements, press release and push notifications to drive adoption.\n- How to Measure Completion: Successful deployment on the mainnet with active user interaction and positive feedback.\n- Estimated Date of Completion: Week 8\n- Budget: ~$15000\n    a. 1 QA tester – 10-15hrs @$80/hr ~ $1000\n    b. 1 Product Marketing Lead – 5-10hrs @$100/hr ~$500\n    c. 1 Social Media Lead – 10-15hrs @$80/hr ~$1000\n    d. 1 Graphic Designer – 10-15hrs @$50/hr ~$750\n    e. 1 Content Creator (video, guides, pr, social posts, blogs, newsletters) – 30-40hrs @$50/hr ~ $2000\n    f. Marketing distribution costs (PR, KOLs, Discount Campaigns) - $2500\n    g. Future infra and maintenance costs - $7500",
                        "stellar.teamMembers": "Sukesh Tedla",
                        "stellar.urls": {
                            "website": "https://kryptos.io",
                            "codeRepository": "https://docs.google.com/document/d/1OEft00GPV4D0jRuNtAuu8RHlPEPAOGXF/edit?usp=sharing&ouid=115126705350833397321&rtpof=true&sd=true",
                            "videoURL": "https://youtu.be/gnXNaC2jZYg",
                            "pitchDeck": "https://youtu.be/gnXNaC2jZYg"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/hellokryptos",
                            "twitter": "https://x.com/KryptosConnect"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 23333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 168944.45,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Developer Tooling"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:21",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/reck82uQhTmQhx8Yr",
                    "projectId": "daoip5:stellar:project:every.finance",
                    "projectName": "Every.finance",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reck82uQhTmQhx8Yr",
                    "status": "Awarded",
                    "description": "Offers decentralized ETFs to help crypto investors on Stellar to optimize yields and manage risk with automated portfolio rebalancing and yield strategies.",
                    "fundsApprovedInUSD": 140000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/11UsysXjHX4Ula6TaEmRaEgVAsQdkoT4F/view?usp=share_link",
                        "stellar.productsAndServices": "What EveryFinance Is:\nEvery Finance is a decentralized finance platform offering decentralized Exchange-Traded Funds (dETFs). It features diversified investments across major blockchains (BNB Chain, Ethereum, and Polygon networks), rebalanced with proprietary algorithms based on risk parity principles. The platform aims to democratize hedge fund advantages and index fund diversification, making optimized yield farming accessible to all. Every Finance focuses on providing simple, secure, and effective portfolio management in the volatile crypto space.\n\nThe Problem:\nManaging and optimizing investments in the complex and rapidly evolving world of decentralized finance (DeFi) is a real challenge. Specifically, how to solve the problem of navigating the volatility, risk, and fragmented nature of the DeFi ecosystem. \n\nThe Solution:\nBy offering a platform that combines \n- sophisticated risk management, \n- automated portfolio rebalancing, \n- and yield optimization through DeFi strategies, \nEvery.Finance empowers users to create and manage diversified portfolios that are tailored to their specific risk tolerance and financial goals. The platform simplifies the process of accessing high-yield opportunities while maintaining control over risk, making DeFi more accessible and effective for both novice and experienced investors..\n\nHow Every.Finance Works on Stellar\nEvery.Finance operates as an intelligent investment platform that allows users to create and manage diversified portfolios tailored to their risk tolerance and financial objectives. Here’s how it works:\n1. Portfolio Creation: Users start by selecting a risk level (e.g., conservative, balanced, aggressive) or customizing their own asset allocations based on personal preferences. The platform offers various investment products like Alpha, Beta, and Gamma, each representing different risk-return profiles.\n2. Asset Selection and Allocation: Based on the chosen risk profile, Every.Finance allocates funds across a diversified mix of assets, such as stablecoins, cryptocurrencies, and tokenized real-world assets. These assets are selected using an in-house strategy that emphasizes both potential returns and risk management.\n3. Yield Optimization: Once assets are allocated, they are farmed using various DeFi strategies, such as staking, liquidity provision, and yield farming, to generate additional income or \"extra yield.\" This step is automated, leveraging the best opportunities within the DeFi ecosystem to enhance returns.\n4. Automated and User Rebalancing: To maintain the desired risk-return profile, Every.Finance periodically rebalances the portfolio. Market rebalancing occurs automatically based on market conditions, while user rebalancing allows investors to manually adjust allocations according to their evolving strategies.\n5. Risk Management: Throughout the process, robust risk management protocols ensure that the portfolio remains aligned with the investor’s risk tolerance. This involves careful selection of assets, strategic deployment in DeFi, and constant monitoring to mitigate potential risks.\n6. Fees and Profit Sharing: The platform charges management and performance fees, which are calculated based on the performance of the portfolio and are periodically deducted. A portion of performance fees is allocated to a profit-sharing pool, allowing users to benefit collectively from successful strategies.\n\nUses of Every.Finance\n- For New Investors: Provides an accessible entry point into the DeFi space, with automated portfolio management and risk mitigation tools that simplify investing.\n- For Experienced Investors: Offers advanced features such as custom portfolio creation, manual rebalancing, and access to high-yield DeFi strategies, allowing for greater control and optimization.\n- For Yield Seekers: Enables investors to maximize their returns by leveraging DeFi strategies like yield farming and staking, which are typically complex and time-consuming to manage independently.\n- For Risk-Conscious Investors: Offers tailored risk management, ensuring that portfolios remain within acceptable risk levels while still seeking to generate returns.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "This is what we are looking to achieve at Every.Finance :\n\nAdoption Rate:\n- Total Value Locked (TVL): A key success metric would be reaching $10 million in TVL on Stellar within 12-18 months. Expanding across other chains like Ethereum and BNB could push the overall TVL to $50 million within 24-30 months.\n- Growth Rate: Consistent monthly TVL growth of 10-15% would indicate healthy platform adoption and user confidence. The goal is to hit these growth rates through marketing campaigns, new product launches, and ecosystem partnerships.\n\nUser Growth and Retention:\n- Monthly Active Users (MAU): Targeting 10,000 monthly active users within 18 months, with steady growth driven by onboarding campaigns, user incentives, and educational outreach.\n- Daily Active Users (DAU): Aim for 2,000–3,000 daily active users (20-30% of MAU), showing continuous engagement and participation in yield-optimizing strategies.\n- Retention Rate: A high retention rate of 60-70% of users remaining active after their first interaction would be key to long-term success. Retention will be boosted by consistent platform updates and value-added services.\n\nPlatform Performance and Yield:\n- Yield Performance: The goal is to outperform industry benchmarks by providing 5-7% annual yield on conservative portfolios and up to 15% annual yield on aggressive portfolios. This performance would attract both retail and institutional investors seeking optimized returns.\n- Risk Management: Maintain at least 95% compliance with user-defined risk levels to build trust and ensure portfolios remain aligned with investors’ goals.",
                        "stellar.tractionEvidence": "Here's our prior traction:\n- More than 2744 users on Zealy\n- Over 2133 members on Discord\n- Over 59k followers on Twitter\n\nAll this information and more is available in this file :\nhttps://drive.google.com/file/d/1KGDrn9VOcRD4e66YrYYVXdWOtCJuhIwZ/view?usp=share_link\n\nWe also received feedback from our community on our social networks: https://drive.google.com/file/d/1I6lL5A79eoFzvDAIvebmyF64yZkDgnfe/view?usp=share_link",
                        "stellar.goToMarketPlan": "Our go-to-market strategy is designed to ensure widespread adoption across both retail and institutional markets. We are focusing on building strong partnerships in the DeFi ecosystem, leveraging community engagement, and onboarding retail and institutional investors to drive growth. The focus remains on B2B and B2C strategies for capturing market share in the DeFi space.\n\nEcosystem Partnerships – B2B\nWe are committed to building strategic partnerships with key players in the DeFi and blockchain space to expand our reach and provide value to other projects. Our efforts will focus on:\n- Partnership with DeFi Protocols: Collaborating with established DeFi protocols to integrate liquidity and provide yield-optimizing strategies across multiple blockchains (BNB Chain, Ethereum, Polygon). This will help attract TVL (Total Value Locked) and provide diversified investment opportunities to users.\n- Cross-Chain Integration: Implementing cross-chain functionality that allows users to move assets between blockchains will position Every.Finance as a versatile tool for investors seeking diversified exposure across DeFi ecosystems.\n- Consulting and Advisory: Offering consulting services to DeFi projects and institutional investors looking to navigate the decentralized finance space, providing them with expertise in yield farming and portfolio management.\n- Profit-Sharing and Incentives: Developing a profit-sharing mechanism for our ecosystem partners, where a portion of the performance fees will be distributed to both institutional and retail participants, encouraging participation and long-term engagement.\n\nFinancial Institution Onboarding – B2B\nEvery.Finance is actively pursuing partnerships with financial institutions, focusing on global hedge funds, asset managers, and institutional investors. Our strategy includes:\n- Target Audience: We aim to engage hedge funds, asset managers, and investment firms that are interested in decentralized financial products and yield farming strategies but need automated portfolio management solutions.\n- Institutional DeFi Adoption: Working with financial institutions to tokenize real-world assets and manage diversified portfolios that integrate decentralized finance strategies.\n- Partnerships with Financial Advisors: Establishing collaborations with consulting firms to introduce Every.Finance’s tools and services into their financial advisory and investment products. Firms like Deloitte and KPMG will be crucial in bringing these solutions to institutional players.\n- Compliance and Regulation: Ensuring that our platform meets relevant regulatory standards, particularly in jurisdictions with progressive blockchain and DeFi regulations, to facilitate institutional adoption.\n\nCommunity Building – B2C\nCommunity engagement is at the core of our retail user acquisition strategy. Every.Finance is focused on building a strong presence within the DeFi community through educational content, active engagement, and transparent updates.\n- Social Media and Content Marketing: Establishing a strong presence on Twitter, Discord, and Telegram to engage DeFi enthusiasts and retail investors. We will share insights on DeFi strategies, market opportunities, and Every.Finance’s unique approach to automated portfolio management.\n- Educational Resources: Offering tutorials, webinars, and guides on decentralized finance and yield farming to onboard new users and establish Every.Finance as a go-to platform for both novice and experienced DeFi investors.\n- Referral and Incentive Programs: Introducing referral programs where existing users can earn rewards by bringing new users onto the platform. This will leverage network effects to accelerate user growth.\n\nMarketing and Branding\nOur marketing efforts will focus on building Every.Finance as a trusted and user-friendly DeFi platform. The strategy includes:\n- B2B Branding: We will work on positioning Every.Finance as a leader in DeFi portfolio management for institutional clients. This includes working with financial influencers and publishing thought leadership content that highlights our automated risk management and portfolio rebalancing capabilities.\n- B2C Outreach: For retail users, we will focus on marketing campaigns that highlight the accessibility and security of our platform. Collaborations with crypto influencers and KOLs (Key Opinion Leaders) will help build trust and awareness.\n- SEO and PR: Optimizing our website and content for search engines to attract organic traffic. Press releases and partnerships with crypto media outlets will also be part of our PR efforts to increase brand visibility.",
                        "stellar.tranche1Deliverables": "1 ) Technical Specification \n \nThe main task of this milestone is to define the technical architecture of the smart contracts of the investment products Alpha, Beta and Gamma on Stellar chain. The EVM version uses ERC20 and ERC721 tokens and different OpenZeppelin libraires that should be adapted for the Stellar version.\n\nDuration: 15 days\n \nCompletion measure:\n- Technical specification document of the smart contracts that explain their architecture, interaction and functions. \n- A smart contract developer should be able to develop the smart contracts from this specification document.\n\nBudget: 10 K USD\n \n \n\n2 ) Smart Contract Development \n- Development of the smart contracts of products Alpha, Beta and Gamma using Stellar Smart Contract Language and the platform Soroban. We wil start by the smart contracts Token (ERC20) and DepositProof/WithdrawalProof ( ERC720) and then the smart contracts Management, Investment and SafeHouse.\n- Compile smart contracts \n- Implement unit tests     \n \n  \nDuration: 2 months \n\nCompletion measure:\n- Smart contracts code\n- unit tests and deployment scripts \n- Full technical documentation\nA developer should be able to clone the github repository, to compile the smart contracts and to run the unit tests.\n \nBudget: 40 K USD",
                        "stellar.tranche2Testnet": "3 )  Testnet User dApp \nDeploy smart contracts on Testnet : the smart contracts of Alpha , Beta and Gamma will be deployed on Stellar testnet. Faucet stable Tokens will be deployed too to be used to test the investment flow ( deposit/ withdraw) by the investor and validate deposit/withdrawal by the manager.\n- Integrate Stelar wallets to the user dApp.\n- Connect the smart contracts of Alpha, Beta and Gamma to the user dApp\n- E2E tests.\n\nDuration: 1 month \n\nCompletion measure:\n- User DApp URL on testnet\n- Addresses of the smart contracts on testnet \n- Testing guide \n\nA user should be able to connect to the dApp using a Stellar wallet and to invest in Alpha , Beta and Gamma and to withdraw his funds.\n\nBudget: 30 K USD\n\n4) Investor PnL Dashboard \n\n- Develop an indexer to track investor’s transactions for the products Alpha , Beta and Gamma. \n-  Develop the dashboard backend that calculates for each investor and each product on the chain Stellar the realized PnL,  unrealized PnL and the total PnL\n- Connect the dashboard backend to the user dApp.\n \nDuration: 1 month \n\nCompletion measure:\n- Investor’s Dashboard on testnet \n\nA user should be able to  track his daily PnL  for  the different products Alpha , Beta and Gamma.\n\nBudget: 20 K USD",
                        "stellar.tranche3Mainnet": "5) Mainnet DApp\n- Third Party Audit of the smart contracts\n- Deploy smart contracts on Mainnet\n- Integration tests and E2E tests for the user dApp \n\nDuration: 1.5 months\n\nCompletion measure:\n- DApp URL on Mainnet \n- Audit Report \nAn investor should be abe to invest in Alpha Beta and Gamma using the user dApp on  mainnet and he should be able to track his daily pnl.\nThe mainnet user Dapp should offer a good user experience.\n\nBudget: 20 K USD\n\n6) Integrate Stellar DeFi Ecosystem to the Manager dApp\n \nThe portfolio management of Every is cross chain. This milestone aims at adding Stellar assets, DeFi protocols and bridges to our portfolio management system. So, the portfolio manager can trade assets on Stellar and bridge them from/to Stellar. Moreover, the manager can use and propose investment strategies on Stellar using the existing DeFi protocols:\n \n- Connect Stellar Dexes and bridges to the manager dApp\n- Add Stellar chain to the trade execution system \n- Define and implement interesting DeFi strategies to be executed on Stellar chain\n- Test the manager dApp with Stellar on mainnet.\n   \n \nDuration: 2 months \n\nCompletion measure:\n- Technical Report that explains the integration of the Stellar Defi Ecosystem to the Manager dApp\n- The portfolio manager should be able to trade assets on the stellar chain and to invest in  its DeFi ecosystem.\n \nBudget: 20 K USD",
                        "stellar.teamMembers": "Jegan, Habib, Clement",
                        "stellar.urls": {
                            "website": "https://www.every.finance",
                            "codeRepository": "https://github.com/orgs/EveryFinance/repositories",
                            "videoURL": "https://drive.google.com/file/d/1CT2FZlrAdIgRmR1-HCWav991UBcOCVr7/view"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/everyfinance/posts/?feedView=all",
                            "twitter": "https://x.com/every_finance",
                            "discord": "https://discord.gg/wWse3bkNVZ"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 46666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 102248.86,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-12-09T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-30:grantApplication:22",
                    "grantPoolId": "daoip5:stellar:grantPool:scf-30",
                    "grantPoolName": "scf-30",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recYuJFv6edLrh6Bk",
                    "projectId": "daoip5:stellar:project:zkcrossdex",
                    "projectName": "zkCrossDEX",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recYuJFv6edLrh6Bk",
                    "status": "Awarded",
                    "description": "Phase Two of Stellar zkCrossDEX expands blockchains, wallets integrations, introduces airdrop program, and launches unified asset management and staking pools.",
                    "fundsApprovedInUSD": 100000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docsend.com/view/fvgd4c7t8qs57udc",
                        "stellar.productsAndServices": "In Phase Two, we plan to develop several key products for Stellar zkCrossDEX Expansion: \n\n1. Stellar Wallets Integration: Seamless integration with Stellar wallets - Lobstr, Albedo, Trezor, Xbull and Ledger. \n\n2. Unified Wallet Manager: Offer a single interface to view DeFi holdings across EVM blockchains and Stellar.\n\n3. Blockchain Integrations: Expand zkCrossDEX to include Arbitrum, Avalanche, Base, Blast, and Optimism. \n\n4. Airdrop Program: Develop infrastructure for Airdrop dashboard, quests, and referral system for user growth.\n\nStellar’s infrastructure will support these innovations, driving adoption and improved user functionality.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "1. Development and Innovation:\n\nWith Phase Two, zkCross Network will bring substantial innovation to the Stellar ecosystem by addressing key DeFi gaps. Our focus on cross-chain liquidity, one-click transaction automation, and unified wallet management will streamline user experience and enhance Stellar’s competitiveness in the DeFi space. Introducing Smart Contract Audits, Stellar Wallets Integration and Staking Pools will lay the foundation for a more secure, scalable, and user-friendly DeFi infrastructure, further solidifying Stellar’s position as a leading blockchain for decentralized finance.\n\n2. User Onboarding and Growth:\n\nOur vision is to onboard the next wave of DeFi users to the Stellar ecosystem by offering an intuitive, easy-to-use platform that removes technical barriers. With the Airdrop Program, Quests, and Referral System, we plan to actively engage the community and incentivize participation. We aim to achieve 50,000 users interacting with Stellar zkCrossDEX within 6 months of Phase Two’s launch, greatly expanding Stellar’s DeFi user base and increasing financial access to decentralized services worldwide.\n\nThis dual focus on innovative development and user onboarding will ensure the long-term success and growth of Stellar zkCrossDEX.",
                        "stellar.tractionEvidence": "We have made significant strides with Stellar zkCrossDEX during Phase One, introducing critical innovations:\n\n1.\tFiat OnRamp Integration: We successfully integrated Transak, enabling seamless fiat-to-crypto onboarding across Stellar and EVM chains.\n\n2.\tCross-Chain Transactions: We launched one-click cross-chain transactions on Ethereum, BNB Chain, and Polygon, abstracting DeFi complexities such as gas, swaps, and bridging.\n\n3.\tDeFi Complexity Abstraction: Automated transaction processes for a simplified DeFi user experience.\n\nYou can view our phase two proposal deck for more detailed insights: https://docsend.com/view/fvgd4c7t8qs57udc\n\nThese milestones validate zkCross Network’s ability to drive real impact in the Stellar ecosystem.",
                        "stellar.goToMarketPlan": "After completing the Stellar zkCrossDEX Phase Two development, our go-to-market strategy will focus on an extensive Airdrop Program where we’ve allocated 2% of the token supply of our upcoming $CROSS token to drive user adoption and promote zkCrossDEX. This will involve:\n\n\t1.\tQuests & Challenges: Engaging users with specific tasks and rewarding them for completing various activities within zkCrossDEX.\n\t2.\tReferral Program: Incentivizing users to invite others into the ecosystem, creating a viral loop of growth and adoption.\n\t3.\tLeaderboards: Adding a competitive element where top participants earn extra rewards.\n\nThis approach will create excitement, incentivise engagement, and rapidly expand our user base. Additionally, through this program, the Stellar community will be able to experience and use zkCrossDEX, further solidifying their involvement.\n\nWe will leverage multiple channels for promotion, including partnerships, influencer marketing, and social media campaigns, ensuring wide visibility and participation.",
                        "stellar.tranche1Deliverables": "Tranche 1: Stellar Wallets Integration & Unified Balance with Wallet Manager\n\n• Deliverable A: Seamless integration with Lobstr, Albedo, Xbull, and Ledger to enhance user experience and support native Stellar interactions.\n• Deliverable B: Implementation of a unified wallet manager displaying DeFi holdings across multiple chains.\n\nCompletion Measurement: Operational wallet integrations and wallet manager on Stellar zkCrossDEX mainnet.\nTimeline: 1 month\nBudget: $40,000",
                        "stellar.tranche2Testnet": "Tranche 2: Blockchain Integrations\n• Deliverable: Expansion to Arbitrum, Avalanche, Base, and Optimism.\n\nCompletion Measurement: Functional blockchain integrations on Stellar zkCrossDEX mainnet.\n\nTimeline: 1 month\nBudget: $30,000",
                        "stellar.tranche3Mainnet": "Tranche 3: Airdrop Program System\n\n• Deliverable: Launch of a referral-based airdrop program with quests and leaderboards to drive adoption.\n\nCompletion Measurement: Mainnet launch of the airdrop program.\nTimeline: 1 month\nBudget: $30,000\n\nWhile the $90k grant will contribute to our development efforts, it will not cover the entire cost of building out the full features of Stellar zkCrossDEX Phase Two as outlined in the three tranches above. \n\nHowever, we are fully committed to our long-term vision for this project. To expedite development and maximise the opportunity presented by the upcoming bull run, we are willing to allocate our resources to fast-track these initiatives. Our goal is to complete our long-term vision before the end of this year, ensuring Stellar zkCrossDEX is fully optimised for the DeFi landscape.",
                        "stellar.teamMembers": "Shivam Tandon",
                        "stellar.urls": {
                            "website": "https://stellar.zkcross.exchange/",
                            "codeRepository": "https://github.com/zkCross-Network",
                            "videoURL": "https://youtu.be/2zqDpO_l_8Q?si=k-zEiuVgv4QA3dz8"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/zkcrossnetwork",
                            "twitter": "https://twitter.com/zkCrossNetwork"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 100000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 256662.83,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Financial Protocols"
                    },
                    "completionPercentage": 67.0
                }
            ]
        }
    ]
}