{
  "@context": "http://www.daostar.org/schemas",
  "name": "Stellar",
  "type": "Foundation",
  "grantPools": [
    {
      "type": "GrantPool",
      "name": "scf-15",
      "applications": [
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:1",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recAn7u7cJ9KA3AEd",
          "projectId": "daoip5:stellar:project:elio-dao",
          "projectName": "Elio DAO",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recAn7u7cJ9KA3AEd",
          "fundsApproved": [
            {
              "amount": 1678743.73,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 148200,
          "title": "Elio DAO",
          "description": "Elio is a DAO infrastructure protocol to create and manage funds, communities and other decentralized organizations.",
          "fundsPaid": [
            {
              "amount": 148200.0,
              "denomination": "USD"
            },
            {
              "amount": 1678743.73,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-07T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Developer Tooling",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "Decentralized Autonomous Organizations (DAOs) represent a paradigm shift in the way organizations are managed, leveraging blockchain technology to enable decentralized decision-making, community governance, and shared ownership. DAOs operate through smart contracts, automating transactions and organizational processes, thus minimizing the need for centralized authorities. Elio DAO is a unique protocol as it provides the core functionality of a DAO builder in a beautiful no-coder-friendly interface, including but not limited to Creation of DAO alongside with Metadata Management Token Issuance, Initial Governance and Council Management A full Proposal / Voting Workflow with Onchain Governance. The entire flow is ready to review in wireframes and designs in this document. Please review it for a full overview of the providing functionality and user interfaces. The twist for Elio DAO, though, is its extendable hook point functionality, where all protocol contracts allow developers to provide extensions in the form of Soroban smart contracts that are called from within the lifecycle of the protocol. This enables a plugin-like system that people already know from web2 apps like wordpress and shopify. Elio DAO is not only a protocol, but an ecosystem, that can be extended easily and has composition as a first class citizen of its protocol. Developers (and ourselves) can customize DAOs to legal needs or community requirements without any limits. We have specified the technical functionality and how we are going to use Soroban to do this in this document within the section \"How we use Soroban\". As Elio DAO is not a DAO itself, it will not have a token or governance model. Instead, it will provide an open-source infrastructure and frontend components for others to use and adapt to their specific needs."
            },
            "stellar.teamMembers": "Christian Peters",
            "stellar.urls": {
              "website": "https://deep-ink.ventures",
              "codeRepository": "https://github.com/deep-ink-ventures",
              "videoURL": "https://drive.google.com/file/d/1SupEKyPEaF0Tg8BxWS8wpYgPls917gak/view?usp=sharing"
            },
            "stellar.socialMedia": {
              "twitter": "https://twitter.com/ElioDAO_org"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:2",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recHahmCLtNhZaCUg",
          "projectId": "daoip5:stellar:project:chainlink-oracles-relayer",
          "projectName": "Chainlink Oracles Relayer",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recHahmCLtNhZaCUg",
          "fundsApproved": [
            {
              "amount": 433899.95,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 38400,
          "title": "Chainlink Oracles Relayer",
          "description": "Trustless Proxy Solution for Chainlink Oracle data on Stellar",
          "fundsPaid": [
            {
              "amount": 38400.0,
              "denomination": "USD"
            },
            {
              "amount": 433899.95,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-07T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Infrastructure & Services",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "Oracles (Random Numbers are just one case, but the most important ones) are needed for any kind of project using NFTs. If you don’t have that, you won’t be able to launch an NFT drop or find out who should get what NFT from a collection. It is necessary for nearly every game that wants to prove randomness in its internal processes. VRF stands for Verifiable Random Function. It is used to provide genuinely random data for a smart contract because this kind of data is not available in smart-contracts themselves. Our trustless VRF proxy solution relays this service to a not yet supported blockchain and also provides a way to verify the correctness of the randomness provided. For this purpose, we provide a way to integrate the bluechip oracle provider \"Chainlink'' into your own network in a trustless way. If desired, we can also connect another oracle provider instead of Chainlink. Developers can make use of it for their own needs (Raffles, pick NFTs details on reveal, Lottery services, Battles with randomness (e.g. effect of an attack), etc.). A dapp developer has to implement the interface of the Chainlink Oracle proxy contract. Which means calling a function in the proxy contract and providing a callback function."
            },
            "stellar.teamMembers": "Mike Lohmann",
            "stellar.urls": {
              "website": "https://www.create3labs.com/"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/create3-labs",
              "twitter": "https://twitter.com/relinkservices"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:3",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec8A43DCXVKh78FI",
          "projectId": "daoip5:stellar:project:anchain-ai",
          "projectName": "AnChain.AI - Tenzing Smart Contract Catalog",
          "createdAt": "2023-06-08T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec8A43DCXVKh78FI",
          "fundsApproved": [
            {
              "amount": 1062447.53,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 95000,
          "title": "AnChain.AI - Tenzing Smart Contract Catalog",
          "description": "The Tenzing Catalog is an open-source catalog of audited smart contracts designed to help companies build web3 projects faster.",
          "fundsPaid": [
            {
              "amount": 95000.0,
              "denomination": "USD"
            },
            {
              "amount": 1062447.53,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-08T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Developer Tooling",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "This grant proposal is related to an open-source Soroban Smart Contract Catalog for the Stellar blockchain. The catalog will be a standalone and free tool. It will contain a list of audited Soroban smart contracts for different use cases (ex. NFTs, SBTs, DeFi, GameFi), which companies and developers can use or refer to to create their web3 application on Stellar. Today, the coding and auditing of smart contracts is still one of the major barriers to entry for companies and developers to launch any blockchain application. It shouldn't be that way. Our goal with this project is to provide templates of functional and secure smart contracts that can (1) be used as-is for deployment, (2) modified to fit specific needs, or (3) simply consumed for educational purposes. We realize that the state of the Soroban platform is still in the early stages and we want to contribute to its testing and development for the ecosystem. Down the line, we plan to also have integrations with our new Tenzing product, a smart contract management product designed to help companies and small teams of developers build web3 projects, deploy smart contracts on the blockchain, and manage the interactions with them. The video demo uploaded below showcases these future functionalities as well, but this project proposal is specifically related to the Smart Contract Catalog portion of Tenzing."
            },
            "stellar.teamMembers": "Christian Nunez, Francesco Piccoli",
            "stellar.urls": {
              "website": "https://anchain.ai/",
              "videoURL": "https://drive.google.com/file/d/14fkcUMervXh2coV6I0R3x65ZluokQr1D/view?usp=sharing"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/anchainai/",
              "twitter": "https://twitter.com/AnChainAI"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:4",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recm80YHqumL7qKsJ",
          "projectId": "daoip5:stellar:project:soroban-smart-option-contract",
          "projectName": "Soroban Smart Option Contract (Part 2)",
          "createdAt": "2023-06-05T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recm80YHqumL7qKsJ",
          "fundsApproved": [
            {
              "amount": 566307.46,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 51500,
          "title": "Soroban Smart Option Contract (Part 2)",
          "description": "An expansion of our Option Contract from SCF #13 we are expanding to option spreads and a bi-lateral trade submission scheme",
          "fundsPaid": [
            {
              "amount": 51500.0,
              "denomination": "USD"
            },
            {
              "amount": 566307.46,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-05T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Developer Tooling",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "Block Time Financial is a complete middle and back-office blockchain infrastructure software company. We provide the ability to issue Stellar assets, make payments, trading, swapping, and more, all done with regulatory audit and compliance issues in mind. We track all the 5 \"Ws\" for blockchain operations, Who, What, Where, When, and Why, so that there is a clear and immutable record of business functions. We specialize in the Stellar blockchain and take full advantage of many of the features, including claimable balances, mass payments, authorizations, path payments, and specialty entity identity tokens such as KYC, AML, ACRED, QUAL, and more. We are fully involved in implementing Soroban into our platform so that our users have a complete environment for building, installing, and utilizing Soroban Smart Contracts. We have a contract management system module that keeps track of all versions of Smart Contracts, both installed by our platform and contracts that have been deployed on the network. We're planning on a fee usage module that helps predict fees and charges for smart contract usage. We also have incorporated the smart contract issuers and their roles into our UserProfile. Our current project, the Smart Option Contract, is a prototype for a bilateral trade submission with collateral. The prototype is currently limited to a \"European equity put option.\" With the additional grant money, we hope to expand this to option spreads and explore the use of adjusting collateral by use of other projects in the ecosphere. We have engaged multiple option traders for input and hope to demonstrate the end product to multiple exchanges with our existing contact network. All these things will be necessary for a business to be able to build, deploy and use smart contracts in a regulatory and compliant manner. Case in point, Franklin Templeton, one of the world's largest investment managers, built software in-house to issue a regulatory-compliant money market fund on Stellar. Our platform will allow other investment managers the same opportunity without having to build software."
            },
            "stellar.teamMembers": "Louis Morgan, Louis Morgan",
            "stellar.urls": {
              "website": "https://github.com/blocktimefinancial/option",
              "codeRepository": "https://github.com/blocktimefinancial/option",
              "videoURL": "https://youtu.be/iUjGjVV6DVw"
            },
            "stellar.socialMedia": {
              "twitter": "https://github.com/blocktimefinancial/option",
              "discord": "https://discord.com/channels/1039603107396603965/1039603108034129922"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:5",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recoZCxDJu6l9Sy9S",
          "projectId": "daoip5:stellar:project:beans-app",
          "projectName": "Beans app",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recoZCxDJu6l9Sy9S",
          "fundsApproved": [
            {
              "amount": 1091981.57,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 96640,
          "title": "Beans app",
          "description": "Beans is a super simple, free p2p payments app with healthy yield on your savings.",
          "fundsPaid": [
            {
              "amount": 96640.0,
              "denomination": "USD"
            },
            {
              "amount": 1091981.57,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-07T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Applications",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "Beans is a non-custodial payments app that targets the general public, not just the crypto community. We offer seamless Stellar-based payments and plan to expand into user-friendly smart contract access for everyone. To achieve this goal, we are launching new products and services:\n\nBeans check-out: We will extend our payment requests to web so that (Soroban) projects or webshops can integrate with Beans and use our cash (Moneygram) and bank on/offramps. At check-out, a project or webshop generates a \"Pay with Beans\" QR code through our public API. They can set the amount, currency, destination address, webhook callback, and optional memo. A Beans user scans the QR and pays with their preferred currency. Via webhooks, the project will know the payment has completed, offering an experience just like any other web 2 check-out!\n\nUser-friendly deposits: We have seen that users find external webviews scary. This is why we are looking to offer in-app KYC and deposits through SEP 6 and 12.\n\nBeans for Bitcoin: Users will be able to deposit and withdraw native Bitcoin through an integration with Coinqvest BTC (SEP 6). This will allow users from the (large) Bitcoin community to use Beans as a Bitcoin payments app, buy BTC with cash, as well as \"upgrade\" their native Bitcoin to one that interoperates with Soroban smart contracts.\n\nSend to phone numbers: By building on SEP 30, a user can send a payment that can be claimed by a new user during sign-up in a non-custodial way.\n\nIntegrate smart contracts: By integrating Soroban, we will be able to offer many new services. The first use-case we will integrate is recurring payments, which our users will be able to set up from within the app. To realize this, we will need to integrate with a .NET Soroban SDK. Currently, the elucidsoft SDK is implementing Soroban, but they said they're short on time. So we will research how to help contribute to this SDK and take the first steps towards a Soroban integration in Beans."
            },
            "stellar.teamMembers": "Jop Middelkamp, Wouter Arkink",
            "stellar.urls": {
              "website": "www.beansapp.com",
              "videoURL": "https://youtu.be/6WSDnFYEfKE"
            },
            "stellar.socialMedia": {
              "twitter": "https://twitter.com/BeansApp",
              "discord": "https://beansapp.medium.com/"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:6",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recIf1jFrLDhF2wvL",
          "projectId": "daoip5:stellar:project:link-io",
          "projectName": "LINK Business",
          "createdAt": "2023-06-08T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recIf1jFrLDhF2wvL",
          "fundsApproved": [
            {
              "amount": 1590331.25,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 140000
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:7",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recVYQzThUCdFa0N5",
          "projectId": "daoip5:stellar:project:pluto-loans-b2b",
          "projectName": "Pluto Loans B2B",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recVYQzThUCdFa0N5",
          "fundsApproved": [
            {
              "amount": 1047461.62,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 92700,
          "title": "Pluto Loans B2B",
          "description": "Pluto Loans allows users to spend their future yield today. The loan is automatically repaid over time using the profits generated",
          "fundsPaid": [
            {
              "amount": 92700.0,
              "denomination": "USD"
            },
            {
              "amount": 1047461.62,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-07T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Financial Protocols",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "With Pluto Loans, users can deposit yield-producing collateral and get a loan of their future yield immediately. No liquidation risks. The loan debt is time-based and self-repaying. Now we are working in a new business model, PlutoLoans B2B. Soroban will augment PlutoLoans functionality by allowing: 1) Loan closure after it has been self-paid without user intervention 2) Protect the users' collateral capital in case of yUSDC loss of value by trading the collateral amount in the loan vault for a stable coin.\n\nArgentina has an inflation rate of over 102.5% (https://tradingeconomics.com/argentina/inflation-cpi). The Argentinian peso has devalued 3,609% since 2012 (https://www.xe.com/currencycharts/?from=USD&to=ARS&view=10Y). Argentina has a ban on purchasing foreign currency, but not on cryptocurrencies (https://www.washingtonpost.com/politics/2019/09/06/argentina-just-reinstated-foreign-currency-restrictions-heres-what-you-need-know/). Personal loans in Argentinian pesos have an interest rate of over 101% (https://www.bbva.com.ar/tablas/tasaprestpers.pdf).\n\nPluto is LATAM-focused, with most of its core team members being based in Argentina, and with Argentina being its main country of operation. Users can make use of regional anchors to buy ARS issued on the Stellar network (https://home.anclap.com/, https://anchors.stablex.org/) or use exchanges to buy XLM. Users deposit yUSDC and get a loan of 50% of their collateral loaned out in pUSD. pUSD is a token backed by the future yield generated by yUSDC, intended to trade 1:1 with yUSDC through various pegging mechanisms (https://ultrastellar.com/assets/yusdc). Self-repaying; a loan gets paid by the yield generated by the collateral of yUSDC. At the maturity of the loan, a user gets back their collateral and keeps their loan. No risk of liquidation. No early cancellation fees. Build on top of other Stellar projects (Ultrastellar’s yUSDC), strengthening the ecosystem."
            },
            "stellar.teamMembers": "kelo6",
            "stellar.urls": {
              "website": "https://www.plutodao.finance/",
              "codeRepository": "https://github.com/PlutoDAO",
              "videoURL": "https://youtu.be/ZI9B2SEPDkY"
            },
            "stellar.socialMedia": {
              "linkedIn": "https://www.linkedin.com/company/plutodao/",
              "discord": "https://discord.gg/9hkx2AVhpc"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:8",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWtqpdZ2UzVkfhe",
          "projectId": "daoip5:stellar:project:reflector",
          "projectName": "Reflector",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recWtqpdZ2UzVkfhe",
          "fundsApproved": [
            {
              "amount": 1681814.33,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 148840,
          "title": "Reflector",
          "description": "Decentralized price feed oracle grid for Stellar DeFi smart contracts to support derivatives, lending, and asset management",
          "fundsPaid": [
            {
              "amount": 148840.0,
              "denomination": "USD"
            },
            {
              "amount": 1681814.33,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-07T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Infrastructure & Services",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "Reflector is a decentralized price feed oracle network for Stellar DeFi smart contracts. Price provider feed is managed by a network of trusted nodes controlled by reputable organizations. Each of them continuously monitors Stellar network for new trades to determine fair prices for every tracked asset. The account which controls oracle price feed contract is protected by M-of-N multisig, so any price update or contract code modification requires a confirmation from the majority of the participating organizations. Nodes periodically generate transactions to update the price feed contract internal state with new prices. Those transactions get broadcasted to other peer nodes to aggregate signatures. Since all servers run the same codebase and take snapshots at predefined timeframes, the generated update transaction should be always identical for all servers, unless they are lagging significantly behind the consensus. Once the transaction gathers enough signatures to match the threshold, it is submitted to Stellar network. Consequently, fresh price data becomes available to all consumers. Consumer contracts can fetch price data for any asset tracked by the oracle following the recently proposed oracle interface SEP. Aside from standard methods that allow retrieving price only designated in a base asset, we also provide automatic cross-price calculation for any pair formed by two arbitrary assets quoted by the oracle and automatic TWAP over the requested range. We focus on trust, relying on proof-of-authority consensus instead of widely used proof-of-stake. Utilization of the built-in Stellar multisig mechanism leverages the time-proven security of the mainnet instead of some in-house brewed consensus mechanism. Storing the data in the oracle contract provides many advantages compared to other architecture based on request-response model: immediate data availability in consumer contracts, low fees, straightforward invocation, efficient ledger utilization."
            },
            "stellar.teamMembers": "OrbitLens",
            "stellar.urls": {
              "website": "https://reflector.world",
              "codeRepository": "https://github.com/hawthorne-abendsen/se-oracle-contract",
              "videoURL": "https://www.youtube.com/@StellarExpert/featured"
            },
            "stellar.socialMedia": {
              "twitter": "https://x.com/in_reflector",
              "discord": "https://discord.gg/v2ggfDty2d"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:9",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recdmXC3u5HWsR7tq",
          "projectId": "daoip5:stellar:project:okashi",
          "projectName": "useSoroban.app II",
          "createdAt": "2023-06-05T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recdmXC3u5HWsR7tq",
          "fundsApproved": [
            {
              "amount": 120037.09,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 124800
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:10",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recq35w2zW5FQu4tY",
          "projectId": "daoip5:stellar:project:trilobyte",
          "projectName": "Trilobyte",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recq35w2zW5FQu4tY",
          "fundsApproved": [
            {
              "amount": 1327514.12,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 119000,
          "title": "Trilobyte",
          "description": "A Cash Flow Financing Protocol on Soroban",
          "fundsPaid": [
            {
              "amount": 119000.0,
              "denomination": "USD"
            },
            {
              "amount": 1327514.12,
              "denomination": "XLM"
            }
          ],
          "status": "Awarded",
          "mostRecentPaymentDate": "2023-06-07T00:00:00Z",
          "latestTranche": "Legacy Award v4.0 (90%)",
          "awardType": "Legacy v4.0 Award",
          "category": "Financial Protocols",
          "extensions": {
            "stellar.technical": {
              "productsAndServices": "Trilobyte is an uncollateralised lending protocol on Soroban, the Stellar Development Foundation’s new native smart contracts platform. The focus of Trilobyte will be on facilitating trade, working capital, and other cash flow finance transactions (Cash Flow Financing) for Latin America and the Caribbean (LATAM+C). These loans are expected to be executed between parties experiencing difficulties contracting the finance they wish to contract for reasons relating to trust, shortcomings of the financial markets they operate in, local currency convertibility issues, geographic bias, or global regulation limiting their activity, among others. Trilobyte will provide the necessary infrastructure to connect whitelisted borrowers with investors, allowing the former to borrow digital assets against expected future cash flows, as a simpler and more cost-effective alternative to what is available in local or international financial markets.\n\nTrilobyte’s ecosystem will consist of five key entities:\n\n- Borrowers: Reputable organisations searching for working capital to finance their operations.\n- Borrower’s Vault: The equivalent to a loan in traditional finance, the Vault is a special-purpose receptacle for receiving the agreed cash flows. It is represented by a smart contract on the Stellar Soroban platform. Vaults can be permissioned or permissionless.\n- The Payment Actors: Payment Actors are third-party vehicles through which the cash flows that serve as the source of repayment are channelled in a Cash Flow Financing lending scheme. Payment Actors can be independent persons or entities who regularly pay funds to the Borrower in the normal course of the Borrower’s business activities. These are generally the clients or customers of the Borrower’s business or other parties, such as management entities or electronic payment platforms, who owe regular payments to the Borrower in the normal course. These regular payments constitute the cash flows that can be captured in a cash flow finance scheme by directing the Payment Actors to make all future payments to the Vault for subsequent redistribution between the Investors and the Borrower in accordance with the agreed terms of the transaction.\n- The Investors: Private individuals or entities who will transfer digital assets into one or multiple Borrower Vaults in exchange for future yields.\n- The Treasury: Initially managed by the Trilobyte team, the Treasury will whitelist Borrowers, create Vaults, and ensure that Payment Actors meet their agreed payment obligations. A DAO is expected to manage the Treasury in the future as the project scales."
            },
            "stellar.teamMembers": "Yulexi Matienzo",
            "stellar.urls": {
              "website": "https://trilobyte.finance/",
              "videoURL": "https://www.youtube.com/watch?v=O-n0uLIQXhQ"
            }
          }
        },
        {
          "type": "GrantApplication",
          "id": "daoip5:stellar:grantApplication:11",
          "grantPoolId": "daoip5:stellar:grantPool:scf-15",
          "grantPoolName": "scf-15",
          "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recQcIB562ZHDFqdJ",
          "projectId": "daoip5:stellar:project:soroswap-finance",
          "projectName": "Soroswap Protocol",
          "createdAt": "2023-06-07T00:00:00Z",
          "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recQcIB562ZHDFqdJ",
          "fundsApproved": [
            {
              "amount": 650849.93,
              "denomination": "XLM"
            }
          ],
          "fundsApprovedInUSD": 57600
        }
      ]
    }
  ]
}