{
  "@context": "http://www.daostar.org/schemas",
  "name": "Stellar Community Fund",
  "type": "Foundation",
  "grantPools": [
    {
      "type": "GrantPool",
      "name": "SCF #29",
      "applications": [
        {
          "type": "GrantApplication",
          "id": "29-93",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "HouseAfrica’s Sytemap - Sytemap",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Powering Africa's Landownership with Technology. Product: Sytemap Land Marketplace is a decentralized platform built on the Stellar blockchain that streamlines and simplifies African land ownership.\n\nProblem: The African land market faces significant challenges, including:\n\nFraud: Hundreds of thousands of land scams occur annually, leading to financial loss and heartbreak.\nInefficiency: Traditional land acquisition processes are slow, paper-heavy, and often opaque.\nLimited Access: Secure and transparent land ownership is difficult for many Africans, hindering economic development.\n\nSolution: Sytemap Land Marketplace tackles these issues by:\n\nLeveraging Blockchain: Land ownership records are stored immutably on the Stellar blockchain as NFTs, ensuring security and transparency.\nSmart Contracts: Automated agreements manage the land purchase process, eliminating the need for paperwork and reducing fraud risk.\nStreamlined Platform on Satellite Map: Users can browse verified land plots, reserve plots, complete transactions, and manage/monitor their ownership digitally and virtually.\n\nTarget Audience: Sytemap caters to:\n\nProperty Seekers: Africans looking for a secure and transparent way to purchase land.\nReal Estate Developers/Government Agencies: Seeking a faster and more efficient way to sell their Land Projects.\nDeFi Users: Investors interested in exploring new opportunities in the African land market. (coming soon)\n\nStellar Integration: Sytemap utilizes Stellar's core functionalities for secure and efficient transactions:\n\nIssuing Custom Assets: Land plots are represented as NFT digital tokens (land tokens) on the Stellar network.\nFast and Low-Cost Transactions: Stellar's high-throughput and low-cost transactions facilitate swift and affordable land ownership transfers. (Coming Soon)\n\nSEP Integrations:\n\nSEP-1 and 30: Enables seamless asset/NFT creation for land tokens on the Stellar network.\n\nEcosystem Partners: Sytemap is exploring partnerships with:\n\nGovernment Housing Agencies: Integration with national and regional land registries for further verification and data accuracy.\nReal Estate Developers: Collaboration with real estate companies to offer a comprehensive land ownership experience.\n\nWhy Stellar? We chose Stellar for several reasons:\n\nScalability: Stellar can handle a high volume of transactions, which is crucial for the growing African land market.\nSecurity: Stellar's robust consensus mechanism ensures the integrity of land ownership records.\nAffordability: Low transaction fees make land ownership accessible to a broader audience in Africa.\nEstablished Ecosystem: Stellar's existing network of partners and developers creates a supportive environment for growth.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recW5iwiFOUUejYvP",
          "status": "funded",
          "socials": [
            {
              "platform": "LinkedIn",
              "url": "https://linkedin.com/company/sytemaphq"
            }
          ],
          "fundsApproved": [
            {
              "amount": "35000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "35000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-94",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "POMA: Engage-to-earn platform - POMA: Engage-to-earn - Phase 1",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "POMA is a platform where developers receive a cashback through a smart contract, distributed based on their engagement nan",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recsBXIcZ3R2EKzy0",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/POMAprotocol"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/poma-protocol/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "14000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "14000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-95",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Globachain Payment Ecosystem - Globachain Payment Ecosystem",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "On and off ramps for individuals and businesses; Merchant services and cross border payments for businesses; All on Stellar. GlobaChain is revolutionizing access to cryptocurrency in fragmented markets with our blockchain-powered payment ecosystem. Addressing the need for a seamless, low-cost on-ramp/off-ramp fiat and local currency exchange in emerging and established markets, our solution overcomes the barriers to cryptocurrency adoption and usage. Licensed as a VASP, GlobaChain facilitates secure, efficient transactions across the UK, Europe, and 16 African countries. Our aim is to onboard the next 100 million users into the crypto economy through our Dapp, offering significantly lower fees than conventional exchanges. By targeting fractionalized markets where payment systems are highly segmented, GlobaChain not only simplifies but also democratizes access to cryptocurrencies for users in underserved regions, making the digital economy truly global and inclusive.\n\nOur suite of services provide alternatives to the familiar rigid traditional financial services, services including cross border payments, on-chain investments, staking/interest. We are the link between trad-fi and defi allowing our customers to swap on-chain digital assets for fiat currency, this is a crucial area within the disruptive world of blockchain and digital assets.\n\nWe have also built a merchant payments to enable in-store crypto collection, which is tailored to the Nigerian, Ghanaian, and South African Markets. In these markets it is very difficult to: A) Make payments easily due to the fragmented nature of the banking system B) Get access to foreign currencies due to the liquidity crisis C) Access low-cost payment services for merchants.\n\nWe will be servicing on and off ramps directly on Stellar, and utilizing the low-cost, fast deposit nature of the blockchain. We chose Stellar because it is a network optimized for payments. Being a PoA, the Stellar network is faster, cheaper, and far more energy-efficient than many other blockchains. Its core design makes it easy to create and issue digital assets that enable rapid payments at low-cost around the world.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recuYdA4IXkFUtuLI",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/globachain"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/globachain"
            }
          ],
          "fundsApproved": [
            {
              "amount": "49500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "49500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-96",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "EA Kazi - EA Kazi",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "EaKazi combines and decentralizes Udemy+Freelancer allowing easy access to freelancers with verifiable credentials. EA Kazi: Revolutionizing Freelance Certification and Recruitment\n\nEA Kazi is a groundbreaking web3 NFT certificate platform designed to bridge the gap between training and employment. By integrating certification with lifelong royalties, EA Kazi ensures that trainers are incentivized to provide high-quality education, while trainees gain verifiable credentials that enhance their job prospects. Built on the Stellar blockchain using Soroban smart contracts, EA Kazi combines the best aspects of platforms like Udemy and Freelancer into a single, cohesive ecosystem. This innovative approach creates a seamless connection between learning and earning, fostering a community of skilled professionals and reputable trainers.\n\nThe Problem:\nIn the current digital economy, the demand for verifiable skills and experienced freelancers is higher than ever. However, several challenges persist: Lack of Verifiable Credentials: Many online courses provide certificates that are easily forged or lack credibility, making it difficult for employers to trust the qualifications of potential hires. Trainer Incentives: Trainers often receive one-time payments for their courses, which disincentivizes them from continually updating and improving their content. Fragmented Platforms: Freelancers must navigate multiple platforms for training and job opportunities, leading to inefficiencies and missed opportunities.\n\nEA Kazi’s Solution:\nEA Kazi addresses these challenges by offering a unified platform where training, certification, and job opportunities coexist seamlessly: NFT Certificates: Upon completing a course, trainees receive NFT certificates stored on the Stellar blockchain. These certificates are immutable and easily verifiable by potential employers, ensuring the credibility of the trainee's skills. Lifelong Royalties for Trainers: Trainers earn royalties from the projects trainees complete using their certifications. This continuous revenue stream incentivizes trainers to maintain high-quality, relevant content. Integrated Ecosystem: EA Kazi combines training, certification, and job opportunities on one platform. Trainees can easily transition from learning to earning, while recruiters can access a pool of verified, skilled freelancers.\n\nUser Dashboards:\nFreelancer/Trainee Dashboard: Displays available courses, job opportunities, and payment information. Trainees can track their certifications and apply for jobs directly through the platform. Recruiter Dashboard: Enables recruiters to post job opportunities and review applications from certified freelancers. Recruiters can easily verify the credentials of applicants, streamlining the hiring process. Trainer Dashboard: Allows trainers to list courses, track their trainees, and view their royalty earnings. Trainers can see the impact of their courses and adjust content based on trainee success.\n\nIntegration with Stellar and Soroban Smart Contracts:\nEA Kazi leverages the Stellar blockchain and Soroban smart contracts to ensure a secure, efficient, and transparent platform. Here's how it integrates: NFT Creation and Management: Soroban smart contracts handle the creation, issuance, and management of NFT certificates. These contracts ensure that each certificate is unique, verifiable, and immutable. Royalty Distribution: Soroban smart contracts automate the distribution of royalties to trainers. Every time a trainee secures and completes a project using their NFT certificate, the smart contract ensures that the trainer receives their rightful share. Secure Transactions: Stellar’s blockchain provides fast, low-cost transactions, making it ideal for managing payments between trainees, trainers, and recruiters. This efficiency ensures that all stakeholders receive their payments promptly and without unnecessary fees.\n\nConclusively, EA Kazi represents a significant advancement in the integration of training and employment within the digital economy. By leveraging the power of Stellar and Soroban smart contracts, EA Kazi ensures that every stakeholder benefits from a transparent, secure, and efficient system. Trainers are incentivized to provide the best possible education, trainees gain verifiable and valuable credentials, and recruiters can trust the skills of the freelancers they hire. This holistic approach addresses critical gaps in the current landscape and paves the way for a more connected and credible freelance economy.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recFjl5hx6W6MpaKT",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "36000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "36000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-97",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Lul-Serving the unbanked - Lul-Serving the unbanked",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Enabling financial inclusion for refugees and the unbanked in Africa with Remittance,ROSCA, Virtual cards, and other service. Our app aids financially underserved refugees and unbanked individuals in sub-Saharan Africa. Many Africans lack adequate banking. For example, 350 Million people are unbanked in Sub-Saharan Africa. Also, millions of refugees don’t have financial access. Refugees often encounter hurdles accessing traditional banking due to language barriers, documentation challenges, and unfamiliarity with other financial options.\n\nOur app, utilizing Stellar, tackles these issues by providing vital services like remittance, digital wallets, payments, crowdfunding, rotating savings and credit associations, and virtual cards. These solutions are crafted to offer refugees and unbanked individuals secure and affordable access to financial services, bolstering their financial inclusion and stability.\n\nRemittance & Payment\n\nProblem: In Sub-Saharan Africa, refugees and locals heavily rely on remittances from developed countries, facing high costs from existing providers—around 8% or more, including unfavorable exchange rates. Many resort to expensive Hawala networks for cross-border payments due to limited banking access.\n\nSolution: Our system facilitates fast, secure remittance primarily for refugees and unbanked populations across 21 African countries. We leverage USDC transactions, establishing our own on/off-ramp system of agents and partnering with Stellar Network Anchors where necessary. USSD functionality ensures swift, secure payments for users without reliable internet access.\n\nHow it works with Stellar: Senders and receivers will get Stellar wallets where they will be able to send and receive money, by depositing and sending in USDC. Once the beneficiary receives the amount in her wallet, she can easily cash out the funds using our on/off ramp. This will make the remittance delivery cheap and fast.\n\nSaving\n\nProblem: Our target audience commonly resorts to holding their savings in cash, posing security risks, especially for refugees and low-income persons in crowded accommodations. There's a pressing need for a secure money storage solution. Moreover, local currency inflation exacerbates the risks of prolonged cash holding.\n\nSolution: Our app enables users to securely deposit and save cash in USDC, safeguarding against inflation and theft. Developed in native languages it ensures accessibility. We'll establish a proprietary on/off ramp system, leveraging local businesses and our agent network for convenient cash-out.\n\nHow it works with Stellar: Integrating with Stellar wallets allows users to easily deposit funds in USDC, enabling secure savings and protection against inflation.\n\nCommunal Funding\n\nProblem: In African societies, a strong tradition of community support exists, aiding those in need with expenses like hospital bills and funeral costs. However, online crowdfunding poses challenges for our target audience, including high processing fees and difficulty in delivering funds to beneficiaries without access to financial institutions.\n\nSolution: Leveraging our system, users can securely and affordably transfer funds to designated beneficiaries. Upon reaching the predetermined funding threshold, beneficiaries can promptly cash the much-needed funds via our off-ramp system.\n\nHow it works with Stellar: We will designate wallets for such collections, allowing the beneficiary herself to access these funds, streamlining the collection processes, making it easy and efficient. Additionally, cashing out will be easy.\n\nRotating Savings and Credit Associations\n\nProblem: Rotating Savings and Credit Associations (ROSCAs) are highly popular in African societies, where members regularly contribute a fixed amount to a communal fund. Each member then takes turns receiving the total pooled amount, providing access to a lump sum. This mechanism is particularly beneficial for unbanked individuals. However, there is currently no secure method to facilitate ROSCAs for groups spread across different localities, which is common for refugees dispersed in various countries.\n\nSolution: We will enable people to create wallets on our app and once they subscribe to a group for ROSCA, payment will be made from their wallet to the common wallet. And when all the members of the group accept, the funds will be transferred to the beneficiary wallet.\n\nHow it works with Stellar: We will designate wallets specifically for such collections, allowing ROSCA groups easy collection and disbursement.\n\nVirtual Card\n\nProblem: Majority of Sub-Saharans don’t have access to card payment, blocking them out of the international financial system. They can't purchase online causing many difficulties.\n\nSolution: We will enable people to create and fund virtual cards from their Stellar wallet by partnering with third-party card issuing companies. Through this way, people could easily access international payments by paying in their local currency.\n\nHow it works with Stellar: We will integrate Stellar wallets with the third-party companies to seamlessly transfer funds from wallets to virtual cards.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rectWILIUqnvfGvTK",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "20500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "20500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-98",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "SoroStarter: Soroban LaunchPad - SoroStarter: Soroban LaunchPad",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "A secured and decentralized IDO and fundraising platform for Soroban and the Stellar ecosystem. SoroStarter is a secured and decentralized IDO and fundraising platform designed for the Soroban blockchain and the Stellar ecosystem. Its primary goal is to provide projects and companies building on Soroban and the Stellar ecosystem with a secure and decentralized infrastructure for launching and raising funds. This is achieved through its token pool IDO, token sale, and incubation protocol. Additionally, SoroStarter assists these projects and companies in significantly growing their communities and expanding their projects' reach and adoption through an incentivized community engagement mechanism. Furthermore, SoroStarter enables end-users—both investors and the Stellar Lumen community as a whole—to gain secure early access to quality, well-vetted IDOs and token sales of projects on Soroban.\n\nThe products of SoroStarter encompass its two main features:\n\nSoroStarter’s IDO/Sale Protocol: A secure and decentralized IDO and fundraising protocol which operates on Soroban, facilitating seamless participation of users, investors, and community members in IDOs on the Soroban blockchain. Based on preset IDO/sales parameters, the protocol algorithmically manages allocation, access, token unlocking and distribution, refunds, and the release of raised funds post-sale.\n\nSoroStarter's IDO Selection and Onboarding Mechanism: An efficient vetting and selection process which is used to evaluate projects listed on SoroStarter for IDO or token sale opportunities. At its core is an online governance voting mechanism on Soroban, enabling members of the Stellar Lumen community to vote on projects to be listed on SoroStarter for a launch.\n\nA critical requirement in any blockchain ecosystem with smart contract capabilities is the ability for dApps and projects to deploy easily and establish their own independent economies. Many of these economies depend on utility tokens specific to their ecosystem. For example, consider a GameFi or play-to-earn project, which often relies on NFTs for player access and an in-game token for rewards and purchases. These projects need a reliable, decentralized, and secure method to launch their tokens and ecosystem assets. By providing this capability, more projects with independent economies and value-driven ecosystems can be launched. This attracts a larger user base to the project's community, thereby expanding the blockchain ecosystem as a whole. SoroStarter addresses these needs on Soroban and Stellar Lumen by offering a dependable, decentralized, and secure platform for projects building on Soroban to launch tokens and raise funds. This contributes to the overall adoption and growth of the ecosystem.\n\nSoroStarter's core features, mechanisms, and protocols are built and deployed on Soroban, the Stellar's native smart contract platform. It leverages Soroban's robust capabilities for smart contracts and transaction processing. Our governance mechanism and IDO/Sale protocol smart contracts are developed and deployed on Soroban, ensuring transparency, security, and efficiency in project selection and fundraising processes. Additionally, we utilize the Stellar SDK to seamlessly integrate these Soroban contracts with our application's user interfaces. This integration enhances user experience and improves usability.\n\nSome of our deployments and integrations can be seen on SoroStarter's MVP currently deployed on Futurenet. Here are the important links:\n\nToken Sale dApp (MVP)\nProject Voting dApp (MVP)\nGovernance Staking dApp\nIDO/Sales Contract\nGovernance/Voting Contract",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recHIlOHhT0rMNGUN",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/SoroStarter"
            }
          ],
          "fundsApproved": [
            {
              "amount": "47175.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "47175.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-99",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "USDC payments for LatAm stores - Unalivio",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Making online sales is hard for many retailers in LatAm. With Unalivio, merchants can perform digital sales and get paid in USDC Unalivio is an online payments tool for brick-and-mortar retailers, and a cross border payments system. Unalivio pays out in USDC because it is specifically made for LatAm. Unalivio allows users to pay for goods for their family abroad in a direct transaction to the merchant, instead of sending money that needs to be picked up. With Unalivio, users create a ticket that can be shared and paid from around the world. The payer uses local currency through a cash-in partner, or crypto. Once the payment is verified, the system notifies all parties involved and transfers USDC to the vendor account. To complete the loop, vendors review transactions, administrative details and withdraw funds as USDC on Stellar.\n\nNot long ago, I received a worrisome phone call from my friend Luis in Dubai. He intended to pay $2,000 USD for his father’s surgery in Venezuela, but his Zelle was blocked when he attempted to make the transfer! The bank blocked the transaction because it decided this was an unauthorized use, even though everything was ready! The doctor, hospital, nurses, and of course his father!! Because they were in a part of the world that is not connected to the USD financial system, they had to go through time consuming hurdles in order to use their own money in a life-or-death situation. He called me because he remembered what we are building with Unalivio, and within minutes we did the cash in, created an account for the doctor’s office and let them receive confirmation of funds. Thankfully Luis’ dad is ok, and we got reassurance of WHY we are building these solutions.\n\nEach year 138 Billion Dollars are sent to LatAm; and in Venezuela, our sandbox market, 7 million migrants sent 4.5 Billion Dollars in remittances in 2023. And for traditional retailers, making online transactions is hard, and making cross border transactions is almost impossible!\n\nAt the core of our system, we use USDC on Stellar to move funds around Latam with this stablecoin. We collect funds from around LatAm with our network of Stellar anchor, Crypto payment cash in, and other payment rails, convert them into USDC and pay our affiliated merchants on USDC. We also expand Stellar's use case by enabling cash-in payments with USDC on Stellar at hundreds of locations, creating a tool that is both valuable and sustainable real-world problem-solving.\n\nTo grow and incentivize usage, we are implementing a counter system to measure and analyze incentives. As part of our launch we tested discounts and cashbacks for payments. We will be launching direct integration into wallets as our pilot integration into Beans App, because we want to incentivize the thousands of users they have with Venezuelan ties in order to promote Stellar payments exclusively.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec4s8vcXcD1RHTSl",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/somosunalivio"
            }
          ],
          "fundsApproved": [
            {
              "amount": "49300.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "49300.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-100",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "THE HUB Citizens Portal - THE HUB Citizens Portal",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Deploy THE HUB Citizens Portal (interoperable avatar generation platform) on Stellar. The goal for the project is to develop a platform that integrates Stellar's blockchain capabilities, VIIO's users (Latam provider of on and off ramping services), and THE HUB Portal: A Web3 platform to upload, deploy and manage Interoperable 3D User-Generated Content. This ecosystem aims to provide Latin Americans with a personalized financial experience, allowing them to keep up with the new wave of adoption of the 3D internet.\n\nTHE HUB\n\nThe HUB is the home of virtual creators, offering a platform called Citizens Portal to upload, deploy, and manage Interoperable 3D User-Generated Content (UGC). Our goal is to empower creators to fully unleash their creativity. By leveraging tokenization, we add verifiable ownership and open up new monetization opportunities for our Citizens.\n\nVIIO\n\nVIIO is building a financial ecosystem transforming the financial landscape for Latin Americans, starting with Colombia. We provide a global account to maintain USDC, enabling our users to save, spend, and hedge against currency devaluation. The deployment of the application will focus on doing an activation campaign specifically aimed at the Latin American Community of VIIO. The app will allow VIIO users and other Stellar community members to mint a randomised, interoperable 3D avatars from a collection of 5000 characters, which will allow them to get to know the Stellar community and its ecosystem in a gamified way. It will be structured in the following way:\n\nLaunch the Stellar Citizens and THE HUB Citizens Portal for all VIIO users and Stellar community members, enabling users to create and manage their digital avatars, which will be minted as NFTs on the Stellar blockchain using Soroban.\n\nPromote VIIO and the Stellar avatars in Latin America through a marketing and engagement campaign, emphasising the benefits of saving in US dollars, the security features of VIIO, and the uniqueness of having a digital avatar as well as using the Stellar blockchain.\n\nBenefits for Stellar: The platform will serve as a public good for the Stellar ecosystem by providing a tool focused on the interoperability and standardization of uploading, deploying, and managing all future 3D collections on-chain. It utilizes the VRM interoperability standard for the creation, customization, and management of avatars, characters, and vehicles. This standardization facilitates seamless integration and interaction across different virtual environments, platforms and games, thereby enhancing the standardization at the metadata level of such NFTs while making them fully interoperable. The platform is designed with an administrator and editor mode, both available to the entire Stellar developer community. The administrator mode enables content creators to generate and deploy their own 3D campaigns. It also allows campaign creators to add items, wearables, and other assets to existing collections, enhancing the possibilities for customization and monetization of 3D NFT campaigns. Additionally, the editor mode enables owners of NFTs from a collection to edit their avatars, characters, or vehicles.\n\nArchitecture\n\nAvatar Stellar Asset Issuance\n\nAsset Issuer Account: A dedicated issuer account will be responsible for creating these unique avatar assets\n\nCustom Asset: Each avatar will be represented as a unique asset on Stellar.\n\nIPFS Integration:\n\nIPFS will store immutable metadata for each avatar. Each avatar asset on Stellar will reference its corresponding metadata on IPFS, through an attached memo to the issuance transaction.\n\nWearables Database (Wearables DB):\n\nMedia Storage: This database will store VRM files and other media data related to avatar customization\n\nURL Exposure: Media items will be accessible via URLs, allowing easy integration with the Avatar Module and Metadata Service.\n\nAvatar Database (Avatar DB):\n\nAvatar Data Management: This database will store data specific to each Stellar avatar asset, such as current wearables and customization options.\n\nMetadata Service:\n\nMetadata Service: is meant to manage the whole metadata logic for avatar NFTs, interacting with IPFS, Avatar Contract, Avatar DB, Wearables DB and UI\n\nAvatar Module:\n\nAvatar Module is the app the final user is supposed to interact with to manage their own avatars\n\nMVP: https://avatar-generator-git-dev-dap-frontend.vercel.app/thehub",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recQFye9LGFqAXQWh",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/thehub_dao"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/the-hub-dao/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "46500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "46500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-101",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "BorderDollar - Invoice Finance - BorderDollar",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "BorderDollar provides investors with opportunities to invest in real-world assets through SME cross-border trade invoice financing BorderDollar provides investors with opportunities to invest in real-world assets through SME cross-border trade invoice financing. The trade finance gap is $2.5T worldwide, and we are focusing on the maritime industry in SEA which represents a $500B gap with annual growth of 9.6% (https://www.adb.org/publications/2023-trade-finance-gaps-growth).\n\nThese SMEs are underserved by the traditional financial institutions, experience tight cashflow, and inefficiencies in the supply chain. These SMEs face tight cashflow problems because they have short-term needs for the money, but customers will only pay them after anywhere between 30-90 days. With invoice financing / freight factoring, these SMEs get upfront funding thus freeing them for important things such as paying their employees on time, rent, etc.\n\nThe BorderDollar platform involves two stakeholders: investors, and businesses.\n\nInvestor-facing platform: Investors refer to individuals who want to finance invoices in exchange for a certain amount of returns, i.e. between 8-14% APR. Here on the investor-facing side, investors connect their wallets, choose a liquidity pool/campaign to fund, and how much they want to fund. Our value proposition to investors is that they are investing in an underserved, neglected, and most importantly orthogonal to regular assets. We appeal to non-degens who wish to make a difference for underbanked SMEs and prefer stable regularly timed returns over staking-type projects with short-lived high returns.\n\nBusiness-facing platform: SMEs which require cash will upload their invoices, and we will assess these invoices internally before putting them up for funding by funders. On this end of the platform, businesses undergo KYC. They will then receive 70-80% of their invoices' value in fiat using an off-ramp service. For example, when we onboard SMEs from the Philippines, we can use Moneygram for money transfers from the liquidity pool to fiat because of their collaboration with Circle and Stellar (https://www.moneygram.com/intl/stellarwallets).\n\nThese invoices will initially be assessed manually through SME owner interviews and due diligence, along with our risk scorecard. In the future, we will integrate machine learning for automated risk assessments for scalability.\n\nFor more technical information, please refer to the technical architecture document below.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recDTKZEE2PaegFTc",
          "status": "funded",
          "socials": [
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/in/jackietanyen"
            }
          ],
          "fundsApproved": [
            {
              "amount": "95000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "95000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-102",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Copperx - Gateway and Payout - Copperx - Gateway and Payout",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "We’re building next-gen financial tools for businesses and consumers to help accept and manage payments using stablecoins. Copperx Gateway: Copperx Gateway is an inbound payment solution for receiving crypto payments from thousands of customers. It offers no-code tools such as invoices, payment links, and developer APIs to integrate payments into various products.\n\nCopperx Payout: Copperx Payout is a pioneering global payout solution designed specifically for Web3 businesses. It enables seamless, efficient, and compliant transactions to employees, contractors, and vendors in over 50 countries.\n\nProblem We Solve: Web3 businesses are struggling to move between crypto and fiat, and to pay salaries to their global teams or vendors. They can't even get a bank account due to current regulations. Web3 companies have to set up multiple entities for fund movement, which we can avoid if we solve global payouts.\n\nIntegration on Stellar: We are developing contracts for accepting payments and facilitating offramps via international remittances. Our partnerships with Bridge, Circle, and regional offramp providers ensure minimal cost crypto-to-fiat conversions. As more companies join Stellar, we can be a one-stop solution for all their financial tooling needs. Additionally, we can leverage Stellar’s Moneygram rail to power last-mile offramps to our current users, making our solutions even more comprehensive and efficient.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec02RUwR3wO7gsH3",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/CopperxHQ"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/copperx/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "50000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "50000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-103",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Beans app - Cards & passkeys - Beans app",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Adding cards, passkeys and DeFi to the Beans non-custodial wallet. As a non-custodial wallet built for people without knowledge about blockchain, users can already send and receive money internationally. We have seen though that users would love to use their Beans balance to directly spend their funds in shops. This would mean they don’t have to withdraw and keep their funds in a more stable currency for longer. We are excited to add support for prepaid cards in Europe, LATAM and Africa. This will mean that users will keep their funds in the app (and on Stellar) for a longer period and will mean a significant increase in utility. It aligns really well with our vision that blockchain based wallets have the potential to look and feel similar to normal centralized banking services.\n\nTo add prepaid cards, we are looking to work with our card partner to leverage existing SEP’s like SEP 10 and SEP 6 and 12. By building on top of these standards it will be easier to maintain and the functionality will become available to the broader ecosystem easily as well. As cards need some additional features around card management, we are looking to build this in a way that has the potential to become a new “card standard”. In future iterations we might shift from prepaid cards to debit cards by using Soroban. This is something closely related to our ambitions to shift towards a smart wallet architecture.\n\nWe have previously done a proof-of-concept with very easy to use lending pool functionality inside Beans, through an integration with Blend. To take this into production, we require features like earnings management, multi procotol support, automated pool balancing and safety mechanisms. We were planning to build this ourselves, however, our direction changed after connecting with Paltalabs during the Consensus 2024 hackathon. Paltalabs showcased an idea that closely aligned with our needs. They expressed interest in further developing DeFindex in cooperation with us, offering substantial benefits by offloading the development of critical features to Paltalabs. Most of the work done on our Blend proof-of-concept can be reused or adapted to align with the DeFindex protocol. Additionally, we will develop a DeFindex adapter for the Blend lending pool that can be used by everyone in the Stellar ecosystem. To build the integration, we will build a Blend adapter that connects DeFindex with Blend. This adapter can be re-used by ecosystem projects.\n\nWe have seen that the onboarding flow can be a bit long for some users and SMS authentication is not the best fallback authtentication option in all countries. That’s why we are looking for other authentication options. Secondly, we see a lot of potential when we shift towards a smart wallet infrastructure. The first step in that direction is working with passkeys for account recovery. We are super excited by the ease of use of password less account recovery and looking to use passkeys for seemless account creation and recovery. A first step in this direction is by addin passkeys to our SEP 30 authentication options. After that, in future rounds we will be able to explore smart-wallet infrastructure changes in more detail. Here we expect to run into challenges like compatability with existing SEP's, sending from C addresses to G addressses, offering cross-currency swaps etc.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recl9kp1khhJSoxKF",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/BeansApp"
            },
            {
              "platform": "Discord",
              "url": "https://beansapp.medium.com/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "99740.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "99740.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-104",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "SendIN - SendIN",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "US to India money transfers made easy, cheap &amp; lightning fast. SendIN is a payments platform built on Stellar, designed to enhance the process of sending money from the US to India. We make US to India money transfers easy, cheap, and lightning fast. We offer a complete Web2 UX that ensures a seamless and user-friendly experience for Web2 users.\n\nFeatures:\n\nSendIN Wallet: Each user is provided with a custodial SendIN wallet to deposit funds. Built on the Stellar network, this wallet ensures fast, secure, and efficient transactions.\n\nKYC & Account Management: Users can easily manage their account, track pending transfers, and see transaction history. The KYC service will be facilitated according to the SEP-0012 standard and would be compliant with general KYC & AML standards.\n\nSend Money from US: Users can effortlessly send money from the US to any registered user on the platform using just their email.\n\nReceive Money in India: Users in India can receive money directly into their linked bank accounts if their KYC is authenticated. Our infrastructure guarantees that funds will be received in the bank account within 15 minutes of being sent.\n\nWeb2 Friendly UI/UX: Our application is designed to onboard web2 users seamlessly, providing a no/low web3 interface. Users won't need to manage their keys, convert crypto, or interact directly with the blockchain. All processes are automated and handled in the backend, ensuring a smooth and user-friendly experience.\n\nThe Problem:\n\nHigh fees & hidden costs: Traditional money transfers often charge high transaction fees, have hidden markup charges, and offer unfavorable exchange rates.\n\nSlow payment processing: On average, most remittance services take at least a day. There are also often delays caused by individual stakeholders like banks making the process inefficient.\n\nThe Market:\nThe remittance market, particularly for transfers from the US to India, represents a significant and exponentially growing sector. India is the world's largest recipient of remittances, receiving over $125 billion in 2023 alone. These are our 2 main user segments:\n1. Large Expatriate Population: The Indian expatriate community in the US is substantial and continuously growing, creating a steady demand for reliable and affordable remittance services.\n2. Freelancers and Merchants: There is a growing segment of freelancers and merchants who require efficient and fast payment solutions for cross-border transactions.\n\nThere was a survey conducted by zero-hash and light payment which revealed significant frustration with traditional payment systems. Here are the challenges freelancers face with traditional payments:\n\nSpeed:\n48% experience delays in getting paid.\n75% want payments within 24 hours; 45% desire real-time payments.\n\nCosts:\n49% find fees high and impacting their earnings.\n18% say fees significantly affect their income.\n\nStellar Integration:\nSendIN is built on the Stellar network to leverage its advantages of low transaction fees and almost instant settlement times. This integration ensures that our users benefit from fast, secure, and cost-effective transactions, making SendIN a highly efficient remittance platform. Here’s how we are utilizing Stellar's core features:\n\nStellar Anchors:\n- Kado: In the US, we will use Kado as our on-ramp service to convert fiat currency to USDC on the Stellar network. Kado is a Stellar anchor that adheres to SEP-0006 (deposit and withdrawal operations) and SEP-0024 (interactive deposits and withdrawals).\n- Onramp.money: In India, we will utilize Onramp.money to off-ramp USDC into INR, directly transferring the funds to users’ Indian bank accounts. Onramp.money ensures that the conversion and transfer process is smooth and compliant with local regulations.\n\nSDK / Soroban Integration: Our proof-of-concept (POC) currently uses the Stellar-JS SDK for transaction handling and network interactions. We plan to transition to using Soroban smart contracts for automating and securing our transactions. By utilizing Soroban, we can reduce the risk of errors and fraud and will also automate transactions.\n\nSEP-0012 Standard: Our KYC service will adhere to the SEP-0012 standard, which outlines the requirements for KYC data exchange. We will use the KYC API provided by Stellar. This ensures that our platform is compliant with global KYC and AML (Anti-Money Laundering) regulations.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reclOpHi3CxBBYPaO",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "37500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "37500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-105",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Bitwave Enterprise Payments - Bitwave",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Bitwave will deploy B2B custodial &amp; onchain payments using Stellar Soroban Smart Contracts, Coinbase Prime and Oracle Netsuite. Bitwave will deploy an enterprise-grade custodial and on-chain payment solution using Soroban, Stellar's smart contract platform. This solution leverages the robustness and security of Stellar's blockchain to provide enterprises with an efficient, secure, and seamless way to manage and process their cross-border payments.\n\nEnterprise Privacy Concerns\n\nChallenge Solved\nThe industry has privacy concerns about disclosing a single company address for all payments, which can reveal sensitive financial information. Bitcoin wallets such as XPUB allow separate addresses per customer or invoice, but they have limitations, such as relying on the payee for payment amount input and lacking smart contract controls. In the EVM ecosystem, using HD wallets for privacy is challenging due to a lack of user-friendly exposure.\n\nBitwave Solution\nBitwave Payments recognizes the significance of privacy in financial transactions. To enhance privacy and security, we use smart contracts and account abstraction. Our approach helps eliminate the requirement of a single address for all payments, adding an extra layer of control. With Bitwave's solution, businesses can specify the token amount to exchange, ensuring precise and secure payments. Our solution integrates smart contract functionalities to safeguard financial information and streamline payments for businesses in the blockchain ecosystem.\n\nStreamlined Approval Workflows\n\nChallenge Solved\nApproval payment processes can be cumbersome, especially in environments that require strict compliance and control. Manual approval workflows are prone to errors and can slow down financial operations.\n\nBitwave Solution\nBitwave automates and secures the workflow process, simplifying the management of role-based permissions and reducing the complexity of approvals. This ensures enterprise-grade access control while delivering rapid insights to financial teams and eliminating manual errors.\n\nSeamless Invoice Payments\n\nChallenge Solved\nTraditional cryptocurrency payments can be cumbersome, requiring multiple steps and systems. The lack of integration with existing financial systems often leads to fragmented visibility and payment control.\n\nBitwave Solution\nBitwave Payments lets businesses quickly initiate and complete bulk payments from their non-custodial wallet to vendors. It seamlessly integrates with existing accounting software and systems.\n\nFlexible Pricing Rules\n\nChallenge Solved\nHandling invoices in multiple denominations, especially in a mix of fiat and crypto, complicates accounting and financial reporting. It also adds to the workload due to the need for constant recalculations based on volatile crypto prices.\n\nBitwave Solution\nBitwave's pricing engine supports invoices in any denomination and automates pricing rules, significantly reducing manual workload. This flexibility and automation simplify accounting for crypto transactions, even during volatility.\n\nMinimized Costs\n\nChallenge Solved\nTraditional payment and financial reporting operations are often separated, resulting in higher costs for reconciliation, customer service, and transaction processing.\n\nBitwave Solution\nBitwave consolidates these operations, reducing costs and providing a seamless financial experience across the enterprise's financial stack. This consolidation results in more efficient operations and cost savings.\n\nSimplified Vendor Onboarding\n\nChallenge Solved\nOnboarding new vendors can be complex. It involves manually recording wallet information, performing security checks, and managing smart contracts.\n\nBitwave Solution\nBitwave simplifies vendor onboarding by automating the recording of wallet information in the general ledger. This streamlines the process of adding new vendors and managing payments.\n\nCompliance with Global Regulations\n\nChallenge Solved\nMeeting regulatory requirements involves staying updated with changing regulations, accurately reporting transactions, and implementing effective anti-money laundering (AML) procedures. Non-compliance can lead to legal penalties and reputational damage.\n\nBitwave Solution\nBitwave provides payment tools to help businesses track, report, and ensure compliance with tax obligations and AML regulations. By automating compliance reporting and offering AML frameworks, Bitwave ensures businesses adhere to regulatory standards. This reduces the risk of non-compliance, penalties, and administrative workload, allowing companies to focus on core activities instead of regulatory intricacies.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recTq3wV5OuPXU0mp",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/bitwaveplatform"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/bitwaveplatform/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "100000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "100000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-106",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "stellarpro.dev - stellarpro.dev",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Stellar-focused education platform for post-beginnerdevelopers wanting to grow their skills to intermediate and advanced levels. Stellarpro.dev is a Stellar-focused education platform, targeting developers who have gone past first steps and want to continue into intermediate and advanced skill levels to be able to build production-ready dApps on Stellar leveraging ecosystem tooling.\n\nObjectives:\n\n- Awareness of tooling available for Developers (lower time spent on finding and evaluating tools)\n- Easy and one-stop discovery of tooling features available for Developers (counteract segregation of information)\n- Lower learning curve for tooling (minimize time needed to become productive)\n- Engage participation from long-term and trusted community members (SCF pilots can become platform contributors) (monetary incentive)",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recEafxknk0CPdmB7",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "26000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "26000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-107",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Hoops Finance - Hoops Finance",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Analytics and DeFi platform for risk-adjusted investment in Soroban liquidity pools. Hoops Finance is an analytics and DeFi platform that indexes Soroban Liquidity Pools from leading ecosystem protocols. The platform offers:\n\nRisk Analysis: Extrapolates data to create various risk analyses.\nPerformance Metrics: Lists key metrics such as pool utilization, total value locked (TVL), and tokens in the pool.\nAggregated Saving Account: Uses indexed data to create aggregated saving accounts leveraging the best-performing pools across several protocols.\n\nProblems It Solves:\n\nLack of comprehensive risk analysis and performance metrics for liquidity pools on Soroban.\nDifficulty for investors to identify the best-performing pools adjusted for risk.\n\nSolution:\n\nRisk Analysis: Provides detailed risk metrics, aiding investors in making informed decisions.\nPerformance Metrics: Offers real-time data on liquidity pools, simplifying the investment process.\nAggregated Saving Account: Optimizes returns by leveraging top-performing pools.\n\nTarget Audience:\n\nInstitutional and retail investors looking for reliable investment opportunities in DeFi.\nDevelopers and financial analysts requiring comprehensive data for liquidity pool performance.\n\nWhy Stellar?:\n\nRobust Ecosystem: Offers a mature and supportive environment for DeFi projects.\nLow Transaction Costs: Ensures cost-effective data processing and transactions.\nSupport for Smart Contracts: Facilitates advanced functionalities crucial for Hoops Finance.\n\nFor more information on the Stellar and Soroban integrations: https://www.notion.so/bastianstudio/Soroban-Components-to-Implement-Savings-Accounts-db63048d76234efbae5887515c66aa0e?pvs=4",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rechiZHwFanNF1nnI",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "50000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "50000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-108",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Reflector DAO - Reflector",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "DAO-governed oracle with publicprice feed and customizable subscriptions for Stellar DeFi Reflector oracle contracts are controlled by the multisig-protected consensus of reputable organizations. The admin account of the oracle smart contract always has all node public keys as co-signers with >50% multisig threshold, so more than half of the oracle backing nodes have to agree on a transaction in order to store price feed data or modify oracle contract state.\n\nEach node independently calculates the values of quoted prices using deterministic idempotent algorithms to ensure consistency, generates the update transaction, signs it with the node's private key, and shares it with other peer nodes via WebSocket protocol. If for some reason (ledger access delay, failing connection, version incompatibility, adversary attack) any given node quotes a token/asset price different from other nodes, the transaction hash will not match the hash generated by the majority, so the transaction won't make it into the ledger. This way Reflector utilizes Stellar protocol underlying security to implement an uncomplicated yet robust consensus, which guarantees reliability, fault tolerance, and regular price feed updates.\n\nFor on-chain Stellar assets price feed data retrieval, Reflector relies on a quorum of nodes connected to Stellar validators. Each node fetches trades information directly from the Stellar Core database. Price feeds for generic tokens get updated in a similar fashion, but nodes have to agree on information pulled from external sources (CEX/DEX API, price aggregators, stock exchanges, derivative platforms, etc.)\n\nOther contracts interact with the oracle contract, retrieving data stored by Reflector nodes. Consumers can fetch historical ranges, use cross-price calculation, utilize TWAP averaging, or simply pull the most recent token price depending on the use-case.\n\nComponents:\n\nReflector node: Fetches prices, maintains p2p communication with other nodes, and publishes price updates signed by the quorum.\n\nOracle smart contract: Contract implementation that incorporates consumer-facing interface with admin functionality.\n\nContract JavaScript bindings: Provides convenient JS wrappers for interaction with the contract from JS runtime.\n\nStellar Core DB connector: Database connector library responsible for retrieving and parsing data from Stellar Core.\n\nAdmin dashboard: Web interface for Reflector node operators, toolkit for managing Reflector cluster and orchestrating updates.\n\nCluster orchestrator: Broker service for synchronizing cluster configuration voting and updates.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/receZeLlUlVSruadg",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/in_reflector"
            },
            {
              "platform": "Discord",
              "url": "https://discord.gg/v2ggfDty2d"
            }
          ],
          "fundsApproved": [
            {
              "amount": "100000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "100000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-109",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Horizon & Soroban API - InfStones",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Provide Horizon and Soroban API developer access via an auto-scaling cluster with a freemium endpoint and support structure. InfStones will provide Horizon and Soroban API a range of premium features API controls to cater to the diverse needs of developers, institutions, and various types of users:\n\na) Free API: A complimentary shared API endpoint that meets the basic needs of individual developers.\n\nb) Paid API: For users with higher demands on performance and monthly usage, we offer a range of paid plans for shared API endpoints, with auto-scaling enabled.\n\nc) Dedicated API: For users with the highest demands on performance, monthly usage, or privacy, we provide independent paid nodes to meet the needs for dedicated APIs. Users can freely choose from multiple region options including US East, US West, Asia East, Asia South, Europe West, and Europe Central. Additionally, we support various resource configurations to meet users' diverse performance requirements.\n\nAdditionally, we offer the following API value-added features:\n\na) API usage analysis\n\nb) API Logs\n\nc) API security settings (including API key protection, IP address whitelisting, and more)\n\nd) Block watch solution: an API usage monitoring and alert services, allowing users to set alert thresholds and choose from various notification methods such as email, SMS, and phone calls.\n\nUptime SLA: 99.9%.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec14mcRMcEixJXEg",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/infstones"
            },
            {
              "platform": "Discord",
              "url": "https://discord.com/invite/5Sgu93crrA"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/infstones/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "100000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "100000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-110",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Stellar Attestation Service - Stellar Attestation Service",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Soroban framework for attesting to digital interactions on the Stellar network. Problem:\nIn many industries, the verification of credentials and compliance with regulatory requirements is complex, time-consuming, and prone to fraud. Traditional methods for issuing and verifying digital attestations often rely on centralized systems, which are vulnerable to security breaches, tampering, and inefficiencies. These challenges are especially pronounced in sectors such as financial services, supply chain management, education, healthcare, real estate, and employment verification.\n\nSolution:\nWe are building a decentralized attestation service for the Stellar blockchain, leveraging Soroban smart contracts. This service will allow projects within the Stellar ecosystem to issue, verify, and manage digital credentials for their users. Our platform will enable the creation, storage, and verification of various types of attestations, such as identity verification, educational certifications, professional qualifications, and more. This service will issue tokenized assets representing attestations, store metadata on decentralized storage solutions like IPFS, and provide APIs for seamless integration with various projects. By integrating with our platform, projects within the Stellar ecosystem can enhance their operations, increase trust among users, and ensure compliance with regulatory requirements. This service will not only address critical pain points but will also foster innovation and collaboration within the Stellar community.\n\nKey features of our attestation service include:\n\nUnified Trust Framework (UTF): Our Soroban smart contracts standardize trust assessments across various applications, with default resolver contracts and the ability to use your own resolver contracts for custom attestation logic.\n\nAttestation Schema Registry: Allows registration of custom attestation schemas that define the structure and rules for attestations.\n\nPrivacy-preserving verification mechanisms: Verifications are conducted without compromising privacy.\n\nIntegration with existing Stellar wallets: Seamlessly works with current Stellar wallet solutions.\n\nRevocation and expiration management: Supports managing the validity and lifecycle of attestations.\n\nSecure on-chain storage of attestations: All Attestations are safely stored on the blockchain.\n\nInteroperability with Stellar-based services & SEPs: Ensures compatibility with other Stellar services.\n\nDeveloper SDKs and integrations: SDKs and CLI tools for Rust and Node.js allow developers to easily integrate attestation functionalities into their applications.\n\nTarget Audience:\nSAS caters to:\n\nDevelopers building applications on Stellar\n\nFinancial institutions using Stellar for remittances or asset issuance\n\nDecentralized finance (DeFi) projects requiring KYC/AML compliance\n\nCredit Worthiness, Lending and Scoring (DeFi)\n\nEducational institutions issuing digital certificates\n\nMarketplaces that rely on reputation and reviews\n\nGovernment agencies for identity verification\n\nStellar Integration:\n\nSoroban Smart Contracts:\nImplement core attestation logic (issuance, revocation, verification)\nStore credential schemas and registry of issuers\nHandle selective disclosure and zero-knowledge proofs\n\nStellar Operations:\nUse custom operations for credential-related transactions\nLeverage multi-signature accounts for enhanced security\n\nSEP Integrations:\nSEP-0010 for authentication of issuers and verifiers\nSEP-0012 for KYC information collection\nSEP-0030 for account recovery using attestations\n\nEcosystem Partnerships:\nCollaborate with Stellar anchors for fiat on/off ramps\nIntegrate with existing Stellar wallets for credential storage\nPartner with KYC/AML providers in the Stellar ecosystem\n\nWe chose Stellar for our attestation service due to its:\n\nFast and low-cost transactions, ideal for frequent credential operations\n\nBuilt-in compliance features align with regulatory requirements\n\nStrong focus on financial inclusion aligns with many use cases for digital credentials\n\nSoroban's WebAssembly-based smart contracts offer flexibility and performance\n\nActive developer community and support from Stellar Development Foundation",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recF8AbyncoxdFYvk",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "37500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "37500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-111",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "0xAuth - 0xAuth",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "0xAuth will enable seamless compliance andinteroperability for tokenised funds. The Problem\nTraditional finance is moving on-chain, as evidenced by Franklin Templeton, KKR, and BlackRock launching tokenised funds. However, onboarding and verification processes are still manual and repetitive, leading to a high abandonment rate (40% if over ten minutes [1]) and significant potential revenue loss ($3.3 trillion in 2019 [2]). There is a critical need for a seamless, compliant Web3 onboarding process with portable credentials.\n\nWhat Problems Are Tokenised Fund Institutions Facing?\nTo stay competitive, institutions must keep investor fees low, driving many to move on-chain. However, high compliance costs due to repetitive, siloed processes create inefficiencies, reducing investor mobility, increasing Customer Acquisition Costs (CAC), and hindering operational efficiency. Additionally, tokenised funds operate in a gated manner, limiting potential investors. A cross-chain approach could significantly expand the investor base.\n\nWhat Are We Proposing?\n\n0xAuth aims to provide a frictionless onboarding and verification process with portable investor credentials, boasting minimal compliance costs. Key features include:\n\nAutomated Verification: 0xAuth uses trusted off-chain oracles for automated verification of accredited investors, including KYC, KYB, AML compliance, and PEP screening via Plaid and Vezgo.\n\nPortable Credentials: A digital identity contract (ERC-734) is deployed on-chain, and users are issued verifiable credentials both off-chain (W3C VC standard) and on-chain (ERC-735 standard).\n\nConditional Wallet Connectivity: Platforms can verify user eligibility by integrating with 0xAuth and checking their verifiable credentials to conditionally allow or block access.\n\nZero-Knowledge Proofs (ZKPs): Platforms can use JSON-LD-based ZKPs for selective disclosure of user information, allowing verification without revealing entire identities.\n\nFuture Plans: Implement on-chain verification of off-chain credentials using ZKP verifier contracts (which support criteria selection via ZK predicates) on the Stellar network.\n\nHow Does Stellar Fit into the Picture?\n\nWe envision 0xAuth as the single sign-on (SSO) for a seamless, yet fully compliant, Web3 ecosystem. Our solution eliminates the need for siloed and gated environments typical in tokenised funds. With an eye toward a multi-chain future, 0xAuth is designed to facilitate the effortless movement of eligible investors across different blockchain networks while enabling institutions to attract and engage users from these diverse ecosystems.\n\nIncorporating support for Stellar-based tokenised funds into 0xAuth is a strategic move. By doing so, we aim to significantly expand the pool of potential investors for institutions like Franklin Templeton and WisdomTree, which are already utilising Stellar. Our included illustrations depict the envisioned integration and the benefits it brings.\n\nHow Can Stellar Benefit From Our Solution?\n\nEnhanced Interoperability: 0xAuth enables seamless identity verification across blockchains, positioning Stellar as a bridge within the multi-chain ecosystem.\n\nCompliance as a Service: 0xAuth’s tools simplify compliance for tokenised funds, making Stellar a compliance hub for cross-chain RWA transactions.\n\nMarket Expansion: Reducing compliance friction in cross-chain transactions attracts more institutional participants and eligible investors, boosting Stellar's ecosystem activity and liquidity.\n\nExclusive Features: We plan to develop custom features for Stellar on 0xAuth, including institutional dashboards, audit trails, and enhanced security protocols tailored for institutional users.\n\nBy enabling these capabilities, 0xAuth will help solidify Stellar's role as a leading network for tokenised assets, broadening its user base and enhancing its operational ecosystem.\n\nGlossary\n[1] https://thepaypers.com/payments-general/fis-have-14-minutes-and-20-seconds-to-onboard-customers-signicat-finds--780846\n[2] https://resources.fenergo.com/newsroom/global-business-commercial-banking-market-sees-3-3-trillion-in-losses-due-to-operational-inefficiencies",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recsAQHCghw9HIUvF",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "90000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "90000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-112",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Silicore - Silicore",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Democratizing knowledge of distinct Anchor benefits The project aims to develop a new software application to streamline the company's internal communication processes. The application will include features such as instant messaging, file sharing, and video conferencing. The goal is to improve efficiency and collaboration among team members. The project will be divided into three phases: planning, development, and testing. The planning phase will involve gathering requirements and creating a project plan. The development phase will focus on coding and implementing the features. The testing phase will involve thorough testing to ensure the application is bug-free and meets all requirements. The project is expected to be completed within six months.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recyN1rWGOVPFszvZ",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "31000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "31000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-113",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "LOAM - Grow Ambitious Dapps - LOAM",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Focus on the important parts of your Stellar Dapp. Let Loam handle the tedious bits. Please provide the content you would like me to streamline.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rect6tCyLANzPdveo",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "3000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "3000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-114",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Soroban AIssistant - SoroBuilder",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "A Soroban AI powered Assistant specifically designed to accelerate the conceptualization and development of smart contracts. Soroban is currently experiencing a significant influx of developers eager to build within the Stellar ecosystem. As a result, many of these developers in the coming months and years will likely be new to Soroban and Rust. To support Soroban developers in conceptualizing and writing smart contracts, we are developing an AI-powered smart contract generation assistant. This assistant will possess agentic capabilities, enabling it to gather the necessary information and deliver a smart contract project ready for review, testing, and iteration on the Testnet.\n\nWe have already developed a proof-of-concept Soroban-specific system which successfully outputs complete robust Soroban smart contracts with little errors. You can find a video of how it works in the Drive. The code generated by the assistant should be viewed not as a final product but as a robust foundation for the project.\n\nThis tool will significantly accelerate the development process. The idea is to add another catalyst in the development workflow that further “Sorobinices” the Stellar “Abacus,” code-included as much as batteries included. In a rapidly growing system still in its infancy, we aim to provide a multiplier that effectively drives feedback and fosters growth.\n\nThe Soroban AIssistant is a web-app that runs in the background on an AI agentic system specifically designed and tailored to the creation of Soroban Smart Contracts. It will allow Soroban developers to describe in depth the problem they are trying to solve in a conversational way and the assistant will ask all necessary questions to collect the information it needs to proceed.\n\nBy compiling and vectorizing all available information on Soroban (including Stellar’s documentation, APIs, Github code libraries…) as well as the Smart contracts that have been deployed on Github, the whole model is solely focused on being a tool Soroban developers can use to accelerate the conceptualization and creation of smart contracts.\n\nThe agentic flow consists of 3 main stages. We will provide a high-level overview of the whole process here, but you can find the full detail and deep dive in the technical architecture, where you will be able to find all details on the different agents and how the system interacts given that it is a deep-tech project.\n\nUnderstanding Phase and Initial proposal creation: The first part of the flow is aimed at fully understanding what the user is trying to solve or build, gathering comprehensive user inputs and converting them into a coherent problem statement. Then, considering all available options to tackle it and merge all user inputs together with the vectorized database of Soroban, Stellar, and Rust knowledge to conceptualize a potential solution.\n\nRefinement phase: Propose and refine an initial design using specialized AI modules. This phase focuses on integrating expert inputs and iterative improvements to ensure the design is robust and ready for development.\n\nBuilding the Smart Contract: Construct, review, and document the smart contract based on the refined design. Output zip folder with project files and folders for testing.\n\nThe user will receive a zip file with all project files and a .md document with comments and explanations, fully documenting every step of the process, decisions made, and so they can navigate the code much easier.\n\nDeployment and Testing: After this, the developer can directly upload and test the smart contracts on the testnet and by utilizing a tool such as the Okashi.dev playground, they can start building on top of that foundation. It is key to highlight that as the Soroban ecosystem develops, more data will be available, and together with the exponential improvements LLMs are experiencing, the Soroban AIssistant will also keep improving exponentially. This will widely help the ecosystem grow and increase the accessibility to developing on Soroban.\n\nWe have many ideas of improvement for the coming months such as outputting also the server-side Python and Javascript files, chatting with the docs, and possibly giving access to more specific agents that fulfill a single role very well. For example, a Security auditor or an oracle creator.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reccr8QR0TDBxQWI8",
          "status": "funded",
          "socials": [
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/missio-ia"
            }
          ],
          "fundsApproved": [
            {
              "amount": "42500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "42500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-115",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Soroban Command Insights (SCI) - Stellar Command Insights (SCI)",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "A real-time monitoring and visualization system for Soroban CLI commands on the Stellar network, powered by the ELK stack. Product Description: I am developing an advanced real-time monitoring and visualization system specifically designed for Soroban CLI commands on the Stellar network. Powered by the ELK (Elasticsearch, Logstash, Kibana) stack, this system efficiently captures, processes, and visually presents data generated by Soroban commands, offering developers and users invaluable insights and analytics.\n\nKey Features of SCI:\n1- Real-time Command Monitoring: Provides instant visibility into Soroban CLI command execution, tracking performance, resource usage, and outcomes.\n2- Error Detection and Analysis: Automatically identifies errors or anomalies in command execution, offering detailed logs for rapid troubleshooting.\n3- Historical Data Analysis: Stores and indexes historical command data, enabling trend analysis and optimization of Soroban-based applications over time.\n4- Alert System: Allows setting custom alerts based on specific thresholds or conditions, ensuring prompt notification of critical issues.\n5- Performance Optimization: Customizable dashboard displays key performance indicators such as command execution time and resource consumption.\n\nProblems Solved: SCI resolves critical challenges in Soroban CLI usage:\n1- Lack of Built-in Logging: Provides detailed logging of all CLI commands, inputs, and outputs.\n2- Limited Command Visibility: Enhances visibility into complex command executions through real-time monitoring.\n3- Difficulty in Troubleshooting: Detailed error detection and analysis feature reduces debugging time for failed commands.\n4- No Historical Command Data: Enables tracking of past Soroban CLI usage patterns for workflow optimization.\n5- Absence of Proactive Monitoring: Custom alert system monitors specific command behaviors or errors proactively.\n6- Inefficient Performance Analysis: Centralized performance metrics aid in optimizing Soroban CLI usage.\n\nTarget Audience:\nSoroban Smart Contract Developers: Gain insights into CLI command execution for efficient debugging and optimization of smart contracts. Analyze historical command data to improve development workflows and contract performance.\nBusinesses: Track and analyze operations in real-time, empowering informed decision-making based on accurate data insights.\nSystem Administrators: Monitor network performance and ensure seamless operation of services utilizing Soroban CLI commands, enhancing overall system reliability.\nBlockchain Analysts: Access detailed logs and visualizations of Soroban CLI commands to conduct in-depth analysis of blockchain activities. Analysts can identify trends, generate reports, and provide actionable insights to stakeholders.\nEducational Institutions: Utilize the monitoring system as a teaching tool to demonstrate real-world applications of blockchain technology and smart contract execution. It can be used in courses related to blockchain development, network security, and data analytics.\nFinancial Institutions: Monitor and analyze transaction data to ensure secure and efficient financial operations. The system provides real-time insights into transaction status, failure rates, and performance metrics, which are crucial for maintaining trust and reliability in financial services.\nRegulators and Compliance Officers: Track and audit transactions on the Stellar network to ensure compliance with regulatory requirements. The detailed logging and visualization capabilities help in maintaining transparency and accountability.\n\nIntegration with Stellar: My system seamlessly integrates with Stellar's robust infrastructure, enhancing the functionality and reliability of Soroban CLI command monitoring through key integrations:\nStellar Operations: Captures and analyzes data from various Stellar operations, providing comprehensive insights into network activities and transaction flows. This includes monitoring payment transactions, account creation, asset management, and more, ensuring that all critical operations are tracked and analyzed in real-time.\nSEP Integrations: Integrates with relevant Stellar Ecosystem Proposals (SEPs), ensuring compatibility and connectivity with other Stellar-based services and tools, thereby fostering a cohesive ecosystem.\nMachine Learning for Anomaly Detection: Integrates Elasticsearch's machine learning capabilities to detect anomalies in command execution. This helps identify unusual patterns or potential issues in the command usage, allowing for proactive management and optimization of the Soroban CLI environment.\nData Security and Privacy: Ensures that all captured command data is securely stored and processed. The system adheres to best practices for data security and privacy, ensuring that sensitive information is protected while providing comprehensive monitoring and analysis.\n\nWhy Stellar: I chose Stellar for its efficient, secure, and scalable blockchain infrastructure, ideal for high-performance monitoring and cross-border transactions.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recR4ULg6RudZEquX",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "35000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "35000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-116",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Soroban full-featured indexer - Decentrio",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "We Decentrio introduce a full-featured and high-performance Soroban indexer that support friendly JSON data. Our product is a continuation of our previous product Sorobook (version 1). Sorobook is an indexer with an integrated API server that collects Soroban transaction data and event data to provide feature-rich queries to Dapps in a clean, user-friendly format, along with sufficient documentation. Given what we have to offer, many Dapps could utilize our product to greatly enhance their UI/UX in terms of performance and utility. With that being said, there is still plenty of room to improve, most notably to support contract state and contract calls data. Though it's what is needed by most Dapps, existing API solutions don't have it as it is complicated to implement (requires complex data processing and efficient data management). That's why we want to introduce the next version of Sorobook so that we can include these needed functionalities.\n\nSorobook ver2.0 would support these types of data. We opt to provide friendly JSON data so that Dapps UI can easily work with our APIs. For that purpose, we've developed a JSON-XDR two-way converter in Golang. Once the development work is done, we'll host public APIs available for everyone to use. In the future, as our user base grows, we plan to provide a more robust hosting infrastructure, along with a tiered subscription service based on usage and load.\n\nOur product integrates seamlessly with Stellar. All we have to do is run a Stellar core instance, which is where we fetch our data using the Go ingest library. The collected data is then processed and pushed into a PostgreSQL database, which is in turn used by our API server.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec9Hr5X3cViYi8Te",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/decentriolabs"
            }
          ],
          "fundsApproved": [
            {
              "amount": "100000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "100000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-117",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Solarkraft - Solarkraft",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Runtime monitoring for Soroban smart contracts to aid developers and auditors in finding critical bugs before and in production The product. Solarkraft is a runtime monitoring tool of Soroban smart contracts. It tests whether on-chain invocations of the smart contract conform to a developer-written monitor specification, and flags deviations. Runtime monitoring applies to all phases of the engineering lifecycle and aids developers, auditors, and users. Importantly, Solarkraft monitors are small snippets of code, not a monolithic specification. This makes them more accessible formal artifacts than usual. We provide additional details in the Technical Architecture document.\n\nThe problem. Smart contracts are backing billions of dollars in cryptocurrencies. At the same time, smart contracts are notoriously difficult to get right. One reason for that is that the code of the smart contracts is immutable, that is, they cannot be quickly patched once deployed on mainnet. Another reason is that smart contracts are often written using an agile framework, where the requirements are figured out on-the-go, often by writing unit tests and integration tests. As a result, the expected behavior is poorly documented, if at all. The most common engineering practices (manual specification and code review, testing, security audits) are problematic in that they involve a lot of (incomplete) guessing, thus allowing critical bugs to sneak into production. Formal methods promise to deliver hard guarantees about the correctness of software. Even though we observe that formal methods enjoy stronger adoption in web3 than in web2, the use of formal methods is still quite limited in the blockchain space. In our experience, this is because formal specification is too far removed from an engineer's day-to-day practice.\n\nOur solution. Solarkraft takes a middle ground between practical engineering methods and Formal Methods. Our goal is to connect and harden smart contract development and auditing via runtime monitoring backed by formal methods. We take into account our learnings from Atomkraft, the model-based testing tool that we developed for the Cosmos ecosystem in 2022, but propose the following novel and unique features:\n\nWe propose to write multiple modular monitor specifications for individual features, as opposed to a monolithic specification of the entire contract behavior. These are easier to write, read, and verify. Moreover, there is a good chance of reuse.\n\nWe map contract values to specification values, which is known as “abstraction”. This will be easier and more natural to do than mapping specification values to contract values, which is known as “concretization”.\n\nSolarkraft integrates well into the development process. This brings immediate value to engineers. They can both test their contracts and observe monitor alerts in the development stage, and keep running the same monitors after contract deployment.\n\nSolarkraft will be of value to contract auditors too. Auditors often have limited time frames for discovering security bugs (in contrast to malicious actors!). Drawing from our experience in auditing projects in the Ethereum and Cosmos ecosystems, it is quite challenging to write a complete specification that faithfully represents a collection of contracts (though we managed to do that in a few cases). With the approach outlined in this proposal, abnormal contract behavior can be discovered much faster, by writing simpler abstract monitor specifications.\n\nIntegration with Stellar. When it comes to developing sustainable tooling, we believe in value-driven development:\n\nTo this end, our proposal for this Community Award is to engage with the Soroban community to collaborate on a real-life case study and support it in Solarkraft (e.g., with Blend, Phoenix, Soroswap, Xyclones, etc). Since Solarkraft is open source, we expect the learnings to benefit the entire Soroban developer community.\n\nWe will also address test generation for Soroban smart contracts, similar to a fuzzer. This generator will use the monitor specifications as guidance to generate both successful and failing test cases, similar to how we did it with Atomkraft. In contrast to Atomkraft, where we generated inputs for long executions of large specifications, Solarkraft will take a different approach: we generate inputs for a single step of the synchronous product of simple monitor specifications. This approach should scale much better than the standard bounded model checking of large specifications.\n\nImmediate value is also generated by performing security audits. Our team could use Solarkraft in the future to audit Soroban contracts. Since Solarkraft is open source, we expect other auditing teams to get value out of it as well.\n\nWhy Stellar? Stellar is appealing because of the technical maturity of its ecosystem. We appreciate the thoughtfulness with which Stellar has been designed and implemented.\n\nReferences\nAtomkraft Model-based Testing Tool: https://github.com/informalsystems/atomkraft",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recTmGxt9atX6ovnz",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "67000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "67000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-118",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "AutoAction - AutoAction",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "AutoAction is a smart contract automation tool for implementing custom logic, time-based, and event-based automated transactions Sure, please provide the content from cell A that you would like me to streamline.",
          "contentURI": "",
          "status": "approved",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "50000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "50000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-119",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Digicus - from MVP to 1.0 - Digicus",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Digicus,Scratch for smart contracts, simplifies contract creation &amp; modification via an intuitive, Lego-like graphical interface. The Problem\n\nWhile smart contract development on Stellar has taken many leaps forward since I wrote about it six years ago, the barriers to entry are still numerous... it's an intimidating field only the most technically savvy (or at least the most curious learners) can break into. Put simply, developing smart contracts is hard.\n\nSpecifically:\n\nWhile Rust (the most well supported Soroban SDK) is one of the most admired languages, it is far from one of the most popular.\n\nMore mature and seasoned smart contract platforms are complicated and error prone.\n\nThus, how can we help existing developers succeed? Even more importantly, how can we lower the barrier to entry for community newcomers? And as a stretch, how easy can we make it for non-technical folks to participate and even create their own smart contracts?\n\nToday, various tools exist to solve this problem. Grouped generally, there are a few approaches:\n\nAllow folks to use the programming language they are most familiar with (Hyperledger Fabric)\n\nGive folks the best damn developer experience possible (Stellar with: all SDF Soroban tooling, SCF participants like Okashi, etc.)\n\nProvide a set of re-usable, well vetted, well tested, and well understood boiler-plate, templated smart contracts (tons of this in the Ethereum ecosystem, a few SCF projects, etc.)\n\nWe propose a fourth approach: making the smart contract language itself more approachable.\n\nThe Solution\n\nWith the above problem in mind, consider the following:\n\n65% of the general population are visual learners.\n\nScratch is an incredible first language, in fact it’s also more popular than Rust.\n\nDigicus is a block-based Soroban native, smart contract programming language complete with an easy to use, low-code IDE. It attempts to leverage the existing programming on-boarding paradigms to give folks an opportunity to get their hands dirty while also requiring only the minimal amount of technical expertise to get started; we want Stellar developers to be writing contracts without requiring them to understand Rust, investigate WASM binaries, etc. Many schools (from elementary to college) use Scratch in their coding 101 class for exactly this reason!\n\nOnce folks become familiar with smart contracts via Digicus, there are two paths forward:\n\nTransition to using the SDF supported Rust SDK (Digicus can target the Rust SDK so this transition can initially be a hybrid). This is akin to CS-201 where folks begin to use languages like Python and Java to learn data structures and algorithms.\n\nAdopt Digicus as the IDE and programming language of choice for Soroban smart contract development. In this case, we will work to adopt and integrate into the IDE other community initiatives, projects, and efforts such as vulnerability analysis frameworks, auto-complete tooling, etc.\n\nExisting, similar solutions in the blockchain space include:\n\nSmartBuilder (very similar to what we're proposing here, built for Hyperledger)\n\nToolblox (Ethereum)\n\nBlocks Editor (unsure what chain)\n\nThe Audience\n\nThere are a few audiences we target:\n\n[primary] net new members to the Soroban developer community\n\n[primary] existing, less technically savvy members of the Soroban developer community\n\n[secondary] existing, technically savvy members of the Stellar developer community who have only just started experimenting with Soroban\n\nWhile we might see Soroban power users adopt our tooling, we are not (at least initially) developing with this community in mind.\n\nOnboarding\n\nDigicus is a beginner friendly tool for developing smart contracts. Beginner here means many things:\n1. no tools need to be downloaded (folks will be able to do all development in browser)\n2. there is no specific programming language learning (or even that much programming knowledge) as a pre-requisite\n3. for more tech savvy folks, it offers a natural progression. Folks can begin investigating the generated code (i.e. the contract in Rust) and decide to begin writing contracts in a supported programming language of their choice\n\nThus, we will promote it as a beginner smart contract creation tool.\n\nWe will investigate a few avenues to do so:\n1. generate our own tutorial/\"how to\" content in various forms (video, blog post, etc.)\n2. work with SDF to incorporate it into the official tutorial documentation (at some point once it is feature complete)\n3. actually use it ourselves, proving it is functional for real use cases\n\nFor folks new to the ecosystem, we'd expect them to learn about Digicus via avenues (1) and (2). For existing folks in the ecosystem, they may also learn about Digicus via (1) and (2) but also potentially (3); maybe they are a Ruby developer at heart and have been frustrated by the Rust language/toolchain, waiting for a simpler way to develop smart contracts.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recoFbY3txQwrt3p2",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "100000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "100000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-120",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Calimero Network - Calimero Network",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Calimero Network is an innovative framework for building Self-Sovereign Application protocols and private data sharing. Calimero Network is a framework that enables building and running peer-to-peer self-sovereign applications (SSApps) focusing on data ownership. SSApps are decentralized applications built on top of Calimero's peer-2-peer infrastructure, where users have full ownership over their data.\n\nData is incredibly valuable, powering progress and innovation. Yet, it's often collected and used in ways that might surprise you, raising privacy concerns. At Calimero Network, we argue that users should be in full control of their data, ensuring privacy, security, and autonomy over their personal information and interactions within the network. Additionally, as digital interactions become increasingly important in both personal and professional contexts, there is a growing need for solutions that provide enhanced security, privacy, and data ownership.\n\nOur goal is for Calimero to become a Layer 0 for Private Data in the Stellar ecosystem. We recognize the strong linkage between blockchain technology and off-chain compute, and would love to see developers building use cases on Calimero’s infrastructure, such as Private DAOs, Private Finance, Private Social, Edge Computing on user devices (mobile, PC, and browsers) where private data is closer to the source (user), while all the immutable and trustless execution happens on Stellar.\n\nTo make our vision true, we have developed a framework that empowers developers with tools like the Protocol SDK for defining application-specific communication rules and the Client SDK for seamless interaction with the network, alongside a specialized compute market for executing demanding tasks. The network's architecture supports peer-to-peer encrypted data streams, ensuring verifiability, data privacy, and security. Calimero Network stands out by offering localized consensus, which contrasts with traditional global consensus models, allowing for scalable and efficient application performance without sacrificing user privacy. Intended for developers seeking to create privacy-preserving applications and users desiring control over their data, Calimero Network promises a decentralized computing environment where privacy is paramount, and data remains under the user's control hosted on their local device.\n\nLater in this proposal, we dive deeper into the specific technical integration with Stellar in the question regarding the technical architecture. Additionally, we will break down the roadmap into 3 major milestones. While this proposal’s scope captures integration with Stellar, followed by a joint hackathon, afterwards we plan to integrate with projects building on Stellar to further promulgate the privacy-preserving narrative within the Stellar ecosystem.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recoBk1kfi1SixVph",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/CalimeroNetwork"
            },
            {
              "platform": "Discord",
              "url": "https://discord.gg/kjP4GrafXj"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/calimero-network/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "25000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "25000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-121",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "West African Ambassadors (WAA) - West African Ambassadors (WAA)",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "The WAA Program empowers builders to tackle regional issues through blockchain, focusing on education, collaboration, and adoption The West African Ambassador program is a dynamic incentive designed to address regional challenges through blockchain technology on the Stellar ecosystem. With 50+ members and hundreds of event attendees, the program aims to generate innovative solutions applicable across various industries in Africa. Since its inception, it has already successfully supported the development of GearUP, its first funded project, with the ambition of catalyzing a new project each month. This initiative not only promotes local blockchain developers but also organizes numerous events to boost adoption of the homegrown applications. Next month we have 8 events planned in the region as well as 12 virtual coding classes on Discord, and weekly Ambassador meetings open to the public to attend.\n\nThe West Africa Ambassadors Program addresses several key issues in the region through the application of blockchain technology: Economic Development and Entrepreneurship: By encouraging the creation of blockchain-based businesses, the program supports economic growth and provides new opportunities for local entrepreneurs. This is achieved by nurturing skills in blockchain technology and smart contract deployment, empowering participants to turn innovative ideas into viable businesses. Education and Skill Development: The program targets individuals with little to no coding experience, offering educational classes that teach them how to code and deploy smart contracts. This education not only builds valuable technical skills but also enhances problem-solving capabilities, preparing participants for advanced opportunities in the tech sector. Community Building and Collaboration: By organizing events and fostering collaboration among members, the program strengthens the local blockchain community. This enables knowledge sharing and joint problem-solving, creating a supportive ecosystem where members can learn from each other and collaborate on projects. Technology Adoption and Innovation: The program promotes the adoption of blockchain technology by demonstrating its practical applications, particularly how it can solve local problems. By featuring local applications built on Stellar, it showcases successful implementations and encourages further innovation in the region. The primary audience includes aspiring developers, entrepreneurs, and tech enthusiasts in West Africa who are interested in blockchain technology and its applications for local development. Through its multifaceted approach, the program aims to transform these individuals into skilled professionals and innovators in the blockchain space.\n\nEvents in the West Africa Ambassadors Program play a crucial role in promoting projects built on Stellar, particularly those utilizing Soroban smart contracts. These gatherings serve as dynamic platforms where developers can showcase their applications through detailed presentations and engaging live demonstrations. By highlighting successful projects, these events encourage broader adoption of Stellar’s technologies and demonstrate practical uses in solving local issues. Each event is carefully structured to maximize exposure for developers, allowing them to present their blockchain solutions to an audience that includes potential investors, industry leaders, and future users. This exposure is instrumental in securing feedback, fostering partnerships, and attracting necessary funding. Additionally, these events offer valuable case studies and success stories that illustrate the tangible benefits and impact of using Stellar and Soroban in real-world applications. Moreover, the community-centric atmosphere of these events encourages networking and collaboration among participants. This environment fosters a supportive ecosystem where developers can connect, share insights, and collaborate on future projects. Such interactions not only enhance individual projects but also strengthen the overall capacity of the local blockchain community to innovate and address regional challenges effectively.\n\nThe coding classes within the program are integral to preparing ambassadors for these events. By focusing on the technical workings of the Stellar SDK and the Rust programming language, essential for crafting smart contracts on Soroban, ambassadors gain a deep understanding of Stellar's infrastructure. This knowledge equips them to host discussions and presentations about Stellar's technical interworkings at events, enhancing their ability to educate and engage audiences effectively. Participants start with a fundamental understanding of blockchain technology and progressively tackle more complex topics, including smart contract deployment and optimization on the Stellar network. This structured educational approach ensures that by the end of the program, attendees are not only well-versed in theoretical concepts but also competent in applying them to develop practical, scalable solutions.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec76AToqXxNpKzvV",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "47500.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "47500.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-122",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Stellar Women Bootcamp - Stellar Women Bootcamp",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "A 4-week, gamified educational program designed to onboard Latin women into the DeFi basics, with a focus on Stellar ecosystem. Who are we? We are Women Biz, a latin community created by women to empower women through web3. We organize events and educational programs to promote Blockchain adoption through web2 to web3 onboarding. With a diverse community with over 1800 members across 16 countries, we have created an environment that promotes education, collaboration, and empowerment within the blockchain industry. These engagements have served as crucibles of learning and interaction, facilitating knowledge exchange and fostering a supportive ecosystem for women navigating the complexities of Web3. Our experience includes organizing over 50 IRL events and hosting over 30 online workshops, providing valuable opportunities for learning and networking. Notable highlights include our successful “Women in Web3” bootcamp, which attracted 190 women participants and received over 400 quest submissions as well as our “Latina Blockchain Hackathon” that produced 21 innovative projects.\n\nWhat problem do we identify? Today's financial systems are often inaccessible, inefficient, and costly, particularly for individuals and businesses in underserved and developing regions. Traditional financial services can be exclusive, slow, and burdened with high fees. Additionally, according to Boston Consulting Group (BCG) and POCLab gender diversity research results published in 2023, women make up only about 27% of the Web3 workforce, often in non-technical roles. Only 13% of Web3 founding teams include a woman, and only 3% have teams that are exclusively made up of women. This significant gender gap further limits the potential for innovation and inclusion in the blockchain space.\n\nOur solution Recognizing the potential of Stellar to transform financial systems, we propose a DeFi-focused bootcamp to educate and empower individuals to leverage Stellar for decentralized finance applications. The Stellar Women Bootcamp is a 4-week, gamified educational program designed to equip Latin women with the knowledge and skills necessary to develop and utilize decentralized finance solutions on the Stellar network. The bootcamp offers 80 scholarships, and includes live classes, mentoring, and weekly challenges. Participants will learn DeFi fundamentals, interact with Stellar projects and earn rewards through active engagement. The program aims to bridge the gap between Web2 and Web3 financial knowledge.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reccvCDAiuwbDwy4n",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "14400.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "14400.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-123",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Soroban Samba - Educational - NearX - Dev Educational Program",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Soroban Samba is a two month-long event in Brazil dedicated to onboarding developers and teams to build on Soroban. Brazil has proven to be a hub of talent, hosting outstanding Stellar projects such as Soroswap, Cheesecake Lab, Emigro, Oinc, Nearx, and many others, with more emerging each batch. Soroban Samba is the perfect opportunity to unite all Brazilian projects, establish a robust and supportive community, and further boost project development. This month-long event will onboard over 1000 developers and feature a unique design identity and communication strategy. It will be widely promoted through social media, technology journals, developer communities, and universities in Brazil. This event will not only stimulate innovation within the chain but also encourage newcomers to explore and utilize existing DApps on the Soroban chain.\n\nEvent highlights include: Online Learn-to-Earn activities, Online coding Classes, and Support for developers.\n\nOnline Learn-to-Earn Activities: The main focus of Soroban Samba, developers will face weekly challenges to win prizes. These challenges will be revealed each Monday, and participants will have a few days to complete them. The challenges will be individual and graded by difficulty levels (junior, mid-level, senior). Each weekly batch will have rewards distributed to everyone who completes the challenges according to the level of difficulty. These challenges will prepare participants to build various integrations and products within Soroban, including financial solutions, DeFi integrations, on-ramps and off-ramps, and more. This experience will bring significant traction to the Soroban Community in Brazil. Also we believe there are many excellent projects within Soroban, though most currently have low traction. To address this, we will include strategies to engage future Soroban developers and our audience with Soroban apps and DApps through gamified experiences with prizes. The idea is to reward every participant.\n\nFocus Areas: Financial Solutions: Developing applications for payments, remittances, or decentralized finance (DeFi) solutions. DeFi Integrations: Creating DeFi solutions such as lending platforms, decentralized exchanges, or yield farming tools. On-Ramps and Off-Ramps: Building tools to facilitate the conversion of fiat to crypto and vice versa. Social Impact Projects: Creating applications that address social issues like transparency in charity, voting systems, or identity verification.\n\nBenefits of Online Learn-to-Earn Activities for Stellar: Increased Developer Engagement, Accelerated Ecosystem Growth, Community Building, Enhanced Visibility and Adoption, Quality Assurance, Innovation and Problem-Solving. By implementing Online Learn-to-Earn activities, Stellar can significantly enhance its ecosystem, attract and retain talented developers, and ensure sustained growth and innovation.\n\nOnline Coding Classes: During Soroban Samba, each week will feature its own coding challenges. To prepare developers for these activities, coding classes will dive deep into Soroban code and explain various ways to complete each challenge. These classes are crucial for understanding the structure of Soroban coding. Additionally, during Soroban week, all Brazilian Stellar projects will be invited to showcase their solutions and share their personal experiences building on Soroban. In total, we expect to offer more than 10 hours of content, crafted in Portuguese and focused on builders. We aim for participants not only to build but also to interact with applications in the ecosystem, using wallets, exchanges, on-ramps, off-ramps, and more.\n\nSupport for Developers: Support is crucial as hundreds of developers will participate in Soroban Samba. A technical team with substantial knowledge about Soroban will be available within our community to assist developers with specific needs, including screen sharing and personalized guidance. This dedicated support will ensure that all participants can effectively navigate challenges and maximize their development potential.\n\nIn Summary: We expect 1,000 developers to participate in Soroban Samba, resulting in the deployment of over 2,000 contracts. Senior participants will be incentivized and supported to build their own products on Soroban. This comprehensive support and encouragement will help foster innovation and growth within the Soroban ecosystem. Our team is committed to achieving transformative results. That's why we focus on exceeding expectations in every proposal we deliver. We strive to go above and beyond to ensure outstanding outcomes for Soroban Samba.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recgSPiti9D1KPRG3",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/nearxschool"
            },
            {
              "platform": "Discord",
              "url": "https://discord.gg/nearx"
            }
          ],
          "fundsApproved": [
            {
              "amount": "65000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "65000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-124",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "The Starship Soroban - The Starship Soroban",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "A bilingual (Turkish and English) gamified platform to teach Soroban smart contracts through interactive modules and quizzes. Starship Soroban is a bilingual learning platform designed to teach Soroban smart contracts to Turkish and English-speaking audiences. The platform gamifies the learning process through interactive modules, each focusing on a specific smart contract concept. At the end of each module, quizzes assess the learners' understanding, making the educational experience engaging and effective.\n\nProblems it Solves:\nLanguage Barrier: Provides resources in Turkish and English, making Soroban smart contract education accessible to a wider audience.\nComplexity: Simplifies the learning process by breaking down complex concepts into manageable, gamified and interactive modules.\nEngagement: Uses gamification to make learning more engaging, reducing the intimidation factor and encouraging continued participation.\n\nHow it Works:\nInteractive Modules: Each module focuses on a specific aspect of Soroban smart contracts, using examples, explanations, and interactive elements.\nQuizzes: At the end of each module, quizzes test the learners' understanding, providing immediate feedback and reinforcement learning.\nRewards System: Learners earn virtual rewards and certificates upon successful completion of modules, motivating continuous engagement.\n\nScenario Gamification: You are a captain of the Starship Soroban, tasked with exploring different planets in the Soroban Galaxy. Each planet represents a module focusing on a specific smart contract concept. To progress through the galaxy, you must complete missions (learning modules) and solve challenges (quizzes) on each planet. Successfully completing a mission earns you star points and unlocks new planets to explore.\n\nPlanets and Modules:\nEventus Prime: Events Module\nMission: Learn to define event topics, structure event data, and publish events from a Soroban smart contract.\nChallenge: Implement a sample contract with working event publication and successful event subscription.\n\nStructura: Custom Types Module\nMission: Create and use custom data structures (structs and enums) in Soroban smart contracts.\nChallenge: Develop a sample contract utilizing custom types, verified through unit tests and code reviews.\n\nErratica: Errors Module\nMission: Define, handle, and propagate errors in Soroban smart contracts.\nChallenge: Implement error handling in a sample contract with successful error propagation and panic scenarios.\n\nLogos: Logging Module\nMission: Set up logging configurations in the Cargo.toml file and use the log! macro for debugging.\nChallenge: Generate and verify logs in a sample contract during execution.\n\nAuthon: Auth Module\nMission: Implement authentication and authorization using address identifiers and the require_auth method.\nChallenge: Create a sample contract with functional authentication and authorization mechanisms.\n\nConexus: Cross Contract Calls Module\nMission: Set up and perform cross-contract calls between Soroban contracts.\nChallenge: Execute cross-contract calls in a sample contract verified through unit tests.\n\nDeployon: Deployer Module\nMission: Upload Wasm binaries, handle authorization using the deployer() function, and initialize contracts.\nChallenge: Deploy and initialize a sample contract, verified through deployment logs and functionality tests.\n\nAllocatoris: Allocator Module\nMission: Use the allocator feature to manage dynamic memory in Soroban smart contracts.\nChallenge: Utilize the allocator in a sample contract, verified through unit tests and memory usage analysis.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec2ZXjpkY4lCdRpV",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "10000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "10000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-125",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Lantern Finance XLM Expansion - Lantern Finance XLM Expansion",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "To expand Lantern’s infrastructure to enable clients to borrow USD &amp; stablecoins against their XLM. Lantern will revolutionize how XLM holders leverage their assets, offering a seamless path to liquidity without selling. We will do this by expanding our existing product suite to include XLM as a collateral option for clients looking to borrow USD or stablecoins. Today, there are limited options available for XLM holders to easily use their tokens as collateral for a USD or stablecoin loan. Previous crypto lenders like BlockFi and Celsius have since gone bankrupt or are no longer operational. This implosion stemmed from a slew of risky institutional lending between these companies, which eventually took the retail lending space down with it. While there are DeFi options, these aren't ideal for many investors who are risk averse and not tech-savvy given the tax and compliance headaches, multiple layers of smart contract risk, and sub-par user experience.\n\nA collateralized loan from Lantern will allow XLM holders to get access to dollars without having to sell their assets. This way, investors can retain upside if they are bullish on the value of XLM long-term, as well as defer capital gains taxes. In return, Lantern will custody the clients' XLM collateral in our BitGo cold storage wallets (insured up to $250MM), which will be used to cover any potential loan losses should the price of XLM fall drastically. Our loans are over-collateralized (typically around a 25-40% loan-to-value at origination), which gives Lantern ample time to allow clients to address margin calls, as well as protect the Company from losses. USD loans enter margin call once they hit a 60% LTV and will have some of their collateral force-liquidated once the loan hits 70% LTV.\n\nUnlike previous crypto lenders like BlockFi and Celsius, Lantern will not be engaging in undercollateralized institutional lending with our clients’ crypto collateral. Previous platforms commingled client funds with other tokens on hand, which exposed their clients’ balances to outsized counterparty risk. Our product is designed to keep client collateral in a designated wallet for the life of the loan and will only be touched should the loan trigger liquidation or repayment of the loan.\n\nOur ideal customer profile (ICP) are urban professionals usually in finance, consulting, tech, between ages of 25-45. They tend to be higher net worth with ~25-50% of their portfolio in crypto holdings, including XLM. They are finance-savvy but risk averse and uncomfortable navigating DeFi applications.\n\nIf accepted into the Stellar Community Fund program, we will use the funds to build out the necessary infrastructure required to accept XLM as collateral for USD loans, including the auto-liquidation functionality which is critical to protect Lantern from defaulting borrowers. Any residual funds will be used to help fund the loans requested by our clients. As we continue to expand our product offering, we hope to become the most trusted and primary lending of choice for XLM users looking to borrow dollars against their holdings.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec1emvKo0DFpWx0c",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/LanternFi"
            },
            {
              "platform": "LinkedIn",
              "url": "https://www.linkedin.com/company/lantern-fi/"
            }
          ],
          "fundsApproved": [
            {
              "amount": "48483.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "48483.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-126",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "BondHive:OnChain Fixed Deposit - BondHive:OnChain Fixed Deposit",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Bond Hive simplifies on-chain savings, offering fixed returns by tokenizing carry trade, making complex futures easy for everyone What It Is: Bond Hive offers Crypto Yield Bonds that function like fixed deposits on-chain, leveraging arbitrage opportunities from futures perp and futures delivery on centralized exchanges. These bonds provide users with predictable returns from the futures market, simplifying complex trading into a straightforward savings product.\n\nProblems It Solves: Bond Hive addresses the complexity and inaccessibility of futures arbitrage in decentralized finance, making it simple for casual investors. It also enhances capital efficiency by issuing a stablecoin on top of the bonds, offering additional liquidity and usability.\n\nAudience: Targeted at users in Latin America and other regions, Bond Hive allows easy access to on-chain savings with fixed returns visible upfront, making it ideal for those seeking reliable and simple investment options.\n\nHow It Works: Bond Hive leverages the Stellar network to issue and manage Crypto Yield Bonds, capitalizing on Stellar’s fast and low-cost transactions for a scalable and efficient service. The platform integrates with major exchanges like Binance, OKX, Bybit, and Deribit to enter positions by arbitraging perpetual and delivery futures. This operation tokenizes funding fees from these futures, converting them into bonds that offer stable returns. Collateral is kept with on-chain custodians, namely Copper and Ceefo, to minimize counterparty risk and ensure all operations are blockchain-integrated.\n\nUse of Stellar and/or Soroban: Our platform capitalizes on Stellar’s high transaction throughput and integrates with Soroban for advanced smart contract capabilities. This setup manages the entire bond lifecycle—from issuance to maturity—ensuring seamless and secure operations.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recFFYDdyYhSVQ9np",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/bondhive"
            }
          ],
          "fundsApproved": [
            {
              "amount": "100000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "100000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-127",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Switchly.com - Bridge and DEX - Switchly.com - Bridge and DEX",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "A decentralized, cross-chain protocol for stablecoin bridging and exchange. Switchly is a novel implementation of a cross-chain dex/bridge. Through our DeFi experience including developing integrations into THORChain and Maya Protocol, we identified other opportunities that will allow for innovation in this space and make the migration of assets between networks as well as decentralized trading more accessible to both users and developers.\n\nFor those familiar, this will follow the established validator model, though we do also intend to make use of smart contracts on supported networks where that is more beneficial, including Soroban. However, we will be differentiating ourselves in several ways, from how users and decentralized applications interact with the system and their user experience through to the economic model and even to the nature of fund custody.\n\nThe first iteration will allow users and developers to fluidly move from one USD pegged asset to another, with minimal fees, simple implementation, security, and a great user experience. Whether you're moving from USDT on ETH to USDC on Stellar or DAI on Polygon to PYUSD on Solana, this system will make that as frictionless and economical as can be.\n\nThis isn't just for users either; we want developers to open their applications to be more accessible and empower them to generate more revenue and make more of an impact for their users too. As an example, a USDC income-generating DeFi protocol built with Soroban on Stellar could use this to open doors to the billions held in liquidity across the stable-coin space.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reclxBFY2nWk88GX0",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "46000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "46000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-128",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Mystic - RWA lending market - Mystic - RWA lending market",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Mystic is building a lending market for RWAs, which lets borrowers take out stablecoins using their tokenized real-world assets. Mystic is building a lending and borrowing market for RWAs. For context, over $10 trillion worth of financial assets are expected to be tokenized until 2030, driven by institutional adoption. However, existing lending markets both lack the compliance rails to support these assets and don't have mechanisms in place to prevent liquidity fragmentation caused by different parties tokenizing the same underlying asset (e.g. there are 10+ US Treasury Bill tokens on Eth Mainnet alone).\n\nMystic solves this by setting KYC/KYB requirements at the asset-level, which allows us to modularly support any asset and its legal requirements (e.g. non-US investors only). Not only that, Mystic has an optimizer system in place which helps balance liquidity across assets of the same asset class (e.g. distribute liquidity amongst multiple tokens representing US Treasuries). Both of these characteristics combined make Mystic the perfect lending playground for institutions and high-networth individuals looking to leverage their real-world asset holdings.\n\nSeeing as our current infrastructure is all Ethereum-based and EVM-focused, we lack the ability to support Stellar assets and work with Stellar-aligned asset managers, like Franklin Templeton and future ones. We are very interested in being on Stellar, as the ecosystem seems like a perfect fit with our value proposition. Hence, we are requesting this Activation Award so we may reproduce our infrastructure on Soroban and go live on Stellar!",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recqCzftyJOhfSKmB",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/mystic_finance"
            }
          ],
          "fundsApproved": [
            {
              "amount": "47000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "47000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-129",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Chrysalis - Chrysalis",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Chrysalis - turn Stellar assets into fluid opportunities, offering seamless liquidity and staking rewards on one dynamic platform. Chrysalis is a liquid staking platform built on the Stellar network, designed to provide users with a seamless and efficient way to stake their XLM or ETH assets. By leveraging the power of Stellar's fast and low-cost transactions, Chrysalis enables users to convert their XLM into ETH, which is then staked on Lido, one of the most trusted staking protocols on Ethereum. This process allows users to earn passive income through staking rewards while also receiving rnETH, a representation of their staked ETH, which can be utilized within the broader DeFi ecosystem.\n\nChrysalis addresses several key problems:\n\n1. Limited Staking Options on Stellar: Stellar users traditionally have fewer staking opportunities compared to other blockchain ecosystems. Chrysalis allows Stellar asset holders to convert their assets to ETH and participate in Ethereum's robust staking environment.\n2. Illiquidity of Staked Assets: Staking typically locks assets, making them illiquid. Chrysalis provides rnETH tokens, which represent the staked ETH and can be traded or used in DeFi applications, ensuring users have liquidity even while their assets are staked.\n3. Complexity of Cross-Chain Staking: Cross-chain interactions can be complex and costly. Chrysalis simplifies this process, offering a user-friendly interface and automated conversions, reducing the technical barriers for users wanting to stake across different blockchains.\n\nChrysalis is aimed at crypto enthusiasts and investors who hold XLM or ETH and are looking for ways to maximize their returns through staking. It appeals to users who value liquidity and want to leverage their assets in DeFi while still earning staking rewards. Additionally, it targets those who appreciate the efficiency and low transaction costs of the Stellar network.\n\nChrysalis integrates deeply with Stellar using smart contracts on Soroban, Stellar's native smart contract platform. Here’s a detailed look at the integration and architecture:\n\n1. Asset Conversion: Users deposit XLM into the Chrysalis platform, where a smart contract automatically converts it into ETH using a decentralized exchange (DEX) integrated within the Stellar ecosystem. This conversion process leverages Stellar's fast and cost-effective transactions.\n2. Staking Mechanism: Once converted, the ETH is staked on Lido via an inter-chain bridge. The staking process is handled by another set of smart contracts, ensuring secure and transparent transactions. Users receive rnETH tokens representing their staked ETH, which are issued on Stellar.\n3. Liquidity and Rewards Management: rnETH tokens provide users with liquidity. These tokens can be traded on Stellar’s DEX or used in various DeFi protocols. Additionally, the staking rewards generated on Lido are periodically converted and distributed to rnETH holders through the Chrysalis platform, ensuring users benefit from their staked assets without needing to manage the complexities themselves.\n4. Integration with Ecosystem Partners: Chrysalis integrates with various Stellar ecosystem partners for efficient asset conversion, secure staking, and liquidity management. Partnerships with Stellar anchors facilitate fiat on-ramps and off-ramps, enhancing the overall user experience by providing seamless entry and exit points for fiat currencies.\n\nChrysalis chose Stellar for several reasons:\n\n1. Speed and Cost: Stellar’s network is known for its rapid transaction speeds and low fees, making it an ideal choice for frequent asset conversions and transfers.\n2. Robust Ecosystem: Stellar’s growing ecosystem of anchors, wallets, and DEXs provides a solid foundation for building a comprehensive liquid staking platform.\n3. Security and Transparency: Stellar’s commitment to security and transparency aligns with Chrysalis's mission to provide a trustworthy and reliable staking service.\n4. Soroban Smart Contracts: Soroban’s powerful and flexible smart contract capabilities enable the complex logic required for Chrysalis’s cross-chain staking and liquidity management, ensuring a seamless user experience.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/reclPkvuD4iqLs6E5",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://x.com/ChrysalisFi"
            },
            {
              "platform": "Discord",
              "url": "https://discord.gg/3TRy4pzzHn"
            }
          ],
          "fundsApproved": [
            {
              "amount": "49040.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "49040.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-130",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "CLOB DEX - CLOB",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "CLOB DEX: a cutting-edge, DEX on Soroban, offering automated orders, on-chain settlement and limitless trading. CLOB DEX is a permissionless, decentralized perpetual exchange protocol with automated orders built on Soroban. It uses a fully on-chain orderbook utilizing Red-Black Tree architecture to provide a platform with a risk engine, matching engine, shared asset pools, and on-chain settlement. Using automated orders and collateral insurance to infinite trading possibilities.\n\nIssues we address: DEX trading often comes with high gas costs, fees, and slippage. Professional traders seldom use DeFi due to its lack of speed and liquidity. Derivative DEXs lack efficiency in trading fees and flexibility for traders.\n\nCLOB DEX will be integrated on Stellar using the Soroban Smart Contract asset manager, which will handle account creation, permit the depositing and withdrawing of approved assets, and update user balances on-chain after trade completions. This integration ensures a seamless, automated, and secure trading experience within the Stellar ecosystem.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recyjcPV4GrExiwhR",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "72019.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "72019.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-131",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "Balanced to Stellar - Relay 2 - Connecting Balanced to Stellar",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Balanced is a cross-chain DEX and stablecoin that enablesnative cross-chain DeFi primitives for any ecosystem. Balanced is a cross-chain DEX and CDP-style stablecoin. You can connect your native wallet, deposit native collateral, borrow bnUSD, and swap native assets cross-chain with Balanced. A portion of the ICON network's monthly ICX emissions go towards liquidity in cross-chain liquidity pools.\n\nYou can see the benefits to the user from user reviews here: https://balanced.network/reviews/, the app itself here: https://app.balanced.network/, and the on-chain statistics here: https://stats.balanced.network/. We also have an active Discord community here: https://discord.gg/ru2bJ6JRxG.\n\nThere are 4 main services in this project:\n1. Balanced smart contracts - these are the DEX operations. These were written as part of our previous Activation Grant deliverables.\n2. xCall smart contracts - While our focus is on Balanced and the end user, this connection also provides the infrastructure for anyone to easily make arbitrary cross-chain function calls to any of the chains ICON is connected to. The ICON blockchain serves as a router if it is not the source or destination chain of these calls. These were written as part of our previous Activation Grant deliverables.\n3. Centralized relay - This relays messages between ICON and Stellar. We have implemented a variety of cross-chain protocols, ranging from trusted to trustless. Trustless bridging takes a lot more work and is a lot more expensive to verify source chain messages on the destination chain, so for the scope of this project we are focused on higher speed and lower transaction cost. There are currently two entities that operate the centralized relays, the ICON Foundation and Lydia Labs, and their on-chain messages must agree in order for a transaction to execute. This is the focus of the deliverables for this Community Award application.\n4. Frontend user interface - You can see our interface at https://balanced.network/. For example, you can natively swap AVAX from Avalanche with ICX from ICON, deposit native AVAX to mint bnUSD on Avalanche, or deposit native ICX to mint bnUSD on ICON. To be able to do similarly with native XLM on Stellar are among the end results of this project.\n\nIn the previous Activation Award phase, we wrote Balanced and xCall Soroban smart contracts. In this Community Award phase, we will add Stellar to the centralized relay so that the Balanced and xCall Soroban smart contracts on Stellar can communicate with the Balanced and xCall Java smart contracts on ICON. Note that because ICON is a central hub connected to other chains, it will also be able to propagate communication to other connected chains as well, such as Avalanche.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recsdvsPQ2rnhYmtS",
          "status": "funded",
          "socials": [
            {
              "platform": "Twitter",
              "url": "https://twitter.com/BalancedDAO"
            },
            {
              "platform": "Discord",
              "url": "https://discord.com/invite/DCa53m9wPq"
            }
          ],
          "fundsApproved": [
            {
              "amount": "72000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "72000.00",
          "payoutAddress": {},
          "payouts": []
        },
        {
          "type": "GrantApplication",
          "id": "29-132",
          "grantPoolsURI": "https://raw.githubusercontent.com/opensource-observer/oss-funding/refs/heads/main/daoip-5/json/stellar/GrantsPool.json",
          "grantPoolId": 29,
          "grantPoolName": "SCF #29",
          "projectsURI": "",
          "projectName": "OrbitCDP - OrbitCDP",
          "createdAt": "2024-07-14T00:00:00",
          "projectDescription": "Collateralize your lumens for a wide range of stablecoins with Orbit. OrbitCDP enables users to leverage their cryptocurrency holdings by using them as collateral to borrow stablecoins in various different currencies such as oUSD, oEUR, and much more. Users can overcollateralize XLM to mint stablecoins of a range of currencies through its blend pool. This blend pool allows users to deposit XLM to borrow a stablecoin of their choice, enhancing liquidity and stability across the platform. The stablecoins are added to the blend pool by the treasury contract with deposits of new stablecoins to the pool. These stablecoins can then be utilized for various financial activities such as trading and international transactions, providing flexibility and utility to cryptocurrency holders within the OrbitCDP ecosystem.\n\nOrbitCDP mitigates cryptocurrency volatility by allowing users to collateralize their XLM and convert them into stablecoins, offering a reliable medium of exchange. This helps users avoid the need to sell their crypto assets during market downturns, thus maintaining liquidity. Additionally, OrbitCDP issued stablecoins can help facilitate fast and low-cost international transactions using Stellar's blockchain, making cross-border payments in different currencies more efficient. Furthermore, by providing stablecoins backed by XLM collateral, OrbitCDP helps users in developing countries with volatile currencies to protect their wealth and conduct transactions more reliably.",
          "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recgGLPg9l5ZoIcL5",
          "status": "funded",
          "socials": [],
          "fundsApproved": [
            {
              "amount": "80000.00",
              "denomination": "USD"
            }
          ],
          "fundsApprovedInUSD": "80000.00",
          "payoutAddress": {},
          "payouts": []
        }
      ]
    }
  ]
}