{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar",
    "type": "Foundation",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf-33",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:1",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recsJtI0JZOmnayxP",
                    "projectId": "daoip-5:stellar:project:warmancer-black-friday",
                    "projectName": "Warmancer: Black Friday",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recsJtI0JZOmnayxP",
                    "status": "Awarded",
                    "description": "Warmancer: Black Friday is a free-to-play, public-good strategy game that combines the depth of traditional board games with the intrigue of hidden information, utilizing zero-knowledge proofs (ZKPs) on the Stellar blockchain (pending technology availability) to conceal board positions for enhanced secrecy and fairness. Players will collect unique on-chain items and abilities tied to their wallet addresses, fostering dynamic gameplay, cross-project compatibility, and rewarding community engagement.",
                    "fundsApprovedInUSD": 136500.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://towa-hi.github.io/warmancer-docs/#/",
                        "stellar.productsAndServices": "A complete, playable, and free web3 game will be launched from this grant along with community events, tournaments, and promotional activities run by Scrying Stone. Stellar and Soroban will be used for asset management and in-game board management with some features dependent on development of onchain standards.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success will be measured by organic participation in the game through promotional events and tournaments. On-chain assets will facilitate",
                        "stellar.tractionEvidence": "We currently have an internal alpha testing version of the game with a public beta on the way.",
                        "stellar.goToMarketPlan": "1. Executive Summary\n\nScrying Stone’s Warmancer: Black Friday is a blockchain game that combines immersive gameplay with cutting-edge blockchain technology, targeting the niche of web3 gamers and blockchain enthusiasts. The game leverages unique gameplay, community-driven fun, and NFT integration to create a compelling experience. This Go-To-Market plan outlines the strategy to build anticipation, drive user adoption, and establish a sustainable player ecosystem.\n\n  \n\n2. Target Audience\n\n-   Primary Audiences:\n    \n    -   Web3 gamers already engaged in blockchain-based games.\n        \n    -   People interested in NFT utility and play-to-have-fun models.\n        \n-   Secondary Audiences:\n    \n    -   Traditional gamers curious about blockchain.\n        \n    -   Developers and influencers within blockchain gaming communities.\n        \n\n  \n\n3. Key Value Proposition\n\n-   Gameplay: A grimdark aesthetic inspired by '90s DOS games with unique wizard strategy battles.\n    \n-   Blockchain Features:\n    \n    -   NFTs: Collectible in-game items with tangible utility such as unlocking in-game cosmetics and gameplay mechanics.\n        \n    -   Tokenomics: THERE IS NONE. This is not play-to-earn. This is not a way to make money. This is a free-to-play public good that utilizes blockchain technology to improve the gaming experience and help teach the public about the benefits of blockchain.\n        \n-   Market Differentiation: Combines nostalgic visuals with modern decentralized technology and unique modern gameplay mechanics developed by seasoned blockchain veterans and AAA video game developers.\n    \n\n  \n\n4. Go-To-Market Strategy\n\n#### Pre-Launch (Months 1-3)\n\n1.  Community Building:\n    \n    -   Launch Discord server focused on the game’s development journey.\n        \n    -   Create engaging Twitter threads showcasing concept art, lore, and gameplay teasers.\n        \n    -   Collaborate with blockchain gaming influencers for early access and reviews.\n        \n1.  Content Marketing:\n    \n    -   Weekly blog posts and Medium articles on the game’s development and blockchain features.\n        \n    -   Short-form videos for X and YouTube Shorts showcasing gameplay mechanics.\n        \n1.  Partnerships:\n    \n    -   Partner with NFT marketplaces for exclusive drops.\n        \n    -   Foundational beginning of a web3 gaming platform that will support multiple game launches..\n        \n\n#### Testnet Launch (Months 4-5)\n\n1.  Beta Testing:\n    \n    -   Conduct an open beta with community members.\n        \n    -   Incentivize feedback with exclusive NFTs for in-game assets.\n        \n1.  Marketing Campaign:\n    \n    -   Launch a NFT campaign with in-game perks.\n        \n    -   Paid ads on platforms like Twitter and Reddit targeting blockchain gamers.\n        \n    -   Host community events and tournaments.\n        \n1.  Influencer Engagement:\n    \n    -   Host live streams with gaming influencers showcasing the game.\n        \n    -   Leverage user-generated content with hashtag campaigns (#WizardDuel).\n        \n\n#### Post-Launch (Months 6+)\n\n1.  Ongoing Engagement:\n    \n    -   Introduce seasonal content like wizard tournaments and special quests.\n        \n    -   Reward community participation with leaderboard-based prizes.\n        \n1.  Analytics and Optimization:\n    \n    -   Monitor player retention, token minting, and community feedback.\n        \n    -   Iterate marketing strategies based on data insights.\n        \n\n  \n\n5. Metrics and KPIs\n\n-   Pre-Launch:\n    \n    -   Discord community growth: 500 members.\n        \n    -   Social media engagement: 250 average impressions per post.\n        \n-   Launch:\n    \n    -   Beta participation: 500 players.\n        \n    -   NFT minting success: 80% of available assets minted within the first week.\n        \n-   Post-Launch:\n    \n    -   Active daily users (ADU): 500 within the first three months.\n        \n\n  \n\n6. Six Month Budget\n\n-   AAA Video Game Developer Costs: $30,000\n    \n-   Blockchain Developer: $15,000\n    \n-   Art Director: $18,000\n    \n-   UI Artist: $6,000\n    \n-   Music and Sound: $6,000\n    \n-   Operational Costs: $1,500\n    \n-   Game Designer: $10,000\n    \n-   Community Engagement and Management: $20,000 \n    \n-   Engineering Lead: 30,000\n    \n\n  \nTotal $136,500\n\n  \n\n7. Risks and Mitigation\n\n1.  Low User Adoption:\n    \n    -   Mitigation: Incentivize early adoption with rewards and exclusive content.\n        \n1.  Technical Issues:\n    \n    -   Mitigation: Rigorous beta testing and a bug bounty program.\n        \n1.  Market Saturation:\n    \n    -   Mitigation: Focus on unique value propositions and niche marketing.",
                        "stellar.tranche1Deliverables": "Deliverables:\n\n-   Develop a fully functional beta version with:\n    \n    -   Hand-drawn media and high-quality music assets.\n        \n    -   Single-player gameplay modes running on external servers.\n        \n    -   Basic in-game communication features.  \n\n    - Full integration of Stellar wallet support. \n\n    - Soroban asset support.\n\n    - In-game asset verification system.\n        \n\nHow to Measure Completion:\n\n-   Completion of all core gameplay features.\n    \n-   Availability of beta version for internal testing.  \n    \n\nBudget Allocation:\n- Blockchain Development (Stellar wallet, Soroban assets): $15,000\n\n-   Art and Design (Hand-drawn media, UI, styling, NFT asset production): $15,000\n    \n-   Music and Sound Production: $6,000\n    \n-   Coding (Game mechanics, server setup): $13,000\n    \n-   Project Management and Miscellaneous Costs: $5,000\n    \n\nTotal Budget: $54,000  \nEstimated Completion Date: March 31, 2025",
                        "stellar.tranche2Testnet": "Deliverables:\n- Multiplayer gameplay modes running on external servers.\n\n- Launch a blockchain-enabled testnet version with:\n   \n    -   Anti-cheat smart contracts.\n        \n    -   Exploration of zero-knowledge proofs (if feasible).  \n        \n\nHow to Measure Completion:\n\n-   Blockchain functionality verified in a test environment.\n    \n-   Testnet version playable with blockchain-enabled features, including multiplayer functionality..  \n    \n\nBudget Allocation:\n\n- Multiplayer development: $7000\n    \n-   Smart Contract Development (Anti-cheat, asset verification): $12,000\n    \n-   Game Design and Integration: $8,500\n    \n-   Quality Assurance and Testing: $5,000  \n    \n\nTotal Budget: $32,500  \nEstimated Completion Date: May 31, 2025",
                        "stellar.tranche3Mainnet": "Deliverables:\n\n-   Full launch of the on-chain game with:\n    \n    -   Fully functional anti-cheat mechanisms.\n        \n    -   Stellar wallet and Soroban support.\n        \n    -   Zero-knowledge proof implementation (if available).\n        \n    -   Community engagement program for early adopters.\n        \n    -   Free-to-play accessibility with no token requirement.\n        \n\n  \nHow to Measure Completion:\n\n-   Successful deployment on mainnet.\n    \n-   Public availability of the game with all features.\n    \n\n  \nBudget Allocation:\n\n-   Final Coding (Mainnet deployment, game mechanics): $15,000\n    \n-   Art and Music Enhancements: $9,000\n    \n-   Community Engagement Program Setup: $10,000\n    \n-   Quality Assurance and Final Testing: $6,000\n    \n-   Operational Costs: $10,000\n    \n\n  \nTotal Budget: $50,000  \nEstimated Completion Date: June 30, 2025",
                        "stellar.teamMembers": "John Rubisoff, robek",
                        "stellar.urls": {
                            "website": "https://warmancer.io",
                            "codeRepository": "https://github.com/towa-hi/solid-parakeet",
                            "videoURL": "https://www.youtube.com/watch?v=O55nGKcey1c"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/scrying_stone"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 91000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 299532.27,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-21T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:2",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recj3q75Rnnn3ahfb",
                    "projectId": "daoip-5:stellar:project:peerpesa",
                    "projectName": "PeerPesa",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recj3q75Rnnn3ahfb",
                    "status": "Awarded",
                    "description": "Cross-border payments with XLM, simplifying money transfers for Africa. Fast, affordable, and blockchain-powered.",
                    "fundsApprovedInUSD": 45000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1xDwunlqk5DS_2PtADgnPnTi3DGAtcl2lYeiMj-DxUCk/edit?tab=t.0#heading=h.gjdgxs",
                        "stellar.productsAndServices": "PeerPesa aims to expand its blockchain-based financial services through a new product build, focusing on enhancing cross-border payments and crypto-fiat settlements across East Africa.\n\nFeatures in the New Build:\n\n1.  Send Money Using XLM to Mobile Money/Bank Transfer: Enhancing the ability for users to send money directly using Stellar's XLM to mobile money wallets or bank accounts across borders. By leveraging Stellar's low transaction costs and rapid settlement capabilities, this feature will ensure affordable and near-instant transfers, providing a seamless experience for users needing cross-border remittances.\n    \n1.  Buy Crypto (XLM): Adding a feature for users to buy Stellar's XLM directly within the PeerPesa app. This will leverage Stellar's decentralized exchange (DEX) to facilitate easy purchasing of XLM at competitive rates. This improvement will empower users to easily acquire and hold XLM, thereby increasing financial inclusion and enabling more individuals to participate in blockchain-based financial services.\n    \n\nImpact of Improvements: These enhancements will make PeerPesa a more efficient and accessible financial service provider for users across East Africa. By leveraging Stellar's blockchain capabilities, PeerPesa will reduce the cost of cross-border transactions, provide direct access to XLM, and bridge the gap between traditional and blockchain-based finance, ultimately enhancing financial inclusion in the region.",
                        "stellar.successCriteria": "Success Criteria and Impact\n\n-   Financial Inclusion: Increased financial access for underserved communities in Africa, enabling secure cross-border payments via mobile money and bank transfers.\n    \n-   User Growth: Achieve significant user growth by onboarding at least 10,000 users within the first 6 months, focusing on both senders and recipients.\n    \n-   Transaction Efficiency: Facilitate over 5,000 successful cross-border transactions per month, reducing the cost and time taken for remittances compared to traditional methods.\n    \n-   Community Impact: Strengthen economic ties within the African diaspora by providing a reliable, affordable remittance platform, thereby fostering economic growth and resilience.\n    \n-   Partner Network Expansion: Establish strategic partnerships with at least 3 major mobile money operators and 5 local businesses or financial institutions, enhancing service accessibility.\n    \n-   Customer Satisfaction: Achieve a high satisfaction rate (above 90%) from user surveys, focusing on ease of use, transaction speed, and cost-effectiveness.\n    \n-   Scalability: Successfully launch on Stellar mainnet, demonstrating scalability and readiness for expansion to additional regions and user segments.",
                        "stellar.tractionEvidence": "-   Stellar Blockchain Integration: PeerPesa has successfully integrated with the Stellar blockchain, allowing seamless cross-border payments using XLM.\n    \n-   Partnerships: Established partnerships with flutterwave.com for fiat on/off-ramp integration and successfully integrated with their API.\n    \n-   Early User Adoption: Onboarded early adopters for the MVP phase, including members of the East African diaspora, with positive initial feedback on transaction speed and affordability.\n    \n-   Product Development: Successfully developed and deployed the PeerPesa dapp on the Stellar blockchain, allowing users to send and receive payments via mobile wallets and bank accounts.",
                        "stellar.goToMarketPlan": "Go-To-Market (GTM) Plan for PeerPesa\n\n1. Market Research & Target Audience\n\n-   Target Regions: Focus initially on East Africa, including Uganda, Kenya, Tanzania, Rwanda, South Sudan, and the DRC. These regions have a high need for affordable and accessible remittance services.\n    \n-   Target Audience:\n    \n    -   Diaspora Communities: Africans residing abroad who need efficient and low-cost solutions to send money to their families.\n        \n    -   Local Recipients: Individuals and families receiving remittances in local currencies through mobile money or bank transfers.\n        \n    -   Small Businesses: SMEs dealing with cross-border transactions in the region.\n        \n-   Market Need: High remittance fees, limited financial infrastructure, and a strong need for fast, affordable, and secure money transfer services are key issues PeerPesa aims to address.\n    \n\n2. Positioning and Messaging\n\n-   Unique Value Proposition (UVP): “Effortless cross-border payments for Africa powered by Stellar blockchain—fast, reliable, and affordable money transfers with XLM to mobile wallets and bank accounts.”\n    \n-   Key Messages:\n    \n    -   Affordable cross-border remittances powered by blockchain.\n        \n    -   Direct integration with mobile money for easy, fast, and secure transactions.\n        \n    -   Empowering local communities through better access to digital financial services.\n        \n\n3. Channels and Marketing Strategy\n\n-   Digital Marketing:\n    \n    -   Social Media: Use platforms like Facebook, Twitter, Instagram, and LinkedIn to target diaspora communities and showcase the benefits of PeerPesa. Leverage testimonials and educational content about blockchain.\n        \n    -   Content Marketing: Develop blogs, explainer videos, and infographics to educate the audience on the benefits of using blockchain for remittances and the unique value PeerPesa provides.\n        \n    -   SEO: Target keywords related to remittances in East Africa, affordable money transfers, and Stellar blockchain payments.\n        \n-   Community Engagement:\n    \n    -   Collaborate with diaspora groups, cultural associations, and community leaders to promote PeerPesa as a trusted solution for cross-border payments.\n        \n    -   Organize virtual webinars to educate potential users about the platform and its benefits.\n        \n-   Partnerships:\n    \n    -   Establish partnerships with financial institutions, fintech platforms, and mobile money providers like MTN and Safaricom to expand the accessibility of services.\n        \n    -   Collaborate with local businesses and SMEs to use PeerPesa for transactions and business payments.\n        \n\n4. Launch Strategy\n\n-   Soft Launch (MVP):\n    \n    -   Launch the Minimum Viable Product (MVP) in key East African markets for a small group of early adopters, including local diaspora groups and small businesses.\n        \n    -   Gather user feedback and iterate based on initial usage data to improve the platform's features and user experience.\n        \n-   Testnet Launch:\n    \n    -   Use the Stellar testnet to identify potential issues and optimize the platform’s performance. Promote the testnet phase as a beta testing opportunity for users to participate and provide feedback.\n        \n    -   Create awareness through social media and local influencers, emphasizing the transparency and security benefits of the blockchain.\n        \n-   Mainnet Launch:\n    \n    -   Execute a full-scale launch with targeted marketing campaigns across digital channels, diaspora communities, and strategic partnerships.\n        \n    -   Offer incentives for new users, such as discounted transaction fees or referral bonuses.\n        \n\n5. Partnerships and Alliances\n\n-   Mobile Money Providers: Secure partnerships with major mobile money operators like MTN, Airtel, and Safaricom to facilitate seamless on/off-ramping of funds.\n    \n-   Stellar Ecosystem Partners: Leverage Stellar's LaunchKit and other infrastructure to gain visibility within the Stellar community and access potential partnerships.\n    \n-   Local Financial Institutions: Work with local banks and microfinance institutions to extend PeerPesa’s services to users without mobile money access.\n    \n\n6. Customer Support\n\n-   Onboarding Assistance: Provide a user-friendly onboarding process with tutorials and support for setting up accounts and completing KYC verification.\n    \n-   24/7 Customer Support: Implement an always-available support system via chat, email, and phone to address any user concerns in real-time.\n    \n-   Community Engagement: Use community managers to create a strong brand presence within key diaspora communities to build trust and loyalty.\n    \n\n7. Metrics for Success\n\n-   User Acquisition: Track the number of new users onboarded, both senders and recipients.\n    \n-   Transaction Volume: Monitor the total volume of transactions conducted through PeerPesa in both XLM and local currencies.\n    \n-   Customer Retention: Measure the percentage of users making repeat transactions to gauge user satisfaction.\n    \n-   Partnership Growth: Assess the number and impact of partnerships with financial institutions, mobile money operators, and local businesses.\n    \n\n8. Timeline\n\n-   Month 1-2: MVP launch and onboarding of early adopters.\n    \n-   Month 3-4: Testnet phase and beta testing with community feedback collection.\n    \n-   Month 5-6: Mainnet launch with a full-scale marketing campaign, partnership expansions, and incentives for early users.\n    \n\nThis Go-To-Market plan aims to establish PeerPesa as the go-to platform for seamless, fast, and cost-effective cross-border payments across East Africa, leveraging Stellar blockchain to make financial services accessible to everyone.",
                        "stellar.tranche1Deliverables": "Tranche 1 - MVP\n\nStellar Community Fund Build Tranche Deliverables for PeerPesa  \nRevised Total Budget: $23,953 USD\n\n#### Overview\n\nPeerPesa is a remittance platform integrated with Stellar blockchain technology. The goal is to provide a seamless cross-border money transfer experience using Stellar Lumens (XLM) for Africans in the diaspora to send money home. The project milestones have been broken down into three key phases: Minimum Viable Product (MVP), Testnet, and Mainnet launch.\n\n#### Milestone 1: Minimum Viable Product (MVP)\n\nRevised Total Budget: $23,953 USD\n\n1.  Product Design and Development (Month 1)\n    \n    -   User Interface (UI) Design: Develop detailed wireframes and prototypes for key user flows, ensuring a smooth and intuitive experience.  \n        Revised Budget: $1,913 USD\n        \n    -   User Experience (UX) Testing: Conduct focus group sessions and usability testing to gather feedback on early UI concepts and incorporate necessary adjustments.  \n        Revised Budget: $956 USD\n        \n    -   Frontend Development: Build out the MVP interface, ensuring cross-platform compatibility for web and mobile.  \n        Revised Budget: $2,392 USD\n        \n    -   Backend Architecture: Design and implement a scalable backend structure to support core functionalities like payment processing, data storage, and user management.  \n        Revised Budget: $1,435 USD\n        \n    -   APIs Integration: Integrate third-party APIs for mobile money, crypto trading, and other key services such as KYC verification.  \n        Revised Budget: $956 USD\n        \n    -   Blockchain Integration: Integrate the Stellar Lumens (XLM) blockchain to handle cross-border transactions securely and efficiently.  \n        Revised Budget: $478 USD\n        \n    -   Quality Assurance (QA): Execute a comprehensive testing phase, covering functional testing, regression testing, and bug resolution.  \n        Revised Budget: $239 USD\n        \n1.  KYC and Compliance Integration (Month 1 - 2)\n    \n    -   Service Provider Evaluation: Conduct a comparative analysis of multiple KYC service providers to select the best partner for integration.  \n        Revised Budget: $478 USD\n        \n    -   API Integration for KYC: Develop and integrate API connections with the chosen KYC provider, including setting up automated identity verification workflows.  \n        Revised Budget: $1,435 USD\n        \n    -   Compliance Documentation: Develop legal documentation and compliance protocols in line with regulatory standards for data handling and user privacy.  \n        Revised Budget: $956 USD\n        \n    -   Testing and Adjustment: Test the KYC integration with sample users to identify bottlenecks and improve processing times.  \n        Revised Budget: $478 USD\n        \n1.  Payment and Crypto Integration (Month 2)\n    \n    -   Mobile Money Integration: Implement integration with local mobile money systems, focusing initially on key regions (e.g., Kenya, Uganda, Nigeria, Ghana, and others).  \n        Revised Budget: $1,435 USD\n        \n    -   Crypto Trading Feature: Develop a basic interface for users to buy and sell cryptocurrency, leveraging KotaniPay API.  \n        Revised Budget: $1,435 USD\n        \n    -   Transaction Tracking: Develop a system for real-time transaction monitoring, enabling transparency and ensuring a positive user experience.  \n        Revised Budget: $956 USD\n        \n    -   Fee Structure Implementation: Set up the infrastructure to charge transaction fees, including testing different models to identify the most sustainable revenue approach.  \n        Revised Budget: $478 USD\n        \n1.  User Testing and Feedback (Month 2 - 3)\n    \n    -   Beta Testing: Organize an initial beta launch with selected users to gather feedback on all core functionalities.  \n        Revised Budget: $956 USD\n        \n    -   Focus Groups and Surveys: Conduct focus groups and detailed user surveys to collect qualitative and quantitative feedback on product usability.  \n        Revised Budget: $717 USD\n        \n    -   Performance Analysis: Use analytics tools to track user behavior during beta testing and identify areas for improvement.  \n        Revised Budget: $717 USD\n        \n    -   Feature Prioritization: Develop a priority list for additional features or changes based on the feedback received.  \n        Revised Budget: $478 USD\n        \n1.  Team Expansion and Training (Ongoing - Month 1 - 3)\n    \n    -   Hire Key Personnel: Recruit additional developers, UX designers, and compliance experts to handle the increased scope of work.  \n        Revised Budget: $2,392 USD\n        \n    -   Training: Conduct internal training for the team to ensure they are well-equipped to use the blockchain features, KYC tools, and integration mechanisms effectively.  \n        Revised Budget: $956 USD\n        \n    -   Documentation: Develop detailed operational manuals for the MVP that outline processes for both technical and customer support teams.  \n        Revised Budget: $956 USD",
                        "stellar.tranche2Testnet": "Tranche 2 - Testnet\n\n#### Milestone 2: Testnet Phase\n\nRevised Total Budget: $13,829 USD\n\n1.  Testnet Deployment and Monitoring (Month 3 - 4)\n    \n    -   Testnet Setup: Deploy the MVP onto a testnet environment to validate functionality in a blockchain ecosystem.  \n        Revised Budget: $2,308 USD\n        \n    -   Monitoring Tools Development: Develop monitoring tools to observe the network performance, transaction speeds, and identify any bottlenecks.  \n        Revised Budget: $1,385 USD\n        \n    -   Scalability Testing: Conduct scalability tests to ensure the platform can handle increasing transaction volumes without degrading performance.  \n        Revised Budget: $1,846 USD\n        \n1.  Smart Contract Optimization (Month 4)\n    \n    -   Code Review and Refactoring: Review and optimize the existing smart contracts to improve efficiency and reduce gas costs.  \n        Revised Budget: $1,385 USD\n        \n    -   Gas Optimization: Implement optimizations to reduce gas fees and ensure the platform is cost-effective for users.  \n        Revised Budget: $923 USD\n        \n    -   Unit Testing: Develop and run comprehensive unit tests to ensure smart contracts behave as expected under different scenarios.  \n        Revised Budget: $923 USD\n        \n1.  Infrastructure Scaling and Stress Testing (Month 4)\n    \n    -   Load Testing: Simulate high volumes of transactions to test the infrastructure's ability to scale.  \n        Revised Budget: $1,385 USD\n        \n    -   Performance Optimization: Analyze the results from load testing and optimize infrastructure components to handle increased demand.  \n        Revised Budget: $1,385 USD\n        \n    -   Cloud Resource Management: Optimize cloud resource usage to ensure scalability while maintaining cost efficiency.  \n        Revised Budget: $923 USD",
                        "stellar.tranche3Mainnet": "Tranche 3 - Mainnet\n\nRevised Total Budget: $7,218 USD\n\n#### Milestone 3: Mainnet Launch\n\nRevised Total Budget: $7,218 USD\n\n1.  Mainnet Deployment (Month 5)\n    \n    -   Mainnet Setup: Deploy the fully tested MVP onto the mainnet, ensuring all components are configured properly for a live environment.  \n        Revised Budget: $2,062 USD\n        \n    -   Migration from Testnet to Mainnet: Migrate all data and configurations from the testnet environment to the mainnet.  \n        Revised Budget: $1,031 USD\n        \n    -   Validation and Verification: Conduct final checks and verification of all functionalities on the mainnet to ensure the platform is fully operational.  \n        Revised Budget: $1,031 USD\n        \n1.  Smart Contract Final Review (Month 5 - 6)\n    \n    -   Final Review of Smart Contracts: Conduct a final review of the smart contracts to ensure optimal performance on the mainnet.  \n        Revised Budget: $3,094 USD\n        \n\n-  \n\nGrand Total Revised Budget: $45,000 USD",
                        "stellar.teamMembers": "peerpesa",
                        "stellar.urls": {
                            "website": "https://www.youtube.com/watch?v=5wdvAi4aejs",
                            "codeRepository": "https://github.com/PeerPesa/Stellar.PeerPESA",
                            "videoURL": "https://www.youtube.com/watch?v=c8KHOLoDGnA",
                            "pitchDeck": "https://docsend.com/view/8rirxtmrjhvuh9hj"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/peerpesa/",
                            "twitter": "https://x.com/peer_pesa",
                            "discord": "https://discord.gg/hxzdqsEx"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 30000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 107185.59,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-03T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:3",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recQTvLPkW5iXhuCO",
                    "projectId": "daoip-5:stellar:project:stride",
                    "projectName": "Stride",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recQTvLPkW5iXhuCO",
                    "status": "Awarded",
                    "description": "Stride is planning to build a fitness ecosystem which motivates and rewards the average person to build healthy habits and on the other hand solves everyday problems for fitness fanatics that want to elevate their fitness journey. A fitness ecosystem for everyone everywhere, making a change stride by stride.",
                    "fundsApprovedInUSD": 120000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1Z-YK3aNrp-zB5bg7q9OFzKP-d4CDMDySoQkUz6JJ6-U/edit?usp=sharing",
                        "stellar.productsAndServices": "What is Stride?\n\nStride currently consists of 2 applications forming a fitness ecosystem, the idea is to reach as many people and effectively make a difference in as many peoples lives as possible no matter how small that change may be. To do that we decided to move forward with a dual application approach making it more accessible to anyone and everyone. So let’s jump into both of our applications and what their purposes are:  \n\nStride Native App (Also considered the Pro app)\n\n-   Available on both GooglePlay and Apple App Store\n    \n-   Currently a MVP Beta built to allow users to earn $STRIDE airdrop points beginning there fitness journey as well as socialise.\n    \n\nWhat do we intend to build it into?\n\n-   A fitness application that will be a better solution to fitness enthusiasts than current traditional apps like Strava.\n    \n-   Consisting of features such as: Fitness tracking, advanced analytics, AI Fitness plans, PVP Racing, Hardware integrations, and a dynamic reward system, rewarding users for there efforts in ways that traditional apps simply don’t.  \n    \n\nStride Lite Mini App (Our Lite Version)\n\n-   Available currently on Telegram\n    \n-   Coming soon to LINE Messenger App (We have been accepted to have early access to LINE’s SDK for there soon too launch Mini App store, allowing us to be of the first applications to launch to 250 million LINE Messenger users!)\n    \n-   Currently a Beta built to allow users to walk to earn in game currency and spend this in game currency to enter cash raffles.\n    \n-   The idea is to keep the application simple, fun and very rewarding, making it attractive enough to those who might not be interested in fitness but convincing them to partake and with time maybe even upgrade to Stride Pro and take there fitness journey to the next level!\n    \n-   Launching Stride Lite on Fitness apps has allowed us to tap into a completely new market for the fitness applications which non of our competitors have and thus allowing us to already reach hundreds of thousands of users in just a couple months while in beta stage!  \n    \n\nPlease refer to this google doc for some visuals - https://docs.google.com/document/d/1Z-REUO-zYc_Hn4BgyqvNT9HQc9TX20eSd7DbMZUjoME/edit?usp=sharing  \n\nStride integrates Stellar’s tech to enhance user engagement and ensure transparency in its fitness ecosystem. Key features include:\n\nSoulbound Badges (Metadata for Achievements):  \n\nHow Stellar is used: Soulbound NFTs are created on Stellar's Soroban contracts to track user achievements and fitness milestones on-chain. Impact: Provides an immutable and transparent way for users to showcase their fitness progress, increasing motivation and long-term engagement.  \n\nPVP Challenges and Leaderboards:\n\nHow Stellar is used: Soroban smart contracts manage real-time tracking, ranking, and fair reward distribution based on leaderboard performance. Impact: Encourages competition and gamification, boosting user activity and retention.  \n\nRaffles for Token Rewards:\n\nHow Stellar is used: Stellar stores a secure, on-chain record of raffle wins and ensures transparent reward distribution. Impact: Builds trust in the fairness of reward mechanisms while adding an element of fun for users.  \n\nSoftcoin Claims via Mini apps (e.g., Telegram, Line):\n\nHow Stellar is used: Fitness activity data and achievements are recorded on-chain to ensure transparency and reliability. Impact: Simplifies the backend process and enhances trust, ensuring scalability and user satisfaction.\n\nThese features collectively create a robust fitness ecosystem that leverages Stellar’s capabilities to deliver value, fairness, and transparency to its users.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success for Stride is closely tied to user adoption, engagement, and the impactful integration of Stellar’s blockchain capabilities:  \n\nUser Growth:\n\nTarget 1.89M DAUs by Month 12, focusing on scalable onboarding through the Lite app and delivering a seamless experience for all user types. Stellar’s Soroban smart contracts will ensure transparent and secure handling of user activity and achievements, enhancing trust among a growing user base. Retention & Engagement:\n\nSuccessfully implement on-chain distribution of metadata for badges and achievements using Stellar, ensuring immutable records for advanced activity tracking, leaderboard standings, and raffle wins. This creates a fair and transparent ecosystem for users.  \n  \nDemocratising Access:\n\nBroaden accessibility through Lite app onboarding targeted at underrepresented demographics, expanding wellness and fitness solutions to a global audience. Stellar ensures scalability and affordability for seamless interactions across diverse user bases.  \n  \nImpact on Ecosystem Trust:\n\nStellar’s blockchain integration reinforces transparency and fairness, creating an environment where users trust the ecosystem to reward genuine effort and activity milestones without initial dependence on token rewards. Stride’s success leverages Stellar to deliver a fitness ecosystem rooted in transparency, user engagement, and inclusivity, promoting wellness at scale.\n\n  \nPersonalisation:\n\nProvide hyper-personalised fitness journeys using AI, delivering tailored insights and recommendations to enhance physical and mental health outcomes.  \n  \n\nReal-World Impact:  \nStride addresses both personal and societal challenges tied to fitness and health by reducing barriers like cost, time, and access. Gamification, financial inclusion, and hyper-personalization ensure fitness is engaging, accessible, and rewarding for everyone. By using AI and gamification to create rewarding experiences, Stride empowers users to take ownership of their health while contributing to global wellness advocacy.",
                        "stellar.tractionEvidence": "Stride has demonstrated strong early traction across its main MVP app and Stride Lite, engaging users globally and establishing a solid foundation for future growth.  \n\nStride App (MVP):\n\n-   Since launch, Stride App has successfully onboarded over 15,000 users, with monthly active users consistently around 4,200. This high level of user interest confirms the app’s appeal as a comprehensive fitness and wellness tool.\n    \n-   Users are highly engaged, with an impressive average session duration of 8 minutes and 25 seconds, indicating that the app’s features and user experience effectively capture and maintain user attention.\n    \n-   Retention rates are strong especially at an MVP stage & 4 months in, with approximately 30% of users returning, highlighting Stride’s ability to keep users motivated and engaged beyond the initial download.\n    \n-   The app is resonating in diverse markets, with significant traction in India, the United States, and South Korea, reflecting Stride’s potential as a global fitness solution.\n    \n-   Current on-chain integration - We have 1 on-chain feature which is Solana wallet connect and this is used specifically just for our NFT collection which is on Solana however we are open to migrating this to Stellar.  \n    \n\nStride Lite:\n\n-   In just over three weeks, Stride Lite has attracted 131,000 unique visitors and generated 679,000 page views, with an average of 3.06 pages per visit, underscoring high engagement and interest.\n    \n-   Over the past 7 days, Stride Lite recorded 43,256 unique visitors and 166,927 page views. Daily, weekly, and monthly active users stand at 13,634, 43,099, and 131,845, respectively.\n    \n-   The app has gained notable traction in regions such as Nigeria, Germany, and the United States, with a balanced mix of new and returning users, maintaining a 45% retention rate, indicating a strong user base with ongoing interest.\n    \n-   Current on-chain integration - We have recently made minor integrations of Metis L2, users can connect there wallet and make gas-less transactions. This campaign is milestone based and short term, no exclusivity or agreements beyond achieving the milestones which are almost complete already. Once milestones are complete Stride Lite will have no on chain integrations and can continue with Stellar integrations  \n    \n\nAnalytic snapshots: https://docs.google.com/document/d/1UH_Kzf7-qSTxwJYjcNP5ySWKyAK7pWcKbKGg6o92q98/edit?usp=sharing",
                        "stellar.goToMarketPlan": "Q4 2024\n\n-   Launch Stride Lite on Telegram\n    \n-   Stride Lite feedback & Improvements\n    \n-   Launch monetisation on Stride Lite\n    \n-   Complete Stride Native MVP\n    \n-   Open Fundraising rounds\n    \n\nQ1 2025\n\n-   On-chain integration (Stride Lite)\n    \n-   Begin development on Stride Native v1.5 (With on-chain integration)\n    \n-   Start TGE Marketing campaign\n    \n-   Secure Launchpad and Listing partnerships\n    \n-   Launch Stride Lite Testnet\n    \n-   Launch Stride Native Testnet\n    \n-   TGE\n    \n\nQ2 2025\n\n-   Launch Mainnet for Stride Native & Stride Lite\n    \n-   Web2 Campaigns\n    \n-   Paid Acquisition (Social, search, display etc)\n    \n-   ASO (App Store Optimisation)\n    \n-   Email Marketing Launch\n    \n-   Expand Stride Lite accross more messenger platforms\n    \n-   Wearable & Sensor integration\n    \n-   AI Personlisation integration\n    \n-   Offline marketing (Events, sponsorships)\n    \n-   Corporate wellness programs\n    \n-   Guild onboarding events\n    \n\nQ3 2025\n\n-   Localised campaigns in new markets\n    \n-   Partner with local influencer & brands\n    \n-   Leverage regional exchange partnerships\n    \n-   Expand region specific guild partnerships (USA , UK , Asia , LATAM )",
                        "stellar.tranche1Deliverables": "Deliverable 1: MVP Stage - Stride Lite Development]  \n\n-----------------------------------------------------------\n\nBrief Description:\n\nDevelop the MVP for Stride Lite, focusing on simplified onboarding, fitness tracking, and essential user engagement features. This phase will prioritise creating a fully functional application while preparing the foundation for future on-chain integrations. Stride Native will also progress with fitness tracking features and gamification as part of its MVP. During this phase we will also be preparing for Stellar's on-chain integration for Testnet phase.  \n\nHow to Measure Completion:\n\n-   MVP of Stride Lite functional with:\n    \n-   Simplified onboarding, in-app purchases, subscriptions, and user motivation features.\n    \n-   Basic user engagement features like challenges and rewards are functional.\n    \n\n-  In-app purchases using powered by Soroban smart contracts.\n\n-   MVP of Stride Native App includes:\n    \n-   Fitness tracking, gamification, and core communication systems.\n    \n-   Figma designs demonstrating the UI/UX of tranche 2.\n    \n-   Collection of user feedback from the first 1,000 users.  \n    \n\nAdditional Integration:\n\n-   Stride has already launched an MVP Telegram miniapp, designed as a lightweight solution for step tracking and reward collection. This miniapp complements Stride Native by providing an accessible entry point for broader user engagement, particularly in underserved regions. Users can seamlessly participate in the ecosystem and transition into Stride’s more feature-rich native app.\n    \n-   The miniapp’s design addresses users who prefer simple, low-barrier access or lack the ability to download full applications, meeting them where they are while driving engagement globally.\n    \n-   This also puts Stride in the unique position to conquer the messenger apps market as a first mover fitness application on new innovative platforms and markets completely untapped by any fitness applications as a whole  \n    \n\nEstimated Date of Completion:\n\n45 Days\n\nBudget:\n\n$40,000",
                        "stellar.tranche2Testnet": "[Deliverable 2: Testnet Integration and Expansion]  \n\n-----------------------------------------------------------\n\nBrief Description:\n\nBegin testing and deploying on-chain features for Stride Lite and Stride Native App using Stellar’s testnet. This phase will integrate blockchain functionalities such as Soulbound Contracts for achievements, PVP Contracts, and Leaderboard Contracts into the ecosystem to prepare for seamless user engagement. Development of Stride Native advances to include features like advanced analytics, social functionalities, and leaderboard systems.  \n\nHow to Measure Completion:\n\n-   Soroban contracts for fitness achievements (e.g., badges via Soulbound Contracts) deployed on Stellar’s testnet.\n    \n\nSoroban contract\n\n-   Soulbound contracts-\n    \n    -   Since Soulbound NFTs are not natively supported by Stellar, we will simulate their behaviour using custom smart contracts to securely recognize and reward user achievements on-chain.\n        \n-   PvP contracts -\n    \n    -   Enable users to compete against each other in challenges, like achieving the most footsteps in a period, with rewards distributed from a pooled treasury to top performers.\n        \n    -   Users will be able to make transactions on the smart contracts through in-wallet integration within the Stride app, leveraging guidance from Stellar’s Wallet SDK\n        \n-   Leaderboard contracts\n    \n    -   User data will be stored using permanent storage on-chain, and the Horizon API will be used to fetch this data from the smart contract to dynamically build and update the leaderboard.\n        \n-   Subscriptions & In-app purchases:\n    \n-   On ramp & Off ramp\n    \n    -   Seamless integration of fiat-to-crypto and crypto-to-fiat services, leveraging Stellar ramp for efficient transactions, to simplify user payments and withdrawals in the Stride ecosystem…  \n        \n\nIntegration with Anchor Platform:\n\n-   By leveraging Anchor Platform’s webhook functionalities, we can listen to real-time events on Stride’s smart contracts, enabling responsive and dynamic interactions within the ecosystem.\n    \n-   Stride Lite Testnet Features: In-app reward testing, wallet integration, and preparation for mainnet compatibility.\n    \n-   Stride Native Testnet Features: Gamification systems like leaderboards, advanced fitness analytics, and community features.\n    \n-   Testing reports from user feedback with functional on-chain mechanics on Stellar testnet.\n    \n-   Detailed reports summarising testing outcomes from the Stellar testnet, focusing on gas costs, reliability, and scalability of the contracts.\n    \n-   Reports demonstrating the successful integration of off-chain fitness data with on-chain contracts, validating the automation of data submission and event-triggered contract interactions.\n    \n-   Write unit tests that comply with Stellar's security standards.\n    \n-   Updated Figma designs to showcase UI/UX refinements of tranche 3  \n    \n\nEstimated Date of Completion:\n\n90 Days\n\nBudget:\n\n$50,000",
                        "stellar.tranche3Mainnet": "[Deliverable 3: Mainnet Launch and Advanced Development]  \n\n-----------------------------------------------------------------\n\nBrief Description:\n\nLaunch production-ready Stride Lite on Stellar’s mainnet with fully integrated on-chain features and reward systems. Advance the development of Stride Native App for iOS and Android, focusing on cutting-edge features such as PVP competitions, fitness personalization, and corporate-focused modules.  \n\nHow to Measure Completion:\n\n-   Soroban smart contracts deployed on Stellar mainnet (Soulbound, PVP, and Leaderboard Contracts).\n    \n-   Mainnet-ready Stride Lite with functional in-app purchases, subscriptions, and rewards.\n    \n-   Development milestones for Stride Native App include:\n    \n-   PVP racing functionality, and targeted user features (e.g., corporate fitness plans).\n    \n-   AI-driven fitness personalization\n    \n\nBy leveraging an open-source LLM like LLaMA 3, we can provide tailored fitness experiences while reducing costs associated with cloud-based solutions and ensuring user data privacy.\n\n-   Wearables & Sensors\n    \n\nWe will utilise an advanced API like Tryterra API to ensure compatibility with a wide range of sensors and wearables, providing seamless data integration across devices.  \n\nEstimated Date of Completion:\n\n60 Days\n\nBudget:\n\n$35,000",
                        "stellar.teamMembers": "Nicholas, dll21 or david",
                        "stellar.urls": {
                            "website": "https://www.stridesocial.xyz/",
                            "codeRepository": "https://docs.google.com/document/d/16mdjmorHlAX4lBbTK1xITqDw_29h2QoRxYBLE2Yq7zw/edit?usp=sharing",
                            "videoURL": "https://docs.google.com/document/d/1Td1kfNFVKpJxCbttZLF-q5yeQOGXpaiUygnhIVmcBMA/edit?usp=sharing",
                            "pitchDeck": "https://pitch.com/v/stride-pitch-deck-9vzv8x"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/stridesocials",
                            "discord": "https://discord.gg/stridesocials"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 80000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 271610.19,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-07T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:4",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recP2KIZz7r2yBrkG",
                    "projectId": "daoip-5:stellar:project:soroban-optimistic-oracle--soo",
                    "projectName": "Soroban Optimistic Oracle  (SOO)",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recP2KIZz7r2yBrkG",
                    "status": "Awarded",
                    "description": "SOO is a decentralized arbitration system for resolving on-chain disputes. It serves as an oracle for projects like prediction markets, insurance protocols, derivatives, and cross-chain bridges, providing data ranging from cryptocurrency prices to sports and political events.",
                    "fundsApprovedInUSD": 30000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://www.figma.com/deck/pEr2MvlTAa5ErIVBuxQ7GG/Soroban-Opt.-Oracle?node-id=1-32&t=pmd69aKDfgZ30lq4-1&scaling=min-zoom&content-scaling=fixed&page-id=0%3A1",
                        "stellar.productsAndServices": "Stellar soroban contracts are currently being used for onChain contract development. I have done some initial work in this github repo(https://github.com/stackman27/soroban-opt-oracle) which i plan on expanding.\n\n-   OnChain Optimistic Oracle (OOO) contract\n    \n    -   The OOO is used to assert truths about the world which are verified using an optimistic escalation game.\n        \n    -   Core idea: an asserter makes a statement about a truth, calling \"assertTruth\". If this statement is not challenged, it is taken as the state of the world. If challenged, it is arbitrated using the Data verification engine or if configured, an escalation manager. Escalation managers enable integrations to define their own security properties and tradeoffs, enabling the notion of \"sovereign security\".\n        \n-   OnChain Voting Oracle contract\n    \n    -   Since all transactions are public we have to use extra tricks to keep some things temporarily hidden. Let’s say we need input like an answer to a quiz or a move in a game from a group of players. We don’t want these players to be able to just watch the blockchain for their competitors’ answers. What we’ll do is have everyone hash their answer and submit that first (the commit). Next, everyone will submit their real answer (the reveal) and we can prove on-chain that it hashes to the committed value. This interaction is handled by the Voting Oracle contract in soroban\n        \n-   OnChain Staking Contract\n    \n    -   Staking contract enabling XLM to be locked up by stakers to earn a pro rata share of a fixed emission rate. This contract also handles the staking, unstaking and reward retrieval logic. There won't be any new XLM token generated, but the yield will be generated based on the asserter/disputer lost staked. Tentative staking interface below;\n        \n            #[derive(Debug)]\n            pub struct VoterStake {\n                stake: u128,                           // XLM staked by the staker.\n                pending_unstake: u128,                 // XLM in unstake cooldown period, waiting to be unstaked.\n                pending_stakes: HashMap<u32, u128>,    // If a voter stakes during an active reveal, stake is pending.\n                rewardspaidper_token: u128,          // Internal tracker used in the calculation of pro-rata share of rewards.\n                outstanding_rewards: u128,             // Accumulated rewards that have not yet been claimed.\n                unapplied_slash: i128,                 // Used to track unapplied slashing in the case of bisected rounds.\n                nextindexto_process: u64,            // The next request index that a staker is susceptible to be slashed on.\n                unstake_time: u64,                     // Time that a staker can unstake. Used to determine if cooldown has passed.\n                delegate: Option<String>,              // Address a staker has delegated to. The delegate can commit/reveal/claimRestake rewards.\n            }\n        \n    \n-   OnChain Reward Distribution contract\n    \n    -   Reward Distribution is a sub contract that Staking Contract inherits. Rewards can either be distributed per epoch or based on the end of challenge period. The unstaking of reward will have to go through a cooldown period\n        \n\n-   Export a pluggable interface for other Soroban contracts to use it easily\n    \n    -   Build necessary adaptars for the oracle contract interface to be easily pluggable in other projects\n        \n    -   The adapters can be universally used or be changed subject to a specific project need\n        \n\n-   OffChain Data Verification Engine (DVE)\n    \n    -   This is an offChain component which will be written in Rust to read/write to Stellar blockchain\n        \n    -   DVE Purpose: Resolves disputes in the Soroban optimistic oracle by verifying disputed data.\n        \n    -   Dispute Process: Ex: A price request is submitted to the DVE, triggering a vote among SOO stakers.\n        \n    -   Voting Period: Voting lasts x hrs\n        \n    -   Voting Criteria: SOO stakers use off-chain price feeds to guide their votes.\n        \n    -   Final Price: The DVE aggregates votes to determine the final asset price for the given timestamp.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Expected success criteria by the end of the grant;\n\n-   Integrate with 3 different Stellar projects enabling real-time data flow from the oracle to their platform\n    \n-   Have > 10 stakers consistently voting and earning rewards using our system\n    \n-   The rewards and security of the system grows as the project grows\n    \n-   Become a standard for onChain dispute handling on Stellar ecosystem\n    \n-   Keep the system economically secure and have strong security against spams, bots and malicious users.",
                        "stellar.tractionEvidence": "The Stellar Optimistic Oracle (SOO) is currently in the process of being deployed to the Stellar Testnet. This integration is pivotal for expanding the range of use cases that can be built on Stellar, from DeFi (decentralized finance) applications to synthetic assets, prediction markets, and real-world data tracking.\n\nAs part of this deployment, we are conducting several test flights to rigorously test the functionality and reliability of the Optimistic Oracle within the Stellar Testnet environment. These test flights involve the deployment of specific smart contracts that simulate real-world data requests, dispute resolutions, and data verification processes. In addition to the technical deployment, I am also in active communication with several other Stellar-funded projects that are well-positioned to leverage the capabilities of the Stellar Optimistic Oracle. These projects span across multiple sectors, including finance, data marketplaces, and NFT platforms, and could significantly benefit from integrating this oracle technology. The goal is to explore collaborative opportunities where SOO can be incorporated into existing Stellar-based applications or be used to create new innovative products that require reliable and decentralized data feeds. These projects are looking for ways to incorporate off-chain data for use in:\n\n-   Automated price feeds for decentralized trading or financial derivatives.\n    \n-   Synthetic assets that track the value of real-world commodities and assets.\n    \n-   Event-driven smart contracts in prediction markets or decentralized insurance.\n    \n-   Cross-chain interoperability, where data from other blockchains or traditional systems can be fed into Stellar-based ecosystems.",
                        "stellar.goToMarketPlan": "Engage the Stellar Developer Ecosystem:\n\n-   Build early traction and trust by connecting with Stellar ecosystem founders and key developers.\n    \n-   Foster relationships with influential projects within the Stellar ecosystem and integrate them into the SOO service.\n    \n\nCommunity Outreach through Developer Networks:\n\n-   Collaborate with Stellar-focused developer communities to promote the adoption of the SOO framework.\n    \n-   Launch small bounty programs to incentivize the creation and use of SOO service\n    \n\nEncourage XLM holders to stake their token for rewards:\n\n-   with SOO one can earn rewards by voting on correct source of truth. This can be a big incentive for XLM holders to stake and earn extra yield on the side",
                        "stellar.tranche1Deliverables": "1.  [Deliverable 1: MVP]\n    \n    -   Brief Description:  \n        The MVP will focus on implementing a working version of the product to quickly achieve market fit and validate core functionalities.\n        \n    -   How to Measure Completion:\n        \n        -   End-to-End On-Chain Completion (Soroban): Deploy basic on-chain contracts on Soroban to ensure the core system functions on the Stellar blockchain.\n            \n        -   Off-Chain Data Verification Engine: Develop an off-chain data verification engine in Rust to handle external data processing.\n            \n        -   Mock Stakers Simulation: Run mock stakers to demonstrate the software’s usage in verifying claims.\n            \n        -   End-to-End Functionality: Ensure the product can verify claims truthfully and reliably from off-chain data sources.\n            \n        -   No Frontend Development: Frontend work is excluded during the MVP phase.\n            \n    -   Estimated date of completion\n        \n        -   Mid Feburary 2025\n            \n    -   Budget\n        \n        -   $7,000\n            \n        -   Soroban Contract Engineer, 100hr at $70rate, $7,000",
                        "stellar.tranche2Testnet": "1.  [Deliverable 2: Testnet]\n    \n    -   Brief Description:  \n        After the MVP release, public testing will be conducted to ensure the Stellar Optimistic Oracle (SOO) works as expected in a real-world, non-production environment.\n        \n    -   How to Measure Completion:\n        \n        -   Deploy Contracts on Stellar Testnet: Deploy SOO contracts to Stellar Testnet for live testing.\n            \n        -   Two-Step Voting Process: Implement and test the privacy-focused two-step voting mechanism.\n            \n        -   Staking/Slashing Mechanism: Integrate staking/ slashing for honest data reporting and penalties for bad actors.\n            \n        -   Voter Yield Mechanism: Develop yield generation for validators involved in dispute resolution.\n            \n        -   Economic Guarantees for Voter Yield: Design economic incentives to ensure sufficient rewards for stakers.\n            \n        -   Public Testing: Make the testnet version publicly available for users to test claims and participate.\n            \n        -   Extensive Contract Testing: Perform thorough testing of contracts for security and functionality.\n            \n        -   Frontend Integration: Complete frontend and integrate with Soroban contracts + off-chain code.\n            \n    -   Estimated date of completion\n        \n        -   Mid March 2025\n            \n    -   Budget\n        \n        -   $13,000\n            \n        -   Soroban Contract Engineer, 100hr at $70rate, ~$7,000\n            \n        -   Full Stack Engineer, 90hr at $65rate, ~$6,000",
                        "stellar.tranche3Mainnet": "1.  [Deliverable 3: Mainnet]\n    \n    -   Brief description\n        \n        -   Audited Soroban Contracts: All contracts will undergo external security audits to ensure they are secure and ready for mainnet deployment.\n            \n        -   Partnership with Stellar Projects: At least one Stellar-funded project will integrate SOO, enabling real-time data flow from the oracle to their platform.\n            \n        -   End-to-End (E2E) Functionality: The system will be fully functional for both on-chain (Stellar) and off-chain (external data) interactions, with all components tested for seamless integration.\n            \n        -   Economic & Privacy Guarantees: The system will offer strong economic incentives for correct behavior and implement privacy protections for all participants.\n            \n    -   How to measure completion\n        \n        -   Audited Contracts: Successful completion of security audits with reports available to the community.\n            \n        -   Integration with a Stellar Project: At least one Stellar-based project will integrate SOO, demonstrating its practical use.\n            \n        -   End-to-End Testing: Complete E2E tests showing smooth data flow and dispute resolution on both the on-chain and off-chain components.\n            \n        -   Stakers Available for Voting: At least 5-10 stakers ready to participate in dispute resolution during mainnet launch.\n            \n    -   Estimated date of completion\n        \n        -   Late April 2025\n            \n    -   Budget\n        \n        -   $10,000\n            \n        -   Soroban Contract Engineer, 100hr at $70rate, ~$7,000\n            \n        -   Full Stack Engineer, 50hr at $65rate, ~$3,000",
                        "stellar.teamMembers": "shanks",
                        "stellar.urls": {
                            "website": "https://github.com/stackman27/soroban-opt-oracle",
                            "codeRepository": "https://github.com/stackman27/soroban-opt-oracle",
                            "videoURL": "https://drive.google.com/file/d/1F7_pCM9KtPEXOV7B7H0oykRZ4mDlIiew/view?usp=sharing"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 143688.78,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-23T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:5",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec5hY727ovjmxujE",
                    "projectId": "daoip-5:stellar:project:codelnpay",
                    "projectName": "CodeLnPay",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec5hY727ovjmxujE",
                    "status": "Awarded",
                    "description": "CodeLn Pay is a cross-border salary payment platform that helps African-Based Remote Workers seamlessly collect their income in Stable Coins.",
                    "fundsApprovedInUSD": 90100.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://res.cloudinary.com/dfy4gylof/image/upload/v1726631368/CodelnPay_SEP31_Process.png",
                        "stellar.productsAndServices": "According to Mckinsey 2023 report, Africa will be home to the world’s largest working-age population by 2040. Africa is currently the fastest growing talent market for remote work.  But the problem is, remote workers struggle to access their income from employers abroad. They experience salary delays of up to 2 weeks, high withdrawal charges of up to 15% and they are constantly being short-changed by the local currency devaluation.\n\nWe built CodeLn Pay to solve this problem. CodeLn Pay is a crypto cross-border payment platform that allows African-based remote workers to get paid the same day, at an affordable charge of 1% and giving them the option to receive salaries in stable coins. They are able to seamlessly invoice employers, receive payment and save stable coins in their digital wallet. We have most of our users in Nigeria and Ghana and we are expanding to Kenya where we have gotten interest from users in that market. We are helping our users to overcome the challenges of cross-border payments that are especially unique to Africa and delivering a fast, secure, and cost-effective payment channels on chain.\n\nOur current platform is a Web App on SEP 24, this award will be used to build our mobile app and integrate SEP 31 on Stellar. We have gathered feedback from our users from which we will upgrading our product.\n\nHere are the feature breakdown below:\n\n1.  Upgrade Current Implementation to SEP31  \n    Frontend: Wallet UI implementation for SEP31 using the Stellar Wallet SDK  \n    Backend: API implementation for new functionalities\n    \n1.  Mobile Application Design  \n    Wireframe/ LoFi design of app and User flow  \n    User Interface Design, Screen Design\n    \n1.  Mobile Application Development (Flutter App)  \n    Frontend: Implement core functionality,  login, registration , invoicing  \n    Backend: API implementation for mobile core functions\n    \n1.  Mobile Wallet Implementation  \n    Frontend: Pay in UI Implementation  \n    Backend: Backend REST APIs for integration with mobile frontend\n    \n1.  Mobile Wallet Withdrawal Function\n    \n    Frontend: Cashing Out UI Implementation\n    \n    Backend: Backend integration to provide withdrawal for markets",
                        "stellar.successCriteria": "According to Mckinsey 2023 report, Africa will be home to the world’s largest working-age population by 2040. Africa is currently the fastest growing talent market for remote work. The problem is, African-based remote workers struggle to collect their income from employers abroad. They experience challenges around salary delays of up to 2 weeks, high withdrawal charges of up to 15% and and they are constantly being short-changed by the local currency devaluation. CodeLn Pay is an Impact first startup that is helping African youths to mitigate the challenges that are limiting seamless access to decent income. We are addressing financial access challenges that are especially unique to an emerging market like Africa.",
                        "stellar.tractionEvidence": "Highlighting the CodeLnPay Story below to show our product progress, improvement and traction:\n\nOur journey began in the SCF Bootcamp, we came in with just an idea and in 3 days, we were able to design our first prototype with the help of Stellar Engineers and our provided Mentor Stephen Deng, GP at DFS Lab. We took our prototype to market and based on user feedback, we were able to define what our MVP should look like starting with a Web App. \n\nWe got our first grant from Stellar which we used to build our MVP, a web app using SEP 24 anchors: Finclusive, LinkIO, Paychant and Clickpesa. We were able to launch this on the Testnet. \n\nWe got accepted in the Stellar & Draper University’s Astro Hacker House where we got support with launching our product and direct product feedback from our Stellar Mentor, Elliot Voris. With these help, we were able to launch our beta on the Mainnet. We were part of the successful participants who presented before the CEO Of Stellar, Denelle Dixon and Web3 Investor Tim Draper at the end of the Program, the pitch can be found here.\n\nWe were selected to present at Meridian 2024, our CEO gave a demo presentation on the progress of our product, speaker profile here.\n\nWe have successfully launched our beta web app on the mainnet using Paychant, link here. \n\nWe have users signed up from our markets of focus majorly, Nigeria, Ghana and Kenya. Link to some user activities here.",
                        "stellar.goToMarketPlan": "Our current platform is a Web App on SEP 24 where we are able to do fiat to cryto transaction in Nigeria and Ghana. We are going to expand our offerings in these markets and scale to Kenya where we have gotten interest from this market. Our go-to-market strategy will include targeting freelancers and employers by offering a seamless, secure, and cost-effective payment solution. We will leverage platform partnerships, inbound marketing through SEO, content, and influencer partnerships. We will also initiate referral programs, personalized offers, hackathons, and in-app rewards.",
                        "stellar.tranche1Deliverables": "Find a link with more details on our overall budget here.\n\nSummary below:\n\nBrief description: For this deliverable, we will kickstart our Mobile App Development and begin activating SEP 31 Anchor approvals for our current Web App:\n\nDevelop a Wireframe/ LoFi design of Mobile app accounting for each users flow through the system, User Interface Design, Screen Design, Develop Login, Registration and Identity verification processes and develop onboarding processes for users and all essential processes in the mobile app including invoicing, payment requests. Wrap up conversations with Stellar Anchors: Yellowcard and Flutterwave for SEP 31 Integration.\n\nHow to measure completion: Completed User Interface Designs and screens for Mobile App, Users Verification and KYC completed, User Onboarding Completed for new and existing users. Users should be able to issue invoice and request payments. Signed LOIs or approvals from SEP 31 Anchors and access to their APIs or SDKs.\n\nEstimated date of completion: 12.5 weeks\n\nBudget: 41,500",
                        "stellar.tranche2Testnet": "Brief description: For this deliverable, our focus will be on Testnet Anchor Integration, Wallet Implementation, Withdrawal Function, Stellar Transactions on Testnet  & Mobile App Test release:\n\nImplement PayIn UX Flow and Wallet Screens to enable users to create stellar wallets, and request USDC salary payments, Backend Api implementation for pay in process, enabling users to create stellar wallets, and request USDC salary payments and test it  using the stellar test anchor, Implement Cashing out UI screens  and User Flow, ensure the ability to initiate withdrawal and ensure compatibility with the stellar test  anchor, Successful  implementation of cashing out  and cashing in processes on testnet to provide withdrawal options with  Linkio for Nigeria Payments  and Clickpesa for Rwanda and Kenya, Test Application on Anchors Testnet & Release test mobile application on Google playstore for select users.\n\nHow to measure completion: Demonstrate a complete test process on mobile to show invoicing, deposit and withdrawal for both employer and employee on Testnet:\n\nEmployer should be able to see initiate deposit flow on testnet, see rates and complete deposit transaction, Successful registration of employer transactions on the Backend, Employees should be able to see wallet balances and be able to initiate payout to their prefered currencies, Test the payout with simple transactions to Linkio and Clickpesa staging environment, Demonstrate a complete process on mobile, invoicing, deposit and withdrawal on Testnet. Test application on Google Play Store.\n\nEstimated date of completion: 9 weeks\n\nBudget: $30,600",
                        "stellar.tranche3Mainnet": "Brief description: For this deliverable, our focus will be on Mainnet launch, SEP31 Upgrade, Deployment on Mainnet, Mobile App Public Release, User testing & Feedback: Wallet implementation for SEP31 using the Stellar Wallet SDK, API upgrade for SEP31, Conduct final tests for mainnet deployment and Release mobile app on google playstore, IOS to follow, final testing and Web App deployment of SEP31 integration on mainnet.\n\nHow to measure completion: Actual user demonstrates a complete process on mobile using real transactions to show invoicing, deposit and withdrawal on mainnet with the SEP 31 flow.\n\nEstimated date of completion: 5 weeks\n\nBudget: $18,000",
                        "stellar.teamMembers": "Elohor Thomas, Philisiah Mwaluma",
                        "stellar.urls": {
                            "website": "https://pay.codeln.com/",
                            "codeRepository": "https://github.com/CodelnGhana/codelnpay-project",
                            "videoURL": "https://www.youtube.com/watch?v=5Nl4pmJwTr4"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 60066.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 219241.86,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:6",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recXjdDQL2sk7HNKx",
                    "projectId": "daoip-5:stellar:project:a-real-estate-tokenization-platform",
                    "projectName": "A real estate tokenization platform",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recXjdDQL2sk7HNKx",
                    "status": "Awarded",
                    "description": "Verseprop is a commercial real estate tokenization platform, headquartered in London.  It is operational, regulated and revenue producing, having launched in September 2024. It makes real estate debt and equity accessible; faster, more efficiently, and more transparently than traditional Companies.",
                    "fundsApprovedInUSD": 112020.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1u22pBSR_BzXBppQowX-13ZFjmyxzxd0J/edit?usp=sharing&ouid=112480416795641360484&rtpof=true&sd=true",
                        "stellar.productsAndServices": "As regulated platform, Verseprop has already completed its first tokenized real estate credit transaction in the UK and is now starting to integrate into several private real estate companies with the ability to bring scale to the Stellar ecosystem. Existing market coverage includes UK (assets & distribution) and UAE (distribution) with a flexible model to offer equity, debt or hybrid structures.\n\nPlease see link to existing UK regulatory permissions and signed LOI with VARA regulated Broker-Dealer. https://drive.google.com/drive/folders/1FX_cwhGrvHG06vtzmymDZA-_btoNdtza?usp=sharing  \n  \nOur platform offers two distinct services tailored to meet specific client needs:\n\n  \nService #1 Principal-Led Solution: This model focuses on sourcing, underwriting and distributing tokenized real estate equity and debt opportunities through the Verseprop platform. It gives us the ability to target specific sponsors or schemes, i.e. one-off vs programmatic and is particularly attractive for small, medium sized real estate developers / operators who require credit but cannot access through traditional channels, i.e. banks.\n\n  \nService #2 White-Label Solution: This is where our technology solution operates under the client's brand, broadening their investor reach and reducing their costs. The solution is flexible and scalable, delivering a fully branded experience while also providing access to VerseProp’s investor network. It addresses regulatory challenges and streamlines processes such as KYC, investor engagement, management, and payments.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Our Target within 12 months of Mainnet Deployment  \n\n-   Tokenize 30-35 commercial assets on Stellar. Each asset £1-5m.\n    \n-   £100 million in tokenized property assets.\n    \n-   Facilitate c. 500-1,000 primary transactions and an additional 5,000-10,000 transactions for dividend distribution and on-chain management.\n    \n-   Distribute £5 million in dividends and rental yields within 12 months.\n    \n-   Achieve a 70% retention rate with repeat transactions.\n    \n-   Onboard larger-sized assets while maintaining steady transactional growth.\n    \n-   Continue developing partnerships to strengthen distribution networks, enhance credibility, and ensure scalability for future operations adding a minimum of 1 (and possibly 2) locations to support UK and UAE hubs.\n    \n\nBenefits for Stellar Ecosystem:  \n  \nFirstly, we are able to bring immediate scale to the Stellar and, importantly, a diverse client base using our White Label product. This will not only contribute to increased ledger activity and attract new users and liquidity to the network, but also strengthen Stellar's reputation as a preferred blockchain for RWA tokenization.\n\n  \nSecondly, by having Stellar as one of our strategic blockchain partners, we can help drive attention to XLM as a leader in the real estate sector and further showcase blockchain's scalability with practical, real-world applications. Through this integration, we will bring awareness and an untapped user base to the Stellar ecosystem by engaging with developers, lenders, real estate companies and fund, fostering innovation and driving adoption of Stellar for tokenized assets. \n\n  \nLastly, we believe the UK is poised to grow in significance as a Digital Asset Hub based on regulatory changes and appetite from government. Our platform is strategically positioned to deliver a market-leading solution tailored specifically to real estate debt and equity, offering unique value to the Stellar ecosystem from domain experts.",
                        "stellar.tractionEvidence": "Since our last update, Verseprop has made significant progress in regulatory compliance, product development, and strategic partnerships, positioning itself as a market leader in the real estate tokenization sector.\n\nAs referenced in our last submission, Verseprop has now formally signed a broker-dealer LOI to offer compliant and scalable services in the UAE, which will sit alongside its FCA Appointed Representative status in the UK ensuring compliance with regulatory requirements.  \n  \nSince launching in September 2024, Verseprop has made significant progress in regulatory compliance, product development, and strategic partnerships, positioning itself as a market leader in the real estate tokenization space.\n\nIt has already completed a tokenized credit transaction for £240,000 and started to onboard several private real estate companies. In addition, Verseprop’s white-label service empowers real estate businesses to adopt blockchain technology under their branding. Please see link:  \nnexus.mavryk.org/contract/KT1CUKh4VGXuT1vJqgebNwFJZ3CmBRBb2Hm3\n\nVerseprop’s collaborations with globally recognized organizations ensure our platform remains at the forefront of compliance and innovation. Some examples include:\n\n-   RICS Technology Partner: Aligning with global real estate standards.\n    \n-   Strata Global: Principal firm overseeing our Verseprop's regulation as an FCA approved Appointed Representative.\n    \n-   VARA UAE: Collaboration with a Dubai-based partner regulated by the Virtual Assets Regulatory Authority.\n    \n-   Amina Bank (ex Seba): On-ramp and off ramping for both individuals and corporates.\n    \n-   CMS Law: Part of the EquIP accelerator programme from one of the world's largest law firms.\n    \n\n  \nThe UK property market alone offers substantial potential. The market for tokenized real estate in the UK is still in its early stages but rapidly expanding, driven by the increasing demand for alternative investments, exposure to real estate and blockchain-based solutions. With £1.3 trillion in total UK commercial real estate assets and a growing interest in alternative investments, the potential market size is substantial, especially when the model can be replicated in multiple jurisdictions, which Verseprop intends to do.  \n\nVerseprop already has an existing network of private wealth investors (c.75 with the ability to invest £5k up to £5m in a single deal), however where our model is truly compelling is in its integration with existing businesses. This approach allows us to rapidly scale both the volume of assets brought on-chain and the number of users.  \n\nWe also continue to build our Partnerships through broker-dealer relationships that support our growth ambitions and will be part of a trade mission to Hong Kong later this year, as part of an invite from innovative UK Fintechs.  \n\nOur milestones reflect Verseprop's commitment to delivering a compliant, scalable, and innovative platform for real estate tokenization.",
                        "stellar.goToMarketPlan": "Structuring: Start the process of moving asset structures offshore to take advantage of tax benefits and leverage newly emerging tokenization legislation. We currently operate a UK SPV but there is growing demand from international investors for UK based assets. This is being done in collaboration with CMS Law.\n\nSatellite Office: Open satellite office in UAE to support our collaboration agreement and regional expansion. Participating in the Fintech trade mission in Hong Kong to establish distribution in Asia via strategic partnerships, akin to efforts in the UAE. We are currently being assisted by DIFC DIFC | Leading Financial Hub in the MEASA Region and HKinvest InvestHK - Government Department of Foreign Direct Investment | InvestHK  \nLeverage Existing Network: The primary focus of our Go-To-Market Plan has been our - domain expertise, where we can leverage our existing networks with developers, real estate companies and funds giving us access to high quality assets, deal flow and investors. We also rely on a proven track record, having been one of the first platforms to issued tokenized real estate credit with further case studies to follow for both the Marketplace and White Label service.  \n  \nOther forms of customer acquisition include Community Building and Education, where we foster engagement with speakerships and educational content on tokenized real estate. We will be speaking at a number of conferences including Rosenblatt, Digital Asset Regulation Summit and a number of private steering groups with real estate companies.",
                        "stellar.tranche1Deliverables": "Develop Security Token Architecture Using Stellar\n\n-   Utilize Stellar's built-in asset issuance capabilities to create a digital representation of the security token, reflecting beneficial interests.\n    \n-   Define the token's attributes, including asset code and issuer details, ensuring they align with regulatory requirements.\n    \n-   Incorporate compliance measures such as KYC and AML protocols to meet jurisdictional regulations.\n    \n-   Establish trustlines to enable accounts to hold the security token, ensuring only authorized accounts can interact with the asset.\n    \n-   Implement asset control flags to enforce compliance, requiring issuer approval for accounts to hold the token.\n    \n-   Create comprehensive technical documentation detailing the token's architecture, data flow, and integration points within Stellar network.\n    \n-   Develop architecture diagrams to visually represent the system's components and their interactions.\n    \n\nCompletion Measure: Comprehensive technical design document outlining the security token architecture.\n\nEstimated Date of Completion: 2 months from funding award\n\nBudget: $22,340",
                        "stellar.tranche2Testnet": "Develop Security Token Smart Contract for Implementation\n\n-   Develop the application using Stellar SDKs. For advanced programmable logic use Soroban to implement custom functionalities\n    \n-   Conduct unit testing to ensure code quality and functionality.\n    \n-   Completion Measure: Fully implemented and tested security token.\n    \n-   Estimated Date of Completion: 3 months from funding award.\n    \n-   Budget: $13,670  \n    \n\nDevelop User Interface\n\n-   Design and implement a user-friendly interface for issuing and managing tokens.\n    \n-   Integrate functionalities for monitoring token performance and compliance status.\n    \n-   Ensure secure access and data protection within the interface.\n    \n-   Completion Measure: Intuitive user interface for security token management\n    \n-   Estimated Date of Completion: 4 months from funding award.\n    \n-   Budget: $27,340\n    \n\n  \nConduct Security Audits and Testing for Implementation:\n\n-   Engage third-party security experts to perform comprehensive audits.\n    \n-   Conduct penetration testing to identify and mitigate potential vulnerabilities.\n    \n-   Implement necessary fixes and optimizations based on audit findings.\n    \n-   Completion Measure: Security audit reports and a fully secured, optimized token security.\n    \n-   Estimated Date of Completion: 6 months from funding award.\n    \n-   Budget: $35,000",
                        "stellar.tranche3Mainnet": "Mainnet Deployment, Security, and Compliance Features\n\n-   Deploy security tokens on the Stellar mainnet.\n    \n-   Ensure the platform adheres to multi-jurisdictional legal and financial standards.\n    \n-   Completion Measure: Live platform on the mainnet with smart contracts, cross-border payments, and security measures offering access to tokenized real estate debt and equity opportunities.\n    \n-   Estimated Date of Completion: 7 months from funding award.\n    \n-   Budget: $13,670",
                        "stellar.teamMembers": "VERSEPROP",
                        "stellar.urls": {
                            "website": "https://www.verseprop.com",
                            "codeRepository": "https://app.storylane.io/share/l2lj2i6qap6p",
                            "videoURL": "https://share.vidyard.com/watch/WBVfvQTVsB8RteA1dsw8Sd?"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/verseprop",
                            "twitter": "https://www.x.com/verseprop"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 74680.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 251471.79,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-04-02T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:7",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recv1OdCUKlERWHLi",
                    "projectId": "daoip-5:stellar:project:stellarcarbon",
                    "projectName": "Stellarcarbon",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recv1OdCUKlERWHLi",
                    "status": "Awarded",
                    "description": "Stellarcarbon enables Stellar users to contribute to biodiversity projects with confidence and ease, and in 2025 we’ll ship!",
                    "fundsApprovedInUSD": 62000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://github.com/stellarcarbon/sc-website/blob/develop/docs/architecture.md",
                        "stellar.productsAndServices": "We're asking for support to launch Stellarcarbon this coming summer. There are two big work packages we're going to build in parallel:\n\nThe first is to develop a carbon sinking smart contract to enable other Soroban developers to automate compensating for CO₂ emissions through their own contracts, by sending financial support to verified ecosystem restoration projects. We also need to add support for Soroban in our backend so that there is no functional difference between sinking carbon through classic Stellar and through smart contracts. This will introduce the flexibility we need to appeal to builders who are increasingly using Soroban in their products.\n\n  \nThe second package is to finalize the development of our dApp where individuals and small businesses can sink carbon. We have a list of UX issues to improve, and want to do a second round of usability testing to end up with a product that people love to use. This includes communicating clearly how we have a positive impact on climate and biodiversity, because most of our customers have no prior experience with the voluntary carbon market.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "We define our success in terms of integrity and the volume of carbon sunk. The impact projects that are supported through Stellarcarbon need to have a science-based, quantifiable positive impact on biodiversity, climate, and vulnerable communities. Without that integrity, other metrics don’t matter.\n\nThe volume of carbon sunk through Stellarcarbon determines the magnitude of the collective impact made by our customers. This volume is most meaningful when it wouldn’t have happened through other means, or when it replaces the use of eco-credits of lesser integrity than ours. When volume moves from another high-integrity service to Stellarcarbon, it’s still positive for the Stellar ecosystem, but it represents less of an environmental benefit. Finally, there’s the risk of compensation being used for emissions that could have been avoided or reduced at a similar cost, which is detrimental to our success.\n\nWe have calculated the minimum volume that is required for the longevity of our project. It is determined by the break even point where our gross profit equals our operational expenses minus payroll (which can be zero if needed). With our current pricing model, we need to sell 750 tonnes of carbon per year to cover our costs. Our target is to reach this amount 6 months after the launch date.",
                        "stellar.tractionEvidence": "'-   People are already using our earliest demo version app on mainnet right now. We have more than $240 revenue just from demos, 15 distinct pilot users doing 29 transactions in total. This does not include testnet stats, since we don’t preserve data across testnet resets. To verify these stats, see the transaction history in our API, or on stellar.expert.\n    \n-   GiveCredit will use our Soroban contract to further automate carbon credit retirements from the donations of their users.\n    \n-   We have been approached by the lead dev of DeFindex (PaltaLabs), indicating a clear demand for real world eco-assets on Soroban.",
                        "stellar.goToMarketPlan": "Stellarcarbon targets two fundamentally distinct customer segments: retail users and integration partners. While each segment is multifaceted, we can offer a personalized approach to integration partners, and have to think about retail users in terms of profiling and personas.\n\nRetail segment\n\nWe define our retail segment as: the customers that want to access eco-credits to claim the environmental benefit for themselves, and who want to interact with Stellarcarbon through our dApp.\n\nRetail users on Stellar\n\nPeople who already have a non-custodial Stellar wallet or are interested in installing one, experience the least onboarding friction. They don’t have to create any accounts, and the journey from landing on our dApp the first time to sinking their first carbon has taken our pilot users less than two minutes on average. Their second time usually goes even faster.\n\nOur main task in marketing to this audience is to answer questions that are not about Stellar: What is the voluntary carbon market? What does it mean for a carbon credit to have “community and biodiversity benefits”? Why would I spend money on this? How can I see that my contribution actually has a positive impact?\n\nTo reach this audience, we would like to:\n\n-   create better informative content about ReFi and Stellarcarbon\n    \n-   publish testimonials by our pilot customers\n    \n-   host and participate in X spaces and Discord events, working together with Lumen Loop and Stellar Global\n    \n-   leverage our early adopters as ambassadors\n    \n\nReFi enthusiasts\n\nThere is a dedicated and growing community of crypto-savvy people who are passionate about regenerative finance (ReFi). They have an affinity for other blockchains, most notably Celo, Polygon, and Solana. We want to introduce them into the Stellar ecosystem, and pave the way for other ReFi pioneers building on Stellar, such as Geld Network and netzero.kiwi.\n\nWe have been active in the ReFi community for several years (as individuals), on X and Discord. Tribalism has been a barrier to promoting Stellar and Stellarcarbon on some of the most active Discord servers. Through our network, we have gained access to some more chain-agnostic venues (thanks Evan!), which will help Stellarcarbon be part of the conversation.\n\nTo reach this audience, we would like to:\n\n-   announce our launch in the CARBON copy newsletter\n    \n-   become a highlighted project on Giveth\n    \n-   engage with the ReFi DAO community\n    \n-   provide tutorials on our website on how to set up a Stellar wallet and bridge stablecoins\n    \n-   post regular updates on the impact projects we support\n    \n\nNew-to-crypto users\n\nOne of our pilot customers was a first-time dApp user, who had also never used a non-custodial wallet before. We onboarded him from scratch, providing limited wallet installation and on-ramping instructions. Including setup, sinking carbon took around 15 minutes the first time, and 5 minutes the second time. Overall, this was a good experience for everyone involved and we expect him to be a repeat customer.\n\nThe most important characteristic of customers coming from outside the crypto space is that they don’t want to pay with digital assets. To serve this audience, we’ll need to enable debit card payments through a payments processor. The second is that they’re not that interested in the technology, and experience managing and securing their own keypair as friction.\n\nWe can smoothen this journey by building in support for smart wallets with passkeys and/or account recovery (SEP-30). Stellarcarbon can take care of account creation, reserves, and fees, without having to become a custodial wallet provider. Such a solution is out of scope for this submission, and we’re considering it as a post-launch addition. When we are ready to onboard new-to-crypto users, we will focus on simple, relatable campaigns that emphasize the positive environmental impact rather than blockchain technology.\n\nIntegration segment\n\nThe integration segment consists of builders that want to automate their interactions with Stellarcarbon. They can give their users access to eco-credits, claim the environmental benefit for themselves, or do both. These builders are already on Stellar/Soroban, or are willing to join the ecosystem.\n\nOur strategy for engaging with integration partners is tailored. We have the capacity for 1-on-1 conversations with builders who are interested in integrating Stellarcarbon into their software. One of the uncertainties for potential integrators is how much demand for eco-credits there will be within their user base. Having our own retail customers really helps to prove the demand to them. We haven’t been actively reaching out to other builders for the past year or so, and are going to ramp up these efforts paired with our dApp launch.\n\nTo reach this audience, we would like to:\n\n-   add an overview of software integration opportunities on our website\n    \n-   clarify that we can split our sales margin with integration partners\n    \n-   show builders of end-user applications how easy it is to integrate Stellarcarbon into their checkout flow\n    \n-   ask developers of wallets that don’t currently support dApps how we can help to give their users access\n    \n-   reach out to infrastructure providers with an offer to help track their emissions (using tools like CodeCarbon) and reach carbon neutrality\n    \n-   offer a bounty to use DeFi yield for automatic carbon retirements\n    \n-   participate in industry events and increase our visibility there",
                        "stellar.tranche1Deliverables": "[Deliverable 1] Soroban Interface MVP\n\n-   Develop the full sink carbon contract as specified in the technical architecture. Launch a CARBON/USDC liquidity pool on testnet Soroswap. Develop a replenish pool feature in the Stellarcarbon backend.\n    \n-   How to measure completion: contract repo is available on our GitHub featuring the sink carbon contract. The contract can be deployed and invoked in a local sandbox. Our liquidity pool is visible in Soroswap. Whenever the CARBON price there deviates significantly from the price returned by our API, the pool will be automatically rebalanced within minutes.\n    \n-   Estimated date of completion: 8 weeks after award announcement.\n    \n-   Budget: 60 hours development + 60 hours testing x $100/hr = $12,000\n    \n\n[Deliverable 2] dApp frontend UX, content, and styling\n\n-   Testing has revealed numerous improvements that we want to make to the UX. Most revolve around input validation and error handling. We have identified what we can do to guide users through a successful sink carbon flow. Several testers have asked for emissions estimates (e.g. calculators) to be further integrated into our dApp. We’ll rewrite some of our text content and improve on the accessibility of the page layouts.\n    \n-   How to measure completion: the dApp looks and feels complete. A tester can use test.stellarcarbon.io to sink carbon on testnet and manage their account. Some data connections may still be mocked at this stage.\n    \n-   Estimated date of completion: 8 weeks after award announcement.\n    \n-   Budget: 50 hours development + 40 hours testing x $100/hr = $9,000\n    \n\nThese two objectives can be completed independently and in parallel. We’ll have two developers working on them simultaneously, and there are no direct dependencies between the deliverables.",
                        "stellar.tranche2Testnet": "[Deliverable 3] dApp usability improvements\n\n-   We’ll launch the full dApp frontend on testnet at the beginning of this milestone. Our previous testers and newly recruited ones will be provided with a testing protocol, which we’ll use to gather feedback and sort out any remaining issues.\n    \n-   How to measure completion: a usability testing report will be provided.\n    \n-   Estimated date of completion: 12 weeks after award announcement.\n    \n-   Budget: 40 hours usability testing + 40 hours iteration x $100/hr = $8,000\n    \n\n[Deliverable 4] Automate retirements for testing\n\n-   After sinking carbon, the sinking transaction needs to trigger a “retirement” of carbon credits in the Verra Registry. In our testnet app, the corresponding amount of credits currently isn’t retired because the Verra Registry lacks a testing environment for us to develop against. We want to mock this part of the retirement process in our own backend to provide a testing experience that is comparable with the real Verra Registry connection.\n    \n-   How to measure completion: pending retirement balances are automatically retired (after some delay) in our dApp.\n    \n-   Estimated date of completion: 10 weeks after award announcement.\n    \n-   Budget: 30 hours development + 20 hours testing x $100/hr = $5,000\n    \n\n[Deliverable 5] Complete Soroban Interface\n\n-   After deploying our smart contract to testnet, we’ll start integration testing with at least one partner. This will deliver us the insights we need to improve the contract and its documentation. Support for the contract will be added to our backend, including event ingestion and their post-processing into data structures that are compatible with our classic Stellar data.\n    \n-   How to measure completion: sink carbon events (i.e. atomic swaps with metadata) that are generated in Soroban are visible in our testnet API and in the dApp.\n    \n-   Estimated date of completion: 12 weeks after award announcement.\n    \n-   Budget: 45 hours development + 25 hours testing x $100/hr = $7,000\n    \n\nWhile working on this milestone, we will also increase our engagement with the Stellar community. There will be testing opportunities for end-users as well as for developers. As we have done in the past, we’ll want to on-ramp these testers as pilot customers and integration partners.",
                        "stellar.tranche3Mainnet": "[Deliverable 6] Soroban Integration on mainnet\n\n-   Before we can launch on mainnet, we want our contract to be audited and well documented. Since it ties into a larger system, we also need to document the integration between the Soroban events and our backend and the API it exposes. We’ll launch the Soroswap liquidity pool on mainnet. The automatic replenishment feature will be adapted for and deployed in our mainnet backend. We’ll also develop a backup mechanism that publishes ingested contract events in our public data repository.\n    \n-   How to measure completion: it’s possible to obtain and sink carbon through Soroban contract invocations. The resulting events will be visible in our dApp, API, and will show up in our data repo after some time. An audit report of the contract has been published by a reputable 3rd party (provided we have been granted audit credits from the SDF Audit Bank).\n    \n-   Estimated date of completion: 20 weeks after award announcement.\n    \n-   Budget: 40 hours development + 20 hours testing + 40 hours audit process x $100/hr = $10,000\n    \n\n[Deliverable 7] Fully automate retirements for mainnet\n\n-   There are some tricky parts in automating retirements for mainnet. We currently still have a human-in-the-loop process, because errors made in the Verra Registry are immutable. The logic for processing retirements has been specified, but we have yet to identify all edge cases. We’ll develop the solution incrementally, starting with the simple cases for which we haven’t needed manual intervention, and proceeding towards the most challenging case of batching fractional retirements from multiple users into a community certificate.\n    \n-   How to measure completion: sinking transactions will show as retired in our dApp as soon as possible, within a couple of minutes when we can generate an individual certificate. Check the Verra Registry to verify that the retirement has actually happened. Individual certificates will also be emailed to eligible accounts directly by Verra.\n    \n-   Estimated date of completion: 24 weeks after award announcement.\n    \n-   Budget: 50 hours development + 20 hours testing x $100/hr = $9,000\n    \n\n[Deliverable 8] Launch our dApp (retail shop)\n\n-   This is a festive moment: we’ll go live with our dApp on www.stellarcarbon.io, replacing our old website. There should not be much left to do; all the features and content have been completed in other deliverables. We’ll configure our CI/CD pipeline to deploy the production version of the dApp, do some manual testing, and update our DNS records. After we have fully launched, we’ll continue to focus our efforts on marketing and business development. Onward!\n    \n-   How to measure completion: our dApp is live and fully functional on www.stellarcarbon.io.\n    \n-   Estimated date of completion: 24 weeks after award announcement.\n    \n-   Budget: 12 hours development + 8 hours testing x $100/hr = $2,000",
                        "stellar.teamMembers": "Alex Olieman, Adam Menary, Henk",
                        "stellar.urls": {
                            "website": "https://test.stellarcarbon.io/",
                            "codeRepository": "https://github.com/stellarcarbon/",
                            "videoURL": "https://www.youtube.com/watch?v=CX9ar7vkPVQ"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/stellarcarbon"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 41333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 140083.69,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:8",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recrpQc2euTFMrS72",
                    "projectId": "daoip-5:stellar:project:the-give-hub",
                    "projectName": "The Give Hub",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recrpQc2euTFMrS72",
                    "status": "Awarded",
                    "description": "The Give Hub connects global donors with verified projects in remote communities using blockchain and local partners.",
                    "fundsApprovedInUSD": 45000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://thegivehub.com/en/architecture.html",
                        "stellar.productsAndServices": "The Give Hub is a crowdfunding platform connecting global donors with high-impact projects in remote communities. Our key products and services include:\n\n1. Verified Project Funding\n\n-   Stellar Integration: Uses Soroban smart contracts for milestone-based fund release\n    \n-   Impact: Automated verification reduces administrative overhead by 80% and ensures transparent fund management\n    \n\n2. Cross-Border Microlending\n\n-   Stellar Integration: Leverages Stellar's native asset support for multi-currency transactions\n    \n-   Impact: Reduces transfer fees from 6.5% to under 0.1%, enabling viable microlending in remote regions\n    \n\n3. Digital Nomad Verification Network\n\n-   Stellar Integration: Local partners trigger smart contract execution through blockchain-verified updates\n    \n-   Impact: Creates sustainable local employment while ensuring project authenticity through immutable verification\n    \n\n4. Mobile-First Donor Platform\n\n-   Stellar Integration: Integrates Stellar's fast settlement (3-5 seconds) for immediate fund deployment\n    \n-   Impact: Enables rapid response funding and real-time impact tracking for donors\n    \n\n5. Impact Tracking Dashboard\n\n-   Stellar Integration: Records all milestone completions and fund releases on-chain\n    \n-   Impact: Provides donors with transparent, verifiable proof of project outcomes\n    \n\nThese features combine to solve the critical \"last mile\" problem in remote region development funding, while Stellar's blockchain infrastructure ensures security, transparency, and efficiency throughout the process.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "Success Metrics (6-Month Target)\n\n1.  Digital Nomad Network\n    \n\n-   Output: 15 active Digital Nomads across Colombia and East Africa\n    \n-   Impact: Creates sustainable local employment ($300-500/month per Nomad) and establishes initial verification networks in 5-7 key regions\n    \n\n1.  Campaign Success\n    \n\n-   Output: 10 successfully funded projects averaging $5,000 each\n    \n-   Impact: Delivers $50,000 in direct funding to critical community projects like school repairs, water access, and agricultural infrastructure\n    \n\n1.  Financial Inclusion\n    \n\n-   Output: 100+ first-time blockchain users in remote communities\n    \n-   Impact: Introduces accessible financial tools to previously unbanked populations, creating pathways for broader financial participation\n    \n\n1.  Cross-Border Impact\n    \n\n-   Output: Donors from multiple countries (one or more) contributing to remote projects\n    \n-   Impact: Builds direct connections between global capital and local needs, bypassing traditional aid bureaucracy\n    \n\n1.  Cost Efficiency\n    \n\n-   Output: Reduce transfer fees from typical 6.5% to under 0.1%\n    \n-   Impact: Additional $12,750 reaches beneficiaries directly (based on projected $50,000 in donations)\n    \n\nLong-term Community Impact\n\n-   Sustainable Development: Projects are identified and verified by local community members, ensuring relevance and long-term value\n    \n-   Financial Literacy: Each Digital Nomad educates an average of 50 community members on blockchain technology and digital financial tools\n    \n-   Trust Building: Creates verifiable track records for remote communities, enabling future funding opportunities\n    \n-   Local Empowerment: Digital Nomads become tech-enabled community leaders, bridging the digital divide",
                        "stellar.tractionEvidence": "The Give Hub has demonstrated strong early traction and market validation through multiple channels:\n\nUser Demand:\n\n-   25+ potential users on our waitlist for platform launch (Redacted report: https://thegivehub.com/subscribers.php)\n    \n-   Functioning beta platform with complete campaign creation and management capabilities (https://app.thegivehub.com/)\n    \n-   Bilingual website and blog (English/Spanish) with growing organic traffic (https://thegivehub.com/es/)\n    \n\nStrategic Partnerships:\n\n-   Official endorsement from Colombian Senator Maria José Pizarro Rodríguez, providing government-level validation and regional access (PDF: https://thegivehub.com/senator-letter.pdf )\n    \n-   Partnership with Fast Freddie Rodriguez, former US Olympic cyclist, to act as a celebrity spokesperson, expanding our reach into the athletic philanthropy community (Email: https://thegivehub.com/en/fred-email.html)\n    \n-   Network of 12 verified Digital Nomads in Colombia ready to facilitate local project verification\n    \n\nTechnical Readiness:\n\n-   Operational beta platform includes:\n    \n    -   User registration and authentication (https://app.thegivehub.com/registration.html)\n        \n    -   Campaign creation and management interface (https://app.thegivehub.com/)\n        \n    -   Milestone tracking system\n        \n    -   Impact metrics dashboard\n        \n    -   Marketing website (https://thegivehub.com/en/) and blog (https://blog.thegivehub.com/en/)\n        \n-   Mobile-first design ensuring accessibility in remote regions\n    \n-   Multi-language support infrastructure\n    \n\nThis combination of user interest, strategic partnerships, and technical readiness demonstrates clear market validation and positions The Give Hub for successful deployment on the Stellar network.\n\nAdditionally, our team brings decades worth of software engineering experience to the table. This means faster development times, fewer mistakes and high quality solutions delivered on time.",
                        "stellar.goToMarketPlan": "1. Market Entry Strategy\n-----------------------------\n\nPhase 1: Initial Launch (Months 1-2)\n\n-   Geographic Focus: Start with 2-3 specific regions in Colombia\n    \n    -   Selected based on existing connections and senator endorsement\n        \n    -   Areas with demonstrated need and internet connectivity\n        \n    -   Communities with active local leadership\n        \n-   Digital Nomad Program Launch\n    \n    -   Recruit and train initial 5 digital nomads\n        \n    -   Focus on regions with established relationships\n        \n    -   Provide comprehensive platform training\n        \n    -   Equip with necessary tools and documentation\n        \n-   Pilot Projects\n    \n    -   Launch 10-15 carefully selected campaigns\n        \n    -   Focus on quick-win projects (school repairs, water access)\n        \n    -   Document entire process for case studies\n        \n    -   Create success stories for marketing\n        \n\nPhase 2: Expansion (Months 3-4)\n\n-   Geographic Expansion\n    \n    -   Extend to additional regions in Colombia\n        \n    -   Begin operations in one new country\n        \n    -   Target areas with similar socioeconomic profiles\n        \n-   Program Scaling\n    \n    -   Expand digital nomad team to 15-20\n        \n    -   Implement refined training based on pilot feedback\n        \n    -   Establish regional coordination structure\n        \n\n2. Marketing Strategy\n--------------------------\n\nDigital Marketing\n\n1.  Content Marketing\n    \n    -   Impact stories and project updates\n        \n    -   Before/after project showcases\n        \n    -   Community testimonials\n        \n    -   Digital nomad field reports\n        \n1.  Social Media\n    \n    -   Platform-specific content strategy:\n        \n        -   LinkedIn: Professional network engagement\n            \n        -   Instagram: Visual project updates\n            \n        -   Twitter: Real-time updates and community engagement\n            \n        -   YouTube: Project documentation and stories\n            \n1.  Email Marketing\n    \n    -   Weekly project updates\n        \n    -   Monthly impact reports\n        \n    -   Donor newsletters\n        \n    -   Digital nomad field updates\n        \n\nPartnerships & PR\n\n1.  Strategic Partnerships\n    \n    -   Local NGOs and community organizations\n        \n    -   Corporate CSR programs\n        \n    -   Educational institutions\n        \n    -   Religious organizations\n        \n1.  Media Relations\n    \n    -   Press releases for major milestones\n        \n    -   Feature stories in development-focused media\n        \n    -   Local news coverage of projects\n        \n    -   Documentary opportunities\n        \n\nCommunity Building\n\n1.  Donor Community\n    \n    -   Regular virtual updates\n        \n    -   Donor recognition program\n        \n    -   Impact tracking dashboard\n        \n    -   Direct communication with projects\n        \n1.  Project Community\n    \n    -   Success story sharing\n        \n    -   Best practices workshops\n        \n    -   Regional meetups\n        \n    -   WhatsApp groups for project leaders\n        \n\n3. Project Development Pipeline\n------------------------------------\n\nCampaign Creation Process\n\n1.  Initial Assessment\n    \n    -   Community needs evaluation\n        \n    -   Project feasibility study\n        \n    -   Impact metric definition\n        \n    -   Budget planning\n        \n1.  Campaign Setup\n    \n    -   Professional photography/video\n        \n    -   Clear milestone definition\n        \n    -   Impact metric tracking setup\n        \n    -   Local team training\n        \n1.  Launch Support\n    \n    -   Marketing materials creation\n        \n    -   Social media campaign\n        \n    -   Local PR activities\n        \n    -   Donor outreach\n        \n\n4. Metrics & KPIs\n----------------------\n\nSuccess Metrics\n\n-   Number of active campaigns\n    \n-   Total funds raised\n    \n-   Average campaign success rate\n    \n-   Digital nomad productivity\n    \n-   Community engagement rates\n    \n-   Platform user growth\n    \n-   Donor retention rates\n    \n\nImpact Metrics\n\n-   Number of communities served\n    \n-   People impacted per project\n    \n-   SDG alignment scores\n    \n-   Long-term impact measurements\n    \n-   Community feedback scores\n    \n\n5. Risk Mitigation\n-----------------------\n\nOperational Risks\n\n-   Backup digital nomads for each region\n    \n-   Clear escalation procedures\n    \n-   Emergency response protocols\n    \n\nProject Risks\n\n-   Thorough vetting process\n    \n-   Regular progress monitoring\n    \n-   Clear documentation requirements\n    \n-   Multiple verification points\n    \n\n6. Growth Strategy\n-----------------------\n\nShort-term (6 months)\n\n-   Establish presence in 3 countries\n    \n-   50 successful campaigns\n    \n-   30 active digital nomads\n    \n-   $500,000 in processed donations\n    \n\nMedium-term (12 months)\n\n-   Expand to 5 countries\n    \n-   200 successful campaigns\n    \n-   75 active digital nomads\n    \n-   $2M in processed donations\n    \n\nLong-term (24 months)\n\n-   Present in 10 countries\n    \n-   500 successful campaigns\n    \n-   150 active digital nomads\n    \n-   $5M in processed donations\n    \n\n7. Success Enablers\n------------------------\n\n1.  Strong local partnerships\n    \n1.  Digital nomad program\n    \n1.  Clear impact metrics\n    \n1.  Transparent processes\n    \n1.  Community engagement\n    \n1.  Technology platform\n    \n1.  Regular communication\n    \n1.  Quick wins focus",
                        "stellar.tranche1Deliverables": "Tranche 1: MVP Development\n==========================\n\nOverview\n--------\n\nInitial development phase focusing on core platform functionality, basic KYC/AML integration, and essential campaign management features.\n\nTotal Budget: $20,000  \nTimeline: 8 weeks  \nGoal: Production-ready MVP with robust campaign management\n\nDeliverables & Budget Breakdown\n-------------------------------\n\nFrontend Engineering ($8,000)\n\n#### 1. User Authentication and Profile System (50h × $50 = $2,500)\n\n-   User Registration and Login Flow\n    \n    -   Form validation with real-time feedback\n        \n    -   Social authentication integration (Google)\n        \n    -   Session management with JWT\n        \n    -   Advanced error handling and user feedback\n        \n-   Profile Creation and Editing\n    \n    -   Avatar upload and cropping\n        \n    -   Profile completion progress indicator\n        \n    -   Contact information validation\n        \n    -   Dynamic field validation\n        \n-   Email Verification System\n    \n    -   Email template system\n        \n    -   Verification link handling\n        \n    -   Resend verification functionality\n        \n    -   Email delivery tracking\n        \n\n#### 2. Campaign Creation Interface (60h × $50 = $3,000)\n\n-   Campaign Form with Validation\n    \n    -   Dynamic form field validation\n        \n    -   Auto-save functionality\n        \n    -   Draft/preview mode toggle\n        \n    -   Mobile-optimized input fields\n        \n-   Media Upload Functionality\n    \n    -   Image optimization and resizing\n        \n    -   Progress indicators\n        \n    -   Gallery management interface\n        \n    -   Drag-and-drop support\n        \n-   Campaign Preview Mode\n    \n    -   Live preview updates\n        \n    -   Mobile/desktop preview toggle\n        \n    -   Social share preview\n        \n    -   SEO preview\n        \n\n#### 3. Basic Admin Dashboard (50h × $50 = $2,500)\n\n-   Campaign Management View\n    \n    -   Status filtering and sorting\n        \n    -   Bulk action capabilities\n        \n    -   Quick edit functionality\n        \n    -   Advanced search features\n        \n-   User Management Interface\n    \n    -   Role assignment system\n        \n    -   Activity log viewer\n        \n    -   User search and filtering\n        \n    -   Audit trail tracking\n        \n-   Basic Analytics Display\n    \n    -   Daily/weekly/monthly views\n        \n    -   Export functionality\n        \n    -   Key metrics visualization\n        \n    -   Custom date ranges\n        \n\nBackend Engineering ($9,600)\n\n#### 1. Core API Development (70h × $60 = $4,200)\n\n-   RESTful API Endpoints\n    \n    -   Campaign management endpoints\n        \n    -   User management endpoints\n        \n    -   Donation processing routes\n        \n    -   Rate limiting implementation\n        \n-   Data Validation Middleware\n    \n    -   Input sanitization\n        \n    -   Schema validation\n        \n    -   Error handling\n        \n    -   Request/Response logging\n        \n-   Error Handling System\n    \n    -   Standardized error responses\n        \n    -   Error logging\n        \n    -   Client-friendly messages\n        \n    -   Error tracking and analytics\n        \n\n#### 2. Database Schema (30h × $60 = $1,800)\n\n-   MongoDB Collections Setup\n    \n    -   User and profile schemas\n        \n    -   Campaign and milestone schemas\n        \n    -   Transaction history schema\n        \n    -   Indexing optimization\n        \n-   Indexing Strategy\n    \n    -   Performance optimization\n        \n    -   Query pattern analysis\n        \n    -   Search optimization\n        \n    -   Compound indexes\n        \n-   Data Migration Scripts\n    \n    -   Version control\n        \n    -   Rollback procedures\n        \n    -   Data validation\n        \n    -   Data integrity checks\n        \n\n#### 3. Basic KYC/AML Integration (40h × $60 = $2,400)\n\n-   Basic KYC Verification Flow\n    \n    -   ID document upload handling\n        \n    -   Face verification integration\n        \n    -   Address validation system\n        \n    -   Document expiry tracking\n        \n-   Jumio API Integration\n    \n    -   API client implementation\n        \n    -   Webhook handling\n        \n    -   Result processing\n        \n    -   Retry mechanisms\n        \n-   AML Screening Setup\n    \n    -   PEP list integration\n        \n    -   Sanctions checking\n        \n    -   Basic risk scoring\n        \n    -   Audit logging\n        \n\n#### 4. Authentication System (20h × $60 = $1,200)\n\n-   JWT Implementation\n    \n    -   Token generation and validation\n        \n    -   Refresh token handling\n        \n    -   Session management\n        \n    -   Token revocation\n        \n\nBlockchain Engineering ($2,400)\n\n#### 1. Stellar Wallet Integration (30h × $80)\n\n-   Wallet Creation Flow\n    \n    -   Key pair generation\n        \n    -   Testnet account funding\n        \n    -   Balance management\n        \n    -   Error handling\n        \n-   Test Transaction Handling\n    \n    -   Transaction building\n        \n    -   Signature collection\n        \n    -   Status tracking\n        \n    -   Fee management\n        \n-   Balance Checking System\n    \n    -   Real-time updates\n        \n    -   Multi-currency support\n        \n    -   Transaction history\n        \n    -   Balance alerts\n        \n\nSuccess Criteria\n----------------\n\n1.  All detailed items completed and tested\n    \n1.  Working MVP deployed to staging environment\n    \n1.  Complete technical documentation\n    \n1.  Test coverage > 85%\n    \n1.  Basic security audit completed\n    \n1.  Performance benchmarks met:\n    \n    -   API response time < 200ms\n        \n    -   Page load time < 2s\n        \n    -   Successful transaction rate > 99%\n        \n\nDependencies\n------------\n\n1.  Stellar testnet access\n    \n1.  Jumio API credentials\n    \n1.  MongoDB Atlas cluster\n    \n1.  Development environment setup\n    \n1.  CI/CD infrastructure\n    \n\nRisk Mitigation\n---------------\n\n1.  Weekly progress reviews\n    \n1.  Regular code reviews\n    \n1.  Staging environment for testing\n    \n1.  Version control with feature branches\n    \n1.  Automated testing pipeline\n    \n1.  Performance monitoring setup",
                        "stellar.tranche2Testnet": "Tranche 2: Testnet Launch & Smart Contract Development\n======================================================\n\nOverview\n--------\n\nSecond phase focusing on smart contract development, testnet deployment, and Digital Nomad verification system implementation.\n\nTotal Budget: $25,000  \nTimeline: 10 weeks  \nGoal: Complete testnet deployment with full feature set\n\nLaunchKit Access Benefits\n-------------------------\n\n-   Smart contract security audit credits\n    \n-   Infrastructure deployment credits\n    \n-   Technical support access\n    \n-   Development tools and resources\n    \n\nDeliverables & Budget Breakdown\n-------------------------------\n\nFrontend Engineering ($8,000)\n\n#### 1. Digital Nomad Portal (60h × $50 = $3,000)\n\n-   Verification Interface\n    \n    -   Multi-step verification wizard\n        \n    -   Document upload interface\n        \n    -   Progress tracking system\n        \n    -   Real-time status updates\n        \n-   Document Management System\n    \n    -   Multi-file upload handling\n        \n    -   File type validation\n        \n    -   Document categorization\n        \n    -   Version control\n        \n-   Verification Dashboard\n    \n    -   Task management interface\n        \n    -   Notification center\n        \n    -   Activity timeline\n        \n    -   Status tracking\n        \n\n#### 2. Milestone Tracking System (50h × $50 = $2,500)\n\n-   Milestone Creation Interface\n    \n    -   Dynamic form builder\n        \n    -   Budget allocation tools\n        \n    -   Dependency mapping\n        \n    -   Timeline visualization\n        \n-   Progress Tracking\n    \n    -   Real-time progress updates\n        \n    -   Milestone dependencies\n        \n    -   Critical path identification\n        \n    -   Delay notifications\n        \n-   Documentation System\n    \n    -   Media upload manager\n        \n    -   Document organization\n        \n    -   Version control\n        \n    -   Preview functionality\n        \n\n#### 3. Impact Metrics Dashboard (50h × $50 = $2,500)\n\n-   Metrics Visualization\n    \n    -   Custom widget creation\n        \n    -   Real-time data updates\n        \n    -   Interactive charts\n        \n    -   Comparison tools\n        \n-   Reporting Interface\n    \n    -   Report template system\n        \n    -   Custom report builder\n        \n    -   Export functionality\n        \n    -   Scheduled reporting\n        \n-   Data Analysis Tools\n    \n    -   Trend analysis\n        \n    -   Impact forecasting\n        \n    -   Goal tracking\n        \n    -   Performance indicators\n        \n\nBackend Engineering ($9,000)\n\n#### 1. Enhanced Verification System (50h × $60 = $3,000)\n\n-   Multi-step Verification Process\n    \n    -   Status management\n        \n    -   Approval workflows\n        \n    -   Rejection handling\n        \n    -   Appeal process\n        \n-   Document Processing\n    \n    -   Image optimization\n        \n    -   Metadata extraction\n        \n    -   OCR integration\n        \n    -   Fraud detection\n        \n-   Advanced Notification System\n    \n    -   Email notifications\n        \n    -   SMS integration\n        \n    -   In-app notifications\n        \n    -   Notification preferences\n        \n\n#### 2. Enhanced KYC/AML Processing (50h × $60 = $3,000)\n\n-   Advanced Identity Verification\n    \n    -   Multi-document correlation\n        \n    -   Biometric verification\n        \n    -   Address verification\n        \n    -   Identity scoring\n        \n-   Transaction Monitoring\n    \n    -   Pattern detection\n        \n    -   Risk scoring\n        \n    -   Alert generation\n        \n    -   Case management\n        \n-   Compliance Reporting\n    \n    -   Automated report generation\n        \n    -   Regulatory filing\n        \n    -   Audit trail creation\n        \n    -   Compliance dashboard\n        \n\n#### 3. Impact Analytics Engine (50h × $60 = $3,000)\n\n-   Metrics Processing\n    \n    -   Data aggregation\n        \n    -   Custom calculations\n        \n    -   Historical tracking\n        \n    -   Trend analysis\n        \n-   Data Integration\n    \n    -   External data sources\n        \n    -   API integrations\n        \n    -   Data validation\n        \n    -   Error handling\n        \n-   Reporting System\n    \n    -   Template engine\n        \n    -   PDF generation\n        \n    -   Data export\n        \n    -   API access\n        \n\nBlockchain Engineering ($8,000)\n\n#### 1. Smart Contract Development (60h × $80 = $4,800)\n\n-   Campaign Contract\n    \n    -   Fund management logic\n        \n    -   Access control system\n        \n    -   Event emission\n        \n    -   State management\n        \n-   Milestone Contract\n    \n    -   Verification logic\n        \n    -   Fund release conditions\n        \n    -   Multi-signature support\n        \n    -   Milestone tracking\n        \n-   Verification Contract\n    \n    -   Digital Nomad management\n        \n    -   Proof verification\n        \n    -   Status updates\n        \n    -   Dispute resolution\n        \n\n#### 2. Testing and Security (40h × $80 = $3,200)\n\n-   Comprehensive Test Suite\n    \n    -   Unit testing\n        \n    -   Integration testing\n        \n    -   Load testing\n        \n    -   Security testing\n        \n-   Security Implementation\n    \n    -   Access controls\n        \n    -   Input validation\n        \n    -   Error handling\n        \n    -   Rate limiting\n        \n-   Documentation and optimizations\n    \n    -   Code documentation\n        \n    -   Network fee optimization\n        \n    -   Best practices implementation\n        \n\nSuccess Criteria\n----------------\n\n1.  All smart contracts deployed to testnet\n    \n1.  Complete test coverage > 90%\n    \n1.  Digital Nomad system operational\n    \n1.  All integrations functional\n    \n1.  Performance benchmarks met:\n    \n    -   Transaction confirmation < 5s\n        \n    -   Contract execution cost optimized\n        \n    -   API response time < 250ms\n        \n\nDependencies\n------------\n\n1.  Tranche 1 completion\n    \n1.  LaunchKit access\n    \n1.  Testnet resources\n    \n1.  Security audit allocation\n    \n1.  Development tools and services\n    \n\nRisk Mitigation\n---------------\n\n1.  Comprehensive testing plan\n    \n1.  Performance monitoring\n    \n1.  Backup and recovery procedures\n    \n1.  Documentation requirements\n    \n1.  Code review process\n    \n1.  Change management\n    \n1.  Incident response plan\n    \n\nNext Steps\n----------\n\n1.  Smart contract deployment\n    \n1.  Integration testing\n    \n1.  User acceptance testing\n    \n1.  Documentation completion\n    \n1.  Team training\n    \n1.  Monitoring setup\n    \n\nLaunchKit Deliverables\n----------------------\n\n1.  Infrastructure Configuration\n    \n1.  Deployment Documentation\n    \n1.  Performance Analysis\n    \n1.  Best Practices Implementation\n    \n1.  Technical Support Documentation",
                        "stellar.tranche3Mainnet": "Tranche 3: Mainnet Launch & Production Deployment\n=================================================\n\nOverview\n--------\n\nFinal phase focusing on mainnet deployment, production infrastructure, and platform optimization.\n\nTotal Budget: $25,000  \nTimeline: 8 weeks  \nGoal: Production-ready platform with mainnet integration\n\nDeliverables & Budget Breakdown\n-------------------------------\n\nFrontend Engineering ($7,000)\n\n#### 1. Mobile Optimization (60h × $50 = $3,000)\n\n-   Responsive Design Enhancement\n    \n    -   Progressive web app implementation\n        \n    -   Touch interaction optimization\n        \n    -   Offline functionality\n        \n    -   Performance optimization\n        \n-   Mobile-first Features\n    \n    -   Mobile payment flow\n        \n    -   Camera integration\n        \n    -   Location services\n        \n    -   Push notifications\n        \n-   Cross-device Testing\n    \n    -   Device compatibility matrix\n        \n    -   Browser testing\n        \n    -   Performance benchmarking\n        \n    -   Accessibility compliance\n        \n\n#### 2. Multi-language Support (40h × $50 = $2,000)\n\n-   Translation System\n    \n    -   Language selection interface\n        \n    -   Content management system\n        \n    -   Dynamic content loading\n        \n    -   RTL support\n        \n-   Localization Features\n    \n    -   Currency conversion\n        \n    -   Date/time formatting\n        \n    -   Number formatting\n        \n    -   Regional content\n        \n-   Content Management\n    \n    -   Translation workflow\n        \n    -   Content versioning\n        \n    -   Language fallbacks\n        \n    -   SEO optimization\n        \n\n#### 3. Payment Flow Optimization (40h × $50 = $2,000)\n\n-   Donation Interface\n    \n    -   Quick donation options\n        \n    -   Recurring payment setup\n        \n    -   Transaction confirmation\n        \n    -   Receipt generation\n        \n-   Transaction Tracking\n    \n    -   Status updates\n        \n    -   Transaction history\n        \n    -   Payment methods management\n        \n    -   Error recovery\n        \n-   Analytics Integration\n    \n    -   Conversion tracking\n        \n    -   Drop-off analysis\n        \n    -   A/B testing\n        \n    -   Performance metrics\n        \n\nBackend Engineering ($7,200)\n\n#### 1. Performance Optimization (50h × $60 = $3,000)\n\n-   Query Optimization\n    \n    -   Database indexing\n        \n    -   Query caching\n        \n    -   Connection pooling\n        \n    -   Query analysis\n        \n-   Caching Implementation\n    \n    -   Redis integration\n        \n    -   Cache invalidation\n        \n    -   Cache warming\n        \n    -   Memory management\n        \n-   Load Testing\n    \n    -   Stress testing\n        \n    -   Bottleneck identification\n        \n    -   Performance monitoring\n        \n    -   Optimization strategies\n        \n\n#### 2. Security Hardening (40h × $60 = $2,400)\n\n-   Security Implementation\n    \n    -   Vulnerability fixes\n        \n    -   Penetration testing\n        \n    -   Security headers\n        \n    -   SSL configuration\n        \n-   Access Control\n    \n    -   Role-based security\n        \n    -   API authentication\n        \n    -   Session management\n        \n    -   Data encryption\n        \n-   Protection Systems\n    \n    -   Rate limiting\n        \n    -   DDoS protection\n        \n    -   Input validation\n        \n    -   XSS prevention\n        \n\n#### 3. API Documentation (30h × $60 = $1,800)\n\n-   Technical Documentation\n    \n    -   API reference\n        \n    -   Integration guides\n        \n    -   Code examples\n        \n    -   Error documentation\n        \n-   System Architecture\n    \n    -   Component diagrams\n        \n    -   Data flow documentation\n        \n    -   Deployment guides\n        \n    -   Security documentation\n        \n-   Developer Resources\n    \n    -   SDK documentation\n        \n    -   Tutorial creation\n        \n    -   Best practices\n        \n    -   Troubleshooting guides\n        \n\nBlockchain Engineering ($5,200)\n\n#### 1. Mainnet Deployment (40h × $80 = $3,200)\n\n-   Contract Migration\n    \n    -   Parameter configuration\n        \n    -   Network setup\n        \n    -   Fee optimization\n        \n    -   State migration\n        \n-   Security Verification\n    \n    -   Vulnerability scanning\n        \n    -   Access control verification\n        \n    -   Emergency procedures\n        \n-   Production Integration\n    \n    -   Network monitoring\n        \n    -   Transaction verification\n        \n    -   Error handling\n        \n    -   Backup procedures\n        \n\n#### 2. Production Setup (25h × $80 = $2,000)\n\n-   Monitoring System\n    \n    -   Transaction monitoring\n        \n    -   Alert system\n        \n    -   Performance tracking\n        \n    -   Error detection\n        \n-   Recovery Procedures\n    \n    -   Backup system\n        \n    -   Recovery testing\n        \n    -   Incident response\n        \n    -   Continuity planning\n        \n\nDevOps Engineering ($4,200)\n\n#### 1. Infrastructure Setup (25h × $70 = $1,750)\n\n-   Server Configuration\n    \n    -   Load balancing\n        \n    -   Auto-scaling\n        \n    -   Failover setup\n        \n    -   Network security\n        \n-   Monitoring Implementation\n    \n    -   System metrics\n        \n    -   Log aggregation\n        \n    -   Alert configuration\n        \n    -   Dashboard setup\n        \n-   Backup Systems\n    \n    -   Automated backups\n        \n    -   Data replication\n        \n    -   Disaster recovery\n        \n    -   Retention policies\n        \n\n#### 2. CI/CD Pipeline (20h × $70 = $1,400)\n\n-   Deployment Automation\n    \n    -   Build process\n        \n    -   Testing automation\n        \n    -   Deployment scripts\n        \n    -   Rollback procedures\n        \n-   Environment Management\n    \n    -   Staging setup\n        \n    -   Production configuration\n        \n    -   Environment isolation\n        \n    -   Secret management\n        \n\n#### 3. Quality Assurance (15h × $70 = $1,050)\n\n-   Testing Framework\n    \n    -   E2E testing\n        \n    -   Integration testing\n        \n    -   Performance testing\n        \n    -   Security testing\n        \n-   Monitoring Tools\n    \n    -   Error tracking\n        \n    -   Performance monitoring\n        \n    -   User analytics\n        \n    -   System health\n        \n\nQuality Assurance ($1,400)\n\n#### 1. Final Testing (40h × $35)\n\n-   System Testing\n    \n    -   Full platform testing\n        \n    -   Cross-browser testing\n        \n    -   Mobile testing\n        \n    -   Payment testing\n        \n-   Performance Validation\n    \n    -   Load testing\n        \n    -   Stress testing\n        \n    -   Scalability testing\n        \n    -   Recovery testing\n        \n\nSuccess Criteria\n----------------\n\n1.  Successful mainnet deployment\n    \n1.  Production environment operational\n    \n1.  Performance benchmarks met:\n    \n    -   Page load time < 2s\n        \n    -   API response time < 150ms\n        \n    -   99.9% uptime\n        \n    -   Zero security incidents\n        \n1.  Multi-language support verified\n    \n1.  Mobile responsiveness validated\n    \n1.  All documentation completed\n    \n\nDependencies\n------------\n\n1.  Tranche 2 completion\n    \n1.  Infrastructure resources\n    \n1.  Domain configuration\n    \n1.  Production credentials\n    \n\nRisk Mitigation\n---------------\n\n1.  Phased deployment strategy\n    \n1.  Comprehensive monitoring\n    \n1.  Incident response plan\n    \n1.  Backup and recovery procedures\n    \n1.  Rollback procedures\n    \n\nLaunch Requirements\n-------------------\n\n1.  Performance validation\n    \n1.  Documentation completion\n    \n1.  Team readiness\n    \n1.  Support system setup\n    \n1.  Monitoring configuration\n    \n1.  Backup procedures\n    \n1.  Emergency response plan",
                        "stellar.teamMembers": "Kevin Ready, Christopher Robison",
                        "stellar.urls": {
                            "website": "https://thegivehub.com",
                            "codeRepository": "https://github.com/thegivehub",
                            "videoURL": "https://youtu.be/eOjkoQqnWAw"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/thegivehub",
                            "twitter": "https://x.com/therealgivehub",
                            "discord": "https://discord.gg/tJREDeHV"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 30000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 95650.54,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-05-12T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:9",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recbMhw9t64VaUFUP",
                    "projectId": "daoip-5:stellar:project:artizen",
                    "projectName": "Artizen",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recbMhw9t64VaUFUP",
                    "status": "Awarded",
                    "description": "Match funding platform for breakthroughs in art, science, technology, and culture.",
                    "fundsApprovedInUSD": 130000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1wBqqQ7kY1YrC4Y3ftaRinSoSvitdML4xDiuQJMyDzME/edit?usp=sharing",
                        "stellar.productsAndServices": "Enhancing Artizen with Stellar Integration  \n\n1.  NFT Minting: Use Stellar to mint low-cost, fast NFTs, enabling creators to tokenize and monetize their work globally.\n    \n1.  Cross-Border Payouts: Stellar’s infrastructure ensures low-cost, rapid payouts with currency conversion, empowering creators in under-resourced regions.\n    \n1.  Efficient Sponsorship Payments: Stellar streamlines transparent fund transfers from brands to creators, building trust and reducing overhead.\n    \n1.  Expanded Payment Options: Stellar enables diverse payment methods, lowering barriers for fans and increasing project funding.\n    \n\n  \nImpact: Stellar integration makes Artizen faster, cheaper, and more inclusive, scaling our mission to empower creators while advancing Stellar's vision for equitable financial access.",
                        "stellar.successCriteria": "-   100,000 New Users: Drive adoption of Stellar-powered features, expanding financial access for creators globally.\n    \n-   $10M Awarded to Creators: Increase funding to underserved creators, boosting economic opportunities in under-resourced regions.\n    \n-   100 Stellar-Powered Projects: Showcase the impact of fast, low-cost payments and NFTs on creator success.\n    \n-   Global Reach: Empower creators in Africa, Latin America, and beyond with cross-border payment solutions.",
                        "stellar.tractionEvidence": "Traction Evidence for Artizen x Stellar Integration  \n\n1.  Awarded $2M to Creators: Artizen has funded 268 groundbreaking projects across art, science, and technology. This demonstrates our proven ability to attract top creators and successfully scale funding mechanisms.\n    \n1.  Rapid Growth: Artizen’s North Star metric—total money awarded—has more than doubled every season, with projections to surpass $1B awarded by 2028.\n    \n1.  Global Community of Innovators: Over 50,000 creators and fans actively participate on our platform, including award-winning innovators whose projects premiere at events like Sundance and TED.\n    \n1.  Profitable and Scalable: With a sustainable business model generating $350K in revenue this year, Artizen is already profitable and rapidly expanding.\n    \n1.  Brand Partnerships: Trusted by global leaders like Filecoin, Microsoft, and the Tribeca Film Festival, Artizen consistently drives ecosystem growth for sponsors.  \n    \n\nThese milestones validate Artizen’s capability to execute and scale initiatives, providing a solid foundation for Stellar integration to amplify our impact.",
                        "stellar.goToMarketPlan": "Our go-to-market strategy is bold and visionary: we’re partnering with cultural icons like the Wu-Tang Clan, groundbreaking scientists like Brian Cox, and visionary artists like Grimes to launch Stellar-powered creative projects that captivate global audiences. With a track record of working with legends like Jonny Greenwood of Radiohead, filmmaker Darren Aronofsky, and Patti Smith, we’ll use these relationships to secure high-profile sponsorships and drive mass adoption. Having awarded $1.7M through partners like Microsoft and Unity, we’re now aiming to collaborate with brands like Adobe and Meta to award $10M to creators in the next 24 months.",
                        "stellar.tranche1Deliverables": "Deliverable 1: Integration of Stellar NFT Minting for Artifacts\n\n-   Description: Implement core functionality to mint Artifacts as NFTs on Stellar, with metadata stored on IPFS/Arweave. This includes developing a user interface for creators to tokenize their work and creating wallet integration for receiving NFTs.\n    \n-   How to Measure Completion: Successful minting of an Artifact NFT on Stellar by a creator, with metadata stored off-chain and linked to the NFT. Demonstration of the functionality in a live staging environment.\n    \n-   Estimated Date of Completion: Month 2\n    \n-   Budget: $45,000 (Development costs, blockchain integration, frontend/backend engineering, IPFS/Arweave storage setup).\n    \n\nDeliverable 2: Cross-Border Payouts via Stellar\n\n-   Description: Develop the backend system for cross-border payments using Stellar’s PathPaymentStrictSend operation. Integrate with Stellar Anchors to provide fiat on/off ramps for payouts in local currencies.\n    \n-   How to Measure Completion: Completion of a successful test payment from a sponsor to a creator, with currency conversion and withdrawal through an anchor.\n    \n-   Estimated Date of Completion: Month 3\n    \n-   Budget: $20,000 (Smart contract development, integration with Stellar Anchors, payment gateway setup).",
                        "stellar.tranche2Testnet": "Deliverable 3: Stellar Testnet Deployment for Core Features\n\n-   Description: Deploy and test NFT minting, cross-border payouts, and sponsorship payment features on Stellar Testnet. Build in feedback mechanisms for creators and sponsors.\n    \n-   How to Measure Completion: Successful deployment on Testnet with end-to-end testing of core features, including minting, payouts, and payments. Documented feedback from beta testers.\n    \n-   Estimated Date of Completion: Month 4\n    \n-   Budget: Access to Stellar LaunchKit resources (no XLM award for this tranche).",
                        "stellar.tranche3Mainnet": "Deliverable 4: Launch on Stellar Mainnet\n\n-   Description: Deploy the full Stellar integration on Artizen’s platform, including NFT minting, payouts, and sponsorship payments. Ensure integration with Stellar Anchors for fiat conversions and finalize user onboarding experience.\n    \n-   How to Measure Completion: Public launch on Stellar Mainnet with live transactions. Demonstration of successful NFT minting, payouts, and sponsorship payments by real users.\n    \n-   Estimated Date of Completion: Month 6\n    \n-   Budget: $65,000 (Final engineering, security audits, deployment costs, user onboarding support).",
                        "stellar.teamMembers": "René Pinnell",
                        "stellar.urls": {
                            "website": "https://artizen.fund/",
                            "codeRepository": "https://github.com/artizen-fund",
                            "videoURL": "https://youtu.be/kMh951LGV3U"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/artizenfund"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 43333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 130644.85,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-02-11T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:10",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recCdH1be0EVloiFQ",
                    "projectId": "daoip-5:stellar:project:outbounder",
                    "projectName": "Outbounder",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recCdH1be0EVloiFQ",
                    "status": "Awarded",
                    "description": "Outbounder offers organizations seamless, automated cross-border payroll and aid disbursements via Stellar with built-in on/off-ramp and permission controls.",
                    "fundsApprovedInUSD": 38000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/124bxcHLPIa2FCjlNyhhrUnTyN7_ieYYgYOBsmy5wxeY/edit?usp=sharing",
                        "stellar.productsAndServices": "'- Core Offering\n- A software service that lets companies and NGOs schedule, automate, and manage fiat-crypto payroll & aid payments on Stellar without direct blockchain interaction.\n- Key Features\n- Automated Payment Schedules\n    - Create one-off or recurring disbursements (e.g. monthly payroll, weekly aid grants) via the dashboard, with configuration through industry-standard CSV or our frontend interface that manages and triggers Stellar transactions.\n- On-Ramp / Off-Ramp (SEP-6 & SEP-24)\n    - Integrated fiat on- and off-ramp flows through SEP-6/24 anchors for USD, EUR and other currencies.\n- Cross-Border FX & Path Payments\n    - Native Stellar path-payment support for best-rate FX, routing payments through pools or anchors automatically. (also Soroban pools if they show they can handle stable rates, as we would require)\n- Granular Permissions\n    - Role-based access: define who can initiate, approve or audit payments within your organization.\n- Partner-Wallet Integration\n    - Recipients can receive funds in any supported Stellar wallet (Initially Vibrant, Beans, and Lobstr).",
                        "stellar.successCriteria": "'- Success Criteria:\n    - By the start of 2026, we will consider Outbounder a success if we have:\n- $20,000+ USD in Monthly Disbursements\n        - Processed, including both payroll and humanitarian-aid payments, through fully automated schedules and path-payment FX routing on Stellar.\n- 10+ Onboarded Organizations\n        - A diverse set of NGOs, enterprises, and pilot partners actively using Outbounder for live payouts.\n- 500+ Unique Recipients Served\n        - End-users (employees, aid beneficiaries, contractors) receiving funds via our partner anchor network and supported Stellar wallets.\n- 2+ Live Anchor Integrations\n        - Full SEP-6/24 on- and off-ramp flows with at least two major stablecoin anchors (USDC, EURC) in production.\n- Measurable On-Chain Liquidity Growth\n        - A demonstrable increase in on-chain volume and tighter path-payment spreads. Showing that Outbounder’s automated flows help strengthen FOREX rates and rival traditional payment rails in cost, speed, and flexibility.",
                        "stellar.tractionEvidence": "From July of 2023, to June of 2024, Stream executed thousands of transactions daily, sending an average of nearly $3,500 in monthly outbound transaction volume across 50+ liquidity pools. Every log across our 5 previous customers can be audited there, along with their token amounts, payment hashes, timestamps, and other metadata (check the \"logs\" folders) :  \nhttps://drive.google.com/drive/folders/10jelcFcxPcPdI2oSNwutwAMmYb0CkN9L?usp=sharing\n\nAt peak, Stream processed $5,000 in monthly payment volume, sending hourly transactions to thousands of addresses in a scalable, reliable manner.",
                        "stellar.goToMarketPlan": "'- Primary Audience:\n    - NGOs and humanitarian organizations needing streamlined cash assistance disbursements\n    - Enterprises and payroll processors seeking automated cross-border payroll solutions\n- Secondary Audience:\n    - Anchors and liquidity providers looking to expand stablecoin on/off-ramp usage\n    - Market makers, DeFi projects, and traditional businesses exploring on-chain financial rails\n- Market Trends\n    - Rapid growth in blockchain adoption for B2B and B2C payments\n    - Rising demand for turnkey on/off-ramp solutions in global remittances\n    - Shift towards programmatic, scheduled payouts in payroll and aid programs\n    - Increased regulatory scrutiny driving need for built-in KYC/AML workflows (SEP-12)\n- Value Proposition\n    - Simplified Onboarding: No blockchain expertise required, users interact via intuitive UI\n    - Automated Scheduling: One-off and recurring payouts for payroll and humanitarian aid\n    - Best-Rate FX & Anchors: Dynamic path payments and integrated SEP-6/24 on/off-ramp with major USDC/EURC anchors\n    - Compliance-Ready: Built-in SEP-12 KYC (for organizations, may be a more manual solution depending on what MyKobo and other anchors are able to provide), detailed audit logs, and role-based permissions\n- Marketing Strategy\n    - Positioning: Outbounder as the go-to platform for automated, compliant cross-border payments and humanitarian aid.\n- Channels:\n    - Digital campaigns on Stellar Global & Developer Discords, Anchor Directory forums\n    - Content marketing: blog posts, case studies, partner co-authored articles\n    - live demos targeting NGOs and corporate treasuries\n    - Community Engagement: Regular project updates on Stellar Discord, hackathons, and AMAs\n- Sales Strategy\n    - Direct Outreach: Leverage SCF network to engage anchor partners and enterprise leads\n    - Partner Referrals: Incentivize existing pilot organizations and anchor Partners to refer new customers\n    - Pricing: Free pilot tier covering up to $10k/month volume; tiered subscription based on recipient count thereafter.\n- Launch Plan\n- Pre-Launch: Beta testing with 3–5 pilot organizations (late 2025/early 2026)\n    - Official Launch: Public mainnet release and announcement via social channels and blogs (August 2025)",
                        "stellar.tranche1Deliverables": "'- Deliverable 1: Supabase Core & Data Model\n    - Brief description: Define and deploy the Supabase schema covering authentication (JWT/OAuth2, SEP-10), organization and member tables with RLS policies, KYC/AML fields (SEP-12), payment schedules, and audit logs. Establish row‑level security to enforce granular permissions for payroll and aid administrators.\n    - How to measure completion: project live with working signup/login flows, organization creation, role assignments, and enforced policies; database tables populated and accessible via Supabase Studio.\n    - Estimated date of completion: 2025-04-20\n    - Budget: $1,000\n- Deliverable 2: Authentication & Permissions Service\n    - Brief description: Implement authentication and authorization APIs using Supabase edge functions and Go microservices: JWT-based login, OAuth2 integration, SEP-1 Stellar account onboarding, Multisignature account setup, etc\n    - How to measure completion: functions and Go endpoints return valid tokens, create and configure Stellar accounts with correct thresholds, accept and store KYC payloads; integration tests for login, account creation, and permissions enforcement pass.\n    - Estimated date of completion: 2025-05-25\n    - Budget: $6,000\n- Deliverable 3: Next.js Frontend & Organization Dashboard\n    - Brief description: Build the Next.js App Router frontend for Outbounder: secure pages for organization management, payment schedule creation and editing, real‑time status updates via subscriptions, and audit log viewer. Include responsive, accessible UI.\n    - How to measure completion: Vercel deployment available at outbounder.xyz with production‑ready pages for user registration, dashboard views, schedule CRUD, and live updates; UI tests validate workflows.\n- Estimated date of completion: 2025-06-25\n    - Budget: $10,000\n- Deliverable 4: Go Worker Queue & Stellar Protocol Integration\n    - Brief description: Develop a Go worker service to process scheduled jobs from Supabase triggers: implement SEP-6/SEP-24 fiat on-/off‑ramp flows with USDC/EURC anchors, dynamic path‑payment FX routing, and account operations (key rotations, threshold updates) on testnet.\n    - How to measure completion: Worker dequeues schedule jobs, executes on‑chain operations end‑to‑end on testnet anchors, logs transaction hashes back to Supabase; automated tests for on‑ramp, payout, and off‑ramp scenarios succeed.\n    - Estimated date of completion: 2025-07-15\n    - Budget: $8,000\n- Deliverable 5: End‑To‑End Payroll & Aid Automation\n    - Brief description: Complete implementation of automated payroll and humanitarian assistance workflows: recurring and one‑off payment schedules, off‑ramp integration, audit log exports, and recipient notifications. Ensure UX for both employers and aid coordinators is seamless.\n    - How to measure completion: Demo of testnet flows for at least two pilot organizations successfully scheduling, executing, and reconciling payroll and aid disbursements; audit logs and CSV exports available in the UI.\n- Estimated date of completion: 2025-08-10\n    - Budget: $8,000",
                        "stellar.tranche2Testnet": "- Deliverable 1: Polish & Integration\n    - Brief description: Complete documentation, debugging, and seamless frontend integration of Supabase and Next.js components for the payroll service on Testnet.\n    - How to measure completion: All code paths documented; UI and backend fully debugged; integration tests pass with Supabase subscriptions driving live updates.\n    - Estimated date of completion: 2025-08-15\n    - Budget: $0\n- Deliverable 2: Audits And Testing\n    - Brief description: Load, scale, and reliability testing of automated payroll flows on Testnet, including cross-border payments, contractor payroll, and off-ramp scenarios.\n    - How to measure completion: Successful execution of all predefined test cases for multi-currency transactions; performance benchmarks met.\n- Estimated date of completion: 2025-08-30\n    - Budget: $0",
                        "stellar.tranche3Mainnet": "'- Deliverable 1: Mainnet Deployment & Anchor Integration\n    - Brief description: Deploy Outbounder’s full payroll and humanitarian aid modules to Stellar mainnet. Integrate with at least two live anchors (USDC & EURC) for secure on-/off-ramp flows.\n    - How to measure completion: Successful end-to-end live transactions executed on mainnet; anchor partner sign-offs; production frontend and worker pointing to mainnet.\n    - Estimated date of completion: 2025-09-15\n    - Budget: $2,000\n- Deliverable 2: Monitoring, Documentation & Pilot Onboarding\n    - Brief description: Set up production monitoring and alerting (Prometheus/Grafana), finalize user and developer documentation (audit exports, API guides), and begin outreach for onboarding (pilots programs and beta testers).\n    - How to measure completion: Monitoring dashboards and alerts active; docs published; A beta tester successfully operates a small testing pilot either on testnet or using small amounts on the main net.\n- Estimated date of completion: 2025-09-20\n    - Budget: $5,000",
                        "stellar.teamMembers": "Amrith",
                        "stellar.urls": {
                            "website": "https://tumbl.xyz",
                            "codeRepository": "https://docs.google.com/document/d/1RA6a9VxjTbEpR7ysVYvPGxE0ZI5hEtFEkkCy3Qjx7xQ/edit?usp=sharing",
                            "videoURL": "https://vimeo.com/1043319758?share=copy"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/in/amrith-srinivas-8a4b06262/"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 12666.67,
                                "denomination": "USD"
                            },
                            {
                                "amount": 40339.92,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-02-10T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:11",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec9omQfwyAe5KiKD",
                    "projectId": "daoip-5:stellar:project:blindpay",
                    "projectName": "BlindPay",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec9omQfwyAe5KiKD",
                    "status": "Awarded",
                    "description": "Stablecoin API and regulatory infrastructure for global on/offramping.",
                    "fundsApprovedInUSD": 40000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1tXGALHBpMhbATfSnPKARBqctoyGoRPuge4Ukiv8j_Hc/edit?usp=sharing",
                        "stellar.productsAndServices": "BlindPay is a payment processor that allows you to convert stablecoins into fiat currency or fiat currency to stablecoins.  \n  \nWe don't have custody of users funds, which means we do NOT provide any wallet, and all failed payments will have the funds returned to the same wallet that started the payment. You can check more details here: https://blindpay.com/docs\n\nWe also have some customers waiting for stellar integration like Zenith Protocols (https://orbitcdp.finance/) and RampMeDaddy (https://rampmedaddy.com/).",
                        "stellar.successCriteria": "$1M in Total Payment Volume using stellar blockchain in the next 6 months from mainnet implementation.",
                        "stellar.tractionEvidence": "https://docs.google.com/document/d/1UPOhH58Zt_f9tBa5gs1BpGXCfcX8nzJxm6ROcKTwPt0/edit?usp=sharing",
                        "stellar.goToMarketPlan": "'-   Partner with EasyA (Phil and Dom) to tap into their developer network:\n    \n    -   Present at their in-person hackathons\n        \n    -   Host integration workshops for participating developers\n        \n    -   Create hackathon challenges focused on our on/off ramp integration\n        \n    -   Offer special incentives for hackathon participants\n        \n-   Launch with committed early adopters:\n    \n    -   Prioritize integration with Zenith Protocols (Orbit CDP)\n        \n    -   Support RampMeDaddy's implementation\n        \n    -   Document these implementations as case studies\n        \n    -   Leverage their successful integrations for social proof\n        \n-   Create developer-focused content:\n    \n    -   Technical documentation optimized for developer experience\n        \n    -   Integration tutorials and sample code\n        \n    -   Video walkthrough of implementation process\n        \n-   Build developer advocacy program:\n    \n    -   Identify and nurture relationships with active Stellar developers\n        \n    -   Create incentives for early adopters who become product advocates\n        \n    -   Establish developer feedback loop for product improvements",
                        "stellar.tranche1Deliverables": "[Deliverable 1]  \n\nImplementation of testnet Faucet for stellar assets in our existing developer portal.  \n\nHow to measure completion: Log into the existing developer portal and have the ability to mint USDC for testing purposes in the Stellar network  \n\nEstimated date of completion: 1 week after grant date\n\nBudget: 3,750  \n\n[Deliverable 2]  \n\nAdapt the current SDK to integrate with Stellar, implementing the proposed flow with Claimable Balances. This involves modifying the SDK and our API, while maintaining compatibility for our current customers. Our company serves customers that are currently in operation and in order to maintain our high standards of security and compliance, a new continuous integration/continuous deployment (CI/CD) pipeline will be set up to test the Stellar workflow thoroughly in an automated environment (using the stellar/quickstart docker image).  \n\nHow to measure completion: Reviewers can either implement our SDK or use our demo implementation purpose-built for this submission (very lean Stellar wallet with off-ramp capabilities).  \n\nEstimated date of completion: 5 weeks after grant date\n\nBudget: 18,750",
                        "stellar.tranche2Testnet": "[Deliverable 1]  \n\nImplementation of the Stellar Signer API, this is so the signing server is segregated from the public API into its own private network and with its own signing validation rules (e.g. as to not sign transactions blindly).  \n\nHow to measure completion: Updated technical architecture & network diagram for review.  \n\nEstimated date of completion: 2 weeks from Grant Date\n\nBudget: 7,500",
                        "stellar.tranche3Mainnet": "[Deliverable 1]  \n\nIntegration of the Claimable Balances workflow with all BlindPay features like blockchain screening, KYC levels, transaction monitoring and fiat money transfers.\n\nHow to measure completion: End-to-end off-ramp using BlindPay on mainnet.  \n\nEstimated date of completion: 2 weeks from Grant Date\n\nBudget: 10,000",
                        "stellar.teamMembers": "Bernardo Simonassi",
                        "stellar.urls": {
                            "website": "https://blindpay.com/",
                            "codeRepository": "https://docs.google.com/document/d/1g2kD1R0UsrmtdXYbf39AtxqeiUcC9DAWAVKm1yf_siY/edit?usp=sharing",
                            "videoURL": "https://youtu.be/lhwJBIy241o",
                            "pitchDeck": "https://papermark.io/view/clvr0q6lm0006y0mb9qgbcbde"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/blindpay",
                            "twitter": "https://x.com/blindpaylabs"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 13333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 39362.94,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Applications"
                    },
                    "completionPercentage": 33.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:12",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recwkBsoW10eSCw85",
                    "projectId": "daoip-5:stellar:project:sorobanhooks",
                    "projectName": "SorobanHooks",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recwkBsoW10eSCw85",
                    "status": "Awarded",
                    "description": "A real-time webhook-driven platform for developers to automate contract deployment, event monitoring, and cross-chain transactions on Stellar and Soroban.",
                    "fundsApprovedInUSD": 25000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://drive.google.com/file/d/167c6KVuyvRo7haInUahDfeMRxkO8gya3/view?usp=sharing",
                        "stellar.productsAndServices": "Problem:\n\nDevelopers and non-technical users in the Stellar ecosystem face significant challenges when setting up real-time event tracking for on-chain and cross-chain activities. The process can take up to a week, requiring them to:\n\n-   Understand API flows.\n    \n-   Set up servers and integrate with Stellar APIs.\n    \n-   Write custom code for each specific event, which varies by product and workflow.\n    \n\nOver time, managing this setup at scale becomes increasingly difficult due to:\n\n-   High costs and resource demands.\n    \n-   Challenges in tracking failed or pending transactions, unusual activities, and system health.\n    \n\nWhile developers have the technical capability, this process is time-consuming, resource-intensive, and lacks a simple plug-and-play solution. Non-technical users, on the other hand, are left with no feasible options to implement such solutions.\n\nSolution:\n\nSorobanhooks is an all-in-one automation and real-time event tracking platform tailored for the Stellar and Soroban ecosystem. It simplifies and streamlines operations with:\n\n-   Plug-and-play webhooks and integrations with third-party platforms like Slack or Telegram.\n    \n-   Customizable workflows with real-time event data and analytics dashboards.\n    \n-   Cross-chain activity tracking and reporting tools for seamless scalability.\n    \n-   Additional features like smart contract testing and deployment in just a few clicks.\n    \n\nThis solution drastically reduces the time, cost (up to $100k in year depending on scale), and effort for developers and product owners, enabling them to scale their projects efficiently while maintaining real-time oversight and control.\n\nProduct & Features:\n\n1.  Soroban Event Notifier to track contract events,\n    \n1.  Soroban Transaction Tracker for live updates on transaction statuses,\n    \n1.  Soroban Balance Watcher to monitor account balances,\n    \n1.  Soroban Contract Deployer for seamless contract deployment\n    \n1.  Soroban Cross-Chain Bridge Monitor to track cross-chain transfers.\n    \n\nHow to Use:\n\n1.  Sign Up: The developer signs up on Sorobanhooks and creates an account.\n    \n1.  Create a New Project: The developer creates a new project within Sorobanhooks to track event or deploy smart contract.\n    \n1.  Configure Webhooks: They set up webhooks for specific events, such as contract deployment, token transfers, or balance changes.\n    \n1.  Deploy Contract or import : Using the Sorobanhooks interface, the developer deploys their Soroban smart contract or import\n    \n1.  Real-Time Monitoring: As events occur (e.g., a token transfer or contract state change), the webhooks automatically notify the developer’s endpoint with real-time updates.\n    \n1.  Action Automation: The developer can automate workflows based on these notifications, such as executing additional contract actions or triggering external services\n    \n\nDemand From Market :\n\n1.  Developer Bottlenecks : Developers want a plug-and-play solution to automate repetitive tasks like event tracking, transaction monitoring, and smart contract deployments, freeing up resources for core development work.\n    \n1.  Expanding Ecosystem : A platform that bridges multi-chain monitoring and automation within Stellar and Soroban is critical for this growing audience.\n    \n1.  Inclusion of Non-Tech Users : A tool like Sorobanhooks simplifies access for non-technical users, making blockchain technology more inclusive and enabling faster adoption.\n    \n1.  Current Market Gaps : A centralized, scalable platform eliminates these pain points by providing an all-in-one solution for automation, reporting, and monitoring.\n    \n1.  Expanded Demand with Mobile & Web Push Notification Integrations: In addition to the real-time event monitoring and cross-chain tracking, there is increasing demand for mobile and web push notifications for seamless user engagement.This integration will allow users to set up their webhooks to automatically trigger push notifications, reducing the need for custom development and enhancing the flexibility of the platform.\n    \n\nValidation & Opportunities:\n\n-   Early Feedback: Discussions with 10+ projects in the Stellar ecosystem have revealed that most lack the resources to build such tools in-house.\n    \n-   Adoption Potential: A streamlined solution that reduces time-to-market for blockchain projects can attract a broad spectrum of users, from small startups to enterprise-level players.\n    \n-   Cross-Chain integration with top platforms and dApps : Ethereum, Binance Smart Chain (BSC), Polygon, Avalanche, Solana, Cosmos (IBC) Polkadot, Arbitrum, Celo, Cardano, Uniswap, Aave, Curve. Finance, PancakeSwap, SushiSwap, QuickSwap, Wormhole, AnySwap, Chainlink, Balancer\n    \n\nChallengers for developers and businesses:\n\n-   Lack of Technical Resources : Many of these projects had small teams with limited technical expertise, particularly in backend development or API integration.\n    \n-   Time-Consuming Development Process : Teams were spending 1-2 weeks building webhook systems, testing integrations, and troubleshooting issues instead of focusing on core product development.\n    \n-   Scaling Challenges : Projects that had implemented basic webhook systems were struggling with scalability as transaction volumes grew, leading to server crashes, delays, and high maintenance costs. Handling custom web and mobile push notification.\n    \n-   Difficulty Tracking Custom Events : Every project had unique workflows and required custom event triggers that were difficult to implement with existing tools.\n    \n-   Non-Technical User Challenges : Non-developer stakeholders in projects couldn’t easily stay informed about on-chain events without constant developer support.\n    \n-   Limited Monitoring for Cross-Chain Activity : Projects working on cross-chain interoperability couldn’t find tools that provided real-time tracking of asset transfers across chains.\n    \n-   Inadequate Reporting and Analytics : Basic webhook implementations didn’t offer dashboards or analytics, making it hard for teams to analyze trends or troubleshoot issues.\n    \n-   High Maintenance Costs : Projects that had built custom webhook systems faced high maintenance costs, including server hosting, debugging, and scaling infrastructure.\n    \n\nWhy Our solution is necessary when many of the offered features can be easily implemented by developers :\n\n-   Time-Saving: Developers spend weeks or months setting up real-time event monitoring, webhook infrastructure, and cross-chain integrations.\n    \n-   Resource Optimization : Building these features requires dedicated server infrastructure, reliable APIs, custom error handling, and cross-chain expertise—demanding resources that many startups and teams don’t have.\n    \n-   Scalability : Custom implementations are often difficult to scale as user traffic grows or workflows become more complex.\n    \n-   Maintenance and Reliability: Maintaining a custom-built webhook system requires constant monitoring, debugging, and updates—a significant drain on resources.\n    \n-   Multi-Feature Integration: Developers must implement multiple independent features, such as transaction tracking, balance monitoring, and cross-chain operations, which require unique implementations for each.\n    \n-   Accessibility for Non-Tech Users : Non-technical product owners and business teams cannot easily interpret or act on raw data from APIs and blockchain transactions.\n    \n-   Focus on Stellar and Soroban Ecosystem : Generic webhook tools lack tailored support for Stellar/Soroban’s unique workflows and requirements.\n    \n\nUnique Value Proposition :\n\n-   Tailored for Stellar and Soroban: Unlike generic webhook or automation platforms, Sorobanhooks is purpose-built for Stellar and Soroban, providing seamless integration with their APIs, event types, and transaction workflows.\n    \n-   Plug-and-Play Simplicity: Sorobanhooks eliminates the need to set up servers, write custom webhook code, or understand intricate API flows. It provides ready-to-use tools and templates for rapid deployment.\n    \n-   Unified, All-in-One Platform: Combines essential features—like real-time event notifications, transaction tracking, balance monitoring, and cross-chain workflows—into a single dashboard.\n    \n-   Accessible for Non-Tech Users: Offers intuitive dashboards and third-party integrations (e.g., Telegram, Slack), making it easy for non-technical users to monitor and act on blockchain events.\n    \n-   Cost-Efficiency and Scalability: Provides a fully managed, scalable service for Stellar workflows, eliminating infrastructure, maintenance, and error-handling costs for users.\n    \n-   Advanced Workflow Customization: Enables developers to set up custom webhooks, analytics, and workflows specific to their product needs, with minimal effort.\n    \n-   Cross-Chain Support : Includes tracking and monitoring of cross-chain transactions, an often-overlooked but critical feature for multi-blockchain projects. Some of the platform like ( Ethereum, Binance Smart Chain (BSC), Polygon, Avalanche, Solana, Cosmos (IBC) Polkadot, Arbitrum, Celo, Cardano, Uniswap, Aave, Curve. Finance, PancakeSwap, SushiSwap, QuickSwap, Wormhole, AnySwap, Chainlink, Balancer) can use our platform for different usecases.\n    \n-   Time-Saving Deployment Features: Offers smart contract testing and deployment tools, automating key steps of the development lifecycle.\n    \n\nPITCH DECK DEMO : https://www.youtube.com/watch?v=3DiR3XWCDCg\n\nSCF#31 Feedback clarification in detail : https://bit.ly/4fJRujw",
                        "stellar.successCriteria": "1.  User Adoption & Retention: Track the number of developers and projects using SorobanHooks, along with retention rates and daily active users to gauge long-term engagement.\n    \n1.  Webhook Usage & Activity: Measure the number of webhooks created, transactions monitored, and events triggered to understand product utilization and scalability.\n    \n1.  Cross-Chain Transaction Volume: Monitor the volume of cross-chain transactions facilitated by SorobanHooks to assess its effectiveness in solving real-world problems.\n    \n1.  Community Engagement: Evaluate participation in forums, GitHub contributions, and feedback from developer communities to ensure we are meeting user needs.\n    \n1.  Customer Satisfaction & Feedback: Collect user feedback through surveys, support interactions, and community forums to continuously improve the product.",
                        "stellar.tractionEvidence": "Traction Evidence  \n\nWe've attracted interest from two SCF projects eager to explore our tools. \n\nWaitlist: 18 projects\n\nUser interviews: 12\n\nSocial media: https://x.com/sorobanhooks\n\nWinner: SCF Kickstart Week!",
                        "stellar.goToMarketPlan": "1.  Targeted Developer Outreach : Engage developer communities through webinars, meetups, and online forums.\n    \n1.  Content Marketing : Create educational content showcasing use cases and platform benefits.\n    \n1.  Strategic Partnerships : Collaborate with blockchain projects to enhance visibility and credibility.",
                        "stellar.tranche1Deliverables": "Brief Description: The MVP will include core functionalities such as\n\n1.  Soroban Event Notifier to track contract events,\n    \n1.  Soroban Transaction Tracker for live updates on transaction statuses,\n    \n1.  Soroban Balance Watcher to monitor account balances,\n    \n1.  Soroban Contract Deployer for seamless contract deployment,\n    \n1.  Soroban Cross-Chain Bridge Monitor to track cross-chain transfers.\n    \n\nHow to Measure Completion:\n\n-   Sign-up and wallet connection functional and secure.\n    \n-   Basic project creation and webhook configuration available.\n    \n-   Test cases for basic features passed, and a small user group actively testing the MVP.\n    \n-   Cross-chain event monitoring functional.\n    \n-   Balance alerts and transaction monitoring tested and active.\n    \n-   Integration with Stellar and Soroban testnets verified.\n    \n\nEstimated Date of Completion: 2 months from project approval.\n\nBudget: $20K\n\n-   Development: $20K (Developers cost 2 months: Frontend, backend, DevOps & blockchain developer).",
                        "stellar.tranche2Testnet": "'-   Brief Description: The testnet phase will focus on extending functionality to support cross-chain event monitoring, balance tracking, and integration with the Stellar and Soroban testnet environments. Testing with a limited user group for feedback and optimization will occur during this phase.  \n    \n-   How to Measure Completion:\n    \n    -   Cross-chain event monitoring functional.\n        \n    -   Balance alerts and transaction monitoring tested and active.\n        \n    -   Integration with Stellar and Soroban testnets verified.  \n        \n-   Estimated Date of Completion: 1 month from MVP release.\n    \n-   Budget: (No XLM award for testnet release, but will request infrastructure credits through Stellar LaunchKit.)\n    \n    -   Development and Testing: Access to Stellar LaunchKit credits.",
                        "stellar.tranche3Mainnet": "Brief Description: Final product launch on the Stellar mainnet, including the full suite of functionalities like contract deployment, monitoring cross-chain transactions, and webhooks for event notifications. This milestone will also include optimizations based on testnet feedback and final auditing.  \n\nHow to Measure Completion:\n\n-   Full functionality on Stellar mainnet.\n    \n-   Audits passed and security measures implemented.\n    \n-   User adoption metrics such as sign-ups, transactions monitored, and active webhooks.\n    \n\nEstimated Date of Completion: 1 months from Testnet release.\n\nBudget: $5K\n\n-   Final deployment over server and auditing, Infrastructure setup (AWS, cloud services): $5K ( we can skip it if we get credits from AWS/GCP by Staller support)\n    \n-   Marketing and user onboarding: $2K",
                        "stellar.teamMembers": "Vishal, dev (Sorobanhooks)",
                        "stellar.urls": {
                            "website": "https://www.sorobanhooks.xyz/",
                            "codeRepository": "https://github.com/sorobanhooks/sorobanhooks",
                            "videoURL": "https://www.youtube.com/watch?v=AKLCD01_aX4"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/sorobanhooks"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 25000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 86855.46,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Infrastructure & Services"
                    },
                    "completionPercentage": 67.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:13",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/rec51IC0ycDCBWjDz",
                    "projectId": "daoip-5:stellar:project:solang-playground",
                    "projectName": "Solang Playground",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/rec51IC0ycDCBWjDz",
                    "status": "Awarded",
                    "description": "A Solidity web IDE for Soroban powered by the Solang compiler.",
                    "fundsApprovedInUSD": 10000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://docs.google.com/document/d/1sVgfzgu2HdeRD_pA77wZREgL54uyu26uZZNIt3-1Dfc/edit?usp=sharing",
                        "stellar.productsAndServices": "**General Features/services:  \n**- Allow Compilation of Solidity contracts to Soroban contracts platform via Solang.  \n- Allow Deployment and interaction of compiled Solidity contracts via the integration of Soroban JS SDK  \n  \nUI/UX Related features:  \nModern UI Redesign\n\n- Sleek, minimalistic design with dark/light mode toggle.\n\n- Responsive layouts for compatibility across desktop, tablet, and mobile.\n\n- Smooth transitions and animations for improved UX.\n\nUpgrade UI Framework\n\n- Use modern frontend frameworks like React.js, Next.js, and TailwindCSS.\n\n- Focus on seamless design and performance.\n\nEnhanced Code Editor\n\n- Auto-completion and IntelliSense-like suggestions.\n\n- Multi-tab support for managing multiple files.\n\nFile Management System\n\n- Drag-and-drop support for file uploads.\n\n- Enable cloud integration for project storage (e.g., Google Drive, Dropbox).",
                        "stellar.usesSoroban": false,
                        "stellar.successCriteria": "1- Output:  \nContracts:  \nCurrently deployed contracts on Testnet are ~3800 since the last network reset on 10th of December 2024, that is ~150 contracts per day.  \nIf playground reaches 5% of this rate, we will consider this a success.\n\nUsers:  \nOnboarding 50 active users within the 3 first three months would be success, and scaling to 500 within the first year would be great as well.  \n\n2- Impact:  \nWe want to tell builders that the Soroban VM is flexible and built in a way that an SDK can be made for virtually any language that compiles to WASM. That is the main message we want to convey.",
                        "stellar.tractionEvidence": "Solang Playrground is not yet launched to users. True traction cannot be measured without Solang compiler being user ready.  \nAlthough Solang<->Stellar integration is not yet launched, the introduction of Solang Playground is expected to make the onboarding of Solidity devs to Soroban a lot easier.  \nOne of the chains that Solang compiles to, Polkadot, has funded the very early stages of the project: Integration of Solang language server to an in-browser editor, hosting Solang on a backend service and some basic UI improvements.",
                        "stellar.goToMarketPlan": "Announcements on dev forums related to both EVMs and Soroban, inviting Solidity devs to try out the new Soroban via Solang Playground.  \nOur main audience wouldn't be Soroban developers, they would be EVM devs instead.",
                        "stellar.tranche1Deliverables": "Description:  \n1- Enable compilation of Solidity Soroban smart contracts supported by Solang.  \n2- Enable the deployment and interaction of compiled Solidity contracts on the Soroban Testnet.\n\nHow to measure completion:  \n1- A Solidity developer/Tester should be able to compile Solidity contracts to the Soroban target with the help of language smarts from the Solang language server  \n2- A Solidity developer/Tester should be able to deploy and interact with compiled Solidity contracts on Soroban Testnet.  \n3- A wireframe for a revamped UI, to be implemented in Tranche 2.\n\nEstimated date of completion:  \n~ 2 Quarters: 15th May ~ 15th June 2025\n\nBudget:  \n$7000",
                        "stellar.tranche2Testnet": "Description:  \nUpon the completion of Tranche 1, Solang playground would virtually be ready for Testnet. However, in the second Tranche, we would focus on making the UI more attractive. We are putting Remix in mind when doing this.\n\nHow to measure completion:  \n1-By the end of Tranche 1, we would have a wireframe ready to be implemented in Tranche 2 therefore revamping the UI and making it more attractive.  \n2- We would implement the following features, which can be objectively tested:  \nModern UI Redesign\n\n- Sleek, minimalistic design with dark/light mode toggle.\n\n- Responsive layouts for compatibility across desktop, tablet, and mobile.\n\n- Smooth transitions and animations for improved UX.\n\nUpgrade UI Framework\n\n- Use modern frontend frameworks like React.js, Next.js, and TailwindCSS.\n\n- Focus on seamless design and performance.\n\nEnhanced Code Editor\n\n- Auto-completion and IntelliSense-like suggestions.\n\n- Multi-tab support for managing multiple files.\n\nFile Management System\n\n- Drag-and-drop support for file uploads.\n\n- Enable cloud integration for project storage (e.g., Google Drive, Dropbox).\n\nEstimated date of completion:  \n~0.5 Quarter - 15th of July 2025\n\nBudget:  \n$3000",
                        "stellar.tranche3Mainnet": "Description:  \nMainnet readiness of Solang Playground directly depends on Mainnet readiness of Solang. There would be no extra work required to Solang Playground to support Mainnet launch.\n\nHow to measure completion:  \nN/A\n\nEstimated date of completion:  \nMainnet launch of Solang<->Stellar is expected to be April 2026, and Solang Playground launch date would be the same.\n\n**Budget:  \n**0",
                        "stellar.teamMembers": "Salaheldin Soliman",
                        "stellar.urls": {
                            "website": "https://github.com/hyperledger-labs/solang-playground",
                            "codeRepository": "https://github.com/hyperledger-labs/solang-playground",
                            "videoURL": "https://youtu.be/DoWAdMQSaRQ"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 3333.33,
                                "denomination": "USD"
                            },
                            {
                                "amount": 10615.75,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #0 - Awarded",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-02-10T00:00:00Z"
                    },
                    "completionPercentage": 0.0
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-33:grantApplication:14",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-33",
                    "grantPoolName": "scf-33",
                    "projectsURI": "https://communityfund.stellar.org/dashboard/submissions/recqlL2RWYaGrPOPj",
                    "projectId": "daoip-5:stellar:project:stellarbroker",
                    "projectName": "StellarBroker",
                    "createdAt": "2024-12-01T00:00:00Z",
                    "contentURI": "https://communityfund.stellar.org/dashboard/submissions/recqlL2RWYaGrPOPj",
                    "status": "Awarded",
                    "description": "Multi-source liquidity swap router for Soroban AMMs and Stellar DEX",
                    "fundsApprovedInUSD": 150000.0,
                    "extensions": {
                        "stellar.technicalArchitecture": "https://stellar.broker/docs/stellar-broker-simple-diagram.png",
                        "stellar.productsAndServices": "StellarBroker is a swap router that provides access to AMMs like SoroSwap and Aquarius, Stellar DEX, and Stellar Classic AMMs. Any wallet or trading platform can integrate it, providing better exchange rates for the end-users while adding monetization from fee commissions.",
                        "stellar.usesSoroban": true,
                        "stellar.successCriteria": "We aim for at least 2 production integrations in Q1 2025 and process at least half of all consumer swaps on Stellar Network (excluding orderbook market-making and trading bots) by the end of the year.",
                        "stellar.tractionEvidence": "This project has been developed in collaboration with @ultradima (UltraStellar) which provided deep insights in addition to our analysis of trading activity based on statistics obtained from StellarExpert. After spending quite a lot time on development, we managed to create a system that provides better price quotes, giving an additional income stream for partner applications while improving exchange rates and UX for end-users. Several well-known ecosystem organizations have committed to using our service once it goes live.",
                        "stellar.goToMarketPlan": "The service will start earning commissions on funds saved for users immediately after the deployment on Pubnet. Eventually, once it earns bigger market share, it will become profitable.",
                        "stellar.tranche1Deliverables": "Website quotation widget\n\n-   Live price quotation on the StellarBroker website\n    \n-   How to measure completion: The website displays the widget with live routing for arbitrary Stellar trading pair, displaying difference compared to a quote produced by Horizon\n    \n-   ETA: 2025-01-13\n    \n-   Budget: $20,000\n    \n\n2 AMM integrations\n\n-   Routing engine supports SoroSwap and Aquarius protocols\n    \n-   How to measure completion: Router shows quotes from SoroSwap, Aquarius, Stellar DEX, and Stellar Classic AMMs, can produce transactions to swap with each of these liquidity sources\n    \n-   ETA: 2025-01-13\n    \n-   Budget: $30,000",
                        "stellar.tranche2Testnet": "Albedo integration\n\n-   StellarBroker router is fully integrated into Albedo\n    \n-   How to measure completion: The router is integrated as a default price quotation engine for Stellar Pubnet swaps interface\n    \n-   ETA: 2025-01-20\n    \n-   Budget: $30,000\n    \n\nBasic dashboard\n\n-   Partner dashboard with the breakdown of earned commissions\n    \n-   How to measure completion: The website should display the statistics of commissions earned from swaps with breakdown by day and market pair, a partner should be able to adjust commission settings\n    \n-   ETA: 2025-01-20\n    \n-   Budget: $20,000",
                        "stellar.tranche3Mainnet": "Partner integration\n\n-   Other wallets integration\n    \n-   How to measure completion: At least one additional popular wallet or trading platform integrates StellarBroker as a primary router\n    \n-   ETA: 2025-02-24\n    \n-   Budget: $10,000\n    \n\nAdditional AMMs integration\n\n-   Integration of Comet and Phoenix AMMs\n    \n-   How to measure completion: At least one additional Soroban protocol (Comet or Phoenix) is available for routing, quotation, and transaction generation\n    \n-   ETA: 2025-02-24\n    \n-   Budget: $20,000\n    \n\nOpen partner enrollment\n\n-   Public partner enrollment process with the outreach to every application in Stellar ecosystem\n    \n-   How to measure completion: Any wallet or trading platform can register on the website and request partner API key for the integration. The dashboard contains more detailed fees breakdown with segmentation by traffic source, commissions earned, percentage of failed swaps, etc. The dashboard also contains the list of all transactions executed from the partner wallet. Partners can withdraw earned commissions.\n    \n-   ETA: 2025-03-24\n    \n-   Budget: $20,000",
                        "stellar.teamMembers": "OrbitLens",
                        "stellar.urls": {
                            "website": "https://stellar.broker",
                            "codeRepository": "https://github.com/stellar-broker",
                            "videoURL": "https://youtu.be/jUb1npgIhQw"
                        },
                        "org.stellar.communityfund.awardType": "Build",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 150000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 523155.58,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #1 - MVP",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2025-03-27T00:00:00Z"
                    },
                    "completionPercentage": 33.0
                }
            ]
        }
    ]
}