{
    "@context": "http://www.daostar.org/schemas",
    "name": "Stellar",
    "type": "Foundation",
    "grantPools": [
        {
            "type": "GrantPool",
            "name": "scf-28",
            "applications": [
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:1",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reczynrU3JHEYcAEw",
                    "projectId": "daoip-5:stellar:project:prophe",
                    "projectName": "Prophe",
                    "createdAt": "2024-06-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reczynrU3JHEYcAEw",
                    "fundsApproved": [
                        {
                            "amount": 460459.17,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 42000,
                    "description": "Prophe is a blockchain-focused toolset that makes project management a breeze.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "What the product is:\n\nProphe is a leading-edge platform for managing blockchain projects, offering essential tools for developers and dapps. With features like smart contract analysis, transaction simulation, and real-time alerting, Prophe ensures project success and efficiency.\n\nWhat problems it solves:\n\nProblem: Poor Real-Time Monitoring\nImpact: Without real-time monitoring, teams cannot promptly address critical issues such as network congestion, transaction failures, or security breaches. This oversight can lead to extended downtime, loss of user trust, and financial losses.\nSolution: Prophe integrates off-chain alert systems that provide real-time notifications via email, Slack, and Discord channels. These alerts cover a wide range of on-chain events and health indicators.\nBenefits: Real-time alerts enable swift identification and resolution of issues, minimizing downtime and ensuring continuous operation. This proactive monitoring approach helps maintain the health and performance of decentralized applications, enhancing user trust and satisfaction.\n\nProblem: Insufficient Testing Environments\nImpact: Developers often encounter unforeseen errors and vulnerabilities post-deployment, leading to costly rollbacks and reputational damage. The lack of accurate testing environments results in inefficient debugging and prolonged development cycles.\nSolution: Prophe implements robust testing environments that replicate real-world blockchain conditions. These environments include advanced simulation tools and comprehensive test suites that allow developers to predict transaction outcomes accurately.\nBenefits: With these environments, developers can identify and resolve issues before deployment, significantly reducing the risk of post-deployment errors. This leads to faster development cycles, cost savings, and more reliable and secure applications.\n\nProblem: Integration Difficulties\nImpact: Integration challenges can cause delays and complicate the development process, leading to fragmented workflows and increased error rates. These issues can stifle innovation and limit the functionality of blockchain applications.\nSolution: Prophe implements a robust integration framework that simplifies connectivity with various tools and APIs. This framework ensures compatibility and smooth interoperability across different services and platforms.\nBenefits: The integration framework reduces complexity and downtime, streamlining the development process and improving efficiency. It allows developers to focus on building innovative features rather than troubleshooting integration issues, thus enhancing the overall capability and performance of their projects.\n\nProblem: Limited Insights\nImpact: Users may find it difficult to interpret complex data, performance, user behavior, and security metrics. This lack of detailed analytics can hinder their ability to extract actionable insights and make informed decisions.\nSolution: Prophe provides comprehensive reporting tools and advanced data visualization options. Users can generate detailed reports and visualize data through graphs, charts, and other interactive elements.\nBenefits: Enhanced reporting and visualization make it easier to understand and interpret complex data. This improves the ability to communicate findings, strategize effectively, and make data-driven decisions.\n\nHow it uses Stellar and/or Soroban:\n\nComprehensive Reporting and Visualization: Prophe offers advanced reporting tools and data visualization options powered by Horizon/Indexing services. Users can generate detailed reports and visualize data through graphs, charts, and interactive elements, facilitating better interpretation of complex data and informed decision-making.\n\nTransaction Simulation: With Soroban RPC capabilities integrated into Prophe, developers can simulate transactions involving smart contracts on the Stellar network. This allows them to test various scenarios and predict transaction outcomes accurately before deployment, reducing the risk of errors and vulnerabilities.\n\nSmart Contract Analysis: Prophe offers tools for analyzing smart contracts deployed on the Stellar blockchain through Stellar SDK. Developers can assess the performance, security, and functionality of their smart contracts, ensuring they meet project requirements.",
                        "stellar.teamMembers": "Oluwaseun Sanyaolu",
                        "stellar.urls": {
                            "website": "https://prophe.xyz",
                            "videoURL": "https://www.loom.com/share/c5dee31c0dc846dd9074d0f752059829?sid=61596efa-91c4-4e4e-9628-ac774257e9fa"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/PropheHQ"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 42000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 460459.17,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-26T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:2",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recCmEL04rTflMaSX",
                    "projectId": "daoip-5:stellar:project:defindex-defi-made-easy",
                    "projectName": "DeFindex: DeFi Made Easy",
                    "createdAt": "2024-07-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recCmEL04rTflMaSX",
                    "fundsApproved": [
                        {
                            "amount": 976316.51,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 100000,
                    "description": "Platform for wallet providers to easily offer savings accounts with diversified DeFi investments in a single click",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "🥳 This project was awarded with the first prize at the EasyA Consensus Hackathon! 🥳 DeFindex is a comprehensive solution consisting of a set of smart contracts, SDK, and frontend tools. It allows wallet providers, investment platforms, and investment managers to seamlessly integrate investment in multiple DeFi protocols with a single click. Wallet users or clients can invest in various DeFi protocols by signing just one transaction, simplifying the process of diversification and rebalancing investments. Also, DeFi protocols can easily implement our protocol adapter, which connects them to our solution. Once integrated, each protocol with an adapter can be selected as an option for a diversified portfolio.\n\nProblems it solves:\n1. Complexity in DeFi Investments:\n- Problem: Investing in multiple DeFi protocols is complex and time-consuming.\n- Solution: DeFindex simplifies this process by enabling one-click investments across multiple DeFi protocols.\n- Benefit: Saves time and reduces the complexity for users and wallet providers.\n2. Risk Management:\n- Problem: Managing and rebalancing investments across different DeFi protocols is risky, slow and requires expertise.\n- Solution: DeFindex offers simplified and secure rebalancing and allocation management of their portfolio.\n- Benefit: Reduces risk, time and ensures optimal investment strategies.\n3. Integration Challenges:\n- Problem: Wallet providers face difficulties integrating various DeFi protocols for their users.\n- Solution: DeFindex provides an easy integration with just three lines of code.\n- Benefit: Streamlines the integration process for wallet providers.\n\nAudience:\n- Wallet Providers: Wallet providers seeking to offer diversified DeFi investment options to their users.\n- Investment Platforms: Platforms managing investments for clients, looking for efficient DeFi integration.\n- Investment Managers: Professionals managing investments who require simplified and diversified DeFi options.\n\nHow it works:\n1. Creation of DeFindex: Wallet providers or investment managers create a DeFindex, specifying the allocation among various DeFi protocols.\n2. Integration: Using our SDK and developer tools, the DeFindex is integrated into the wallet or platform with minimal coding.\n3. One-Click Investment: Users can invest in multiple DeFi protocols with a single transaction, signing off on diversified investments.\n4. Rebalancing: The platform handles the rebalancing of investments according to the specified percentages and protocols.\n\nUse of Stellar and Soroban: DeFindex leverages Soroban for the execution of smart contracts, ensuring secure and efficient transactions. Soroban's robust framework provides the necessary infrastructure for managing and executing complex DeFi strategies seamlessly.",
                        "stellar.teamMembers": "Francisco, Esteban Felipe Iglesias Manríquez, Joaquin Soza Guerra",
                        "stellar.urls": {
                            "website": "defindex.fund",
                            "codeRepository": "https://github.com/paltalabs/",
                            "videoURL": "https://youtu.be/n5vkHdoRQQw",
                            "pitchDeck": "https://docs.google.com/presentation/d/1OmubddhfH36PPEG8Su5c0cFP08d6P0gkXBuORNbv93o/edit?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/defindex_"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 100000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 976316.51,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Financial Protocols",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-26T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:3",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recEgzZZ8W6tacMCS",
                    "projectId": "daoip-5:stellar:project:clickpesa-debt-fund",
                    "projectName": "Making DeFi Finance work #2",
                    "createdAt": "2024-07-11T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recEgzZZ8W6tacMCS",
                    "fundsApproved": [
                        {
                            "amount": 1042560.62,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 95000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:4",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec9KR280sa7GUduW",
                    "projectId": "daoip-5:stellar:project:rise-in",
                    "projectName": "Soroban India & Turkey_Cont.",
                    "createdAt": "2024-07-18T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec9KR280sa7GUduW",
                    "fundsApproved": [
                        {
                            "amount": 969024.17,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 100000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:5",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recaF5bsiYHsjouqw",
                    "projectId": "daoip-5:stellar:project:amero-defi-collective-savings",
                    "projectName": "AMERO-DeFi Collective Savings",
                    "createdAt": "2024-06-21T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recaF5bsiYHsjouqw",
                    "fundsApproved": [
                        {
                            "amount": 517041.92,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 48000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:6",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recchyWjFSmOPmvZl",
                    "projectId": "daoip-5:stellar:project:open-gamefi-sdk-",
                    "projectName": "Open GameFi SDK ",
                    "createdAt": "2024-06-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recchyWjFSmOPmvZl",
                    "fundsApproved": [
                        {
                            "amount": 427569.23,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 39000,
                    "description": "Strengthening Stellar's ecosystem with open-source tools for GameFi integration.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Due to the limited number of characters in this section, the extended version of the description can be found here\n\nWhat the Product Is\n\nThe Open Source SDK for GameFi is a comprehensive suite of tools designed to integrate Stellar blockchain functionalities into the gaming sector. This SDK facilitates seamless interaction with Stellar Wallet SDK, Colyseus.js for multiplayer game development, and Decentraland for metaverse integration.\n\nProblems Addressed and Benefits Provided\n\n• Complexity in Blockchain Integration:\n  • Problem: Integrating blockchain functionalities into games is complex and requires significant technical expertise.\n  • Benefit: The SDK simplifies the integration of Stellar blockchain into games, making it accessible even for developers with limited blockchain experience.\n• High Transaction Fees and Slow Confirmations:\n  • Problem: Existing blockchain solutions suffer from high transaction costs and slow confirmation times, unsuitable for in-game microtransactions.\n  • Benefit: Utilizing Stellar’s fast and low-fee transaction capabilities, it ensures efficient in-game microtransactions.\n• Lack of Open-Source Solutions:\n  • Problem: There is a scarcity of open-source tools for game developers to leverage blockchain technologies.\n  • Benefit: The open-source nature of the SDK encourages innovation and collaboration within the developer community.\n\nHow It Works and Uses Stellar/Soroban\n\nIntegration with Colyseus.js:\n\n• Game Mechanics Library: Provides out-of-the-box game mechanics using Stellar blockchain for Web, Desktop, Mobile, and Web3/Metaverse development.\n• Stellar Wallet SDK Utilization: Enables secure in-game wallet creation, connection of existing wallets via Lobster Wallet & Wallet Connect, and easy data fetching from the Horizon API.\n• Transaction Management: Supports transaction signing, deposits, withdrawals, login, and interaction with Soroban smart contracts.\n• Example Implementations: Includes fully documented examples with game mechanics like Donation Boxes and Reward Claiming, showcasing interaction with NFTs and user data management using MongoDB.\n• UI Elements: Offers open-source Figma UI elements for seamless integration, including connection buttons, QR codes, and transaction confirmations.\n\nOpen-Source Smart Contracts on Soroban:\n\n• Smart Contract Examples: Provides examples for deposits, withdrawals, reward claims, and a donation box, demonstrating their application in games.\n• NFT Contracts: Includes examples for creating and managing NFTs within games.\n\nIntegration with Decentraland:\n\n• Comprehensive Example: Features a full, open-source integration example with Decentraland, including an in-world deployed scene for user and developer testing.\n• AI-Based NPC Integration: Demonstrates AI characters receiving XLM and other tokens on Soroban, enhancing interactive experiences.\n• Donation Box for Meta Residence Tower: Showcases a practical application within Decentraland, optimized with open-source Figma UI elements.\n\nHackathon Initiative:\n\n• Developer Engagement: Organizes a hackathon post-development to encourage the integration of these tools into games, with XLM prizes and comprehensive tutorials.\n• Support and PR: Provides a dedicated Discord channel for developer support, aiming to gather feedback and promote the tools through collaborative PR efforts involving Colyseus, Decentraland, and Stellar marketing.\n\nContribution to Stellar Ecosystem\n\n• Developer Tools Focus: By offering open-source tools, the project targets developers, fostering innovation rather than providing end-to-end applications.\n• GameFi Pathway: This initiative positions Stellar as a viable solution for the GameFi sector, leveraging its fast transaction speeds and low fees.\n• Developer Attraction: The project aims to attract game developers from various sectors, including traditional game development, metaverses, and Web3 platforms, through cross-platform PR and marketing efforts.\n• Real Integration: Expected to achieve real integration in a minimum of five projects, showcasing the potential and versatility of Stellar in gaming.\n\nReal Use Cases for the Open-Source Tools\n\n• In-Game Microtransactions: Fast, low-fee Stellar transactions for purchasing in-game items, connected via Stellar Wallet SDK.\n• Reward Systems: Direct token rewards for milestones and events, enhancing player engagement.\n• Secure Asset Management: Custodial wallets for securely managing in-game assets with Stellar handling transactions.\n• Donations and Crowdfunding: Transparent player contributions using XLM through donation smart contracts.\n• NFT Integration: Creation and management of collectible NFTs, adding unique assets to gameplay.\n• AI-Driven NPC Interactions: AI characters receiving tips or payments in XLM via the Soroban platform.\n• Educational Programs: Stellar tokens incentivize learning, rewarding players for achievements.",
                        "stellar.teamMembers": "Anton Manakov",
                        "stellar.urls": {
                            "website": "https://github.com/yanis7774/Stellar-GameFi-integration/tree/main"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 39000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 427569.23,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-26T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:7",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recf8bn219NPAb7rX",
                    "projectId": "daoip-5:stellar:project:merkle-tree-airdrop-tooling",
                    "projectName": "Merkle Tree Airdrop Tooling",
                    "createdAt": "2024-06-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recf8bn219NPAb7rX",
                    "fundsApproved": [
                        {
                            "amount": 526239.05,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 48000,
                    "description": "Open-source tool for efficient Stellar airdrops enabling scalable and cost-effective token &amp; NFT distribution via smart contracts",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Sorodrop addresses a significant gap in the Stellar ecosystem: the lack of an efficient, scalable, and low-cost solution for conducting large-scale airdrops of tokens and NFTs. Currently, projects wanting to distribute tokens or NFTs to a large audience face technical challenges, high gas fees, and inefficient distribution mechanisms, which hinders their ability to reach wider audiences effectively.\n\nWasted effort: Teams currently develop their own airdrop solutions from scratch, wasting valuable developer time and SCF funds. Sorodrop eliminates this inefficiency by providing ready-made airdrop functionality, ensuring no team has to start from scratch again. Inefficient Distribution: Existing methods are slow and can't handle large recipient numbers effectively. High Costs: High gas fees make large-scale token and NFT distribution expensive. Lack of Automation: Manual interventions increase errors and reduce efficiency. Resource Wastage: Unclaimed tokens or NFTs often go to waste without a clawback mechanism. Rigidity in Distribution: Current solutions lack flexibility to pause, resume, or stage airdrops as needed.\n\nSorodrop caters to various groups within the Stellar ecosystem: Project Owners: Launching new tokens or NFTs and needing a cost-effective way to distribute them widely. Developers: Seeking robust tools for efficient token and NFT distribution without high costs. Community Managers: Rewarding community members efficiently and transparently. Marketers: Conducting promotional campaigns to attract or retain users through airdrops. Fundraisers: Using airdrops to support fundraising events and achieve milestones.\n\nAs an example, we recently had an exploratory conversation with the growing Token Tails community. They need to airdrop their tokens and NFTs to over a thousand addresses. Currently, this isn’t possible on Stellar without manual effort or writing a custom contract. This need is already evident in the ecosystem, and it will become more apparent as more projects and communities grow on Stellar. SoroDrop will save teams and SCF thousands of dollars and hours of work.\n\nSolving this problem will positively impact the Stellar ecosystem: Increased Adoption: Easier, cost-effective distribution attracts more projects to the Stellar network. Enhanced Engagement: Efficient airdrops foster higher community engagement and participation. Innovation Encouragement: Reliable distribution tools encourage developers to innovate on Stellar. Resource Optimization: Clawback functionality prevents resource wastage, boosting ecosystem efficiency. Market Expansion: Projects reach larger audiences without technical and financial constraints, growing the user base and market penetration for Stellar-based assets.\n\nSorodrop streamlines the creation and distribution of tokens and NFTs on the Stellar network using the Soroban framework. Sorodrop addresses the aforementioned issues in several ways: Efficient Distribution through Merkle Trees: Sorodrop uses Merkle tree structures to handle large-scale airdrops efficiently, reducing computational load and ensuring quick, accurate distribution. Cost Reduction: The platform minimizes gas fees, making token and NFT claims more affordable. Automation and User-Friendly Interfaces: Sorodrop automates airdrop execution by allowing CSV uploads of recipient addresses, reducing errors and enhancing efficiency. Resource Optimization through Clawback Functionality: Unclaimed tokens or NFTs can be reclaimed by the project owner, preventing resource wastage. Distribution Flexibility: Project owners can pause and resume airdrops, offering greater control over the distribution process. Multi-Stage Airdrops: Supports staggered distributions, beneficial for complex tokenomics or tiered reward systems. All of Sorodrop’s software components will be open sourced and this will allow users to tailor their airdrop however they want. Application specific airdrops can be made possible with custom development on top of Sorodrop’s smart contracts.\n\nThere have been several attempts at airdrop tools on Stellar, but none have gained traction or are widely considered by projects in the Stellar ecosystem. Our airdrop project on Stellar stands out with several key features that will change this: We support airdrops with over a thousand recipients by implementing merkle calculation for greater gas efficiency. Project owners can customize airdrop terms, including start time, expiration time, name, and logo. Our platform allows multi-stage airdrops, enabling tiered structures within a single contract. Owners can pause and resume airdrops for enhanced security. We are open-source, providing users and project owners access to our tools and contracts for secure use. We also offer the capability to airdrop NFTs to large audiences.",
                        "stellar.teamMembers": "Arda Nakisci, Hasan İrice",
                        "stellar.urls": {
                            "videoURL": "https://www.loom.com/share/dd8fa363e8084969b217f2b7151b1f60?sid=bde11a68-a997-45f6-9e7c-1bd5a9d095fd"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 48000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 526239.05,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-26T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:8",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rechcT1UmtJlod9ec",
                    "projectId": "daoip-5:stellar:project:giveth",
                    "projectName": "Giveth",
                    "createdAt": "2024-07-12T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rechcT1UmtJlod9ec",
                    "fundsApproved": [
                        {
                            "amount": 470563.43,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Bring Quadratic Funding and thousands of projects to Stellar by integrating Giveth.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.teamMembers": "Griff Green, Jacob Schumacher, Mitch Ozmun, Marko Prljic, Mateo Daza, Freshelle May Tilanducae, Carlos Mario Quintero Parra",
                        "stellar.urls": {
                            "website": "https://giveth.io",
                            "codeRepository": "https://github.com/Giveth/giveth-dapps-v2"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://twitter.com/giveth",
                            "discord": "https://discord.giveth.io/"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 470563.43,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-12T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:9",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recisU9Kvy1ORE0BX",
                    "projectId": "daoip-5:stellar:project:bebop",
                    "projectName": "Bebop",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recisU9Kvy1ORE0BX",
                    "fundsApproved": [
                        {
                            "amount": 412243.64,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 36000,
                    "description": "Stablecoin finance for Africa's youth",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "The post-COVID economic fallout left me and an estimated 500 million unbanked and underserved African youth vulnerable to inflation and currency devaluation. Our pursuit of this idea stemmed from personal experiences seeking ways to safeguard and grow wealth amidst economic volatility. Traditional financial solutions like mobile money and banks proved inadequate, leading us to explore alternatives.\n\nCryptocurrencies emerged as a potential remedy, but their complexity and the focus of platforms like Coinbase and MetaMask on card users excluded many. Despite digital transaction growth during the pandemic, challenges like high fees and fragmented infrastructure remained, making cross-border payments difficult—an issue still experienced by Richard and me, along with millions of African workers.\n\nThe pandemic underscored the limitations of mobile money, as services like Spotify and Netflix required cards, excluding many youth. A survey of 350 people showed high demand for these services among underserved youth. Observing these gaps, we leveraged our expertise in mobile payments and blockchain, and my cofounder's legal background, to create a solution. We identified blockchain, stablecoins, and innovative card distribution as key to addressing Africa's financial issues.\n\nWe assembled a team to tackle technical and regulatory challenges, aiming to empower millions of underserved African youth with access to financial services, wealth preservation, and global economic participation. Our solution is a stablecoin app that lets users open dollar accounts on their smartphones, bypassing traditional banking hurdles. Users get virtual and physical debit cards linked to their balance, enabling online and offline transactions. The app allows free, instant P2P transfers and offers savings, yield earning, and borrowing against savings, helping users preserve wealth amidst economic volatility.\n\nThe app also introduces users to cryptocurrency investment, simplifying the process while maintaining blockchain benefits. Our strategy focuses on Africa due to its unique financial landscape and the potential for transformative change through blockchain and stablecoin adoption. Africa's high internet and smartphone penetration support this integration, mirroring successes seen in regions like Latin America. Our goal is to foster financial inclusion and empowerment for Africa's youth, driving socio-economic transformation across the continent.\n\nHow we use Soroban:\n- Connect to Blend Liquidity protocol to allow users to earn yield on their USDC\n- Plan to create our own liquidity pool through Blend\n\nGo To Market:\n- Start with Kenya, leveraging high interest in Bitcoin as an investment, then funnel users to save and earn yield.\n- Provide users with cards for payments.\n\nCurrent Traction:\n- App live on TestFlight\n- Partnered with LINK, Fonbnk, Ramp, Moonpay, and Striga for card distribution\n- Raising money",
                        "stellar.teamMembers": "Christopher Karani",
                        "stellar.urls": {
                            "website": "www.bebop.cash",
                            "videoURL": "https://www.loom.com/share/8611d58dd03047b29959767822380ba2?sid=b3b6ab08-7dee-4710-a8ad-30059266ec29",
                            "pitchDeck": "https://drive.google.com/file/d/1SLpnWkHRX3bxkPEIKqUh48M5LDnl0kx4/view?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/bebopcash/posts/?feedView=all",
                            "twitter": "https://x.com/bebopcash"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 36000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 412243.64,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:10",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reciIW33y5UCN7CLd",
                    "projectId": "daoip-5:stellar:project:kasmer-formal-verification",
                    "projectName": "Kasmer: Formal Verification",
                    "createdAt": "2024-07-09T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/reciIW33y5UCN7CLd",
                    "fundsApproved": [
                        {
                            "amount": 572560.61,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:11",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recjpO5HRcHKL3QhH",
                    "projectId": "daoip-5:stellar:project:givecredit",
                    "projectName": "GiveCredit",
                    "createdAt": "2024-07-18T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recjpO5HRcHKL3QhH",
                    "fundsApproved": [
                        {
                            "amount": 620175.47,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 64000,
                    "description": "GiveCredit is a platform for crowdfunding environmental impact using tax-deductible donations, built on Soroban.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "GiveCredit is a platform for crowdfunding environmental impact, built on Soroban and already deployed on Soroban mainnet. GiveCredit's pilot initiative is offsetting the total carbon dioxide emissions from the Stellar blockchain ecosystem, partnering with SCF grantees StellarCarbon (who are providing carbon credits sourced from Verra, a leading carbon credit provider) and PublicNode (a 501(c)3 nonprofit providing blockchain infrastructure accepting donations to make Stellar fully carbon neutral).\n\nGiveCredit solves different problems for different customer demographics. For donors: It allows them to reduce crypto-related tax fees such as capital gains by making tax-deductible donations for negligible fees, while also making a verifiable positive impact on the environment. For nonprofits: It opens a new source of funding, as well as enabling them to a positive impact on the environment (such as offsetting the emissions from their work). For blockchain carbon projects: it provides a stream of revenue- people to buy the tokenized credits they are offering! For interested third parties such as governments, corporations and foundations- it provides a way to crowdfund carbon dioxide removal (CDR) and other emissions offset initiatives, as well as a source of data about positive environmental impact being made by citizens and nonprofits. For the planet and humanity: Donations through GiveCredit help fund ecosystem preservation and other forms of positive environmental impact.\n\nHow GiveCredit Works: First, the user chooses a project in the GiveCredit app, and goes through the payment flow to send a cryptocurrency donation for the desired amount. At this point, the user can elect to mint an NFT containing the donation details in the metadata as well as to receive a receipt email for tax purposes. The NFT is minted on Soroban using a modified ERC-721 contract.\n\nSecond, the donation flows to the nonprofit, where it is then divided by Soroban smart contract. A portion, typically 10%, is retained by the nonprofit to cover administrative fees and overhead, and the remainder used to retire carbon credits. The remaining funds are sorted by Soroban smart contract into “buckets” corresponding to the price of one carbon credit, after which they are transmitted to the carbon credit provider (in this case, StellarCarbon).\n\nThird, when funds are received by StellarCarbon, they retire carbon credits for the given amount and expose the retirement data in their API, to be accessed by GiveCredit. Finally, GiveCredit’s hook system retrieves retirement information and mints it automatically by Soroban smart contract as an NFT under the appropriate initiative, forming a verifiable connection between the donation and the emissions offset.\n\nDonation, donor identity, NFT, and carbon credit data are stored in GiveCredit's registry database to create a full record of all behavior, display up-to-date data (e.g. carbon credit price, initiative progress) and ensure reliable and efficient performance within the GiveCredit app.",
                        "stellar.teamMembers": "Evan Cooper Hudson",
                        "stellar.urls": {
                            "website": "https://givecredits.cfce.io/",
                            "videoURL": "https://drive.google.com/file/d/1eqSn07fPMqDtFnh6Bc6MUcH3yTHL2UIe/view?usp=sharing",
                            "pitchDeck": "https://docs.google.com/presentation/d/16Rs3PAyj7fjI-Q6fCk5jVdqLukWxrCcy9ZORQrkQI18/edit?usp=sharing"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://x.com/c4collabecon"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 64000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 620175.47,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-18T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:12",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recn2qqdZGTIcTm0n",
                    "projectId": "daoip-5:stellar:project:keizai",
                    "projectName": "Keizai V2.0",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recn2qqdZGTIcTm0n",
                    "fundsApproved": [
                        {
                            "amount": 469499.7,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 41000,
                    "description": "The open-source, Postman-inspired tool that takes Soroban smart contract testing to the next level.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "What the Product Is:\n\nKeizai is a sophisticated platform designed to facilitate the deployment and testing of smart contracts on the Stellar network. It provides a comprehensive set of tools that streamline the entire lifecycle of smart contract management, from deployment through execution and testing.\n\nProblems It Solves:\n\nKeizai addresses several key challenges encountered by smart contract developers:\n\nDeployment Complexity: Deploying smart contracts can often be technical and error-prone. Keizai simplifies this with automated tools that help upload and deploy contracts to the Stellar network efficiently.\n\nTesting and Environment Management: Setting up environments for testing smart contracts can be cumbersome and resource-intensive. Keizai offers on-demand ephemeral environments that reduce overhead and facilitate rapid testing cycles.\n\nAsset Integration and Management: Managing Stellar assets within smart contracts is critical but complex. Keizai provides seamless tools for integrating and managing these assets, enhancing both security and usability.\n\nAudience It Solves Them For:\n\nKeizai is tailored for developers and organizations engaged in deploying and testing smart contracts on the Stellar network. This includes independent developers, startups, and enterprises looking to utilize Stellar for decentralized applications (dApps) and financial services.\n\nBenefits:\n\nStreamlined Deployment: Automates and simplifies the process of uploading and deploying smart contracts to the Stellar network.\n\nEnhanced Testing Efficiency: Provides ephemeral environments for testing that mimic real-world conditions without the need for permanent infrastructure.\n\nRobust Asset Management: Facilitates easy integration and secure management of Stellar assets within Keizai.\n\nHow It Works and Uses Stellar and/or Soroban:\n\nDeployment of Contracts: Developers can deploy their pre-written smart contracts through Keizai’s user-friendly interface. Keizai handles the complexities of deploying these contracts to the Stellar network, including the setup for immediate testing.\n\nEphemeral Work Environments: Keizai utilizes ephemeral environments that allow developers to test contracts under realistic network conditions without persistent setup. These environments are tailored for Stellar, ensuring that testing is both efficient and effective.\n\nStellar Asset Integration (SAC): Through the Stellar Asset Contract feature, Keizai enables straightforward management and integration of Stellar assets directly from the Keizai UI.",
                        "stellar.teamMembers": "Ivan Tammaro",
                        "stellar.urls": {
                            "website": "https://keizai.dev/",
                            "codeRepository": "https://github.com/keizai-tools/"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 41000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 469499.7,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:13",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recwBum9zIyqY6TC3",
                    "projectId": "daoip-5:stellar:project:real-time-contract-monitoring",
                    "projectName": "Real-Time Contract Monitoring",
                    "createdAt": "2024-06-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recwBum9zIyqY6TC3",
                    "fundsApproved": [
                        {
                            "amount": 515275.73,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 47000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:14",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recMMWmxb6Qfg3Lbx",
                    "projectId": "daoip-5:stellar:project:baf-summer-of-stellar",
                    "projectName": "BAF: Summer of Stellar",
                    "createdAt": "2024-06-27T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recMMWmxb6Qfg3Lbx",
                    "fundsApproved": [
                        {
                            "amount": 411053.05,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 37500,
                    "description": "Workshops, content, and tutorials, culminating in a Builders Retreat and demo day in the heart of the Bay Area.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Stellar Builders Retreat: This will be a 3-night retreat taking place in the heart of the Bay Area in five weeks. With space for 15 talented builders, this will be the second iteration of the BAF x Stellar Builder House. Whereas the need for additional events that engage technical talent has been identified; whereas the demand for student sponsorship to attend a builders' retreat has only increased since the completion of the BAF x Stellar Builder House; whereas high-performing students from various regions of North America have been identified as ideal candidates for the builder house, and spaces are available for first-time builders to begin their web3 foundations by building on Stellar. There is a noted lack of engagement from the academic field during the summer with web3 initiatives, and the builders' retreat caters to students with a strong desire to build for philanthropic purposes while strengthening their skillset. Workshops will be conducted each day of the retreat, and all projects are to be built on Soroban/Stellar's platform, with final presentations being done on the last day of the retreat. The theme of the retreat will be \"empowerment\", focusing on financial justice in developing regions through the power of decentralization.\n\nOpen Builders' Day: This will take place at a venue in SF during the retreat, and will serve as a demo day for the residents of the retreat and a chance for others to showcase their Soroban-built projects with the greater community. Here, the BAF team and community of Stellar enthusiasts will come together to exchange knowledge and know-how surrounding Stellar and its capabilities. Food will be served, and this event will highlight the work put in by builders at the retreat, with the eventual goal of each project being pursued further beyond the conclusion of the retreat. With builders sharing their stories and projects, the open builders' day aims to allow the creativity and passion of those in the Stellar ecosystem to flourish.\n\nSoroban Saturdays (Educational/Content for University Series): A content initiative with frequent posts weekly featuring a mix of both technical and non-technical use cases for Stellar technology, meant to inform and educate members of the academic community who possess varying levels of blockchain proficiency. This will be an open-source series that allows for all to benefit from technical content, tutorials, and articles that can be understood by someone with limited or advanced proficiency of the web3 space. This initiative will solve the learning curve issue that many have when entering the blockchain ecosystem, and serve as a guide for those wanting to build out full projects on Stellar. The BAF team and former participants of the builder house have achieved a proficiency in Soroban, and with assistance from the SDF developer team, educational content will be distributed to a number of students and university blockchain organizations -- who will conclude the Soroban Saturdays program with a full plan for an event to be hosted on their university campus, thus expanding the reach Stellar has in the academic world, and BAF will take care of logistics and event planning with each university to ensure success of events.",
                        "stellar.teamMembers": "iski02, Isabelle Ki",
                        "stellar.urls": {
                            "website": "blockchainacceleration.org",
                            "videoURL": "Bbuilder house recap we conducted at Consensus: https://www.youtube.com/watch?v=BV-yNV_Nf4w"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/thebafnetwork/",
                            "twitter": "https://twitter.com/TheBAFNetwork"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 37500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 411053.05,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Education & Community",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-27T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:15",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recQjC4JOmJ9hfjD9",
                    "projectId": "daoip-5:stellar:project:payqin-blockchain-made-simple",
                    "projectName": "PayQin: Blockchain made simple",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recQjC4JOmJ9hfjD9",
                    "fundsApproved": [
                        {
                            "amount": 572560.61,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "status": "Awarded",
                    "extensions": {
                        "stellar.teamMembers": "Fabrice Amalaman, Patrick Ouraga",
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/payqin/",
                            "twitter": "https://twitter.com/PayQinn"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 572560.61,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:16",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUcnDR8rtlntavE",
                    "projectId": "daoip-5:stellar:project:neovestor-an-rwa-launchpad",
                    "projectName": "Neovestor - An RWA launchpad",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recUcnDR8rtlntavE",
                    "fundsApproved": [
                        {
                            "amount": 572560.61,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Neovestor connects emerging market investors with real-world assets and businesses.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Neovestor is a financial inclusion platform providing access to real world assets and business to emerging market investors as a means of growing and diversifying wealth. Like the Stellar Development Foundation, Neovestor aims to address the inequities of the mainstream financial system, particularly in underserved communities. It uses blockchain technology to create a system that is more inclusive, affordable and straightforward.\n\nThe problem we’re solving\n\nNeovestor polled more than 300 investors (aged 18-55) and found that eight in 10 want access to real-world asset (RWA) opportunities but face several barriers:\n\nDistrust and Cost: 57% feel excluded by traditional finance, primarily due to distrust and high minimum investments (46%).\n\nReadiness to Invest: About half are comfortable starting with $100 to $500 investments.\n\nCommunity and Learning: 54% trust family and friends most, yet 71% strongly demand educational content.\n\nSolution:\n\nNeovestor empowers investors by providing affordable and accessible RWA opportunities and enhancing financial literacy:\n\nAffordability: Offers entry-level access starting at USD10, and the ability to earn stable-coin yields.\n\nAccessibility: Invests in proven real-world assets and businesses.\n\nEducation: Delivers mobile-first, customised content to help investors make informed decisions.\n\nWhy Now? And Who?\n\nInitial Target Market:\n\nNeovestor targets 130 million underserved potential investors in Southeast Asia, specifically Indonesia, the Philippines, Thailand, and Vietnam. Collectively, they own ~USD650 billion in cash deposits.\n\nMarket Opportunity:\n\nDemographics: These markets have large, youthful populations (median age 25-40) totalling over 550 million.\n\nLow Investment Participation: Around 1-2% of these populations are investing.\n\nFinancial Inclusion: Between 23% and 48% are unbanked yet equipped with payment onramps.\n\nTech Adoption: Mobile usage exceeds 72% across these markets, while each ranks among the top 10 for crypto adoption globally.\n\nEconomic Factors: Many of these markets have experienced significant inflation, making USD stablecoin investments an attractive hedge.\n\nInvestment focus\n\nNeovestor focuses on established businesses led by seasoned operators across robust sectors, including transportation, logistics, sustainable agriculture, consumer services, and energy.\n\nInitial RWA offerings\n\nA private car service based in the UAE\n\nA poultry farm based in Indonesia\n\nTarget returns of 7 - 10% per annum\n\nExpanding Neovestor’s RWA Portfolio of Offerings\n\nTo build and scale our Real World Asset (RWA) offerings, Neovestor will utilise six main strategies:\n\nEnsuring the Success of Existing Projects: Strengthening the Neovestor brand through the oversubscription of current offerings.\n\nReferrals from Partners: Encouraging partners to refer additional projects through shared economics arrangements and cross-promotional activities.\n\nEstablishing New Partnerships: Collaborating with other RWA projects and platforms (such as generalist launchpads, AMMs, asset tokenisation platforms, etc).\n\nCreating a Network of Deal Curators: Developing a trusted network of key opinion leaders (KOL) and individuals with established deal channels to source and vet deals efficiently, with potential referral bonuses or profit-sharing opportunities.\n\nAttending and Hosting Industry Events: Organising conferences, webinars, and meetups to connect with potential partners and showcase Neovestor's capabilities.\n\nLeverage Social Media and Content Marketing: Using social media platforms and publishing insightful content to attract potential partners.\n\nNeovestor will perform due diligence on all channels and deals to ensure the validity and viability of each project.\n\nBusiness & Revenue Model:\n\nNeovestor generates revenue from three primary sources:\n\nManagement Fees: 2%\n\nIncome Spread: Earned from assets, ranging from 3% to 6%\n\nTrading Fees: 0.5%\n\nAs the platform grows, Neovestor aims to evolve into a launchpad for other real-world asset (RWA) projects, with the following revenue streams:\n\nPlatform:\n\nListing Fees: up to 5%\n\nPlatform Fees: 0.5%\n\nTrading Fees: 0.5%\n\nExisting assets:\n\nNeovestor will continue to generate income (spreads, trading and management fees) from assets that it owns (as outlined above).\n\nCurrent Traction\n\nCommunity:\n\n13k waitlisted\n\n3k active wallets\n\n10K on X (Twitter)\n\nWeb App development\n\nIn development\n\nClosed Beta anticipated in early June\n\nEarly launch end of June\n\nPartnerships\n\nWeb3Auth - a Seed phrase-free non-custodial MPC (Multi-Party Computational) wallet for client-side.\n\nShufti Pro - to provide KYC / AML screening.",
                        "stellar.teamMembers": "TJ Yen",
                        "stellar.urls": {
                            "website": "https://neovestor.com/",
                            "codeRepository": "https://github.com/neovestor-tech",
                            "videoURL": "https://www.loom.com/share/389a88b5f2ce449ba03f5fa7cc34dcf7?sid=41669a48-022a-42eb-9dc0-2fddf923201c"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://twitter.com/neovestorcom",
                            "discord": "https://discord.com/invite/Y57PBsvPct"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 572560.61,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:17",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec2D9kaGTaA48vU9",
                    "projectId": "daoip-5:stellar:project:grip",
                    "projectName": "Grip",
                    "createdAt": "2024-06-27T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec2D9kaGTaA48vU9",
                    "fundsApproved": [
                        {
                            "amount": 496388.21,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 45285,
                    "description": "The financial control center that supercharges all your financial accounts and cards.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Financial Wallets (\"Pouches\")\n\nTo allow Grip users to be able to hold fiat in supported currencies, each currency has its own pouch (this supplements linking accounts directly). We extend this to enable stellar support by setting up custody wallets and muxed accounts under a pooled account, enabling users to hold and interact with assets like XLM and USDC on Stellar.\n\nProblems Solved:\n- Singular Interface for Fiat & Crypto: Simplifies user financial interaction.\n- Cost Efficiency: Reduces overhead on users by avoiding individual account creation using multiplexed accounts.\n- Asset Holding: Provides secure asset custody for users.\n\nBenefits:\n- Quick, secure access to Stellar assets for our users.\n- Lower complexity and cost in account management for our users.\n\nHow It Works:\n- Pooled Account with Muxed IDs: Uses a single base account with unique muxed IDs for user transactions.\n- Trustlines: Establishes trustlines for various assets based on user requests.\n- Stellar CAP-27: Implements multiplexed account management as per Stellar's CAP-27.\n\nCard Payments\n\nTo allow Grip users to be able to make local and international payments with the multi-currency cards we issue to them. They can pay from their pouch balances or directly from their linked financial accounts (a sample of this is shown in the video). This integration will extend our card payment capabilities and enable users to link their stellar wallets on CEX, DEX, and on Grip to physical and virtual cards we issue for seamless payments using Stellar assets like XLM and USDC.\n\nProblems Solved:\n- Financial Interoperability: Connects traditional card payments with blockchain assets.\n- Flexibility: Lets users switch payment methods within the app.\n- Liquidity Management: Simplifies managing liquidity for transactions with Stellar assets.\n\nBenefits:\n- Cardholders can use blockchain assets for daily transactions effortlessly.\n- Merchants can accept payments from users with Stellar assets, increasing their customer base.\n\nHow It Works:\n- Wallet Integration: Stellar wallets set as payment options in the app.\n- Real-Time Validation: Validates wallet balances for transaction authorization.\n- Stellar Anchors: Uses Stellar Anchors for off-ramping transaction values to fiat.\n\nOpen Banking Service\n\nGrip has an in-house open banking infrastructure that was built to extend our service provider coverage to be the most extensive in the market and to also allow for cost-effective transaction spooling, transaction initiation, and to easily enable other features and use cases we might need to support in the future. This feature would extend Grip's OB infra to include integrations with centralized and decentralized exchanges, enabling seamless on-chain and off-chain asset management.\n\nProblems Solved:\n- Liquidity Management: Simplifies managing liquidity across platforms.\n- Financial Control: Centralizes control of finances, including on-chain transactions.\n- Interoperability: Enhances connectivity between traditional finance and blockchain networks.\n\nBenefits:\n- Users: Manage financial assets across multiple platforms easily.\n- Financial Institutions: Offer enhanced services by integrating traditional and blockchain finance.\n\nHow It Works:\n- API Integrations: Connects with CEX and DEX providers using APIs.\n- Transaction Management: Synchronizes transaction history and initiates transactions.\n- Stellar Wallet Linking: Links Stellar wallets for seamless asset management.",
                        "stellar.teamMembers": "Nelson Nelson-Atuonwu",
                        "stellar.urls": {
                            "website": "https://trygrip.co",
                            "videoURL": "https://youtu.be/_HcTOFxhWW8"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://linkedin.com/in/trygripapp",
                            "twitter": "https://twitter.com/trygripapp"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 45285.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 496388.21,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-27T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:18",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec3KOWI0PBoNoy0A",
                    "projectId": "daoip-5:stellar:project:sgf-solutions",
                    "projectName": "SGF Solutions",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec3KOWI0PBoNoy0A",
                    "fundsApproved": [
                        {
                            "amount": 349261.97,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 30500,
                    "description": "Provide liquidity to Argentinians by exchanging USDC for ARS, and depositing them directly into their bank accounts",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "At the moment, the two major players fully integrated with Stellar in Argentina are Settle (used by Vibrant) and Anclap. https://stellar.expert/explorer/public/asset/ARST-GCSAZVWXZKWS4XS223M5F54H2B6XPIIXZZGP7KEAIU6YSL5HDRGCI3DG: Supply: ARST 237M https://stellar.expert/explorer/public/asset/ARS-GCYE7C77EB5AWAA25R5XMWNI2EDOKTTFTTPZKM2SR5DI4B4WFD52DARS-1: Supply 24M Keeping a steady supply of digital ARS is difficult. Even with the new policies Argentina has been implementing which kept the ARS at USD 1:ARS 1000 for nearly four months, recently the ARS has again devalued from USD 1:1000 to USD 1:1300 (30% depreciation) almost overnight. See: https://cuex.com/en/usd-ars_pa At SGF (SGF Solutions SRL), we have 12 years of providing financial solutions to Argentinians, and through our well-established network of retail and corporate clients, we are able to provide double the liquidity in ARS and USD than the other two providers combined, monthly; our relevant monthly volumes are ~ARS 600M (7.2bn/yr) in bank transfers (payouts) which are exchanged from ~USD 500,000/month (6M/yr) and smaller volumes of crypto (BTC, ETH, USDC, USDT) totalling ~USD 100,000. Our operating fees, while dynamic, are generally between 0% and 1%. We believe this is a good fit for the Stellar network, which prides itself on providing low fees for financial transactions. While not relevant to this application, we also provide remittances from Argentina to Spain, which has seen a significant uptake in the last few years as the emigration rates increased due to Argentina’s poor economic conditions. It’s important to clarify that we are not looking to issue our own ARS asset, but rather to improve the interoperability of the Stellar blockchain by accepting Stellar’s USDC and off-ramping ARS directly to bank accounts and digital wallets (CBU’s and CVU’s such as MercadoPago, see https://www.bcra.gob.ar/MediosPago/Politica_Pagos-i.asp). SGF proposes building an application that leverages the Stellar Anchor Platform and SEP-24 to accept USDC and offramp ARS. This is supported in SEP-24 as per this pull request https://github.com/stellar/stellar-protocol/pull/1064, and we quote: “This protocol was originally designed to provide conversions between off-chain and on-chain equivalent assets – for instance BRL <> BRLT, USD <> USDC, NGN <> NGNT, etc. – but it has been updated to make exchanges between off-chain and on-chain non-equivalent assets like BRL <> USDC.“ Our use case is USDC <> ARS (one-way, to begin with). Please see the concrete steps to achieve this in our technical architecture document and make sure to read our total expected roadmap in the relevant section of this document. If you have any questions, please reach out to us @ martin_sgf on Discord.",
                        "stellar.teamMembers": "martin_sgf, martin_sgf",
                        "stellar.urls": {
                            "website": "https://www.sgfsolutions.io/"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 30500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 349261.97,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:19",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec59dhu7lEcLfHwR",
                    "projectId": "daoip-5:stellar:project:octo-ultimate-sociofi-nft-hub",
                    "projectName": "OCTO ultimate SocioFi NFT hub",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec59dhu7lEcLfHwR",
                    "fundsApproved": [
                        {
                            "amount": 463774.09,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 40500,
                    "description": "OCTO is a super dApp that revolves around NFT and digital assets with a strong emphasis on creators and their communities.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Our project, OCTO, named after the octopus, reflects our vision and platform functionality. OCTO aims to be the ultimate NFT hub focusing on creators' content and their communities. Despite differing opinions on NFTs as digital assets, their permanence and evolving use cases are undeniable. Here are some key foundations of OCTO:\n\nLimited and/or Fractioned Functionality: Popular blockchains like Ethereum or Solana offer a variety of NFT-related services, but even these require multiple platforms for basic actions. Other blockchains, including Stellar, lack a convenient all-in-one platform, causing wasted time/money, unnecessary friction, and potential for fraud.\n\nLack of Engagement / Crypto Tribalism: Successful NFT projects need to outreach, engage, and onboard users. However, different standards and blockchain interoperability issues force NFT creators to choose between their favorite blockchain or a more NFT-centric one for a larger audience. This crypto tribalism draws quality projects from blockchains like Stellar to Ethereum or Solana.\n\nContent Creator Economy: As the 'flipper economy' declines, NFT collectors seek projects with immediate and long-term benefits. Entertainment and content take center stage, yet there is typically no method to share content with the project's community safely, timely, and conveniently. Creators often resort to custom-built websites or multiple platforms to achieve basic results. The content creator economy of NFT projects should be rewarded to incentivize quality projects.\n\nMaslow's Hierarchy of Needs: The often-overused concepts of Maslow's pyramid of hierarchy are representative of NFT communities, particularly the 'Love and Belongingness' and 'Self-actualization' layers. These explain one's aspiration to be part of exclusive communities and engage with peers.\n\nProblem & Areas of Improvement\n\nResearch on Stellar NFTs revealed several improvement areas we aim to address:\n\n1. Lack of Latest NFT ERC-Compliant Standards on Soroban: This issue causes unnecessary friction for users.\n2. Insufficient Functionality of Other NFT Marketplaces: Existing marketplaces offer limited functionality compared to OCTO and often operate as custodial services, limiting true asset control.\n3. Lack of Community Building and Engagement: Current Stellar-oriented marketplaces do not focus on community building, engagement, or other aspects of Gamification and SocioFi of the NFT experience.\n\nOCTO's Solutions & Benefits\n\nWe aim to provide the most comprehensive NFT toolbox for the Stellar community with features like a no-code Launchpad, Stellar-based on-chain discussion boards, and auctions. Key USPs include:\n\n- Stellar-based Launchpad: Enables easy NFT collection kickstarts with no-code, lazy minting upon user interaction, and supports advanced standards like ERC-1155 or ERC-404 for complex projects.\n- Swap Functionality: Allows direct swapping of NFTs and digital assets, increasing liquidity and saving on secondary market fees.\n- Rental System: Enables owners to profit while providing lessees with benefits of ownership, such as content access and voting power.\n- Advanced Content DRM: Facilitates gated or non-gated content sharing within the community, eliminating the need for external solutions.\n- Fiat On/Off-Ramps: Simplifies onboarding by allowing users to use bank cards and withdraw proceedings in fiat, easing newcomers into the blockchain world.\n- Built-in P2P Messenger: Allows direct discussion within the platform, saving time and protecting against scammers.\n- Discussion Boards: Enable on-platform expression and creator-audience communication, with discussions importable to other platforms via API.\n- Real World Assets (RWAs): Digitizes real-world assets like tickets and real estate, paving the way for professional NFT use.\n- Privacy Protocols: Allows users to hide certain NFTs from external view, without storing assets externally.\n\nCore Functionality\n\nOCTO's core functionality encompasses:\n\n- Base Marketplace Functionality: Includes primary and secondary markets, enhanced by advanced services.\n- No-Code Launch Mechanics: Allows creators to deploy smart contracts and launch collections without coding knowledge.\n- Advanced Customizable Auctions: Offers various auction types for personalized experiences.\n- Chain-Agnosticism: Ensures ease of use with one-click cross-chain transactions, increasing awareness of supported blockchains like Stellar.\n- Extensive NFT Analytics Tools: Provides comprehensive metrics for informed decision-making.\n- Mobile App: Available on iOS and Android for user convenience.\n- Localization: Supports over 20 languages, making the NFT experience borderless.\n- Fetching Tool: Aggregates all NFT data across supported chains, marketplaces, and collections via our API.\n- Personalization of Experience: Extensive filtering, personalization settings, customizable project pages, and more for a tailored NFT experience.\n\nFor more detailed information, refer to our comprehensive guide outlining all tools in greater detail.",
                        "stellar.teamMembers": "Sergey Kuzmin",
                        "stellar.urls": {
                            "website": "https://octoplace.io/",
                            "codeRepository": "https://github.com/OCTOplace",
                            "videoURL": "https://youtu.be/vG6FNBGgVBE?feature=shared"
                        },
                        "stellar.socialMedia": {
                            "twitter": "https://twitter.com/octoplace",
                            "discord": "https://discord.gg/73Ru5XUP2X"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 40500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 463774.09,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:20",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec6upUevElzRhgCs",
                    "projectId": "daoip-5:stellar:project:gearup-marketplace",
                    "projectName": "Gearup - Marketplace",
                    "createdAt": "2024-06-21T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec6upUevElzRhgCs",
                    "fundsApproved": [
                        {
                            "amount": 538585.33,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "The Peer-2-Peer marketplace for African Creators to rent, sell &amp; buy gear, studio space and courses built on the Stellar Network.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Gearup is a peer-to-peer marketplace that helps African creators to rent, sell and buy gears, studio spaces and professional courses on the Stellar network.\n\nProblem\n\nAccording to a Bloomberg report, the audio-visual industry in Africa faces significant challenges due to the high cost and limited accessibility of gear and studio spaces for creators to execute audio-visual projects. It's estimated that the audio-visual industry loses approximately USD 1.2 billion yearly due to these barriers. Additionally, the lack of professional workshops, audio-visual production courses, and training hampers the productivity and profitability of African creators.\n\nSolution\n\nGearup solves this problem through a peer-2-peer marketplace application that lets creators across Africa have seamless access to quality gear, studio spaces, and professional courses they need to bring their vision to life without the burden of high purchasing costs. We do this by leveraging blockchain technology to track and trace gear, courses, and studio trades and reward good actions in the trading process to ensure security, speed, and transparency.\n\nAdditional Information\n\nGearup offers a decentralized investment opportunity for both creators and non-creators to invest in high-demand gear and list them on the marketplace to generate passive income from rentals. In addition, our comprehensive insurance coverage helps to protect gear owners from all forms of eventualities. This innovative model allows anyone to invest and participate in the creative economy.\n\nThe Opportunity\n\nBuilding Gearup on the Stellar network offers unparalleled opportunities for marketplace applications due to Stellar's fast, low-cost transactions and robust security features. Stellar Network will enhance Gearup's efficiency in handling micro-transactions and on-chain tracking of gear movement from person to person. In addition, Stellar's infrastructure ensures transparency, reduces operational costs, and enables seamless integration with financial institutions built on Stellar. In return, Stellar Network will benefit from Gearup through automatic onboarding of Gearup users into the Stellar Network, increased transaction volume and network activity which can enhance liquidity and network robustness. Gearup's adoption will attract more users, particularly creators, gear and studio owners, and businesses to Stellar Network, thereby fostering a larger ecosystem.",
                        "stellar.teamMembers": "Obasi Francis",
                        "stellar.urls": {
                            "website": "https://gearup.market",
                            "codeRepository": "https://github.com/Gearup-Market",
                            "videoURL": "https://www.youtube.com/watch?v=TN-jMhERphQ"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/gearupmarket",
                            "twitter": "https://twitter.com/Gearupmarket"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 538585.33,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Applications",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-21T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:21",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec6BPjqE2tB48RQX",
                    "projectId": "daoip-5:stellar:project:assemblyscript-soroban-sdk",
                    "projectName": "AS Soroban SDK",
                    "createdAt": "2024-07-09T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec6BPjqE2tB48RQX",
                    "fundsApproved": [
                        {
                            "amount": 320633.94,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 28000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:22",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recGWdH8UVAhNcaxx",
                    "projectId": "daoip-5:stellar:project:bigger-startup-camp-2-0",
                    "projectName": "Startup Camp 2.0 - Round 2 & 3",
                    "createdAt": "2024-07-09T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recGWdH8UVAhNcaxx",
                    "fundsApproved": [
                        {
                            "amount": 1145121.21,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 100000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:23",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec8xDnSJsXhggxFP",
                    "projectId": "daoip-5:stellar:project:sorobanhub",
                    "projectName": "SorobanHub",
                    "createdAt": "2024-07-09T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec8xDnSJsXhggxFP",
                    "fundsApproved": [
                        {
                            "amount": 532481.36,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 46500,
                    "description": "Manage, monitor and interact with your deployed contracts from a single and free to use desktop app.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Sure, please provide the content you want me to streamline.",
                        "stellar.teamMembers": "Enrique A.",
                        "stellar.urls": {
                            "website": ".",
                            "codeRepository": "."
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Community Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 46500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 532481.36,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-09T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:24",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec97jRXGlg930CDY",
                    "projectId": "daoip-5:stellar:project:zkliquid-evm-soroban-bridge",
                    "projectName": "ZKLiquid: EVM - Soroban Bridge",
                    "createdAt": "2024-06-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec97jRXGlg930CDY",
                    "fundsApproved": [
                        {
                            "amount": 455251.59,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 41525
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:25",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recheNDUSZjVVMowM",
                    "projectId": "daoip-5:stellar:project:tansu-soroban-versioning",
                    "projectName": "Tansu - Soroban Versioning",
                    "createdAt": "2024-07-11T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recheNDUSZjVVMowM",
                    "fundsApproved": [
                        {
                            "amount": 526767.47,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 48000,
                    "description": "Bring decentralization back to Version control System with Soroban providing transparency, integrity and security.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "To develop software, developers rely on Version Control Systems (VCS) to keep track of their changes and share their work. Git is one of the most widely used VCS and while being by design decentralized, developers rely on very centralized synchronization systems such as GitHub.\n\nThis centralization raises serious concerns as any actor gaining access to these repositories can: change the history, update code, make releases, and even delete files. All while being hardly noticeable. As open source software is relied upon by all industries, it poses a real threat in terms of software supply chain security.\n\nThe core idea of this proposal is to bring Git hashes onto Stellar's blockchain to benefit from the traceability and accountability blockchain technology guarantees. The code itself is still versioned using Git and it is still hosted on the synchronization platform of choice, which does not interfere with maintainers' traditional workflows. This gives maintainers access to new ways of managing their project on-chain and at its core it provides a distributed way to prove the integrity of their project.\n\nOur project will greatly benefit Stellar's ecosystem as open-source maintainers using our system will get to use Stellar and Soroban. This will in turn bring some of these maintainers to the Stellar ecosystem.\n\nVersion Control System (VCS), specifically using Git, is ubiquitous among software engineers. Git is by design decentralized, more so, the code history makes use of a Merkle tree: a given version, referred to as a commit, is given a hash and hashes are linked together to provide a history. Git is in essence a blockchain.\n\nWhen working on a project using Git, everyone gets the complete history and people can push and pull code from one person to another. The resolution of differences between one's code to another can be challenging if many people work on the same code area.\n\nIn practice, a team of developers-maintainers need a more convenient way to synchronize their work. To address this problem, maintainers can use a central platform where they can synchronize their work. GitHub is the most used platform to share and collaborate on open-source projects. For many teams, the whole software development lifecycle happens there, from the inception of ideas to making a release of a new version.\n\nThis centralization brings a lot of challenges when it comes to securing the software supply chain. In past years, we have seen attacks on almost every, if not all, parts of this centralized structure. Maintainers are being compromised, they become rogue, through exploits on GitHub or in the continuous integration system the code is compromised, there are occurrences of release artifacts being compromised and GitHub is also deleting projects which they deemed (albeit enforced by local regulations) not suitable for their platforms.\n\nTo answer these concerns around software supply chain security, we propose to leverage the Stellar blockchain to store Git hashes. The following components are proposed: (i) a Soroban smart contract to register Git hashes on-chain; (ii) a dApp for maintainers to manage their projects and users to participate and monitor their dependencies; and (iii) tools to help maintainers deploy and use this system transparently.\n\nThe core of the proposal is a Soroban Smart Contract called: Soroban Versioning contract. This contract will set the foundation of what will be built to support maintainers with their projects.\n\nThe contract will hold project-specific metadata and a key pointing to the last code change hash. Updating the hash leaves a permanent record on-chain. These update events can be monitored to build an off-chain history and be further compared to the state on other platforms such as GitHub. We will build the necessary services to ingest these events. These services will play a pivotal role as sitting in between Soroban and our proposed dApp.\n\nStrict access control is key to guarantee that only maintainers can update on-chain data. Soroban provides an elegant and robust solution with address signing. By storing a list of authorized maintainers on-chain, we are enabling projects to be more transparent as to who has specific rights.\n\nAs we have seen in past similar projects, the developer experience is paramount to get any traction and adoption. To that end, we will provide various pre-commit hooks to seamlessly fit most maintainers' workflow.\n\nLast but not least, our codebase will not only be open-sourced, our development will also be open. We will ensure that we provide comprehensive documentation and that the code can be easily understood and audited. Maintainers will need guarantees that we are only doing what they explicitly want us to do with their credentials.",
                        "stellar.teamMembers": "Tupui",
                        "stellar.urls": {
                            "website": "https://github.com/tupui/soroban-versioning",
                            "codeRepository": "https://github.com/tupui/soroban-versioning",
                            "videoURL": "https://github.com/tupui/soroban-versioning"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 48000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 526767.47,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-11T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:26",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rechwhwWyyUgGgDlC",
                    "projectId": "daoip-5:stellar:project:utoken",
                    "projectName": "Utoken",
                    "createdAt": "2024-06-21T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rechwhwWyyUgGgDlC",
                    "fundsApproved": [
                        {
                            "amount": 305690.26,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 28379,
                    "description": "We provide a platform to pay for services using USDC and EURC",
                    "status": "Awarded",
                    "completionPercentage": 67.0,
                    "extensions": {
                        "stellar.productsAndServices": "The Utoken app, through a simple user interface, will allow users (anyone with a stablecoin like USDC in their wallet) to pay bills like data subscriptions, and services using stablecoin.\n\nThe problem\nThe app addresses the issue of Utility for stablecoins beyond remittance and cross-border payment.\n\nFunctionalities\nThe app offers two distinct functionalities which are:\n\nBill payment which covers common utility services like airtime, data subscription, savings etc. and Service payment like gig payment for freelancers and NGOs.\n\nFor bill payment we will make the following available using USDC and EURC on Stellar:\n\nAirtime purchase\nBuy data subscription\nPay electricity bill\nPay for cable TV\nBuy Gift Card\n\nFor services users will be able to:\n\nDonate and support public service/goods through our simple application interface\nFreelancers can create a gig link they can share and get paid\n\nHow it works\nThis is how a user will use the Utoken web app to settle their bill using USDC in their wallet:\n\nThe user visits the website and launches the Utoken web app\nThe user connects any of the supported Stellar non-custodian wallets like Exodus using SimpleSigner\nThe user chooses a location and the service they are interested in paying for e.g Data Subscription\nThe user enters the amount they want to pay, their service ID e.g Subscriber number and the stablecoin of their choice to use\nThe user initiates payment and signs a transaction request which is done through Simplesigner\nThe transaction is approved in the connected wallet after which the user is redirected to the Utoken app. The transaction involves sending the token of choice (USDC) from the user's Wallet to the Utoken multi-sig address on the Stellar Blockchain\nBill is initiated from the app and the transaction status is shown to users\nBill payment is done and the user gets notified through their service provider. For example, they receive a top-up notification from their local telecommunication company\n\nThis is how a user will pay for services:\n\nThe user visits the website and launches the Utoken web app\nThe user connects any of the supported Stellar non-custodian wallets like Exodus using SimpleSigner\nThe user selects the gig button or donate button\nThey search for a service provider of their choice and click on it\nThe user enters the amount they want to pay and some relevant info for communication\nThe user initiates payment and signs a transaction request which is done through Simplesigner\nThe transaction is approved in the connected wallet and the user is redirected to the Utoken app. The transaction involves sending the token of choice (USDC) from the user's Wallet to a multisig address for payment splitting or escrow service.\nIn the case of gig, the service provider (the freelancer) gets notified with the gig link which can be used to request release of funds. The user (paying for the service) can also release funds using the gig link.\n\nTarget Users\nThe product targets:\n\nCrypto natives\nFreelancers\nTraders\nInvestors\nNGOs offering public goods\n\nHow we use Stellar\nWe will use the Stellar blockchain to process payment transactions from a user\nWe will leverage Stellar Anchor to off-ramp and settle web2 service providers\nWe will build an escrow service powered by Stellar Soroban",
                        "stellar.teamMembers": "Boyejo Oluwafemi, jomoflash, rayking1.",
                        "stellar.urls": {
                            "website": "https://utoken.network/",
                            "codeRepository": "https://github.com/Utokens/webapp",
                            "videoURL": "https://youtu.be/qNGoInIADSk"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/utoken-app",
                            "twitter": "https://x.com/UtokenApp"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 28379.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 305690.26,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "Pre-Launch #2 - Testnet",
                        "org.stellar.communityfund.category": "Applications"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:27",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recowXcSbEYnfaD1C",
                    "projectId": "daoip-5:stellar:project:omnilumen",
                    "projectName": "Wagmi.sh for Soroban",
                    "createdAt": "2024-07-26T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recowXcSbEYnfaD1C",
                    "fundsApproved": [
                        {
                            "amount": 488158.25,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:28",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recL7dgmOKB1HHEOo",
                    "projectId": "daoip-5:stellar:project:teken-easy-multi-signatures",
                    "projectName": "Teken - Easy Multi-Signatures",
                    "createdAt": "2024-06-27T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recL7dgmOKB1HHEOo",
                    "fundsApproved": [
                        {
                            "amount": 323362.09,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 29500,
                    "description": "Teken’s mission: an easy-to-use multi-signature app for Stellar, enhancing security and collaboration via Soroban smart contracts.",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "Teken’s mission is to create an easy-to-use multi-signature (multi-sig) application that is a public good for the Stellar ecosystem. Soroban is missing a universal, online multi-sig wallet agnostic tool focused on a simple user experience. Multi-sigs make it harder for hackers to steal money from a wallet because they need multiple keys to access funds. Also, the account does not belong to one individual user but to a group of wallets. This is especially useful when several people own the assets in a company or a decentralized autonomous organization (DAO).\n\nThe app will have several features: Members can connect their wallets to the app and create new proposals, vote for live proposals, and execute proposals. All signature confirmations (votes) will be stored on Soroban smart contracts. Quorum (passing threshold) and voting power can be established individually. Members can also be added and removed through proposals.",
                        "stellar.teamMembers": "varnotused, varnotused",
                        "stellar.urls": {
                            "website": "https://github.com/MoonBite-GmbH/multisig-ui",
                            "codeRepository": "https://github.com/MoonBite-GmbH/soroban-multisig-contracts",
                            "videoURL": "https://www.youtube.com/watch?v=dMuhN7Fj9Ro"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 29500.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 323362.09,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-06-27T00:00:00Z"
                    }
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:29",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recM5WNSe47TmTcfA",
                    "projectId": "daoip-5:stellar:project:link-io",
                    "projectName": "WAVY by LINK",
                    "createdAt": "2024-07-18T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/recM5WNSe47TmTcfA",
                    "fundsApproved": [
                        {
                            "amount": 843047.7,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 87000
                },
                {
                    "type": "GrantApplication",
                    "id": "daoip-5:stellar:grantPool:scf-28:grantApplication:30",
                    "grantPoolId": "daoip-5:stellar:grantPool:scf-28",
                    "grantPoolName": "scf-28",
                    "projectsURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec0b6xVABHxF2jRy",
                    "projectId": "daoip-5:stellar:project:web3-antivirus-w3a-",
                    "projectName": "Web3 Antivirus (W3A)",
                    "createdAt": "2024-07-10T00:00:00Z",
                    "contentURI": "https://airtable.com/appymB1sbp5uidiGe/shrsaWm1IyNZTCEhX/tblpytbu3t73kssiE/viwTba5X3EUwzXlcr/rec0b6xVABHxF2jRy",
                    "fundsApproved": [
                        {
                            "amount": 572560.61,
                            "denomination": "XLM"
                        }
                    ],
                    "fundsApprovedInUSD": 50000,
                    "description": "Web3 Antivirus is an open-source security browser extension that detects crypto scams and warns users before they sign anything",
                    "status": "Awarded",
                    "extensions": {
                        "stellar.productsAndServices": "In 2023, the crypto industry lost over $24.2 billion due to crypto crimes and scams, affecting 1 in every 8 users. Victims face financial loss, emotional distress, and diminished faith in the Web3 ecosystem, impeding its growth and adoption.\n\nIntroducing Web3 Antivirus (W3A): a security browser extension that protects crypto users against scams and fraud in real-time.\n\nKey Features:\n- Phishing alerts: Immediate notifications about dangerous websites.\n- Scam detection for 60+ scenarios.\n- Transaction outcome simulations and validation.\n- Real-Time warnings: Alerts users before they sign anything or connect their wallets.\n- W3A Dashboard: Allows users to maintain wallet health and revoke risky token approvals.\n\nUse Cases:\nW3A analyzes all the entities users interact with (wallets, addresses, websites, assets) and alerts users to potential risks. For instance, W3A will issue warnings if a user:\n- Encounters a fake website or a wallet drainer.\n- Is about to sign a malicious or risky transaction.\n- Intends to buy a token identified as a scam.\n- Intends to approve token permissions to an untrustworthy address.\n- Engages with an address previously linked to suspicious activities.\n\nHow it Works:\nUpon initiating a transaction, W3A intercepts the call to Metamask, pauses it momentarily to analyze the codebase for potential red flags such as suspicious logic, dangerous functions, or risky access permissions. The tool also simulates the transaction on a dedicated testnet to check what will enter and leave a user’s wallet. Within seconds, W3A provides a comprehensive report detailing the transaction's potential threats and outcomes, empowering users to make informed decisions about proceeding. All transaction data, detected threats, and approved accesses are conveniently displayed on the W3A Dashboard.\n\nCurrently, W3A supports Ethereum. We aim to add support for Stellar and enable Stellar users to proactively protect their assets and steer clear of scams and fraud.",
                        "stellar.teamMembers": "Ksenia Ksenia",
                        "stellar.urls": {
                            "website": "https://web3antivirus.io/   https://chrome.google.com/webstore/detail/web3-antivirus/inejiiekmjkmphgjjehhcmkpjncboodn   https://addons.mozilla.org/en-US/firefox/addon/web3-antivirus/   https://microsoftedge.microsoft.com/addons/detail/web3-antivirus/nggcakhlblakghejdigkaekbhicfkckn",
                            "codeRepository": "https://github.com/web3-antivirus/chrome-extension",
                            "videoURL": "https://www.youtube.com/watch?v=-qSXp6_IHCI"
                        },
                        "stellar.socialMedia": {
                            "linkedIn": "https://www.linkedin.com/company/web3-antivirus/",
                            "twitter": "https://twitter.com/web3_antivirus/",
                            "discord": "https://discord.com/invite/4hJAJUQCR2"
                        },
                        "org.stellar.communityfund.awardType": "Legacy v5.0 Activation Award",
                        "org.stellar.communityfund.fundsPaid": [
                            {
                                "amount": 50000.0,
                                "denomination": "USD"
                            },
                            {
                                "amount": 572560.61,
                                "denomination": "XLM"
                            }
                        ],
                        "org.stellar.communityfund.latestTranche": "SCF Legacy Award",
                        "org.stellar.communityfund.category": "Developer Tooling",
                        "org.stellar.communityfund.mostRecentPaymentDate": "2024-07-10T00:00:00Z"
                    }
                }
            ]
        }
    ]
}