{
    "@context": "http://www.daostar.org/schemas",
    "type": "Project",
    "id": "daoip5:celo-org:project:Helpers Foundation",
    "name": "Helpers Foundation",
    "description": "Helpers Social Development Foundation: Providing Climate Change Education + Action, and Increasing Climate Resilience for Underserved Communities in Nigeria. Education and action are needed to create sustained change in local communities. We run projects that directly address climate change such as solar system-powered electricity, solar-powered water,  tree, and shrub planting, clean-up campaigns, and digital skill centers to increase climate resilience, especially for women and youth. Individual action is encouraged e.g. buying and planting trees to reduce greenhouse gas emissions. Mindsets need to change and everyone needs to take action to address climate change that is increasingly impacting lives in Nigeria through drought, decreased agricultural production, and reduced food security, health, and nutrition.\n\n## Road Map and Metrics\n•\tProvide climate education to 500 students every year in our primary school, community center,, and workshops\n• Construction of sanitary facilities in public schools using open defecation.\n• Providing school supplies to over 2,500 public who do not have hope of going to school.\n•\tUtilize our solar water pump and well to provide water for 400 members of our community.\n•\t80 Empower young people, women and youth annually through our digital skills training centers so that they can build climate resilience as agricultural production decreases and climate change threatens traditional livelihoods.\n•\tPartner with The Solar Foundation to develop a solar-powered Public Charging Station for our community to charge their mobile phones and devices.\n\nMedia stories for our impact\n\nhttps://sg.finance.yahoo.com/news/investing-youth-education-fbs-hsdf-120000342.html\n\nhttps://guardian.ng/ama-press-releases/investing-in-youth-education-fbs-and-hsdf-support-community-primary-school-imezi-olo-in-ezeagu-lga/\n\nhttps://www.helpersfoundation.org/building-sanitary-facility-in-primary-school/\n\nhttps://www.helpersfoundation.org/helpers-foundation-set-to-launch-digital-skill-centre-in-enugu/\n\nhttps://independent.ng/group-funds-establishment-of-school-in-enugu/\n\nhttps://issuu.com/buneke/docs/buneke_issue_24_2022_8.5x5.5/s/15969185\n\n\nhttps://www.vanguardngr.com/2022/01/hsdf-inaugurates-free-education-school-in-enugu/",
    "email": "chidi.okeke@helpersfoundation.org"
}
    // TODO: Add to OSS-Directory
