{
    "@context": "http://www.daostar.org/schemas",
    "type": "Project",
    "id": "nan",
    "name": "One Sky Collective",
    "description": "Project has been in development for almost 2 years. Our goal is to have an app used by the masses. While we will use blockchain technology and NFTs, we will not tokenise our work as feedback from partners and surveys suggest that the general public are not supportive of crypto tokens.\n\nAs a mobile and sustainability focused blockchain, Celo could be the perfect foundation for us.\n\nHow will we gain users?\n\n- We have in place a partnership with City to Sea whose Refill app has 500,000 users. We will be jointly applying for a £1.5million National Lottery Climate Fund to build our sustainability app and operations\n\n- I am a Sustainability Champion for the Department for Work and Pensions. We are having a meeting to discuss tailoring my platform/app for our 80,000 staff. With no token, and no seed phrases etc, we have been able to sell the idea of using blockchain technology.\n\n- One of our co-founders is CEO of the World Calisthenics Organization. His athletes and those who he is personal friends with have tens of millions of followers. They will support our beach cleans and \"Art for the Oceans\" campaign.\n\n- We have dozens of artists and National Geographic featured photographers lined up for the above campaign.\n\nWe are looking for a blockchain partner for a long term project to build a future proof sustainability app and fundraising app for conservation work. One that aims to onboard millions. Once we secure DWP and test app on staff, we will then go for the remaining 400,000 civil servants. Myself and my partner also have strong connections to Scottish Government, Scottish media, and the National Health Service. ",
    "contentURI": "https://explorer.gitcoin.co/#/round/42161/29/6",
    "email": "stephen@oneskycollective.org",
    "socials": [
        {
            "platform": "Unknown",
            "url": "One Sky Collective"
        }
    ]
}