{
    "@context": "http://www.daostar.org/schemas",
    "type": "Project",
    "id": "nan",
    "name": "ReFi Lagos",
    "description": "ReFi Lagos, a ReFi DAO Local Node, is on a mission to empower underserved farm communities, volunteers, and nature lovers in Nigeria through innovative climate research, awareness campaigns, and impactful tree planting events. Our focus is to combat deforestation—a critical issue contributing to biodiversity loss and exacerbating climate change impacts, especially along Nigeria's vulnerable coastal regions. Nigeria has lost over 95% of its primary forest to deforestation.\n\nOur Pilot Project:\nProject Olókun represents our grassroots approach to addressing deforestation. By organizing tree planting events with landowners, tree planters and local volunteers, we aim to restore Nigeria's depleted forests. To ensure transparency and accountability, we've partnered with Silvi Protocol (Operation WebTree) to track tree planting efforts on the blockchain, rewarding tree planters more fairly and transparently\n\n\nOur Journey and Achievements:\n\nClimate / Web3 Research (Q3 2023- Q4 2023):\nWe researched the intersection of water-energy-food nexus and explored the transformative potential of Web3 and ReFi in advancing climate-smart agriculture in Nigeria. Our participation in the ReFi Talents Cohort 1 program further deepened our understanding of decentralized technologies and their role in climate solutions. Here’s our research presentation and ReFi Talents Certs\nhttps://tinyurl.com/TsinghuaUniversityIEDE,  https://tinyurl.com/ReFiCertSimon, and\nhttps://tinyurl.com/ReFiCertAdaeze\n\nReFi Blog Posts and Community Stories (Q2 2023 - Present):\nWe're passionate about sharing insights on climate, agriculture, and Web3 technologies in Africa. Our ReFi community stories and blog posts have reached and inspired over 500 ReFi/Web3 community members. Here's a link to our ReFi community stories and blog post https://blog.refidao.com/author/simon/\n\nOnline and In-person Climate Events (Q1 2024 - Present):\n1) Together with Shamba Network, we organized a discussion on the Opportunities and Challenges Facing African Farmers and Regens. Listen to learn more.   https://twitter.com/i/spaces/1RDGllOppwlGL/peek\n\n2) We further organized a session on Promoting Climate Action in Lagos Coastal Communities - https://twitter.com/i/spaces/1yoKMwrLaMeJQ\n\n3) I facilitated the Climate Ambassador Training Program at Owo High School in Ondo State. The program, sponsored by the United States Consulate General in Lagos, empowered  100 high school students (from five schools in Owo town) to become climate leaders and ambassadors in their respective communities. Here is a Twitter (X) thread to learn more - https://x.com/ezeugosimon/status/1758768027993022759\n\n4) On March 2, we launched #Project Olókun, a ReFi Lagos climate awareness and reforestation initiative funded by the Celo Foundation and ReFi DAO. The pilot event empowered community leaders and volunteers to address coastal erosion by planting 20 trees at Mopo Akinlade Community. We partnered  with Silvi Protocol (Operation WebTree) to enable on-chain tree planting events in Nigeria https://tinyurl.com/projectolokun\n\n* The Ecological Benefit:\nWe are improving the soil, biodiversity, removal of carbon from the atmosphere, and air quality through climate awareness and tree planting events.\n\n*  Impact Description:\n1) Raised awareness about the effects of deforestation and climate change in Nigeria.\n\n2) Increased sense of community and shared responsibility for the environment.\n\n3) Increased Web3/ReFi adoption through proven research and engaging content.\n\n\n*  Impact Metric:\nReFi Lagos has had an ecological, social, and educational impact. We planted and cared for over 20 fruit and forest trees in Lagos, with over 20 people involved. Over 40 people participated in each of our virtual climate activities. Our ReFi DAO blog article is read by more than 500 ReFi/Web3 community members.\n\nHere’s the hypercerts  for our recent project - https://hypercerts.org/app/view?claimId=0x822f17a9a5eecfd66dbaff7946a8071c265d1d07-18639987495195167151596734245897399087136768\n\n*  Roadmap With Celo Q2 - Q4 2024:\nPartner with Silvi to develop a tree planting methodology and promote on-chain tree planting events in Nigeria. We will Support the community by:\n1) Promoting Celo as our official sponsor\n2) Publishing future ReFi articles on Celo Public Goods blog.\n3) Supporting Celo community event in Nigeria.  ",
    "contentURI": "https://explorer.gitcoin.co/#/round/42161/29/117",
    "email": "kingcymon@gmail.com",
    "socials": [
        {
            "platform": "Unknown",
            "url": "ReFi Lagos (#projectOlókun)"
        }
    ]
}