{
    "@context": "http://www.daostar.org/schemas",
    "type": "Project",
    "id": "daoip5:celo-org:project:ReFi Mexico",
    "name": "ReFi Mexico",
    "description": "Document with pictures:\nhttps://docs.google.com/document/d/1sXCvIQHQzQfx4yaLcWrnwZYALmh3ZNqC5xexdYT-y0c/edit\n\n\nContribution Description - What has your project contributed to?:\nList the major milestones your project has achieved and outline any upcoming significant developments.\n\nAchievements:\nWe started our operations as a ReFi local node, based in Mexico City 11 months ago. Since then we have started a thriving regen and solar punk community in the big city. We started with basic social media activity and focused on IRL events to gather and know people who are willing to contribute to a bigger cause. We established ourselves as one of the most active communities in Web 3 in Mexico by organizing events and attending events as speakers to talk about ReFi and Economic Frameworks both in Universities and events like Ethereum Mexico. We have as well created important strategic alliances with local web 2.0 and offline initiatives. Not only that, we attended a World-class hackathon and many members of our community won a prize, showing their talent and individual efforts done per each team, plus the interconnection and the power the ReFi Mexico community has had. Also the co-founders designed a social/environmental impact track on the Near Ecosystem for a total of 4K USD in prizes, aiming to increase ReFi economic model awareness in the Web 3 space. We have been fostering an environment for growth and development, supporting local initiatives and entrepreneurs to empower themselves with Web 3.0 technologies and taking the ReFi concept beyond our big city. We have as well started working on our wireframing and mock-up designs for the NFT Minter, not only that but being able to experiment and iterate live, obtaining deep insights into the better doing of our proposal.\n\n\nWhat’s next:\n-We are following a public roadmap we created, as we aim to turn the NFT Minter into a bigger and unique use case we are calling Impact Market Maker.\n-We are currently onboarding a team of dedicated devs, to help us turn our ideas into reality\n-We will continue with our mentorships and assessment on the subject, as we will focus on this stage on the outside of the city, to take ReFi and CELO further\n\n-Create CELO content for our users, mainly in Spanish, as it will help us onboard faster\n\nState the type of contribution your project is: content, social, in-person gathering, educational program, conference organizing, etc.\n\nWe are a Regen hub, autonomous and decentralized by design. We integrate new systems of thinking and community driven initiatives, this means we have a wide range of contributions coming from our community. We barely produce content, although it is on our road map to produce more. Never-the-less we have been known for our IRL gatherings with built in conferences and our educational programs we have co-designed with multiple projects.\n\n\n\nWhat makes the project unique or necessary? How does it differentiate itself from its competitors? What has been the projects relation or contribution to supporting the Celo ecosystem?\n\nAs for now, we are starting our iteration/prototyping phase, currently integrating agnostic solutions without having dwelled in the code. We are creating an NFT Minter that turns into an Impact Market Maker as part of a Climate action marketplace. We are designing robust tokenomics so we can tokenize any activity/asset and be able to market cap projects based on oracles and dMRV frameworks, creating a new generation of carbon credits, decentralized impact data. For this we have started our first IRL experiment, trying to transact all market activities on-chain. Next, we want to pre-mint (tokenize) all RWA our community has to sell (coffee, amaranth, crypto forestation, water treatment, etc.) and do a new Regen Market with seamless transactions and account abstraction. We have been onboarding different profiles into our community, from small local actors, to big secret industry energy solutions. Our goal is to swiftly adapt to a smart money paradigm shift from 'degens' to 'regens', creating the conditions to bring large market industry caps.\n\n\nhttps://www.instagram.com/p/C4KMdPisOzT/\n\nThis is the Regen Market we hosted as a side-event for ETH Cinco de Mayo Hackathon, as a microscale of the market initiative.\n\n\n\n\n\nWhat methods have you employed to attract and educate new users and developers?\n\n\nWe are currently drafting our top devs from Mexico, who will help us expand the reach of their knowledge, this means creating an online platform, where to share links to repos, docs, and APIs, not only that but special translation of technical content in spanish with tech support. For this we will mainly be using Celo composer documentation, guiding our dev community through the CELO Academy  and documentation.\n\n\nHighlight any partnerships or collaborations that have expanded your project's reach and impact.\n-Angulo ambiental: For the co-creation of the footprint mitigation design into the Web 3.0 space\n-Huerto Roma Verde: For being the first big local project in Mexico City for hosting us and letting us organize events, we are currently re-taking Web 3.0 implementation projects for their web 2 community.\n-NanoResonance Technology: Water Treatment company, we will push its adoption in outside Mexico City, as we develop a Web 3 integration for them\n-Ethereum Mexico: For them recognizing as key players in the ReFi space in Mexico\n-And many other smaller local initiatives we have interacted with\n\n\n\nContribution Links - Where can we find your contributions?\nAdd all key links that provide more details on each of your contributions.\n❗️this section is key, high-quality links showcasing your work are crucial for reviewers to assess the legitimacy and credibility of your contributions.\n\nhttps://twitter.com/ReFiMexico/status/1714092973346922701/photo/1\nSide-event for Ethereum Mexico CELO awareness campaign\n\nhttps://www.instagram.com/p/C2SUb2vsWsE/?img_index=5\nSide Event for ETH CincodeMayo Regen Market CELO awareness campaign\nhttps://twitter.com/ReFiMexico/status/1772412634467299679/photo/1\nAngelHack Hackathon community presence\nhttps://twitter.com/ReFiMexico/status/1730072144510439449/photo/1\nEBF aligned\n\nhttps://twitter.com/ReFiMexico/status/1716181930448679394/photo/1\nReFi Mexico (co-founder Gerry) on stage\n\n\n\n\n\n\n\n\n\n\n\n\nOur roadmap for 2024\n\n\nAs well we are providing Office hours on ReFi Mexico Metaverse, to push projects implementing Web 3.0 tools from the design of their solutions.\nhttps://twitter.com/ReFiMexico/status/1772968535846703368/photo/1\n\n\n\nImpact Description - What impact has your project had on the Celo ecosystem?\nDescribe how your initiatives have advanced knowledge, usage, and governance of the Celo platform.\n-Building on CELO fits our current needs: phone blockchain, seamless transactions, stablecoins, and CELO composers for easy integration for new community driven solutions we are currently nurturing.\n\n-NFT Minter- ThirdWeb to deploy  pre built contract for NFTs, tokens, and the marketplace.\n\n-Remix/Hardhat for Smart contract deployment on the celo network (depending the use)\n\n-Build on Mini Pay- Our use case can be perfect for integrating Mini Pay as we need to have seamless transactions and frictionless onboarding.\n\n-Use the governance forums to further keep on building and contributing to CELO ecosystem\n\nTherefore we build a user case for both ends within CELO; developers from our community who will start building in CELO and onboard offline, Web 2 and web 3 climate/social impact agents and their potential (impact data) buyers.\nImpact Metrics - What kind of impact have your project made?\nMetrics to consider: Number of content impressions, event attendance figures, participant feedback scores, and the number of community bootcamp graduates.\nEvidence to include: Links to event summaries, educational content, participant testimonials, and media coverage.\n\nWe have done around 8 IRL community gatherings since genesis.\nThe average number of people attending our events range around 15 to 40 people.\n\nWithin our community, we are following the footsteps of 6 early stage projects, while assessing them into how to build a better product, how to get more funding and encouraging to attend the hackathons.\n\nhttps://twitter.com/ReFiMexico/status/1751676131688779848/photo/1\n\nWe created a collaboration framework currently under design to help mitigate the Web 3 and Hackathons footprint. For this, we hosted a space in our metaverse to eco-educate participants of the regen marketplace prior to the event. This collab came with assessing before, during and after the planning of our side event, as we were provided with guidelines to follow. We plan to replicate and escalate this framework for other personal events and then scale to a macro impact.\n\n25+ people attending the metaverse.\n\n\nhttps://mexicobusiness.news/professional-services/news/tech-good-mexican-startups-making-social-impact\n\nWe appear as a Number 5 project in this news blog\n\n\n\nReFi Mexico community members Hackathon winners during ETH Cinco de Mayo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApplication\nConfigure your application and the payout address to where tokens will be transferred.\nName*\nReFi Mexico\n\n\nWebsite*\n\n\nPayout address*\nContribution & Impact\nDescribe the contribution and impact of your project.\nWe are a Mexican community who has been bringing CELO brand awareness, through events and advising. We are a young community onboarding entrepreneurs and companies into the world of regenerative finances on Web 3.0, we are an initiative-driven community fostering climate and social change. We see a big potential in the RWA tokenization, and impact-driven data.\nContribution description*\nImpact description*\nWe support local ReFi entrepreneurs and are building an innovative NFT Minter for climate action on Celo. This has increased Celo awareness and we are bringing new developers to the ecosystem. We see a big potential in the RWA tokenization, and impact-driven data, as a way to gamify climate and social action activities. We are creating an NFT Minter that turns into an Impact Market Maker as part of a Climate action marketplace. We are designing robust tokenomics so we can tokenize any activity/asset and be able to market cap projects based on oracles and dMRV frameworks, creating a new generation of carbon credits, decentralized impact data. For this we have started our first IRL experiment, trying to transact all market activities on-chain.\n\nRegen Community Building and Education:\nEstablished a strong local presence through social media and frequent in-person gatherings (8 events with 15-40 attendees each).\nCo-organized side events at major conferences like ETH Mexico and ETH Cinco de Mayo, raising Celo awareness among 60+ attendees at each event.\nActed as thought leaders by delivering talks at universities and conferences, educating audiences about ReFi.\nWe experimented with our first Impact Market, where we hosted 9+ regen communities and onboarded them into blockchain.\n\n\nImpact categories*\nCommunity and Adoption\n\n\n\nContribution links *\nWhere can we find your contributions?\nGithub: entrada\nHypercerts:\nPAgina web con CELO integration (LOGO)\nContract addressGithub repoOther\nContract addressGithub repoOther\n\n\n\nAdd row\nImpact metrics *\nWhat kind of impact have your project made? Add row\nCo-organized a Regen Market Side-event at ETH Cinco de Mayo with ReFi Mexico (CELO awareness campaign) 60+ attendees\n\nhttps://twitter.com/ReFiMexico/status/1714092973346922701/photo/1\n\n\nCo-organized a SolarPunk VR Side-event at ETH Mexico with ReFi Mexico (CELO awareness campaign)  40+ attendees\n\nhttps://www.instagram.com/p/C2tbWE8uLQg/?img_index=7\n\n\n\n\n\n\n\n\n\nFunding sources *\nFrom what sources have you received funding?\nGovernance fundPartner fundRevenueOther\nGovernance fundPartner fundRevenueOther\n\n\n\n\n\n\nCo-organized a Regen Market Side-event at ETH Cinco de Mayo with ReFi Mexico (CELO awareness campaign) 60+ attendees\n\nCo-organized a SolarPunk VR Side-event at ETH Mexico with ReFi Mexico (CELO awareness campaign)  40+ attendees",
    "email": "gm@refimexico.org"
}
    // TODO: Add to OSS-Directory
