{
    "@context": "http://www.daostar.org/schemas",
    "type": "Project",
    "id": "nan",
    "name": "Traditional Dream Factory",
    "description": "Our token (see whitepaper: https://oasa.earth/papers/OASA-Whitepaper-V1.2.pdf) is deployed on Celo network: https://explorer.celo.org/mainnet/token/0x10cb7f49389787a99b59b2f87dfdd3bba141559f\n\nThis is the first crypto token that provides direct utility rights to a regenerative village. Our pioneering model is being replicated by other communities already through https://closer.earth. 88 unique wallets currently hold real estate rights through this token, most of which are humans we have onboarded into web3 (and Celo) through a lot of care and attention (we are not primarily a web3 community which means we spend a lot of time onboarding new users and going through the hoops of getting liquidity to Celo..)\n\nIn 2021 already, TDF hosted re:encrypt - an event for ecologically minded hackers. It brought together people from Toucan, Regen Network, Curve labs and more - and was how we got started on our land based DAO journey.\n\nIn 2022, the TDF team was part of founding ReFi Spring. We also hosted ReFi Spring at TDF.\nIn 2023 we hosted ReFi Week: https://www.traditionaldreamfactory.com/events/refi-week-regenerating-the-earth-together\n\nThroughout the bear market, TDF continued to develop it's blockchain based approach to building regenerative villages.\nNot only have we been actively reforesting, building water retention landscapes, bringing community together - we also have a public token that provides direct real estate rights.\n\nDuring ReFi Week, TDF served as a prototype for minting ecological claims pertaining to the ecological benefits framework (EBF): https://checker.gitcoin.co/public/project/show/dmeter-ebf-hypercert\n\nThe TDF DAO is actively using the $TDF token for governance as well on Snapshot: https://snapshot.org/#/traditionaldreamfactory.eth\n\nIn June 2024 we intend to host a follow up on our ReFi Week with the focus on bringing together actors in the ReFi ecosystem on the ground at TDF and we will host a hackathon together with Hack ReFi with some proposed project outlines around:\n- creating an INDEX token which can hold multiple local village tokens so we can create a more liquid asset to help support land based regenerative projects\n- exploring issuance of carbon claims for biochar production\n- furthering the utility of land based tokens such as $TDF\n\n",
    "contentURI": "https://explorer.gitcoin.co/#/round/42161/29/30",
    "email": "sam@oasa.co",
    "socials": [
        {
            "platform": "Unknown",
            "url": "Traditional Dream Factory - the first web3 powered regenerative village - is investing in biochar-producing infrastructure"
        }
    ]
}